{
    "ARAB085": {
        "Christopher MacEvitt": []
    },
    "ARAB001.20": {
        "Mokhtar Bouba": []
    },
    "ARAB005.04": {
        "Yakein Abdelmagid": []
    },
    "ARAB005.03": {
        "Yakein Abdelmagid": []
    },
    "ARAB006.02": {
        "Andrew Simon": []
    },
    "ARAB005.02": {
        "Ezzedine Fishere": []
    },
    "ARAB006.01": {
        "Andrew Simon": []
    },
    "ARAB005.01": {
        "Ezzedine Fishere": []
    },
    "ARAB081.04": {
        "Eman Morsi": []
    },
    "ARAB061.10": {
        "Eman Morsi": []
    },
    "ARAB043.01": {
        "Ezzedine Fishere": [],
        "Hussein Kadhim": []
    },
    "ARAB081.03": {
        "Ezzedine Fishere": []
    },
    "ARAB061.09": {
        "Ezzedine Fishere": []
    },
    "ARAB063.03": {
        "Eman Morsi": []
    },
    "ARAB061.08": {
        "Eman Morsi": [
            "review 1: \"18S with Eman Morsi: Morsi is a pretty disorganized prof but the class is pretty interesting. it covers a wide range of feminist topics in the Arab world. It's very easy and most people don't do all the readings. You'll definitely learn a thing or two but it won't blow your mind. It's worth hanging out with Morsi after class and picking her brain then.\""
        ]
    },
    "ARAB062.02": {
        "Hussein Kadhim": []
    },
    "ARAB061.07": {
        "Hussein Kadhim": [
            "review 1: \"22S with Hussein Kadhim: The famous Arabian Nights professor. So surely, this class would be the layups of layups, right... ? Yeah, no. Not really. To be fair, this class apparently was easy in prior terms, but it seems that the college has cracked down. There are two things that make this class a nightmare. First, there are now four 3-4 page response papers (10% each) that you have to do, which weren't present in prior terms of this course. The mere presence of that work is annoying, but what really makes it shit is the second problem: Kadhim no longer grades any of the work himself. He has outsourced the work to bitchy grad school TAs (yeah go fuck yourself AC '21) who love nothing more but to arbitrarily take off points whenever they can. As such, you essentially have to write full-fledged literary analyses of the books, which in turn, requires you to actually read the books in critical detail. Kadhim himself is also the most boring lecturer I've ever had---his slow, slurred speech makes you want to fall asleep. His lectures are essentially just plot summary of the books, which doesn't give you deep enough details to write the literary analyses the TAs want. And, if you try to contribute to the class, he will often make fun of you for not \"speaking loud enough\" (I think Kadhim has hearing problems? Well, that should be his problem, not the students'.) Oh, and attendance is mandatory and 20% of your grade, so you have to come to class. The final 15 page paper (40%) is the most excruciating paper I've ever written. The only positive things I'll say about this course is that there are no exams (which, to be fair, certainly matters to some people) and that you can 'skip' one of the books (there are 5 books---Kanafani's Men in the Sun, Khedairi's A Sky So Close, Mahfouz's Midaq Alley, Mahfouz's The Thief and the Dogs, Salih's Season of Migration to the North---but only 4 required response papers.) Please, if you need the LIT distrib, find a different class. Kadhim is NOT it.\""
        ]
    },
    "ARAB059": {
        "James Dorsey": [],
        "Jonathan Smolin": [],
        "Tarek El-Ariss": []
    },
    "ARAB043": {
        "Hussein Kadhim": []
    },
    "ARAB042": {
        "Hussein Kadhim": [
            "review 1: \"22W with Hussein Kadhim: Prof. Kadhim is one of the sweetest profs at Dartmouth! Definitely take this class with him if you can. Super useful class for developing reading comprehension and speaking skills in Adv Arabic since it's almost entirely discussion based\""
        ],
        "Eman Morsi": [],
        "Jonathan Smolin": []
    },
    "ARAB041": {
        "Eman Morsi": [],
        "Hussein Kadhim": [],
        "Jonathan Smolin": []
    },
    "ARAB034": {
        "Jamila Chahboun": []
    },
    "ARAB033": {
        "El Mostafa Ouajjani": [],
        "Hussein Kadhim": [],
        "Jonathan Smolin": []
    },
    "ARAB032": {
        "El Mostafa Ouajjani": [],
        "Eman Morsi": [],
        "Jamila Chahboun": [],
        "Jonathan Smolin": []
    },
    "ARAB031": {
        "El Mostafa Ouajjani": [
            "review 1: \"23F with El Mostafa Ouajjani: If you've gotten as far as ARAB 31, you know the drill - just show up, try a little, and its an A. Mostafa is an awesome prof who is super understanding and great at explaining. Really a sweet man. You'll get what you put into this class - enjoy!\""
        ],
        "Eman Morsi": []
    },
    "ARAB025": {
        "Jamila Chahboun": []
    },
    "ARAB023": {
        "El Mostafa Ouajjani": [],
        "Eman Morsi": [],
        "Jamila Chahboun": [],
        "Jonathan Smolin": [],
        "Mokhtar Bouba": [],
        "Tarek El-Ariss": []
    },
    "ARAB022": {
        "Jamila Chahboun": [
            "review 1: \"22F with Jamila Chahboun: Professor Chahboun is a wonderful professor! Thoroughly takes time to meet with students and create office hours/review materials whenever students need it in addition to her scheduled ones. This course continues to build upon the material from Al Kitaab and expand into the intermediary level book. Most of the grade stems from class participation, 2-3 exams, 2 presentations, and a final exam. Highly recommend in the sequential Arabic series offered at Dartmouth. Best part of this course is the lack of drill time in the mornings.\""
        ],
        "El Mostafa Ouajjani": [],
        "Eman Morsi": [],
        "Jonathan Smolin": [],
        "Tarek El-Ariss": []
    },
    "ARAB021": {
        "Jamila Chahboun": []
    },
    "ARAB011": {
        "Eman Morsi": [],
        "Jonathan Smolin": []
    },
    "ARAB010": {
        "Diana Abouali": [],
        "Ezzedine Fishere": [],
        "Jonathan Smolin": []
    },
    "ARAB003": {
        "Diana Abouali": [
            "review 1: \"08S with Diana Abouali: this class was a bit more work-intensive than arabic 2, but not overly so. prof. abouali does a good job explaining all the crazy arabic grammatical rules, and i definitely feel as though i learned a lot in the class. our class didn't get as far in al kitaab as prof. bardenstein's classes did, but i'm not sure if that's a good thing or a bad thing. overall, it was a good class, and prof. abouali really knows her stuff even if she is a bit intimidating at first.\"",
            "review 2: \"06S with Diana Abouali: It was a good Arabic course -- vocab and grammar was learned, nothing special. Definately memorize the verb chart early.\"",
            "review 3: \"05S with Diana Abouali: Professor Abouali is a great prof. She is very patient and understanding, and helped me with my difficulties in Arabic. Though it is a difficult language, she made it manageable to learn.\"",
            "review 4: \"05S with Diana Abouali: good course. good prof. but make sure to staay on top of your homework because it's reallyyyy hard to catch up once you've started slacking.\"",
            "review 5: \"05S with Diana Abouali: I really enjoyed spring term Arabic. Earlier in the year, I felt that although we could kind of read things, we couldn't really say anything. By spring term, we were finally able to have conversations in class. There were days when I would come out of class and drill muttering to myself in Arabic, and at the beginning of the year, I wouldn't have imagined that to be possible. Plus, by the end I think our section had really bonded. Taking an intro language does take up a ton of terms, but it is nice to get to know people consistently (heck, twice a day 5 days a week) for a whole year. I found Arabic frustrating at first, but now the thought of stopping for a term (which I may have to do) makes me sad. To anyone starting Arabic: It's a ton of work, and seems to go really slowly at first, but it starts to pay off by 3rd term. Oh, & Professor Abouali is great. A really incredibly nice person, who cares a great deal about her students.\""
        ],
        "Sinan Antoon": [
            "review 1: \"05S with Sinan Antoon: Sinan was the best arabic prof ever and our stupid administration let him get away...He'll be at NYU next year...We'll miss you, Sinan!\"",
            "review 2: \"05S with Sinan Antoon: this course is great, but a large part of why it was amazing was the professor, sinan antoon. unfortunately, he is leaving for another university. however, this class is still highly enganging and great to take.\"",
            "review 3: \"05S with Sinan Antoon: With Sinan Antoon leaving, the Arabic Department is losing an amazing professor and the Dartmouth community is losing a strong voice for international issues. I am glad that I followed Arabic all the way through the sequence. Arabic 3 has been the most rewarding of the classes as I finally feel I can communicate. If you are contemplating taking Arabic 3...DO IT! It is worth all the hard work.\""
        ],
        "Carol B.": [
            "review 1: \"09S with Carol B.: Professor Bardenstein is very clear about what she expects. In-class activities really help you learn Arabic: much more in-depth than other sections.\"",
            "review 2: \"08S with Carol B.: Bardenstein may be a little intimidating, but she's really good at what she does and is still very human. I learned a lot more in this Arabic class then I did (relatively speaking) in the first two. Good prof, she gets it done.\""
        ],
        "Hussein Kadhim": [
            "review 1: \"04S with Hussein Kadhim: drill and tons of sometimes-tedious hw are annoying, but you pick up a marketable language and usually are rewarded w/a pretty good grade. tests are not too intimidating.\"",
            "review 2: \"04S with Hussein Kadhim: Basically the same as Arabic 1 and 2 - a good class for the lang requirement. Arabic 3 still has drill.\""
        ],
        "Lorice L.": [
            "review 1: \"07S with Lorice L.: Typical easy first year arabic class\"",
            "review 2: \"07S with Lorice L.: While Prof. Kasbari doesn't have some fancy Ph.D., she's the best professor in the Arabic department, so I'm calling her a professor. She's this beautiful Palestinian woman who's very attentive to student's needs and ALWAYS in a pleasant mood (even though she was pregnant this term). She'll take a break for a while to nurse the baby, but when she teaches again, take a class with her. Arabic is a ton of work, and I don't understand how the median this term was an A, but even if you get a crappy grade, you know it'll be your fault, b/c she teaches very well.\""
        ],
        "Jamila Chahboun": [
            "review 1: \"23S with Jamila Chahboun: If youre taking arab 3 you're probably just rounding out the first year language sequence, so you already know what's up. Arab 3 is a little harder than 1/2 just because you start getting into irregular verbs and more complex grammer (plus everything that came before) but its not that much harder. Professors are still incredible and highly recommend - great layup and you'll continue to learn arabic! : )\""
        ],
        "Nahed H.": [
            "review 1: \"03S with Nahed H.: This course was a standard intro langauge class. Professor Awny is a kind person and very helpful. Howerver, Professor Awny and Professor Kadhim did not communicate very well about where Arabic 2 had left off, and I think many of us were frustrated when Professor Awny assumed we knew things which we had not yet covered. Also, my grade at the end of the term had no relation to any of my test grades, which was quite frustrating.\""
        ],
        "Jonathan Smolin": [
            "review 1: \"07S with Jonathan Smolin: lots of arabic grammar is more annoying and a pain but whatever we had drill 3 times a week though so yea! and smolin is very enthusiastic and really helps you learn it. can be a bit much at 9am to hear his booming voice but better that than a crappy prof overall, good good. solid.\""
        ],
        "El Mostafa Ouajjani": []
    },
    "ARAB002": {
        "Diana Abouali": [
            "review 1: \"09W with Diana Abouali: Really nice, cool prof, just didn't learn as much as with others in the department\"",
            "review 2: \"07W with Diana Abouali: Arabic is really fascinating and abouali is great! There were weekly quizzes which were a lot harder than the midterm and the final. if you do the homework, this is a really easy and interesting class\"",
            "review 3: \"07W with Diana Abouali: Professor Abouali is very nice, and really helps you learn the material. she keeps you working, which can be tiring sometimes, but it's worth it in the end. she has everyone participate in class so you end up speaking more, which is good. over all i would say she's a solid prof, who's pretty fair, nice. her tests may seem a little tough but i think she cuts you some slack on the grading... overall i deifnitely recommend her (the other class had khadim, who apparently wasn't very helpful...)\"",
            "review 4: \"07W with Diana Abouali: Abouali really is a great teacher. She cares about her students and tries to do her best to be accommodating. Her quizzes can be a bit tough though so watch out. Otherwise if you work hard you will do well. if you slack off however... grades will not be the same as in Arabic 1.\"",
            "review 5: \"06W with Diana Abouali: Though I dig the language and understand why the process must bo so painfully repetitive, I don't understand why it has to be so static. I won't lie -- the combination of morning drill followed by Arabic class wears on you quite a bit. There were many days when I could hardly will myself out of bed, despite having the awesomest drill instructor ever. There were many nights where I stared at the drills and wondered why exactly it was necessary to fill in the blank -- why not let us do some freewriting with the vocab? Why not have the prof make assignments outside of the textbook? As for the class and the material itself, the vocabulary is ridiculous. I'm very angry that I still cannot say that I like cats better than dogs. I can however discuss my embarassment at having few romantic relationships. That's potentially worthwhile, sort of. The class - the teaching style made me feel exceptionally pressured. I was almost always sure that if I was looking over my old homework I would be called on and suddenly rendered incapable of registering the words uttered. She's still cool though. And Sesame Street rocks the socks.\"",
            "review 6: \"06W with Diana Abouali: so was morning drill. never making that mistake again....\"",
            "review 7: \"05W with Diana Abouali: faster paced than arabic one. very straightforward. evaluations are fair and predictable if you do the homework.\"",
            "review 8: \"05W with Diana Abouali: I liked Arabic much better winter term than fall term. We actually started to learn to understand & say things (a little bit - more on that later), which was much more interesting and rewarding than just learning the alphabet. It was also really nice to get Fridays off, occasionally. Morning people will never understand how hard it is to get up for 9:00 class every morning, let alone Drill. This is really not that difficult a class if you do all the work. Taking time on the homework helps a lot - it really does its job, which is to teach vocab and grammar. The tests definitely got harder this term, however. Just a tip - literally pulling all-nighters before tests is a bad idea, 'cause then you fall asleep during the tests, which is definitely not helpful for grades. I wish she would keep the tests at a consistent difficulty instead of varying them so much. That said, I didn't spend nearly as much time as I should have on Arabic this term, so any bad grades I got were deserved. What really bugs me is that we're definitely not developing any sort of fluency in spoken Arabic. It's true, drill is pretty pointless. It may help with vocab memorization, but it doesn't teach us to speak. And in class, we should spend a lot more time speaking & less time going over grammar exercises that we could do just as well for homework. The other foreign language classes are taught in the language by this point, & people in Japanese & Chinese are actually able to speak them. She could teach in Arabic & it would be hard for a while, but we'd pick up a lot more oral comprehension. (OK, I admit, grammar explanations would need to be in English, but other stuff could be in Arabic.) I'm kinda disappointed 'cause I expected to be able to say something in Arabic by the end of this year & now I don't think I will. However, overall, it is a good course. Prof. Abouali really knows what she's teaching, does a good job explaning it, & is extremely willing to meet with students outside of class. The class also got more fun this term. The skits & breakfasts were cool. It's a good foundation in Modern Standard Arabic. I'm just convinced that to actually become fluent, you'd have to take some Arabic outside of Dartmouth.\"",
            "review 9: \"05W with Diana Abouali: The second quarter of Arabic was very much different from the first. We really delved into grammar, although much of the grammar came with vocabulary lists. The problem was that the vocab still wasn’t the most practical, although we did eventually learn things like telling time and days of the week, in addition to the past tense. Diana is still not doing a great job with making the class varied and creative, although we have had two Middle Eastern food days, albeit both during x-hours. The class has a pronounced lack of cultural material, and the sparse examples of culture we get through video clips or a few minutes of Arabic television do not suffice. The tests definitely got harder this quarter, and a bit schizophrenic, as the tests would seemingly vary between doable and really hard. She also started doing pop quizzes, but eventually told us in advance so we’d actually have time to study. In class, Diana still has trouble explaining some of the main concepts in a way that is easily understood by non-native speakers. Sometimes I think she just expects that the rules make sense. I WISH SHE WOULD’VE EXPLAINED THINGS IN CLASS LIKE SHE DID AT THE REVIEW SESSION BEFORE THE FINAL. CLEAR, CONCISE, TO THE POINT. I have to give her some slack since the book is pretty poorly structured, so that we get little tastes of a variety of grammar subjects without understanding many of these concepts in depth (the book constantly says, “Accept this for what we tell you it is for now, even though it is confusing, because eventually you will learn the concepts in depth”). SO, you kinda have to accept that you will be confused about a lot of things for a while and you definitely have to be ready to make mistakes. Drill. DRILL! AGH! First, Diana fired our drill instructor who’s Palestinian and could thus teach us real pronunciation, although he sometimes confused us with Colloquial. She was just too much of a stickler with him. The next drill instructor we got was kind and patient, but she was really lacking on the creativity scale, probably because, as a third year student, she is scared of being hurt in her class for being out of the box in drill. The drill needs a more varied structure. If I can do my homework and repeat drill phrases at the same time, the drill is not challenging me and not improving my speaking skills. THERE NEEDS TO BE ACTUAL INTERACTION IN DRILL, NOT JUST MINDLES REPITITION!!! Get over the hype of the damn Rassias method and just do what works for your specific students!\""
        ],
        "Hussein Kadhim": [
            "review 1: \"08W with Hussein Kadhim: Kadhim is supposedly a decently good guy and when he actually does explain grammatical concepts, he does have the english language facility and the knowledge of grammar to do so effectively - unfortunately, he rarely actually taught us grammar. Kadhim's philosophy is that the best way to learn a language is through hearing it in in class - as such, he pretty much conducts the class entirely in arabic. While this does admittedly have its benefits, given that this is still an introductory arabic class, he really needed to devote more time to actually explaining the concepts. Our only real reference for grammar was the book Al Kitaab text book which oftentimes did an inadequate job of explanation. I would say my biggest criticism of Kadhim however is his general approach. He wants us to learn the language, but he gave staggeringly little effort to actually make the class interesting and enjoyable. What's more - he would often express visible frustration, and although some of my classmates did not share this perspective, outward hostility towards you when you didn't understand a concept or made a mistake. I found the entire environment pretty somber, intimidating, and just plain not fun. I had Smolin first trimester and he made the class considerably more enjoyable. All this being said, he is an incredibly easy grader. We didn't really have any real tests: we had one xeroxed copy of a drill from the book, an in-class arabic recitation that simply required memorization of a paragraph, and a ridiculous final that was three pages long. He basically just gives everyone A's or A-'s. If you simply want to boost your GPA and don't care much about learning arabic, this could be the class for you, but I plan to steer clear in the future, if possible.\"",
            "review 2: \"08W with Hussein Kadhim: Kadhim is a really easy professor. He is super nice and if you go to office hours for help he will really spend the time until you get the material. He is not really good in class, he concentrates on speaking and not on grammar or vocabulary. Easy GPA boost, but I will suffer in Arabic 3.\"",
            "review 3: \"08W with Hussein Kadhim: Kadhim is an extremely nice and interesting guy, but in class he just wants us to speak and hear him speak the language. Although my verbal skills did improve, grammar was never really explained. Also, the tests were easy almost to the point that they were a joke so I never really had to review the material to get an A.\"",
            "review 4: \"07W with Hussein Kadhim: Khadim is very energetic and puts a lot of emphasis on pronounciation and speaking, so Kadhim's class is behind on spelling and vocab compared to other classes, however if you're willing to put in the time and make sure you keep up with other classes you'll be fine. Kadhim's exams are all take home exercises from the book or short oral presentations speaking about yourself, or speaking as Maha or Khalid, and graded pretty easily.\"",
            "review 5: \"04W with Hussein Kadhim: A lot of people tend to shy away from Arabic because they think it's hard, but with Kadhim it's easy and fun. From hearing about romance language courses, this is much easier than them. A good way to complete the foreign language requirement. Basically the same as Arabic 1, although less speaking work in pairs.\"",
            "review 6: \"03W with Hussein Kadhim: Essentially exact same class as Arabic 1, just with the new material. still a great class with a great prof\""
        ],
        "Lorice L.": [
            "review 1: \"08W with Lorice L.: It seems it doesn't really matter what my experiences are with Professor Kasbari... because she is leaving after this term. Nevertheless, the arabic program is improving continuously. I'm starting to feel better and better with my Arabic; I feel like I could definitely undergo some small talk in an Arabic speaking land. So that feels good.\"",
            "review 2: \"08W with Lorice L.: Kasbari was great, she always explained the material well and was understanding and helpful when students were participating during class, which she made an effort to make every student do every single class. Her baby is adorable, btw.\"",
            "review 3: \"08W with Lorice L.: Kasbari was a very nice teacher that made learning Arabic fun. Its unfortunate that this is her last term. She is very funny and sweet. I learned a lot of vocab and grammar in this class, though I thing my ability to converse is still limited.\"",
            "review 4: \"08W with Lorice L.: Lorice Kasbari was a wonderful prof, and we're all sad she's leaving Dartmouth.\""
        ],
        "Sinan Antoon": [
            "review 1: \"05W with Sinan Antoon: This course builds on everything taught in Arabic 1. Sinan Antoon is an AMAZING professor, very responsive to the class and great at spreading knowledge in general. Drill is annoying to wake up for, but at the same time it helps you learn the pronunciation and even build on vocabulary of the language. I highly recommend Arabic for anyone interested in languages.\"",
            "review 2: \"05W with Sinan Antoon: I loved Arabic 1...I am not as smitten with Arabic 2. I still like Sinan as a professor but I feel that he could explain the material better. He is availible for office hours but you have to schedule an appointment and occasionally he forgets. Overall the class was enjoyable but I am not inspired by the subject as I was after the first term. I think that I am going to take Arabic 3, but I am not sure.\"",
            "review 3: \"05W with Sinan Antoon: Best prof ever. He'll make you work, though.\"",
            "review 4: \"04W with Sinan Antoon: drill, attendance grades, lots of hw = burdensome, tedious, but i loved prof. antoon\""
        ],
        "Carol B.": [
            "review 1: \"09W with Carol B.: Bardenstein teaches some material ahead of the other classes and some material that is not in the book, so there is sometimes more work, but the material she adds help with understanding, so it's good. Overall, she's probably the hardest Arabic prof, but also quite good.\"",
            "review 2: \"08W with Carol B.: Bardenstein taught us way more than any of the other two classes did. We were taught things that we didn't need to know until next term. However, Professor Bardenstein prepared us extremely well. She's fabulous at explaining and really tries to make sure you understand Arabic words and grammatical structures. Lots of homework, lots of work in general. But it pays off in the end. If you actually want to learn Arabic, take this class.\"",
            "review 3: \"08W with Carol B.: Professor Bardenstein is really easy to talk to and great interactive teacher. She varies from the book a lot, but it's really useful for better understanding how the language works. Expect a lot of homework and long tests, but nothing is really hard or unexpected. She also like to make class more fun by adding little elements of culture and expect to do a lot of one on one dialogues with classmates.\""
        ],
        "Jonathan Smolin": [
            "review 1: \"06W with Jonathan Smolin: Arabic 2 could have been really hard, but it was actually not that bad. It's not impossible, and pretty much like any other intro lang course. Smolin is GREAT, knows what he is talking about, and very understanding of students of all levels of ability.\"",
            "review 2: \"06W with Jonathan Smolin: Best person to learn Arabic from possible.\"",
            "review 3: \"06W with Jonathan Smolin: smolin is very excited about teaching, and his students learning, there was homework just about every night, but it is neccesary\""
        ],
        "Jamila Chahboun": [
            "review 1: \"23W with Jamila Chahboun: ustedha is actually the best professor on campus and her classes are amazing. literally 10/10. amazing, mumtastic,\"",
            "review 2: \"18W with Jamila Chahboun: literally like an Arabic mom on campus. great prof, great class, great department. Only thing is with Jamila, you have to work for your A...expect more homework (1.5-2 hours a night) but a better understanding of Arabic grammar and stronger vocab moving forward. Highly recommend this class\""
        ],
        "Robert C.": [
            "review 1: \"02W with Robert C.: If trying to fill your language requirement, Arabic 1-2-3 is a good (and easy, despite drill) way to do it. Though it's a hard language, the class goes really slow, and it's not difficult to do well in class, granted that you attend class.\"",
            "review 2: \"02W with Robert C.: A very easy, interesting Language course. Easy tests without much homework. The homeworks basically cover all the material needed for the tests. Though good attendance is necessary to get an A, the textbook is sufficient for the course though Mckinney is a very effective lang prof. You should take Arabic 1-2-3 to fulfill lang reqs.\""
        ],
        "El Mostafa Ouajjani": [
            "review 1: \"23W with El Mostafa Ouajjani: If you're taking Arabic, take it with Mostafa. He explains the content clearly and makes class interesting and funny. As long as you pay attention in class and keep up with the homework, you'll be more than fine.\""
        ],
        "Mokhtar Bouba": []
    },
    "ARAB001": {
        "El Mostafa Ouajjani": [
            "review 1: \"22F with El Mostafa Ouajjani: I think all the other reviews speak for this class. Prof Mostafa is such a sweet prof and he shows that he cares so much about his students and wants them to learn. You start by learning the alphabet then move on to learning vocab and grammar. Besides the midterm and final, most of the assessments are quizzes, and he goes over the structure before you take them. As long as you do the daily homework and occasionally a little extra review of vocab and grammar, you will be absolutely fine in this class!\"",
            "review 2: \"22F with El Mostafa Ouajjani: I highly recommend taking this class with Mostafa. He is so sweet, funny, and makes the class entertaining. He's super helpful if you have any questions and the class itself isn't too bad.\"",
            "review 3: \"22F with El Mostafa Ouajjani: Professor Mostafa is one of the best professors I had. He is so sweet and nice, and he really cares about improving your Arabic. I loved this class, and he is really funny and a very good teacher. His daily homeworks are not bad at all, basically guaranteed full marks as long as you tried to complete it correctly. His quizzes and midterms are very good and fair, and he definitely prepares you for it well. I highly recommend you taking Arabic 1 if you are interested in learning the language. P.S. I heard that Professor Jamila is also a wonderful professor from all my friends. You can't really go wrong with either.\"",
            "review 4: \"21F with El Mostafa Ouajjani: Would 100% recommend this class. Besides having drill, this class was absolutely amazing. Made a lot of friends with everyone and was a fun place to joke around. Professor Mostafa is so kind and gave us sweets once. Many people think that Arabic is hard but Mostafa made it easily understandable by breaking it up. Be prepared to learn lots of vocabulary though and having to apply it by recording yourself read and doing group projects. There are a lot of partner activities so don't be afraid to branch out to some of your classmates.\"",
            "review 5: \"21F with El Mostafa Ouajjani: I absolutely loved this class! It was great and Professor Mostafa is such an amazing teacher. I never thought I would find myself learning Arabic, but Mostafa made it so much fun. Definitely recommend the Middle Eastern Department here at Dartmouth is amazing!!\"",
            "review 6: \"20F with El Mostafa Ouajjani: Loved this class!!! Mostafa is such a sweetheart and honestly a huge teddy bear. Both Mostafa and Jamila are absolutely amazing, but it is true that Mostafa's homework load is much lighter. Despite that you will still learn so so much!!!\"",
            "review 7: \"19F with El Mostafa Ouajjani: Mostafa is literally the best! He's a really great professor and you will learn a lot. He also made couscous for my friends and I when we visited him in Morocco.\""
        ],
        "Jamila Chahboun": [
            "review 1: \"22F with Jamila Chahboun: Best language class + teacher on campus. Super nice, super fun, you learn the alphabet and some basic grammar + vocab. Basically everyone gets an A. There are daily homeworks but they aren't graded harshly and you can miss a couple and still be fine. Occasional presentations/quizzes but they are never graded so as to punish you. Only downside is drill 4x a week (mine was at 7:45) and the daily homeworks can get annoying sometimes. Still highly recommend!!\"",
            "review 2: \"21F with Jamila Chahboun: AMAZING CLASS!! Ustadha is literally your Arabic mom on campus: very dedicated and caring towards her students. Homework is daily but very manageable. Drills are early in the morning but help brush up on skills learned in class. HIGHLY recommend this class for people with little to absolute no prior experience in Arabic!! If you try your best in the class, you're more than likely to get an A.\"",
            "review 3: \"18F with Jamila Chahboun: GREAT CLASS!! Super nice prof, accessible during office hours, dedicated to students in and beyond Arabic 1. homework is a lot because you have to learn the alphabet and practice writing. Went into this class with zero Arabic, after 1-2 terms I could actually read basic things and speak. Like any language, what you put in is what you get out. Solid guaranteed grade, workload is pretty constant though.\"",
            "review 4: \"18F with Jamila Chahboun: Jamila is one of the kindest and most dedicated profs you will find at Dartmouth. She is an amazing language teacher and cares more about her students than anyone I've met. In Arabic 1 you learn the alphabet, very very basic grammar, and some basic vocab. However, drill meets 4 times a week which is truly exhausting, and Jamila takes it very personally if you cant give the class your all, so if you choose to take Arabic with her, make sure that you are ready to give the class an honest effory.\""
        ],
        "Mokhtar Bouba": []
    }
}