{
    "COCO038": {
        "Elizabeth Wilson And Meredith Kelly": [
            "review 1: \"22S with Elizabeth Wilson And Meredith Kelly: This class, co-taught by two great professors, was as expected, pretty great. Not a huge amount of work, a hard midterm but overall a positive experience. The first half was all EARS and based on climate dynamics, then it shifted to more system analysis and policy. I would recommend if you're interested in energy at all.\"",
            "review 2: \"22S with Elizabeth Wilson And Meredith Kelly: this class was super disorganized and overall a logistical disaster. the profs did not seem to have a great relationship with one another which was weird, cuz they were running the class together. the midterm was insanely hard and the grading on labs/final project was never really explained and kind of seemed arbitrary. overall i wouldn't recommend it unless you care a ton about EARS/ENVS--and even then there are likely better classes in those departments you can take.\""
        ],
        "Elizabeth Wilson": [],
        "Meredith Kelly": []
    },
    "COCO026": {
        "Heidi Denzel": [],
        "Mokhtar Bouba": [],
        "Tonia Convertini": []
    },
    "COCO036": {
        "Sergei Kan": [
            "review 1: \"22W with Sergei Kan: The content of the class is fascinating, it makes for interesting reading and occasionally good discussion. Professor Kan is very knowledgeable about Alaska and it comes through in his lectures and choice of readings. That being said, this class was really frustrating. We had a immense quantity of readings each week, in addition to an almost weekly reading discussion of 500-1500 words. The midterm and final exam are both approx. 2000 words and there is a research paper of 3600 words. Before each class we often had upwards of 200 pages of dense readings and despite the interesting material, it made for a slog. However, we had to get through it because Kan was extremely particular about what he wanted from assignments and it seemed that grades were assigned based on who he liked most/who participated in class the most. The class is interesting but often did not feel worth the amount of work it required.\"",
            "review 2: \"22W with Sergei Kan: I signed up for this class looking for a little bit of a layup, which I didn't really find. It is reading heavy, and there are responses due throughout the course that I put a lot of time into that didn't end up doing much for my grade. Lecture is slow but we got a break during the 10A. Content is interesting enough, but focused mainly on southeast Alaska because prof is Tlingit. Weighting and grading was frustrating because he was annoyed when we didn't use the sources he wanted us to. 50% of our grade was due in the form of the two finals- a 3600 word research paper and a take-home final. Was interesting enough but not a layup.\""
        ]
    },
    "COCO033": {
        "Sergei Kan": []
    },
    "COCO035": {
        "John Kulvicki": [],
        "Viktor Witkowski": []
    },
    "COCO034": {
        "Aden Evens": [],
        "Sarah Ackerman": []
    },
    "COCO031": {
        "David Plunkett": [],
        "Jonathan Phillips": []
    },
    "COCO032": {
        "Iyabo Kwayana": [],
        "Monica Ndounou": []
    },
    "COCO030": {
        "Klaus Milich": [
            "review 1: \"23X with Klaus Milich: I really wouldn't recommend taking this class. My first gripe with it had to do more with my expectations than anything: I went into it expecting to have a practical dive into the current state of American politics, looking at what strategies current groups and politicians use to forward a more authoritarian movement, and what methods can be used to prevent us from losing our democracy. This class is, instead, very theory-heavy. For example, we once had a fifty minute long discussion on the terminological differences between populism and conspiracism. For someone who prefers the practical over the abstract, this was an incredibly frustrating class. Further compounding the frustration was the way in which the class was run. It was set up like a discussion course, with students sitting around in a circle, but Professor Milich spent about 80% of the class time talking. He'd often meander between topics, not following any particular structure, but rather saying whatever the most interesting thing that came to his mind. When students would ask questions he'd rarely provide a clear answer, choosing instead to speak for ten minutes about something only tangential to what the student had actually asked. His assignments and expectations were not clear, and though he told us that he wanted his class to be a democracy -- in that students could make decisions about how the course was run -- there were instances in which he actively ignored student wishes. As much as it pains me to say it, because Professor Milich is quite a nice man, this was my least favorite course I've taken at Dartmouth so far.\"",
            "review 2: \"23X with Klaus Milich: I agree with other commenter. While Prof Milich is a nice guy the course was not good. He only began to grade in week 7. Additionally mid way through the term he decided the class wasn't doing the readings and assigned additional 600 word per week reading responses.\"",
            "review 3: \"23X with Klaus Milich: Honestly, a pretty fun class if you found the topic interesting. Klaus is super cool and a really nice guy. In terms of the actual coursework itself, I'm not gonna lie, I didn't really learn much. I don't agree with the person saying it is the worst class they have taken at Dartmouth because, in the end, the experience was worth it. I only took this class because I wanted something chill and didn't need any distribs/major courses. It was a great spot to fill in.\""
        ]
    },
    "COCO029": {
        "Ellen Rockmore": []
    },
    "COCO028": {
        "Mikhail Gronas": [],
        "Peter Tse": []
    },
    "COCO027": {
        "Edward Bradley": [],
        "Roger Ulrich": []
    },
    "COCO025": {
        "David Rezvani": [
            "review 1: \"19S with David Rezvani: David Rezvani is the worst teacher I have had at Dartmouth. He made up his own foreign policy strategy called \"flexible integration\", which is not cited in any other academic paper, something that should raise some red flags, given that he teaches us \"flexible integration\" for a couple of weeks. He is disorganized, unclear with his expectations, and overall unintelligent. I am baffled that Dartmouth would hire such a professor.\""
        ]
    },
    "COCO024": {
        "Donald Pease": [],
        "James Muirhead": [],
        "Robert Bonner": []
    },
    "COCO023": {
        "Laura McPherson": [],
        "Theodore Levin": []
    },
    "COCO022": {
        "Adina Roskies": [],
        "Matthijs van der Meer": []
    },
    "COCO021": {
        "Francine A'ness, Mokhtar Bouba": [],
        "Francine A'Ness": [],
        "Mokhtar Bouba": [],
        "Prudence Merton": []
    },
    "COCO019": {
        "Jeremy Rutter": [],
        "Paul Christesen": []
    },
    "COCO020": {
        "Theodore Levin": [],
        "Ulrike Wegst": []
    },
    "COCO003.01": {
        "Michael Chaney": []
    },
    "COCO018": {
        "Lorie Loeb": [],
        "Thalia Wheatley": []
    },
    "COCO017": {
        "Alexander Hartov": [],
        "Michael Casey": []
    },
    "COCO016": {
        "Carlos Martinez Casas": [],
        "Kui Dong": []
    },
    "COCO002.01": {
        "Hakan Tell": [],
        "Mark McPeek": []
    },
    "COCO005.01": {
        "Mary Desjardins": [],
        "Mona Domosh": []
    },
    "COCO001.04": {
        "Theodore Levin": []
    },
    "COCO015": {
        "Theodore Levin": [
            "review 1: \"08W with Theodore Levin: The idea of the course is really ambitious - an interdisciplinary approach to the lands, history, culture and religions of the Silk Road. Overall, if the idea interests you, take it. This was the first time it was offered, and there are a lot of kinks to work out. Classes ranged from really interesting (the whole section on religion was well done) to fun (helping build a yurt or dying your own indigo) to really boring (Profs Levin and Rudelson spent 30 min looking for a city on Google Earth while we sat and waited). Some reading was awful - if its still in the syllabus, don't read The Mummies of Urumqi (or at least skip the first 120-140 pp!). Rory Stewart and Genghis Khan redeemed it though. There were 8 guest professors, and three stunning class-long concerts. If you are willing to put up with the occasional boring lecture/reading, the class has a lot to offer on its good days. It's also a REALLY easy A, probably the easiest grade at Dartmouth. I'd recommend it.\"",
            "review 2: \"08W with Theodore Levin: I had little to no interest in the subject when I entered the course. I was pleasantly surprised. The course was very interesting, engaging, and thought-provoking. I especially liked how prof Levin went the extra mile to make the class a special experience for all of us... bringing in hotshot musicians from all over the world and arranging out-of-class experiences (building a yurt, for example) for us to participate in. There were a few rocky moments -- about 1/5 of the lectures, and some of the readings (Marco Polo, I'm looking at you!) were particularly boring, but some lectures, such as the one about blue and white pottery, were unexpectedly interesting. The overall workload was not too bad. You need to do all the readings to do well on the reading quizzes, and the papers are required to be so short that you will spend more time slimming your essays down than writing them. Prof. Levin was delightfully lenient with the essay grading.\"",
            "review 3: \"08W with Theodore Levin: amazing class. filled in interdisciplinary gaps in my education about the east - near east, far east, connections between all of that and the west. class was never the same -- we had guest lecturers more than half the classes, from museum curators to fabric dyers to writers for the NY Times to musical groups from uzbekistan. I learned a huge deal. the class is pretty reading-intensive -- more so than I could keep up with on a regular basis. there were a couple reading quizzes throughout the term that basically mandated that you'd read all the material -- but other than that the assessments were fair and enjoyable... analytic papers on interesting topics like comparing marco polo to an equally idyllic chinese pilgrim, xuanzang. prof. levin is great -- brings such an interesting background to the plate that it's hard to resist his contagious passion for the material.\"",
            "review 4: \"08W with Theodore Levin: The reading quizzes are annoying, but other than that, an interesting class\"",
            "review 5: \"08W with Theodore Levin: This class was AMAZING. We dyed indigo, saw polyphonic singers from Tuva (region in Mongolia/Russia), had a billion different guest lecturers... it was REALLY good. Levin is a wonderful lecturer, and has so many connections that more classes than not we had someone or some group that was really interesting coming to visit us. If he ever teaches this class again, TAKE IT. Even if you don't need the INT/NW, at least go to the first class... you'll love it. And then as a bonus you will get your INT/NW, two hard ones... I don't know Levin as a music professor, but he just seems so interesting and dynamic and friendly and knowledgeable I can't imagine he'd be anything but great.\""
        ]
    },
    "COCO006": {
        "Jody Diamond": [
            "review 1: \"06F with Jody Diamond: Tuesdays were lecture days which discussed the reading assigned for this class, so on average the reading assignments were about 50 pages per week. At some point each student was assigned a short presentation, but there was no pressure, since it was not graded and did not demand anything extra except that the reding be done. I found Prof. Ohnuma very straightforward and was thankful that she took Prof. Diamond's music quiz, which showed that the quiz was poorly constructed and that we were not stupid. Prof. Diamond can be your friend, but she can't be your prof. because she expects you to \"feel\" the gamelan, which could be tough for the musically challenged. Overall, it is not tough to get a good grade in the class.\"",
            "review 2: \"05W with Jody Diamond: Ohnuma is really organized but boring and cold. Diamond is really fun and she has a lot of passion for the subject. Gamelan playing is so so. However, the class is easy.\"",
            "review 3: \"05W with Jody Diamond: Overall the course was worth the work. Professor Ohnuma knows a lot about the subject, and Professor Diamond is really interested in the gamelan. They are a great combination. Ohnuma is more organized while Diamond is more easy-going. The final performance took up a lot of time. I spent a lot of time on this class at the end of the term because the workload increases greatly. Take the course.\"",
            "review 4: \"05W with Jody Diamond: this class was very fun. we learned to planb the gamelan (indonesian and southeast asian orchestra of sorts). there was a lot of reading given by one of the professors but only one of the three days was lecture the other two were gamelan. this class met during every x-hour but was not at all overwheleming\"",
            "review 5: \"02W with Jody Diamond: This class was a very interesting topic. The readings were especially stimulating, but I feel that we spend a lot of time in class going over the Ramayana itself, not particularly over the implications of the readings. Also, the class was not very discussion based. Instead, it involved lectures to get background information, which could have been accomplished through reading, allowing more time for class discussion. Also, from the performance aspect, Professor Diamond provided a great deal of support and invested a lot of time in making students understand what they were doing and why. However, I feel that professor Ohnuma was difficult to reach and she did not really contribute positively to the class.\"",
            "review 6: \"02W with Jody Diamond: This was one of the best classes I have taken at Dartmouth!! It is interdisciplinary in nature, meaning we spent about half the time in lectures learning about the history, diversity, and politics of the Ramayana, while we spent the other half the time learning how to play the gamelan, perform shadow puppetry, etc. It was a really unique and amazing experience - I'd recommend this course to anyone! The assignments were a bit disorganized, mostly because this was the first time the course was taught. We had two midterms (papers), a short take home final exam, and were also graded on our \"final performance\" of the Ramayana as well as individual \"creative projects\" that we devised. I LOVED the course - definitely take it!\"",
            "review 7: \"02W with Jody Diamond: Professor Diamond is generally good and enthusiastic about teaching Gamelan. The only reason why I did not give her an A was because she has a tendency to be disorganized. We were supposed to have a quiz in the 4th week of the term, which we recieved during finals period. She also sent us a final, which she later cancelled because it was the same as the final paper. Professor Ohnuma was not quite as fun as Professor Diamond, but that was mostly because she was teaching us more analytical stuff, while we played with Javanese shadow puppets in Professor Diamond's classes. However, her lectures were very well thought out and explained. It was easy to take notes on them. They were also tested on the quizzes. In general, this class was fun. There was a lot of reading material, but we were not expected to read all of it, and it was interesting. We also all learned how to play in a gamelan and how to use shadow puppets. Lots of fun.\"",
            "review 8: \"02W with Jody Diamond: Professor Ohnuma did the text part - so with her it was readings, discussions and essays. Fairly standard. Professor Diamond did the performance part - so with her it was singing, clapping, playing instruments, and working shadow puppets. Sometimes it got a little boring with Professor Ohnuma. And sometimes Professor Diamond was so disorganised that things took twice as long as they should have. But overall it was pretty good. This is the kind of class where you know everyone's name by the end. Our final performance was very enthusiastic and fun. And I did learn a lot about a subject I knew nothing about to begin with.\""
        ],
        "Sara Chaney": [],
        "William Hudenko": []
    },
    "COCO005.03": {
        "Jessica Smolin": [],
        "Roberta Stewart": []
    },
    "COCO005": {
        "Douglas Bolger": [
            "review 1: \"02F with Douglas Bolger: if you're the type of person who likes law and ecology, it's a match made in heaven. but for me (and for most of the class, it seemed), it was a way to get rid of my interdisciplinary. when i initially signed up for the class, i thought it'd be fun. i guess it was, in a way, but the class itself was very unorganized. that was probably due to the fact that it was taught by 2 profs (one being a nondartmouth prof who isn't on campus for the most part). prof bolger wasn't even in the country for the first 6 weeks of the course. there seemed to be some odd competitive edge between the two of them as they were fighting to talk more. the grades are based on 4 quizzes and a group project/paper/presentation. the quizzes were an unfair reflection of the readings we had to do; they were often boiled down to obscure true and false questions. the group project was a better experience (probably because i was assigned with a good group). overall, the class had great potential and the actual information was interesting, but the class failed to inspire further interest. i know people who liked the class. it could go either way, but in my case, it didn't.\"",
            "review 2: \"02F with Douglas Bolger: Loved the subject matter and the profs are really good (Parenteau is better than Bolger by far, but he's a law professor so he's used to being dynamic. The big project at the end is rather overwhelming and they demand a lot out of the groups considering they're assigned and the projects really have nothing to do with what's learned in class. If you need to take a \"big I\" class, though, this one rocks!\"",
            "review 3: \"01F with Douglas Bolger: The course presents a good introduction to both ecology and law. Much of the relevent concepts (i.e. for the assignments) came out of the law part of the course, although the final project had us explore ecological concepts. There is a lot of material covered in this course that you don't ever really get tested on, so you will get out it what you put in.\"",
            "review 4: \"01F with Douglas Bolger: This course started out very promising, but it failed to live up to its description. The attempts to make the course a success were valiant, but the subject being tackled was just too broad for the scope of the course. It was interesting to see the interactions between the professors because they came from very different backgrounds. The worst part of the course was the final 30 page research paper creating an eco-system management plan. The topic was too encompassing and asked us to create in 30 pages what professionals do in thousands.\""
        ],
        "David Ehrlich": [
            "review 1: \"06F with David Ehrlich: This course was a ridiculous amount of fun. It was basically an overview of different types of artistic expression and looking at how we create and react to art. It was a very time-consuming class, but all of the work we had to do was amazingly fun. However, this is not a good class for many people, as it requires that you be able to throw yourself into a wide variety of artistic pursuits, from poetry to drawing to writing and performing a one-act as part of a group, and really get into it. David (Prof. Ehrlich) is also a bit of an eccentric character, kind of like the class. You'll either sink or swim, but if you can manage to swim, it's an absolutely amazing experience.\""
        ],
        "Ursula J.": [
            "review 1: \"04S with Ursula J.: I took the class because I thought Nanotechnology would be fairly interesting, but it was very technical and practically all the lectures were about the developments of current technologies that can make production nanotechnology possible. I don't know if they're gonna offer this class again, but it's fairly boring.\""
        ]
    },
    "COCO002": {
        "Ronald Green": [
            "review 1: \"07W with Ronald Green: \"Assisted Reproduction\" was a very enlightening course and forced the class to think about some challenging issues. There is not too much work - just a book report, presentation, research paper, and then a culminating final.\"",
            "review 2: \"07W with Ronald Green: I loved this class. The professors were all very good. It was light on work, but consistently interesting and thought provoking. Take this class if you can. You won't regret it.\"",
            "review 3: \"07W with Ronald Green: This course definitely taught me a lot. I can't say that it captured my attention for every minute of the two hours but I definitely learned a lot even if it was just through in-class osmosis. The paper grading was pretty easy and the final exam was okay. Take this class if you want to know more about the medical technology that will be affecting your life in the near future.\"",
            "review 4: \"07W with Ronald Green: This class was by far the best class I have taken at Dartmouth yet. I was nervous going into as a freshman, but that did not have any impact whatsoever once I started the class. The class covers a wide range of issues concering assisted reproduction and the professors are great. This class was so interesting that I want to learn more about this topic. I would definitley take this class if you can.\"",
            "review 5: \"07W with Ronald Green: awesome topics but mismanaged to some degree basically could have been done a lot better\"",
            "review 6: \"07W with Ronald Green: very interesting topics, makes you think. there was a bit of reading, but it was normally fairly interesting (the Daar textbook, not so much) but there wasn't much work besides that. there were two papers, one that was a 4 page review of a book and the other 12-15 page research paper on a topic of your choice. the final was not multiple choice. overall, easy laid back class, profs were great, lectures were pretty interesting, and i would definitely recommend this course to anyone interested. easy way to fulfill the TAS requirement.\"",
            "review 7: \"07W with Ronald Green: Everything about this class was disorganized and arbitrary. The reading assignments were long, complicated and not useful. During lectures the three profs would all jump in with their own opinion about the topic. During class we would debate our own views on topics and never come to any clear conclusion. You didn't seem to miss anything when you missed class, but this didn't make the class easy. The assignments were unclear and had little to do with the course. We had a 4 page book report. This assignment sounds easy enough, and it was by no means hard to complete. But the grades were totally out there and completely based on whether the professor who happened to grade you paper agreed with you about the most important parts of the book. We had a 15 page research paper. While the median grade wasnt low, the grading was again arbitrary and varied greatly based on who graded your paper. The course covered a ridiculous amount of material including philosophy, case law, biology, technology and psychology. We had absolutely no direction in studying for the final. In the end, the exam questions were not hard, but did require a broad range of specific knowledge. This was one of those courses where if the cards fell in your favor you could do little work, not go to class and do well. If the odds were against you, you could do more than expected and do poorly. If you're concerned about grades, you might not want to take the risk.\"",
            "review 8: \"07W with Ronald Green: Really interesting material. It's a good combination of profs with psychology, religion, and medicine. You don't have to do most of the reading.\"",
            "review 9: \"07W with Ronald Green: I'm happy. I got a TAS from a Rel course. Neat.\"",
            "review 10: \"07W with Ronald Green: Unless you're very interested in the subject, STAY AWAY. i took the class based pretty much entirely on the rave reviews it had received but in the aftermath i realized that the reviews were so great because the people who generally took the class were people who were psyched about reproduction. as a humanities person (govt major), i found this class extremely boring.\"",
            "review 11: \"07W with Ronald Green: You didn't have to do the readings for the class--just showing up and studying the notes and ppts would have been enough for the final. The research paper was fairly easily graded, as was the project, but I felt like they would have done better to give more detailed expectations. I didn't do so well on the first paper since I thought I had met the requirements, but there was apparently a hidden set of requirements. You definitely need to make it clear with the profs what they expect from you. So, no hw, other than the one short paper and the research paper, both of which you get ample time for, and the final. Bioethics is a very interesting subject and each of the profs brought a very interesting viewpoint to the class, which made it easy to stay focused.\"",
            "review 12: \"07W with Ronald Green: Interesting material, but SOOO much reading that does not seem helpful at all. I stopped doing it halway through the term and it didn't matter that much.\""
        ],
        "Donald E.": [
            "review 1: \"08S with Donald E.: This course is amazing! The class focuses on all aspects of alcohol and addiction medicine. The class looked at issues through historical, medical, personal, global, local, and societal lenses. By having guest speakers every class period, the course never got boring. It was one of very few classes that I was always excited to attend. Professor Nelson is amazing! If you have the opportunity to take a fun, easy, and interesting course, you should enroll in this class.\"",
            "review 2: \"08S with Donald E.: Very interesting topic with lots of interesting lectures. I highly recommend this class, it is one of the best classes I have taken at Dartmouth.\"",
            "review 3: \"08S with Donald E.: all the profs are awesome\""
        ],
        "Jane Carroll": [
            "review 1: \"03F with Jane Carroll: Not as easy as you would expect a COCO class to be. Wasn't particularly difficult, however. Professors are exceptional.\"",
            "review 2: \"03F with Jane Carroll: This course is NOT for the lazy. I repeat, this course is absolutely, positively NOT for the lazy. Every time I came out of class, I would hear people complaining about how they were absolutely getting shafted in this course. But that is because they were (a) not doing the reading, (b) not preparing for the timed writing assignments, (c) not attending 100% of lectures, or (d) all three of the above. PROFESSORS: The professors are absolutely approachable at all times, and I know that several of my classmates agree with me on this. Prof. Carroll is a dream of a professor and is absolutely great. Prof. Gaposchkin can be hard-edged at times, but her style of teaching and lecturing is more \"tough love,\" but, hey, it works, and she is absolutely great, too. So they actually make a great team: Prof. Gaposchkin will push your critical thinking to the limits, while Prof. Carroll is always there to balance it out with her undying support (don't get me wrong--Prof. G. is more supportive than 99% of the professors on campus, but if you have a choice and you're in this class you're certainly more naturally inclined to approach Prof. C. for help, for whatever reason or another). READING: This class has a fair amount of reading. Enough to keep you busy, but not overly busy. The reading will not consume your life (although some people say it did). In other words, if you have taken Ed 20 before, the reading for this class will be a cakewalk (it's about 30% of the amount of reading in Ed 20, to make a nice comparison). As for office hours, they are 300% available to help, nearly all the time. It was great working with them. I would seriously consider taking another class with this awesome team. LECTURES: As much as the reading will help you, reading without attending 100% of lectures cannot save your grade in here. If you don't plan on coming to lectures, and only plan to do the reading, then this is not the course for you -- expect no higher than a C (tops) in that case. The thing is that the class is entirely lecture-based. The readings from the reader are nice and specific to some pieces of art, but other pieces of art don't appear in the reading and are only covered in lecture. The textbook that accompanies the course really doesn't accompany the course: I only used it a few times in the term more like a reference guide to check for historical accuracy when preparing my answers ahead of time to timed writing questions. Again, the lectures are key. You can't miss even one without jeopardizing your grade--I'm completely serious. The course IS built around lectures. TIMED WRITINGS: The value of these exams goes up every time, which is nice because you tend to get used to writing in art history style as the term goes on (provided you get input from the prof's). They post 3-5 possible questions for the timed writings 2 days before the actual exam. So you get 2 days to prepare a thesis & your response, provided you're on top of things (you can't afford to NOT be on top of things in this class). Sometimes we collectively felt cheated because we'd do pages & pages of reading on some piece of artwork, and it wouldn't even show up in the timed writing questions. But overall the timed writings were an awesome experience. I learned a lot from them, and they were low pressure for those who knew they were prepared for them. If you don't have time to prepare for things like this, don't take this class. So, if you want to work a fair amount (it's not as much work as a Bio/Chem/Ed 20 sort of class, but it requires diligence) AND you want a great view of history and art history as you build critical thinking skills, you MUST take this class. Go for it, it was an awesome class!!\"",
            "review 3: \"03F with Jane Carroll: This course was such an awesome course. I learned so much from the Historical aspects of the rulers of the time to the history of some of the most beautiful art works of the time. I also really enjoyed looking at the propaganda used by the various monarchs through out history. The class made me very aware of how the same strategy is used by the presidential candidates today. I highly recommend this class to anyone, as well as any other class that Prof. Carroll and Prof. Gaposchkin teach. They are both great professors.\""
        ],
        "Roger Ulrich": [
            "review 1: \"01F with Roger Ulrich: This class was clearly not well planned. The readings were excessively long and did not connect to each other. The lecture topics seemed to be picked out of nowhere. The lectures were boring and reached very few points, and certianly did not connect to one another. Half of the papers were on movies watched outside of class. The professors never mentioned how each paper was weighted so it was impossible to guess how you were doing. The final paper topic was not given out until a week before it was due. And worst of all, this class made no attempt to come to any sort of a cohesive conclusion. It did not even touch on how the two disciplines involved (classics and English) were intertwined. If I did not need the 3 distribs this course covers, I would have dropped it ASAP.\"",
            "review 2: \"01F with Roger Ulrich: This class is not hard. Yes, it's extremely boring, but it's not hard. There are no tests, and no final. There are 3 5 page papers and a 6-8 page final paper. That's it. Cosgrove is a terrible lecturer and a difficult grader, but Ulrich is a pretty inetresting lecturer and an easy grader. My advice is to ONLY do the reading that pertains to the 4 papers, and IGNORE the rest. It's not worth your time.\"",
            "review 3: \"01F with Roger Ulrich: This review should be prefaced with the following disclaimer: I now realize I'm just not a fan of the classics. I came into this class looking for distribs. That's what I got. I should have and could have done more of the reading (I only did the ones which directly affected writing various papers), for interest and self-improvement. But I have to confess that Profs Ulrich and Cosgrove left me completely unmotivated to do the reading. Some of the classical stuff was pretty cool. And it was a nice first look at some of the literature I'd barely heard of before. But I simply didn't put in effort into this class, aside from papers. And I still got by. This type of thing is completely do-able in COCO 2, as the material doesn't directly appear on papers. Some of Professor Ulrich's tidbits about architecture were very interesting. And Professor Cosgrove often had many nice insights into the literature, which probably would have been great to hear if I had read the stuff. Anyways, the class wasn't bad. It wasn't a bad experience by any stretch of the imagination. But both because of the subject matter, and because I hardly put any time into this course, I felt the educational value to be extremely lacking. The paper topics were kind of uninspiring as well. The multiple distribs it gives you are great though!\""
        ],
        "Mikhail Gronas": [
            "review 1: \"05F with Mikhail Gronas: I like art, literature, and film and this course was perfect. We analyzed art, read books, and watched films. A large portion of the class focused on history too. The books were very good but we spent far less time on them than on film and art. Assignments weren't always clear but the profs were relaxed too. A lot of reading assigned but it was interesting and could be skimmed. Prof. Gronas is great.\""
        ]
    },
    "COCO001.03": {
        "Kristin O'rourke": [
            "review 1: \"20F with Kristin O'rourke: The class itself it pretty easy. You just do the readings for class and complete all the writing assignments. However, I hated Professor O'Rourke. She was pretty racist and totally lied about the purpose of the class. She specifically stated that the class is NOT an art history class and will study fashion across cultures. This class was literally a Renaissance art class of French fashion. I felt like I was in AP European History all over again. I learned nothing about fashion, and Professor O'Rourke only taught like half the lectures because she kept inviting guest lecturers. She even brought another white professor to talk about Japanese fashion, which I though was hilarious. Anyway, if you're a rich white girl like most of the people in the class, you'll do fine and probably enjoy it. Otherwise, don't take this class!\""
        ],
        "Jane Carroll": []
    }
}