{
    "COLT010.26": {
        "Veronika Fuechtner": [
            "review 1: \"22F with Veronika Fuechtner: Pretty normal seminar style class, really chill professor. 20-80 pages of reading for each class, but easy to skim\""
        ]
    },
    "COLT052.08": {
        "Patricia Stuelke": []
    },
    "COLT070.06": {
        "Laura Chapot": []
    },
    "COLT063.03": {
        "Antonio Gomez": [],
        "Klaus Mladek": []
    },
    "COLT057.12": {
        "Nancy Canepa": [
            "review 1: \"22S with Nancy Canepa: Oh my goodness I cannot say enough good things about this class. She is God's gift to mankind. Not only was this class a big layup, but super interesting. Take this class 1000%.\""
        ]
    },
    "COLT053.05": {
        "Michael Wyatt": []
    },
    "COLT062.08": {
        "Emily Kane": []
    },
    "COLT049.08": {
        "Yi Wu": []
    },
    "COLT010.24": {
        "Annabel Martin": [
            "review 1: \"22S with Annabel Martin: This class is incredible. Annabel Martin is the SWEETEST professor I have ever had. She truly cares about her students and the curriculum. This is my second class with her, I needed the lit distrib but did not want to read full books. We are responsible for 2 movies and 2-3 WGSS theories a week. I skim most of the readings, you really only need to read 1 piece fully because there is a writing assignment to write a reflection of one of your choosing. The movies are super interesting and many are in different languages and countries which can keep it interesting! Class is all discussion based. As I mentioned are a few writing assignments throughout the term but they are very \"reflective\". Martin is just looking to hear about your opinions and experiences - the writing is all VERY informal and casual. She gives you a 100% on every assignment as long as you truly talk about yourself and how you connected with the text. The final is a group project... once again she will give you a 100% if you just put in effort and make it personal.\""
        ]
    },
    "COLT010.23": {
        "Irene Kacandes": [
            "review 1: \"22F with Irene Kacandes: Fast-paced and some long readings, but an excellent and very exciting course. Too bad this was Professor Kacandes's last term teaching.\""
        ]
    },
    "COLT057.10": {
        "James Dorsey": [
            "review 1: \"22X with James Dorsey: I liked this class a lot! It was especially great during the summer because of the immense flexibility Professor Dorsey offered with assignments, allowing you to complete only a subset of them so you could step away when your other classes got intense. You definitely get out what you put in learning-wise, but assignments were mostly graded kindly. A 10A in the summer is never amazing but this class made it worth it. Professor Dorsey is fun and connected well with our class, and the guest lecture was pretty cool too.\""
        ]
    },
    "COLT018.04": {
        "Lucas Hollister": [
            "review 1: \"23X with Lucas Hollister: Overall, I enjoyed this course! Important to note that I really wasn't a fan of the theory we read though, as I found it difficult to understand. The professor was very nice though, and you can tell he has a passion for the subject material. Really enjoyed the fiction we read, and overall the workload was quite manageable. For those who like high-level theory this class will be a great fit, and even for those who don't, I think there are still things to enjoy about it.\"",
            "review 2: \"23X with Lucas Hollister: Hollister is a great prof and a great guy who really respects his students and is passionate about the class. The discussions were enjoyable and made me appreciate the material, even if I didn't like it when I read it on my own. There is a midterm and final paper and a discussion post for every class, but overall it was very manageable. I would definitely recommend this if you need a LIT class.\"",
            "review 3: \"21X with Lucas Hollister: This is one of my favorite classes I've ever taken. Great class to take over sophomore summer (was over Zoom, but think it would also be good in person). You start reading theory at the beginning of the class, which is hard to get through but interesting. I really liked all the things we read, and I think the prof does a good job making sure you don't just read American / Western European works. Reading is super manageable. Class was open ended discussion, guided by the prof if people didn't have immediate thoughts. Would absolutely take a class with this prof again, or recommend this to someone else.\""
        ]
    },
    "COLT051.05": {
        "Andrew Caplan": []
    },
    "COLT007.19": {
        "Klaus Milich": [
            "review 1: \"21W with Klaus Milich: Took some time to figure out how this class works, but once you get it, 100% a layup. Professor is adamant that he is \"not a teacher\" and we are not his students - we are all scholars on the same playing field (we got a whole lecture on this maybe week 2). With this in mind, he really doesn't lay out assignments like other professors do - any sort of direction is really just suggestion in his mind and that wasn't clearly communicated at the beginning of the course. I definitely understand the frustration of the first two - I was in the exact same place for the first 4 weeks and I think that's when those were posted. After talking to the prof and finding out that the 2000 word paper with a specific focus on colonialism was really just an open-ended, word-countless paper and the guidelines were just his ideas and what he would write, I kind of started ignoring the prompts to write what I thought was interesting and my grades went up. Always keep your weekends open and look ahead on the schedule - professor won't announce papers until Fridays and will make them due 4pm on Sundays. Syllabus is hard to find, but I think that might just be the fact that this class is held via zoom during covid (when I say hard to find, I mean it didn't exist for the first few weeks and only exists for about half the term, and then we pick a topic and do our own open-ended writing for the rest of the term. Prof uses \"democratic\" and \"experimental\" to describe the structure of the class and why the syllabus is mysteriously empty. Anything expected for class discussion - readings - is listed in a canvas calendar event and not in the syllabus, which is why you should always look ahead). As long as you read a bit, write a bit, and don't take anything he says too seriously, it's a pretty cool class. Again, very frustrating in the first few weeks trying to figure out the structure when there wasn't any. If you have a question, set up a meeting with him outside of class time and be super specific in your question - he's misunderstood my questions a few times and it will take a few tries before you get a really good answer. He tries so hard to help everyone in the class, and is probably overworked since he's helping so many grad students on their theses. I say it's a layup bc I can just block off my saturdays, write everything I need to for the week and read, and then it's just a matter of showing up to class and sharing a few words here and there. Huge adjustment, but he went from being my least favorite prof to one of my favorites once I figured out the expectations. One last thing - prof will also say some things that might be a little out of place. They're just (slightly passive-aggressive and not super well-worded) jokes, but all said with good intentions. Quotes include \"I need a shrink and you pay for it\" when discussing his frustrations over student citation practices, \"scholars don't 'believe'\" when telling students to cut fluff words like 'believe' out of papers, and \"next time take the computer to the shower with you\" to a student who lost track of time taking a shower and wound up a bit late to class. All of which I thought were condescending at the time, but after getting to talk with the prof and understand his intentions, I see the miscommunication there and know he means well\"",
            "review 2: \"21S with Klaus Milich: I don't think he's as bad as the first commenter but damn. This class has no shape. I have no idea what he expects out of our assignments.\"",
            "review 3: \"21S with Klaus Milich: This man is genuinely the worst professor in the world. The utter stupidity, confusion, and insanity. Nothing makes sense. Nothing is organized. He teaches nothing. He genuinely makes everything worse. You ask him a question about the essay, he gives three responses that contradict one another. He will belittle you in class. He will tell the class that \"I need a shrink and you need to pay for it.\" He will lie and change the assignment due dates and then complain how giving the fully promised time has ruined his schedule. He will tell you he hates teaching undergraduates. He will ruin your day and blame you for it. I have no idea why he is teaching since I would be a better professor. My younger sister in 9th grade would be better. He is what is wrong with Dartmouth education. At least he let us go into breakout rooms once a class because otherwise it would be intolerable. And I am handling the class comparatively well to some of my classmates.\"",
            "review 4: \"21S with Klaus Milich: The first comment is so harsh and unfair - Klaus is actually such a nice and accommodating man. Yes the class is slightly disorganised, but that's more because he likes letting the students decide what to work on. He definitely doesn't mean to belittle anyone in the class - \"I need a shrink ...\" was just meant as a funny response to our essays, and not negative at all. Maybe people haven't got great grades to begin with, but he's always totally happy to go over with students in order to help them get better and ALWAYS happy to give you the time to get better, which is what I thought college is all about ... Btw assignments aren't that unclear either - he more just lets students choose an area that they are interested in, and if you are ever confused, he's totally happy to answer any questions / confusion with no negativity.\"",
            "review 5: \"21S with Klaus Milich: First commenter is hyper sensitive and needs to grow up. The course itself is such a fair amount of work- only like one writing assignment every other week and a pretty low amount of reading. Milich is a pretty good teacher, and the (admittedly out of pocket) comments he's made were clearly meant to be jokes.\"",
            "review 6: \"21S with Klaus Milich: This class was definitely a layup. The professor's instructions were a little confusing in the beginning since he gives a lot of independence with writing assignments, and that is not something most people are used to as high school writing assignments come with a lot of guidelines. But once you realize that, you will actually really like this class. You can find your own literary texts, theories, and research papers to incorporate within your final paper. The professor was strict about things such as showing up to class on time and following instructions to a T but is a funny and understanding man at the end of the day.\""
        ]
    },
    "COLT057.11": {
        "Graziella Parati": []
    },
    "COLT066.02": {
        "Jessica Resvick": []
    },
    "COLT052.05": {
        "Carlos Cortez Minchillo": []
    },
    "COLT040.08": {
        "Samuel Carter": []
    },
    "COLT039.04": {
        "Jessica Resvick": [
            "review 1: \"21W with Jessica Resvick: This class was hella interesting, and Professor Resvick is a great teacher. The readings tended to be interesting, usually, but sometimes they were hard to get through due to some of them being extremely theory heavy. The class had no tests; instead the grades were made up of participation, discussion boards, a midterm group project, and a final ten-page research paper on a topic of our choosing. Professor Resvick tended to use breakout rooms every class period in order to get discussion rolling, and overall it is a very discussion-based class, so you have to do the readings in order to get full participation credit, but overall it was a pretty easy, simple class. I recommend it if you need a third layup class, just know that sometimes the readings could be sorta long (~40 pages of theory).\"",
            "review 2: \"21W with Jessica Resvick: Great way to get LIT distrib! Interesting and thought-provoking class. Met twice a week (Zoom) and X-hour was used only once, if at all. Almost entirely centered around discussion and there is a participation grade but simply being prepared and contributing thoughtfully twice per class is more than enough. Readings are pretty regular but some are replaced by movies (some foreign with subtitles), TV shows (Law+Order, HTGAWM), and podcasts. Resvick is very nice and engaging. Deadlines are important to her but there are very few in the class overall. Midterm gave you an option of a group podcast or an individual essay. Final was a longer essay. Best path to success on assignments is by meeting frequently with Resvick to run things by her before you go ahead with it. She will give tons of helpful feedback but you just need to have the initiative to ask.\""
        ]
    },
    "COLT007.18": {
        "Emily Kane": [
            "review 1: \"23W with Emily Kane: Easiest class I've ever taken. Talk in class and submit the like three total assignments on time. Super easy. Super boring. Go to class because she only gives assignments verbally and doesn't post them on Canvas anywhere. This class is super disorganized - you will submit assignments over email instead of on Canvas and pacing will quickly get off from the syllabus which is never updated. Definitely take this if you want a layup - don't take it if you want to be intellectually challenged or to learn about the subject matter. We basically just watched sci-fi and talked about random French philosophers.\"",
            "review 2: \"23W with Emily Kane: She is crazy disorganized, doesn't lead discussions, and is overall all over the place. But honestly besides that general annoyance-this was the easiest class I've ever taken.\""
        ]
    },
    "COLT052.07": {
        "Silvia Spitta": []
    },
    "COLT039.03": {
        "Nancy Canepa": []
    },
    "COLT019.02": {
        "Daniel Behar": []
    },
    "COLT052.06": {
        "Thomas Matusiak": []
    },
    "COLT007.17": {
        "Michael Mcgillen": [
            "review 1: \"22W with Michael Mcgillen: Professor McGillen is an amazing professor. His passion for the literature read throughout the course is highly evident from his commentary. The way that the readings are curated is also really interesting, allowing you to see the connections from one text to the next and appreciate them from a more informed vantage point. I would highly recommend the class to anyone who is interested in literary analysis and especially in modernist literature (Woolf, Joyce, Rilke etc.) The writing assignments are reasonable, with a weekly one page casual response paper on whatever is the reading that week, two papers (one close reading and one on literary form) and one final research paper which although longer is very open in terms of topic, so it is easy to find something that interests you to write about in length. The quality of the course and how enjoyable it is I think also depends on the nature of the discussion (the entire course is discussion based) but if effort is made by everyone to sustain an interesting discussion it can really be extremely interesting. Generally, if literary analysis is of interest to you, this class will be great!\"",
            "review 2: \"22W with Michael Mcgillen: Professor McGillen's feedback on papers is pretty fantastic, which is why I would recommend this course. I felt that my writing improved over the course. The readings were super euro-centric, though, and I think that a true representation of urban spaces in literature would be more diverse. The workload is reasonable and in line with other courses. I enjoyed most readings and enjoyed discussions as well. This class made me a better writer\""
        ],
        "Michael McGillen": []
    },
    "COLT070.05": {
        "Damiano Benvegnu": [
            "review 1: \"20W with Damiano Benvegnu: Take this class. We did readings and blogs (you only need to write a couple). A midterm group project, (easy) and a final that was either a project or a paper. The actual topics were very interesting and made me think about humans and nature differently. Benvegnu is awesome!\""
        ]
    },
    "COLT021.01": {
        "Monika Otter": []
    },
    "COLT010.22": {
        "Emily Kane": []
    },
    "COLT700": {
        "Antonio Gomez": [],
        "Jill Baron": [],
        "Yuliya Komska": []
    },
    "COLT049.07": {
        "David Laguardia": [
            "review 1: \"22S with David Laguardia: Interesting class. Class is mainly lecture but has some discussion as well. Class isn't exactly structured, and the conversation flows wherever it wants to. There were i think 3 essays on interesting topics, one of which being the final. We read maybe 4 full length novels and some shorter essays. We got to talk about living in the city in our individual lives which is pretty cool. Would recommend for anyone (I'm not a colt major and i liked it).\""
        ]
    },
    "COLT040.07": {
        "William Cheng": []
    },
    "COLT052.01": {
        "Silvia Spitta": []
    },
    "COLT035.04": {
        "Ellis Shookman": []
    },
    "COLT056.02": {
        "Matteo Gilebbi": []
    },
    "COLT052.04": {
        "Jessica Smolin": []
    },
    "COLT051.04": {
        "Hoda Barakat": []
    },
    "COLT010.21": {
        "Gerd Gemunden": []
    },
    "COLT007.09": {
        "Ayo Coly": [
            "review 1: \"22S with Ayo Coly: AMAZING! This professor's voice brought the classroom environment alive. I don't think anyone fell asleep........ not that we would. A manageable workload and a very respectful classroom environment with a diverse syllabus. She was always willing to help during office hours and really cares about her students. Overall --- I appreciated the way that a lot of the texts engaged with each other. It is a bit of reading, but she is really big on humane course loads and kept asking us if the reading was too much. Not a huge time commitment, but still challenged my method of discourse to make me a speaker for the 22nd Century. I DO NOT KNOW WHAT YOU ARE WAITING FOR ....... TAKE HER CLASS.\""
        ]
    },
    "COLT063.02": {
        "Lynn Patyk": []
    },
    "COLT053.04": {
        "Yasser Elhariry": []
    },
    "COLT031.02": {
        "Yasser Elhariry": []
    },
    "COLT010.20": {
        "Eman Morsi": []
    },
    "COLT064.04": {
        "Randall Balmer": [
            "review 1: \"19X with Randall Balmer: Really interesting class! You have to make sure you come to each lecture though since there are random pop quizzes. Essays are graded fairly and it's easy to get a good grade as long as you come to class.\""
        ]
    },
    "COLT040.06": {
        "Michael Chaney": []
    },
    "COLT179": {
        "Eric Miller": [],
        "Michael McGillen": [],
        "Monika Otter": [],
        "Tarek El-Ariss": [],
        "William Cheng": []
    },
    "COLT062.04": {
        "Andrew McCann": []
    },
    "COLT053.03": {
        "Tarek El-Ariss": []
    },
    "COLT007.16": {
        "Paul Carranza": [
            "review 1: \"20S with Paul Carranza: Prof. Carranza is pretty nice and always willing to help, but I won't recommend this class unless you really want to get relaxed throughout the whole term and not learning that much about writing. There are two epistolary fictions required to read; however, you only need to finish the first one to complete two major essays. Besides, Prof. Carranza NEVER POST LECTURE VIDEOS ON TIME. Sometimes he even changed the due date of assignments, since he could post lectures on time.\"",
            "review 2: \"20S with Paul Carranza: Prof Carranza seemed well intentioned but was disorganized and didn't really teach much. The class was somewhat interesting. He posted a few lectures throughout the whole term (maybe max 10 lectures). So the class consisted of mainly doing assigned readings and written work with limited feedback from Carranza.\""
        ]
    },
    "COLT053.02": {
        "Tarek El-Ariss": []
    },
    "COLT061.01": {
        "Kristin O'Rourke": []
    },
    "COLT040.05": {
        "Petra McGillen": []
    },
    "COLT057.09": {
        "Graziella Parati": [
            "review 1: \"21S with Graziella Parati: This class is incredible. I think mind-blowing is an understatement for Professor Parati's teaching; she is truly incredible and so cool, too. The actual class isn't difficult, and you grade your own Midterm which is such a relief, since it is such a long paper. You don't really have to do the readings, but honestly you should just becuase they are so interesting. This class is definitely a layup, but I still wouldn't take it unless youre interested in the topic.\""
        ]
    },
    "COLT049.06": {
        "Yuliya Komska": []
    },
    "COLT035.03": {
        "Eman Morsi": []
    },
    "COLT062.06": {
        "Noah Isenberg": []
    },
    "COLT065.03": {
        "Aimee Bahng": []
    },
    "COLT007.13": {
        "Paul Carranza": [
            "review 1: \"17S with Paul Carranza: Super easy class. Attendance matters and as long as you do enough of the readings for the papers you're good. Prof Carranza is a great, chill prof who's really understanding.\""
        ]
    },
    "COLT049.05": {
        "Andrew Mccann": [
            "review 1: \"22F with Andrew Mccann: Great senior seminar. The texts were really interesting and the content was cool. Lectures were well-done and thoughtful. Would recommend, but also would definitely recommend having prior knowledge of some major ideas related to fin de siecle/decadent literature\""
        ],
        "Andrew McCann": []
    },
    "COLT007.15": {
        "Jessica Smolin": [
            "review 1: \"17W with Jessica Smolin: She is AWFUL. Do not take a class with Jessica Smolin. I took this class for my LIT distrib, but boy was it misery. Everybody hated the class. Before each class we had to write a paragraph response, and also 4 essays. She is A TERRIBLE teacher. I generally enjoy writing, but I'd go into office hours and she would offer absolutely no helpful advice. You'd ask for advice shaping yoru argument, and she'd be like, \"Go read the text more carefully.\" or like \"You need to read the text for deeper meaning.\" She was never ever helpful. I have a lot of friends in the class and everybody felt the same way. She doesn't know how to teach writing, and the essays were graded SO harshly. She was also passive aggressive in class. The readings were incredibly boring; nobody even cared and we had to do all this bullshit discussion about readings nobody cared about. One class she had us watch videos of a naked production of the bacchae. like, complete, full on, frontal male nudity. She would show us long videos of brazilian stuff and not bother to translate it, so everybody in the class who couldn't speak Portuguese was like ????\""
        ]
    },
    "COLT049.04": {
        "Klaus Mladek": []
    },
    "COLT064.01": {
        "Irene Kacandes": [
            "review 1: \"20F with Irene Kacandes: This class is loosely a \"layup\", which I define not as being no work, but that if you do the work, you are guaranteed a pretty solid grade. Do the readings and the student input on time, write decently good papers, and you should wind up with a good grade. In terms of the class content itself, I found it to be really interesting, though the conversations could drag on a bit sometimes over Zoom. Professor Kacandes is a great person who really works to destress you about grading and make the class more about the content than grades. Really enjoyed this class and I think it's a solid selection for anyone with interest in the topic. Didn't take it for the German so I can't comment too much on that, but I think German section met once a week or so to talk in German and had a couple extra activities.\"",
            "review 2: \"19S with Irene Kacandes: Great class and amazing prof. Highly recommend! Was meant to be a small group of kids but evolved to a 50+ class. the readings were a good length. readings were interesting. prof is so intelligent and i would take this class again if i could. :)\""
        ]
    },
    "COLT062.03": {
        "Emily Kane": [
            "review 1: \"22F with Emily Kane: Horrible prof. Super, super disorganized, and grades are based on very arbitrary things. However, she is a very sweet person and it is an easy class.\"",
            "review 2: \"18F with Emily Kane: Professor Kane is wonderful woman who is clearly knowledgable about the subject. However, she's very specific when grading. I struggled with the class because I didn't adhere to her way of thinking, so be sure to think as she would!\""
        ]
    },
    "COLT057.05": {
        "Gerd Gemunden": [],
        "Silvia Spitta": []
    },
    "COLT052.02": {
        "Thamyris Almeida": [
            "review 1: \"22F with Thamyris Almeida: It was an okay class. I took it for the INT distrib thinking it would be a layup for sure. The beginning of the class is not super demanding, but then things start to pick up as you near the start of the final project. Lots of readings that needed to be done before each class (skimming is just fine, but still lots of dense historical information) to discuss. The material itself was interesting, not all the films were entertaining, but we watched them in class once a week. The workload was: Weekly discussion post based on films/readings for that week, 2 short papers double spaced (3-4 pages each), 2-3 single-spaced final project outline, final 10-page paper OR creative project along with a fleshed out outline. The prof was nice and always available for questions, but tough grader. Her lectures were not always the most engaging, it felt more like she was throwing information at us to then make us discuss it right away. It was not the worst thing in the world during a four-course term, but probably would have been better had it been a third course.\""
        ],
        "Gerd Gemunden": [],
        "Silvia Spitta": []
    },
    "COLT039.02": {
        "Nancy Canepa": [
            "review 1: \"17F with Nancy Canepa: I loved this class. We got to read so many different versions of fairy tales. It was so much fun. There were a lot of readings at times, but they usually weren't tough reads. You mostly read fairy tales and on occasion scholarly articles on fairy tales. The essays were very manageable. Professor Canepa gives everyone the option to rewrite or edit their papers once she hands back the grades as an opportunity to increase your grade. We had a final group project that consisted of two parts: research and creativity. You could either do a group presentation on a research topic and individually write your own fairy tale or do the group creative project and write a research paper on your own.\""
        ]
    },
    "COLT010.07": {
        "David Laguardia": [
            "review 1: \"17F with David Laguardia: David is an awesome guy. He's super cool, legitimately a good person, and pushes you to think harder. I loved our discussions. Honestly, it barely felt like we were even going to class. The vibes were so chill and open, that it seemed more like an intellectual discussion among friends. 40% of this class is participation. The rest is essays.\"",
            "review 2: \"17F with David Laguardia: David is a really lenient grader and professor. There were 4 major 1,200 essays due throughout the term and the final paper was a 2,000 word essay. David's class exposed me to a lot of critical theory and philosophers that I intend on learning more about, and the workload was minimal. The class is discussion-based, and as long as you minimally contribute, you're guaranteed an A.\""
        ]
    },
    "COLT010.01": {
        "John Kopper": []
    },
    "COLT064.03": {
        "Roberta Stewart": []
    },
    "COLT051.03": {
        "Ayo Coly": []
    },
    "COLT042.01": {
        "Graziella Parati": [
            "review 1: \"19W with Graziella Parati: Idk what the other reviewers were saying but the class grading was super easy, with medians on every quiz being above 90. If you've lost more than like 5 points on these four quizes, you should consider dropping out of Dartmouth. Class had some interesting lectures and discussions. Worth taking for a LIT distrib and an easy A.\"",
            "review 2: \"19W with Graziella Parati: Layup - but potentially the worst course I have ever taken at Dartmouth. The grading was as follows: 4 pop quizzes, worth 20% each, and attendance, also worth 20%. The quizzes are a joke. The grading on the quizzes, however, is not a joke. Graziella swears she is \"the easiest grader on the planet,\" but given that each quiz is only four questions if you write literally one thing that she or the TA views as anything but the perfectly right answer, you get dinged anywhere from 15-25% on the entire quiz grade. Aside from the grading scheme, this class is extremely boring. Of the 230 people in the class, probably about 80 showed up each day. Also, definitely the most people I have ever seen cheating in a class.\"",
            "review 3: \"19W with Graziella Parati: Definitely a layup but undoubtedly the worst course I have ever taken at Dartmouth. Not only were lectures monotone and boring the grading was close to ludicrous. How 4 pop quizzes, each made up of 4 questions, taking a total of 15 minutes, is representative of an entire course is insane. Not only was the method of examining the course a joke, the grading of the quizzes was extremely inconsistent. The difference between you getting a 60 and a 100 could be a single word that deviates from what the TA or professor Parati considers to be the perfectly correct answer. Additionally, the questions were often definitions or single word answers, concepts where the answer is generally right to wrong. Yet, people come out with an 85 with 3/4 questions correct with absolutely no explanation of how or where any kind of partial credit is coming from with feedback limited to \"No.\" or \"Wrong.\"\"",
            "review 4: \"19W with Graziella Parati: Really easy class - makes ur term soooo much lighter. Quizzes weren't bad if you paid attention - all you have to do to get an A is just pay attention during class, which is only three hours a week. Really confuses me how people could complain about this class\"",
            "review 5: \"19W with Graziella Parati: this class was definitely a layup but super super arbitrary. I'd really only take it as a fourth class. Also the grading was just so irrelevant and was based on no standardised criteria with a bunch of different TAs grading the 4 quizzes. The material itself was also not interesting enough for me to recommend the class. If you really need the easy A though, I'd say take it. Just be prepared bc the grading can be frustrating sometimes bc you feel like you have no control over it.\"",
            "review 6: \"19S with Graziella Parati: Huge layup. Grading was based on 4 pop quizzes and attendance, each being worth 20% of final grade. Quizzes had 2-4 questions and took about 15 minutes each, if even that long. The quizzes had basically nothing from the daily readings on them, so it wasn't at all necessary to do any homework for this class. The quizzes were very easy and if you payed attention in class and took good notes it was usually extremely obvious what would be on the quiz. Parati was very clear with what she thought were the highlights during her lectures. Two of the four quizzes had the low score as 100%. Definitely not a super engaging class but incredibly easy.\"",
            "review 7: \"17W with Graziella Parati: The course was taught by both Parati and Vinken and may be the chillest course ever taught at Dartmouth. Grading was 40% midterm, 40% final, 20% participation. In a 140 person class, saying one or two things throughout the term guaranteed a 100% for participation, and I'm pretty sure even if you were silent you got an A anyway. There were readings assigned every day to foster class discussion, but no quizzes or anything. The midterm was crazy easy (no one took more than 20 minutes) and there was an option to replace the final with a creative project-- Anything at all, so long as you were inspired by a discussion in class, a reading for the class, or a reading done outside of class. Each class was a lecture about something sort of neat, sometimes related to the reading and sometimes not.\""
        ],
        "Barbara Vinken": []
    },
    "COLT035.01": {
        "Hussein Kadhim": []
    },
    "COLT030.01": {
        "Monika Otter": []
    },
    "COLT062.02": {
        "Gerd Gemunden": []
    },
    "COLT049.02": {
        "Israel Reyes": []
    },
    "COLT057.08": {
        "Annabel Martin": []
    },
    "COLT018.02": {
        "Kirstyn Leuner": []
    },
    "COLT018.01": {
        "Kirstyn Leuner": []
    },
    "COLT010.16": {
        "Michael Mcgillen": [
            "review 1: \"20F with Michael Mcgillen: Great class, interesting discussions if the class has engaged students. There's a reading assignment for each class, ranging from probably 20-100 pages max. The only assignments are a small led discussion project, a midterm, and a final paper (and participation). Lots of great readings though they do get a bit repetitive in their subject matter, but it is a pretty specific literature course.\"",
            "review 2: \"20F with Michael Mcgillen: If you're into European literature from 20th century, you'll probably enjoy this course. I personally found a lot of the readings boring and very repetative, and discovered that I'm not really a fan of this type of literature, but then again, that's just my personal taste. As for the assignments, there's only 2 major assignments: a 4-page midterm paper worth 30% of the grade and a 8-page final paper worth 50% of the grade. Professor McGillen knows a lot about the subject but can be a little dry in class and feedbacks generally, an aspect I didn't really appreciate it in class. Overall, if you're into that kind of literary work, you'll probably enjoy this class.\""
        ],
        "Michael McGillen": []
    },
    "COLT007.14": {
        "William Phillips": []
    },
    "COLT064.02": {
        "Alan Lelchuk": [],
        "Dennis Washburn": []
    },
    "COLT007.04": {
        "Joseph Aguado": []
    },
    "COLT057.02": {
        "Graziella Parati": []
    },
    "COLT105": {
        "Silvia Spitta": [
            "review 1: \"22W with Silvia Spitta: This class sucked. It was no work at all but we also learned nothing. The class was incredibly unorganized and I still do not know what she wants to grade. So useless.\""
        ],
        "Antonio Gomez": [],
        "Gerd Gemunden": [],
        "Irene Kacandes": [],
        "Yuliya Komska": []
    },
    "COLT103": {
        "George Edmondson": [],
        "Gerd Gemunden": [],
        "Irene Kacandes": [],
        "Klaus Mladek": []
    },
    "COLT102": {
        "Silvia Spitta": [
            "review 1: \"21F with Silvia Spitta: So, ultimately, it depends on your advisor, how intense the course is. Silvia did not interfere and not really care about how much you interacted with your advisor. So basically, my term was very chill because my advisor and I decided to do the bulk of work during Winterim.\""
        ],
        "Antonio Gomez": [],
        "Irene Kacandes": [],
        "James Dorsey": [],
        "Yuliya Komska": []
    },
    "COLT101": {
        "Antonio Gomez": [],
        "Irene Kacandes": [],
        "James Dorsey": [],
        "Veronika Fuechtner": []
    },
    "COLT100": {
        "Veronika Fuechtner": [
            "review 1: \"21F with Veronika Fuechtner: I am not the biggest theory fan. However, thus class is so useful for every other class/project/whatever. Fuechtner's approach was very discussion based. Not knowing much about theory beforehand made it harder to contribute. However, she is very supportive, also outside of class. For example, regarding PhD applications and she grades surprisingly well (I did so not deserve the HP I got)\""
        ],
        "George Edmondson": [],
        "James Dobson": [],
        "Klaus Mladek": [],
        "Tarek El-Ariss": []
    },
    "COLT087": {
        "Dennis Washburn": [],
        "Gerd Gemunden": [],
        "Lawrence Kritzman": []
    },
    "COLT085": {
        "Dennis Washburn": [],
        "Gerd Gemunden": [],
        "Lawrence Kritzman": [],
        "Michael McGillen": []
    },
    "COLT079": {
        "Dennis Washburn": [],
        "Gerd Gemunden": [],
        "Graziella Parati": [],
        "Lawrence Kritzman": []
    },
    "COLT072.01": {
        "Dennis Washburn": [
            "review 1: \"21F with Dennis Washburn: I know that this course has been changed somewhat over time, so I can't be completely sure that it will be the same over time, but I really liked this class! I had absolutely zero experience in any literature classes at Dartmouth, so it wasn't exactly *easy*, but Prof. Washburn was a really good professor and the classes were always interesting. Our class was very small (6 people), so I really got to know everyone throughout the term and discussions went well. There was a lot of reading for each class (definitely set aside several hours), but we talked about each of them in class so they were definitely relevant. There were lots of opportunities to use examples from your own knowledge, even if (like me) that was mostly based on TV shows and movies because I hadn't read a real book since high school. (A slight exaggeration, but still. Although that definitely did make the class a bit harder for me.) The workload was readings and discussion posts before every class (graded P/F), a two page informal essay every week (also graded P/F, generally), two classes where you were the discussion leader (preparing discussion questions for the class on the readings), and a final paper with a very flexible range of topics, 15-18 pages. Overall I recommend the class!\""
        ],
        "Ayo Coly": [],
        "David Laguardia": [],
        "Michelle Warren": [],
        "Rebecca Biron": []
    },
    "COLT072": {
        "John Kopper": [
            "review 1: \"04F with John Kopper: This course's material was very difficult. Most of the class I spent trying to wrap my mind around vague words that theorists tend to use in different capacities, such as \"form\" \"system\" \"language\" etc. It was nice to have a professor like Kopper who you can completely trust understands the material because the man's a genius. The only time that becomes problematic is when he starts speaking as if he is writing an academic paper, which doesn't always clarify a concept. However, he is extremely responsive to students if you ask him to re-explain, and he makes himself very available. I had to take this course as a major requirement and am glad I could do it with Kopper.\"",
            "review 2: \"04F with John Kopper: yet, if you are truly interested in literary theory, this class will give you all you want. the readings come directly from the sources--and the best, most seminal sources as well--you don't read about Derrida, you read Derrida. However, i really can't imagine properly teaching this course any other way. Professor Kopper obviously knows his stuff. He's a great prof, a somewhat generous grader, and a very cool guy. But it was the other students in the class that made it such a rewarding experience. Everyone attending did the reading, came prepared, and was just flat out brilliant. They asked good questions and gave good presentations. This class is necessary if you plan on making any use of literary theory in papers, in your life, or in your career. it will get you started reading the real authors and will truly inspire you to learn more about them and their ideas. it was a great class and i am very glad i took it.\"",
            "review 3: \"04F with John Kopper: Without a doubt, comp lit 72 was the hardest course I've taken at Dartmouth, but that was my fault. It becomes whatever you make of it--if you want a challenge, there's plenty of opportunity. Class members were almost all very strong, experienced. I was very rarely bored.\"",
            "review 4: \"03F with John Kopper: Don't take this course unless you are an English or Comparative Literature major (in which case you're required to take this class). The reading material is among the hardest I've ever read, because literary theorists have highly abstract ideas and also don't know how to write clearly or effectively. A lot of the readings come across as 20 or 30 page mental masturbations, but also constitute the fundamental works of literary theory. Prof. Kopper is friendly and doesn't put anybody on the spot, which put people at ease with such difficult material. He explains things better than the theorists, but you still have to do the readings. Course work is more than reasonable: three 1-page journals about various readings, two 4-6 page papers, one group presentation, one 10 page paper.\"",
            "review 5: \"03F with John Kopper: Despite the confusingly inapplicable title, this course was fascinating and informative. For those students who have already taken English 15 (Into. to Theory) and are interested in a faster-paced, heavier-hitting course, this one is for you. If you have never before approached theory, however, and have not had much experience with either the English or Comp. Lit departments, leave it be for a few terms. The readings (at least with Professor Kopper) are extensive, difficult, and many in number. You will not have enough time to read all of them, and you won't feel as though they were adequately covered in class (2 hours just aren't enough). The silver linings, however, are that Professor Kopper is infinitely understanding and infinitely available. He made an obvious effort to be around for students who chose to seek him out, and was truly sympathetic and helpful to those who felt daunted by the material. Take this class -- you'll be surprised by how much you learn, and you'll walk away with an incredible arsenal of theory (semi-solidly) under your belt.\""
        ],
        "David P.": [
            "review 1: \"07F with David P.: if you are a comp lit major, this course is pretty much exactly what you're expecting.\"",
            "review 2: \"07F with David P.: the course material is really interesting and fundamental for anyone looking to analyze literature. getting an a without doing readings is easy, but discussions often degenerate and lack much connection to the topics themselves. despite this, though, prof laguardia is really approachable, intelligent, and flexible.\"",
            "review 3: \"07F with David P.: the class covered so much material which was to be expected considering the topic and all the course description. we basically had readings about many different sorts of literary theory and then talked about them generally and in terms of the book lolita. all the writing assignments were applying theories to nabokov's lolita. it felt sort of weird to be writing every single paper for the class on lolita but good practice for thinking critically. the class was a mixture of undergrads and MA comp lit students which could be intimidating at times. many times class was sort of fun because we'd have discussions and prof. laguardia incorporated a lot of youtube videos into the discussions, but some of the theory stuff could also be tough going. also it's a 10A which made for really long classes. overall, not so bad as it sounds from the title.\""
        ],
        "Agnes I.": [
            "review 1: \"02S with Agnes I.: This class can be very intimidating. the reading takes forever and then you have to write up main concepts for everything so there's no skipping out on anything. grading is quite difficult, but it forces you to understand all the material. you will know literary theory by the end of the course, but you might be exhausted from doing it. this class is good for learning, though you've got to be tough to get through the class.\"",
            "review 2: \"02S with Agnes I.: I do not like literary theory, but this course was the best that can be done with it. Lugo-Ortiz is a fabulous professor, and she does love theory. She tries to make you love theory, which was futile in my case, but at least she is passionate about it. If she ever teaches 72 again, I would take it with her. It is a rigorous course and is highly abstract, but she does well with it.\""
        ],
        "Ayo Coly": [],
        "Rebecca Biron": []
    },
    "COLT070.03": {
        "Lawrence Kritzman": []
    },
    "COLT067.06": {
        "Margaret Williamson": []
    },
    "COLT066.01": {
        "Lawrence Kritzman": []
    },
    "COLT064": {
        "Carol B.": [
            "review 1: \"07F with Carol B.: This course was eye-opening. I had no idea the extent to which my \"American-ness\" had biased my view of the Arab-Israeli conflict. Coming away from this term, I have so much more knowledge of the conflict and of the tensions in the Middle East as a whole. I'm so glad to have this as part of my liberal arts education.\"",
            "review 2: \"07F with Carol B.: This class was a very valuable experience. Prof Bardenstein did a good job about showing multiple perspectives on the issue. The reading selection was thought provoking and the assignments were manageable.\"",
            "review 3: \"07F with Carol B.: Prof Bardenstein is one of the better professors I've had at Dartmouth. It's too bad she's only visiting, although she will be here for the rest of the year (she'd be a great addition to the AMELL dept...). She handled a contentious and difficult issue very well, and managed discussionsamong students from many backgrounds (academic and otherwise)skillfully. The class itself is extrememly interesting. I had a very 'casual' understanding of the Palestinian/Israeli conflict, and I think that this class is an excellent introduction to it through literature and films by members of the various parties involved. There is a good, organized mix of books, short stories, documentaries, and movies throughout the course. Highly recommended if it ever is offered again.\""
        ],
        "Irene Kacandes": [
            "review 1: \"08W with Irene Kacandes: The material was tough to get through at times (because of the emotional and sometimes graphic content) but very interesting, and lectures added to the reading we were doing. Discussions weren't always the greatest and often seemed a little forced, but I thought overall the class was great and the grading fair. I'd heard Kacandes was tough, but in my experience she was very helpful and available outside of class.\"",
            "review 2: \"08W with Irene Kacandes: The professors were intense. Professor Kacandes, more than Professor Quack, had a tight grip on the direction of the discussion. I suppose there were some good things to come out of such control, such as the fact that I was able to gain at least one strong view on the topic of the course rather than having multiple scrambled views on it, which would have been the case if she let more people speak. That said, I was sometimes scared to raise my hand in class. Grading was pretty easy, I'd have to say, unless she liked me a lot and hated everyone else, but I doubt that's the case. The midterm and the final were not that bad. Just read your stuff, and you should be fine. Overall, this course taught me a lot.\"",
            "review 3: \"04W with Irene Kacandes: The material is of course really hard, and it is a hard subject, but I think it was well-handled and the discussions were really good. I liked prof. kacandes and spitzer. They were good and the readings were really interesting. It was worth it, and the format of the class is good. I liked that our only grades were on journal entries, participation and one group project.\""
        ],
        "Alina Sokol": [
            "review 1: \"07S with Alina Sokol: This was a great course. Sokol is always available, and very helpful in meetings. The themes that came up in the course were not definitively resolved, but that was the point. The one drawback was specific to this term because there were only 5 people in the class. Would have been better with more, but the class remained interesting despite it.\"",
            "review 2: \"07S with Alina Sokol: The class discussions were very interesting, and it was very easy to share opinions. Professor Sokol also tried to choose readings that she thought we would like, and most of the time she chose really well. The only downer for me was that she is an incredibly frustrating grader on papers, so I would suggest discussing a paper at least once with her before handing it in.\""
        ],
        "Graziella Parati": [
            "review 1: \"02W with Graziella Parati: the class really is interesting if you've never studied italian americans. the prof also chose several movies that were fun, intersting and supplemented the material well (the godfather, sopranos). you grade yourself though, which is kind of weird. the problem i could see, was sometimes the prof's \"feminist\" views took a too strong prevalence in the course where it definately was not appropriate.\"",
            "review 2: \"02W with Graziella Parati: Italian Americans was a superb class. If you're looking to learn more about a particular heritage, this is a great class to take.\""
        ]
    },
    "COLT063": {
        "Graziella Parati": [
            "review 1: \"07S with Graziella Parati: This is a great class if you want to explore some topics in this subject. I needed to take it for the Italian minor, not for Comp Lit. If this is the case for you, the only Italian is a weekly hour-long discussion that was pretty irregular. Parati lets you grade most of your papers yourself and then justify your grade. She is a nice lady and very interested in the material. It's a bit all over the place, from Futurism to film to history and politics. Overall it's an interesting mix. Take it if you need it, or if you want an easy course, or just want to try something a little different.\"",
            "review 2: \"03X with Graziella Parati: We didn't read all that much for this class. It seemed like we mostly watched Fascist movies from the 1920s and 30s; lectures were almost entirely about history, and had nothing to do with literature. We did read one or two novels, but didn't spend much time on them. Prof. Parati is funny and interesting, but the class was packed with people and pretty quiet. It was also in the 2 slot, which is a terrible time in the summer, when it's hot. I always felt sleepy and cramped in that class. The work consists of one 5-7 page paper about a book we don't actually read in class. It was hard to write, because the book was mostly an analysis of other historical analyses. Parati expects us to grade ourselves, which was strange. Then we also had to write a longer research paper (10 pages) and also give a presentation about our research. All in all, easy class, if a bit boring.\"",
            "review 3: \"03X with Graziella Parati: Fascism in Lit and film was a wonderful class. It's really interesting. All of the readings and movies are interesting, and Graziella Parati is a GREAT professor. She is super enthusiastic! Take this class!\"",
            "review 4: \"03X with Graziella Parati: This was an interesting class, but not at all what I expected after reading the description in the ORC. It was pretty much a history class, and there was an emphasis on the female experience under fascism, which wasn't mentioned at all in the course description. However, Parati is an enthusiastic and responsive prof, and I would definitely recommend taking a class with her. She also lets you grade yourself (to a certain extent. . .) which is a nice change from the normal routine.\""
        ]
    },
    "COLT062": {
        "Annabel Martin": [
            "review 1: \"07S with Annabel Martin: So heres the deal - this class is extraordinarily easy. Aside from finding the time to watch 2 movies per week outside of class, theres very little work required. In class discussion is good at times, but at points can be completely ridiculous. If you do not agree or pretend to agree with her ultra, ultra liberal, marxist and feminist points of view, you will do poorly. This can be faked pretty easily though, hence giving you an excellent grade. Professor Martin is a genuinely nice woman, but often gives off an aura of being a little bit too adamantly opposed to viewpoints that contradict her own.\"",
            "review 2: \"07S with Annabel Martin: Well, for starters, the TITLE and DESCRIPTION are quite possibly the most inaccurate I've encountered yet at Dartmouth. This class should be entitled \"A Postmodern Perspective on Gender Roles in our 20th Century World.\" Like, seriously. Change the description to that. This class had little to do with the city, and when I tried to steer the discussions and my own written reactions back to a city-centric theme, I was often dismissed as being off-topic. The teacher was extremely biased against males, I found, with an exception being made for homosexuals. I'm not being prejudiced here, it's just plain true. While it's okay to be a feminist, it's not okay to call out those who don't share her beliefs in class and ridicule them, as she did on multiple occasions. Just...don't take this class. If you're in a fraternity, Martin won't even take you seriously. And unless you're a bra-burning feminist crusader who doesn't shave her pits, you're in for a term of frustration and boredom. Oh, also! Postmodernism is complete nonsense. It's speculation about nothing, attempts to draw conclusions out of thin air about things that don't really exist. I hate to say that some people pursue a line of work that is completely meaningless...but some people pursue a line of work that is completely meaningless.\"",
            "review 3: \"07S with Annabel Martin: Martin is awesome- so cool and really wants to get to know her students. There was a lot of work for this class- 1 blogs per week, two movies plus readings. You really have to watch the films and do one reading. Lot of group projects- and that really makes up a lot of your grade. But the group projects were all great and Martin really likes creativity. Take this if you want an A and don't mind putting in time to watch old films\"",
            "review 4: \"07S with Annabel Martin: the class seemed to be an intense discussion of the city as it pertains to humanity, gender, and socio-economic strata. the films were all relevant, but the readings that we got were really dense philosophy that tied into the films but not in to the idea of the \"city\". everything was really contrived, and it was the kind of class where you think you're going to fail every paper because everything is so random, and then are pleasantly surprised to see that you aced the paper. the fact that it was 3 hours was pretty bad too. i never thought i would complain about a final project being too easy, but the original assignment was a 20 page paper or a short film, which then got permuted so many times that everyone did slideshows of photographs with little to no text whatsoever- and everyone still got A's. easy class, if you can live through it.\"",
            "review 5: \"07S with Annabel Martin: This class is really not at all like other classes in the film dept. It was a very heavily theory-based study of issues in the films (lit. classes) and almost none of the readings were explicitly related to any of the weekly films (2-3 films, 70+ pages of reading per week) and very few of the readings were related to film theory. Nevertheless, I enjoyed the readings--I would recommend it to anyone who is interested in exposure to cultural theory. Prof. Martin is an interesting prof. in lecture, but class discussions became increasingly banal in the second half of the class. I really wish Prof. Martin had devoted more class time to just lecturing on and clarifying the theory readings. Each week a different student group presented on the week's readings and films--this was a pointless nuisance, both in preparing the materials for your own group's presentation and in sitting through other groups' presentations. Easy, but can be challenging and quite interesting depending on how much of the assigned work you finish and how much effort you put into writing your weekly blog entries.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"04F with Ulrike Rainer: This was the best class, I had it Freshman fall. Incredible class, I will definitly recommended.\"",
            "review 2: \"04F with Ulrike Rainer: The course was good. It provided a comprehensive view of Bergman's work. The reading was also good because it helped give additional depth to the films seen in class and it showed Bergman's background and many influences. Classes were sometimes tiresome because I had the feeling that the teacher wanted to teach us something but resolved to have us reach a specific conclusion by asking us questions. Even though it is a discussion class there seemed to be too much discussion at times. Still, I am glad I chose this class.\"",
            "review 3: \"04F with Ulrike Rainer: Professor Rainer is a great prof! She's really enthusiastic and interested in the topic. She also makes herself very available during office hours.\"",
            "review 4: \"04F with Ulrike Rainer: Bergman=amazing genius Prof Rainer= awesome prof Therefore, this course was awesome. Discussion was sometimes a little boring, but always interesting. Awesome course\"",
            "review 5: \"04F with Ulrike Rainer: This class introduces you to the work of Ingmar Bergman and provides you with an interesting perspective on film-making. I had no experience with film and thought this was a great experience. I learned a lot and found the readings to be particularly helpful and well chosen. This is a fun and very interesting class.\""
        ],
        "Amy Lawrence": [
            "review 1: \"05F with Amy Lawrence: Great class and great professor. You watch interesting films but sometimes read boring poetry. Overall the class is great\"",
            "review 2: \"05F with Amy Lawrence: It would be helpful to understand french in this class, the translations of french poems we read seemed OK but I felt like I missed a lot. Also, the grading seemed a bit capricious. Usually I can tell when a paper I wrote is \"good\" or \"bad,\" but in this class I was basically suprised every time I got my grade. Overall it's an OK class, though. It definitely doesn't take up too much of your time, although the 2A timeslot is a killer... especially when the lights go out and the movies go on.\"",
            "review 3: \"05F with Amy Lawrence: This is a fairly interesting course that would have been much better as a one hour lecture instead of two hours. Prof. Lawrence is a good professor and good lecture, but keeping you interested in avant garde art for two hours with no break twice a week is more than could be expected from any prof.\"",
            "review 4: \"02X with Amy Lawrence: Class is good. Lawrence does a good job presenting a random selection of material. papers aren't too tough because they are short.\""
        ],
        "Dennis Washburn": [
            "review 1: \"04W with Dennis Washburn: This class was excellent. Prof. Washburn's part-lecture, part-discussion teaching style works extremely well with attentive students--the opportunities to contribute kept me interested and involved. Professor Washburn is also an excellent lecturer; he is extremely knowledgeable and thorough, yet does not take himself too seriously. The class covered an eclectic mix of texts from postwar Japan, ranging from films by Ozu and Kurosawa to short stories by MIshima and Oe Kenzaburo. The selection of wisely-chosen books was much appreciated, and the occasional readings from non-Japanese authors (Camus, Primo Levi) was a nice touch to facilitate more cross-cultural discussion.\""
        ],
        "William Phillips": [
            "review 1: \"05X with William Phillips: This class is super-laid back and non-stressful, much to the credit to Bill Phillips. He inconveniences himself to accept papers late and make quizzes and assignments due whenever is best for the most people in the class. The class doesn't seem to really have a point; Phillips doesn't go over any technical stuff on adaptation at all. You write a short screenplay and a 6-8 page paper, both of which, you can really write whatever you want to write. The two quizzes are ridiculously random, but supposedly, count for very little of the final grade? Everyone has to give a presentation, but that's also really laid back. the books and movies are a good selection, at least one is sure to please everybody. The titles are THe English Patient Lolita Rashomon and The Tin Drum The Tin Drum is a hoss, but the others are of reasonable length, and you have plenty of time for all of them. Overall, a really awesome summer class. Phillips is a really nice, caring prof, so if you're looking for a laid back, light workload-class, take this one.\""
        ]
    },
    "COLT061": {
        "Richard": [
            "review 1: \"07W with Richard: Best class at Dartmouth.\""
        ]
    },
    "COLT060.01": {
        "John Kopper": [],
        "Monika Otter": []
    },
    "COLT060": {
        "Steven P.": [
            "review 1: \"01F with Steven P.: Even if you only have an ounce appreciation for culture, this course is for you.\""
        ]
    },
    "COLT057.07": {
        "Joseph Aguado": [
            "review 1: \"22W with Joseph Aguado: This was my first class in the COLT department and it will be my last. This class was pretty poorly organized. Some of the assignments and presentations seemed like they were assigned for no reason. If you don't have a solid background in European history you will be lost and confused and Aguado refuses to address any facets of history: this class will only focus on the literature and not the context surrounding it. The workload is pretty standard. A lot of reading/time spent watching 2-hour films but there were only two exams and two papers, none of which were too bad. Take this class if you need the distribs but otherwise it was a waste of time.\""
        ]
    },
    "COLT056.01": {
        "Yuliya Komska": []
    },
    "COLT055.02": {
        "Jung Ja Choi": []
    },
    "COLT055": {
        "Dennis Washburn": [
            "review 1: \"06F with Dennis Washburn: Overall, this was an excellent course!! ALthough you have to read the Tale of Genji which is 1300 pages, the novel is so compelling that its lenght is irrelevant once you understand the genius of Shikibu! The other reading revolve around Genji and they are also as interesting! I higly recommend professor Washburn to anyone!!\"",
            "review 2: \"02F with Dennis Washburn: Other than the big load of reading, this class was fairly easy. We just had two 5-6 page papers, and a final 10-12 page paper. Professor Washburn is a good lecturer and usually pretty fun to listen to. I thought the material was fairly interesting as well, much different from anything else I'd ever learned. If you need an NW or LIT , I'd recommend this course.\"",
            "review 3: \"02F with Dennis Washburn: The class is interesting and Dennis Washburn is a very engaging prof although very into academia. Missing class/late papers for sports, job interviews, trips, etc is frowned upon by the prof.\"",
            "review 4: \"02F with Dennis Washburn: Professor Dennis Washburn is a brilliant professor. That is all.\""
        ]
    },
    "COLT054": {
        "Carol B.": [
            "review 1: \"07F with Carol B.: The class was interesting, especially given it was a subject I had no knowledge of: Israel-Palestine politics, culture, and literature. We read a book a week, which, along with the various readings, was definitely a good load of work. But most of it was interesting, and ranged from food to rap music culture of the Middle East.\"",
            "review 2: \"07F with Carol B.: I very much enjoyed this course. Each week we read one memoir and met to discuss it. Sometimes we prepared presentations in group on specific questions. Other than that, there was only a paper at the end. I thought the selection of memoirs very rich, and Prof. Bardenstein has a vast knowledge of the subject, both on the cultural level as well as that of literary theory. She brought a great deal to the reading of the books. Several documentaries and some Israeli and Palestinian hip-hop were incorporated into the course.\"",
            "review 3: \"07F with Carol B.: This course made me hate Jews. If you give a damn about Israel you might like it.\""
        ]
    },
    "COLT053.01": {
        "Hussein Kadhim": [
            "review 1: \"22S with Hussein Kadhim: The famous Arabian Nights professor. So surely, this class would be the layups of layups, right... ? Yeah, no. Not really. To be fair, this class apparently was easy in prior terms, but it seems that the college has cracked down. There are two things that make this class a nightmare. First, there are now four 3-4 page response papers (10% each) that you have to do, which weren't present in prior terms of this course. The mere presence of that work is annoying, but what really makes it shit is the second problem: Kadhim no longer grades any of the work himself. He has outsourced the work to bitchy grad school TAs (yeah go fuck yourself AC '21) who love nothing more but to arbitrarily take off points whenever they can. As such, you essentially have to write full-fledged literary analyses of the books, which in turn, requires you to actually read the books in critical detail. Kadhim himself is also the most boring lecturer I've ever had---his slow, slurred speech makes you want to fall asleep. His lectures are essentially just plot summary of the books, which doesn't give you deep enough details to write the literary analyses the TAs want. And, if you try to contribute to the class, he will often make fun of you for not \"speaking loud enough\" (I think Kadhim has hearing problems? Well, that should be his problem, not the students'.) Oh, and attendance is mandatory and 20% of your grade, so you have to come to class. The final 15 page paper (40%) is the most excruciating paper I've ever written. The only positive things I'll say about this course is that there are no exams (which, to be fair, certainly matters to some people) and that you can 'skip' one of the books (there are 5 books---Kanafani's Men in the Sun, Khedairi's A Sky So Close, Mahfouz's Midaq Alley, Mahfouz's The Thief and the Dogs, Salih's Season of Migration to the North---but only 4 required response papers.) Please, if you need the LIT distrib, find a different class. Kadhim is NOT it.\""
        ]
    },
    "COLT052": {
        "Ana Merino": [
            "review 1: \"08X with Ana Merino: I took this class as a lit destrib. Not too much work, but still worth my time and money.\"",
            "review 2: \"08X with Ana Merino: The way Ana structured this class was amazing. It's one of those classes at Dartmouth you wish everyone could take because she asked you to really think critically about some really tough issues in class. There was a movie each week/every two weeks, and a short response paper (1 pg) on it. Ana is an amazing prof who is so experienced with all of this material as she's interacted and spent time with street children, child soldiers, etc. She's amazing, and generated some amazing discussions. She was so approachable and at the end of the course said that she would be willing to write each and everyone of us fantastic recommendations whenever we needed it. The course itself was great as the reading was always interesting and the movies were SO intense. So intense in fact that our class actually got kinda close with each other discussing the intensity of each movie. In terms of course work--short 1pg response papers to movies watched (like journal style), 1 mid term (open book!), 1 final paper of topic of your choice/presentation--everything else is class discussion.\"",
            "review 3: \"08F with Ana Merino: It was very comprehensive. Sometimes it felt like it was a bit all over the place. Other than that, I learned a lot about Jewish experiences. The reading is a bit overwhelming, but it's interesting.\""
        ],
        "Silvia Spitta": [
            "review 1: \"07W with Silvia Spitta: Prof Spitta is great. This course is not much work and you get to read some really cool novels. The end of the course is a bit scattered (Cuba and cameras have nothing to do with borderlands...what's going on here?), but other than that it's great. Spitta is up for you doing pretty much whatever you want for the paper and responses though. The small size was the best part.\"",
            "review 2: \"05W with Silvia Spitta: I knew I should have dropped the course when I started to show the syllabus around to several professors, who, upon looking at it, frowned, cringed, and said, \"This is such an unstructured course,\" \"There is no sense of \"the borderlands\" in the syllabus,\" \"I don't like Spitta's publications,\" and finally, \"So...Cubans are part of the US borderlands now? Which is fine, I guess...but, in the syllabus, I don't see any readings that talk about the border beyond a US-Mexico context.\" And, in class, when we discussed the Cuban Playwright Dolores Prida, there was no connection to the borderlands, same with Barthes. Prof. Spitta might be a good and nice person, but she's a lackluster professor that should never have received tenure and has no place at Dartmouth College. Her courses are often described as \"easy,\" \"boring,\" and a \"waste of time.\" Some Spanish majors continually search for her courses because of that easy A and light course work. Then, the way she treated the material, \"the Borderlands,\" was through, what I feel, is a very demeaning anthropological gaze that, had this been on Asian American Literature, would be termed as \"Orientalism\". She moves about the course as if this were but a mere hobby rather than a serious intellectual pursuit of hers. I think it's insulting that the Comp Lit department allows her to teach a course on the Borderlands when she hasn't really had any publications (minor or important) on the Borderlands. She does hybridity, which is not the same. She repeats the following ad naseum: \"Latino/a literature is a literature caught between conflicting cultural and literary traditions: it is Janus-faced and looks to Latin America and the U.S. at once.\" And she also subsititutes \"Latino/a literature\" with \"border literature\" etc. I disagree with that aspect, and I find the \"Janus-faced\" description quite simplistic and misleading. Latino literature is not Janus-faced because, like it's writers, it looks AWAY from Latin America. She would also tell students that they were depressed. She was also vulgar enough to tell a student that \"Minorities are pampered at Dartmouth.\" With this, I end. PS She never connects Barthes to the Borderlands, it's just a book that she assigns to all her classes.\""
        ],
        "Lorgia Garcia-Pena": [
            "review 1: \"08S with Lorgia Garcia-Pena: I absolutely loved taking this course, and needless to say, professor Garcia-PeÃ±a is amazing. I had never taken a course that analyzes different texts from the caribbean diaspora. I have learned to much in this course and am REALLY thankful I ended up taking it before I graduated from Dartmouth...hands down one of the best courses I have taken here. The course consisted of reading a novel each week, one oral presentation, writing about 3 2-page papers and a 10 page final. All very doable. The conversations in class were pretty good too.\""
        ]
    },
    "COLT051.01": {
        "Ayo Coly": []
    },
    "COLT050": {
        "Mary Green": [
            "review 1: \"04S with Mary Green: The prof is nice about due dates and stuff - she's pretty easygoing and doesn't grade too hard ont he little papers. the movies are usually cool, at least since they replace reading.\""
        ]
    },
    "COLT049": {
        "Israel Reyes": [
            "review 1: \"07F with Israel Reyes: Professor Reyes is a really nice guy. The class was based on a bunch of readings and a few books. We discussed really bizarre yet interesting topics. None of the readings were particulary difficult and the course work was manageable. Work consisted of three 3-5 papers and a final paper of 8 pages. work was very doable.\"",
            "review 2: \"07F with Israel Reyes: Prof. Reyes was a nice guy and seemed interested enough in the subject. There were some really interesting readings and movies and occasionally, he will assign something that is completely revolting but thought-provoking. Overall, an interesting class for those WGST majors/minors.\"",
            "review 3: \"07F with Israel Reyes: There were lots of readings for each class, but you really only needed to do the readings that you write your (short=3pg) essays about. There were three short essays, one presentation and a final paper that was basically the same as the shorter ones, but 8 pages instead. Professor Reyes is incredibly nice and makes you want to do well in the class. The topics were interesting but don't expect great lectures. Just go to class, do the readings for your essays and PARTICIPATE! You could even participate without reading the articles. Easy grader and a wonderful guy.\"",
            "review 4: \"07F with Israel Reyes: This class was very interesting. If you are a major or a non-major you should take this class. Professor Reyes was great!\""
        ],
        "Bed Giri": [
            "review 1: \"07S with Bed Giri: interesting material...boring prof. The material was interesting- and worth learning. some of the theorists were a little difficult to understand at first, but you hash it out well in class. Prof. Giri has good intentions, but he is so boring. and speaks really quietly, so he's kind of hard to hear. he is also sometimes hard to reach outside of class. but he knows his information, so he is a good resource.\"",
            "review 2: \"07S with Bed Giri: The beginning readings were a bit esoteric, but the novels were interesting enough.\"",
            "review 3: \"07S with Bed Giri: This class was kind of boring, to be honest...it wasn't bad, though, per se, and the novels were interesting (though the theory readings were torture). The lectures were just kind of blah, despite the fact that Prof. Giri is really nice (and a really easy grader). But overall, I'd say this is a good way to get your NW/theory class out of the way.\""
        ],
        "Rebecca Biron": [
            "review 1: \"08S with Rebecca Biron: This was an awesome course -- a lot of reading/movie-watching, but worth it. Biron was a really good lecturer, and the discussion she facilitated was interesting. Definitely take a course with her if you can!\"",
            "review 2: \"08S with Rebecca Biron: Biron is a great professor and you should talk to her at office hours - she is wonderful and extremely helpful. The material however was good when we did the fiction section, but the factual part was repetitive and boring.\""
        ],
        "Jamilya Nazyrova": [
            "review 1: \"06S with Jamilya Nazyrova: The material itself was interesting... However, the amount of reading we were expected to do was steep... especially near the end when we had to read a novel per class. The thing is, we'd only discuss these novels for like 40 minutes each... we wouldn't even go too in-depth on them. It seemed almost a waste to read them thoroughly because of this. Don't judge the amount of reading by the books in Wheelock. You'll get a stack of handouts a good 4 inches high. Also, professor Nazyrova never really explained what the assignments were. She'd just say, like, write a paper. A week later, someone would raise their hand and ask her what the paper was supposed to be about, how long it was, etc. Or she'd say \"who wants to give a presentation in two days on this reading assignment\" and a couple people would volunteer, but no more direction was said about it, and we had to guess what she was looking for in the presentations. So... the material itself was interesting and fun to read about, but there was too much of it, and it would've been nice if we understood what was expected of us. Good prof otherwise, though. She's genuinely interested in the subject and enjoys throwing ideas around. I'm glad I took the course.\""
        ],
        "Sara L.": [
            "review 1: \"07F with Sara L.: Teacher was great and was passionate about the course material. Readings were for the most part interesting. Around 150 pgs per class.\""
        ]
    },
    "COLT047": {
        "Marsha Swislocki": [
            "review 1: \"03X with Marsha Swislocki: We read many great versions of Don Juan throughout the ages. It's a great subject because it ultimately deals with sex and gender relations. We cover Byron, Shaw, Pushkin, Moliere and more . . . There was a lot of reading and it was hard to keep up. But we read mostly plays, so it was a bit easy to just skim. We also watched some movies, which were fun. Prof. Swislocki is very friendly and caring and even got pizza for all of us one night when we watched a Don Juan film. It's the perfect class for the summer. Work consisted of two short papers and one long paper.\"",
            "review 2: \"03X with Marsha Swislocki: I thought this class was the gut summer mythology class when I signed up for it, b/c I signed up for it in the winter b/c I wasn't going to be on campus in the spring. When I found out it wasn't, it was too late to switch out, so I considered my options and figured another comparative literature class couldn't hurt. I really didn't know too much about Don Juan earlier, but now I know quite a bit. It's worth taking if you just need a spot to fill.\"",
            "review 3: \"03X with Marsha Swislocki: prof swislocki is really knowledgeable about the topic and a great facilitator for class discussions. she respects student's opinions and fosters your ideas for paper topics. there was a fair amount of reading, but we got to watch some movies and prof swislocki even brought us food one night. a really relaxed, interesting class with only two papers and a presentation and good class discussions. great for soph summer.\""
        ]
    },
    "COLT046": {
        "Lawrence Kritzman": [
            "review 1: \"08F with Lawrence Kritzman: I'm a Catholic who had never taken a religion class before in my life (other than Sunday school) and took this on a whim because I heard that Kritzman was a good prof. I couldn't have been more pleased with how it panned out--Kritzman was led engaging and thought-provoking discussions and gave interesting lectures, and though the reading was quickly paced, it's easy to breeze right through because every piece chosen is incredibly interesting.\"",
            "review 2: \"08F with Lawrence Kritzman: Prof Kritzman is amazing, The assigned readings were interesting. Take any class you can with him, you won't regret it.\"",
            "review 3: \"05F with Lawrence Kritzman: This was far and away the best class I've taken at Dartmouth. The class in itself was really awesome. The readings were diverse and really compelling. The best part of the class though is Professor Kritzman who is an amazing professor in so many ways. First, he was incredibly knowledgable on the subject and if he ever didn't know the answer to a question he would research it and come back with a detailed answer the next class. Second, he's a great guy. He really tried to form a personal relationship with everyone in our class which is a really unique experience because he's a very interesting man. Lastly, he's a very accomadating professor. He really tried to make the class as stress-free and enjoyable as possible. We wouldn't move on to the next reading until we had fully discussed the previous one. If you ever have an opportunity, take a class with Kritzman. Not that I should talk him up anymore, but he just won the SA Profiles in Excellence award rightfully so. I only wish I had found out about Professor Kritzman earlier at Dartmouth so I could have taken more classes with him.\""
        ],
        "Ivy Schweitzer": [
            "review 1: \"04S with Ivy Schweitzer: this class definitely challenges its students, however be prepared for a more ancient or historical perspective of mothers and daughters. we did not get to more modern or recent issues until the last week of class.\"",
            "review 2: \"04S with Ivy Schweitzer: The complete title for this class was \"the psychology and literature of mothers and daughters\", so we learned a lot of freud and chodorow and even the historical context of the mother daughter relationship, which were all very interesting. We also read novels, poems, and short stories, analyzed art and photography, and saw film clips that had the mother daughter theme and used the theories from the texts to interpret. I loved the material for the class--diverse and open to interpretation. There are a lot of readings though and about halfway through, we were doing a novel every/every other class. There are a lot of papers, about five or six but they aren't too difficult to write and there is almost always a choice between questions. Prof. Schweitzer is really fair in grading; she actually gave me higher grades for the papers then when the TA graded them. (TA isn't too helpful either.) You can do the midterm paper on an topic that relates to the theme of the class and the final is a take home test that combines short answer/definitions and two essay questions. The class really isn't too difficult and the topic is really interesting. Prof. Schweitzer is a great Comp. lit professor so she's very good at lecturing for this kind of class. Median was A-.\""
        ]
    },
    "COLT045": {
        "Beatriz Pastor": [
            "review 1: \"22F with Beatriz Pastor: Took this class for the distrib and because I'd liked COLT classes I'd previously taken. The class is... ok. The material itself is interesting, but there's a lot of reading (at least for a distrib). You do have to do all of the reading - the class is mostly lecture, but sometimes there's discussion where she asks very specific questions. The workload is a 1-page journal entry for each reading you do, a group presentation, a 3-4 page midterm paper, an in-class midterm, and a 8-10 page final project (everything is 1.5 spaced, because why not). The class is NOT well organized. There aren't really assignment descriptions, and the prof isn't super helpful if you ask for assignment descriptions. There aren't rubrics and there aren't really prompts either. Lectures are not posted on Canvas, so if you miss class and don't have friends to send you notes, you just miss the material. There's currently two conflicting versions of the syllabus on the Canvas page. It's difficult to know what she wants, and because the reading journals are turned in all at once at the end, I have no idea what my grade in the class is. Overall 6.5/10, interesting but also one of the most frustrating classes I've taken here.\"",
            "review 2: \"09F with Beatriz Pastor: This is a good intro to utopian theory and gives you a good background with More's Utopia and Huxley's Brave New World. Class is usually interesting, but sometimes the prof gets sidetracked into her specialty, which is Latin American history. We did a lot in class on Columbus and Cortes and their utopian visions. If you want to understand the prof, find out what Bloch was talking about in utopian theory. You never read it in class but she always refers back to him... Be prepared for very little writing, but a completely unexplained two-pager around week three that she grades strangely. Other than that, the class is good: not that much work, small, discussion-based. Note to freshmen: know what you're getting yourself into if asking to join a completely upper-class COLT class. It's not impossible, actually kind of fun, but make sure you're genuinely interested in learning all about utopia.\"",
            "review 3: \"09F with Beatriz Pastor: I've always been interested in utopian and dystopian literature so I was very excited to gain a new perspective on utopia and theory, literature, and history. We looked at utopia in a lot of different contexts and through different mediums, which kept the class interesting and refreshing. We had a two-page paper, a two-part midterm (part in class, part take-home), group presentation, and an 8-10 page final paper. The assignments were not too difficult but I think that there was some confusion as to what Professor Pastor wanted, especially with the two-page paper. The workload was manageable though and I still recommend the class 100%. Professor Pastor really knows the material and is very interested in the subject. This was a great class overall and if you have any interest at all in utopia then you should take it.\"",
            "review 4: \"06S with Beatriz Pastor: Pastor is great, I would have liked a little more discussion but she really has a great understanding of the material and she covers the material very well. The readings are very interesting, and many of them can be skimmed. I really enjoyed this, I did it to fulfill my int distrib but I am glad I took the course.\""
        ]
    },
    "COLT042.04": {
        "Jung Ja Choi": []
    },
    "COLT042.03": {
        "Klaus Milich": [
            "review 1: \"20W with Klaus Milich: Great Professor and wildly entertaining, but a fair amount of work. There were readings/movies for every class period for which you had to write a discussion post generally more than 300 words along with a 3000-3500 essay at the end of the term. Additionally, each group of 2-3 students had two presentations throughout the term on other essays or movies. A lot of time is spent on Robin Hood, some time on pirates, and none of terrorists. All in all it was a fun class because of the Professor and his personality, but was not rewarding in any sense. It was not a layup but wasn’t too hard.\"",
            "review 2: \"19S with Klaus Milich: Professor Klaus Milich is a great guy but leaves something to be desired in structuring a class. There are readings every week but you can get by without deeply reading any of them. Participation is key, engage with the class and engage with the professor and you will be just fine. We only had one essay the whole term and that was our only grade if you're looking for a class with structure this is not the one for you, but this was a very rewarding class and again professor Klaus is a good prof and a better guy.\""
        ]
    },
    "COLT042.02": {
        "David Laguardia": []
    },
    "COLT041": {
        "Lewis Glinert": [
            "review 1: \"04F with Lewis Glinert: The class was very good. Through inspection of humor of various periods I received a comprehensive view of Judaism through the centuries, which is an added bonus. Glinert teaches with much excitement and enthusiasm, making it easier to pay attention in class. My only problem with the class is that it covers a lot of ground (approximetly 3500 years of humorous writings of various sorts)and there didn't seem to be enough time to pay specific attention to many of the topics discussed in class and in the readings.\"",
            "review 2: \"04F with Lewis Glinert: Professor Glinert is extremely knowledgable. Unfortunately, he's not a great teacher. His discussions are often unorganized. There is quite a large amount of reading, much of it on reserved, which can be annoying. There are no tests, but there are 5 papers. Overall, it's an ok course, but nothing inspiring or fun like I had hoped.\"",
            "review 3: \"04F with Lewis Glinert: This class was great. Professor Glinert is very animated in his lectures and really has a deep interest in teaching about this subject. The class had a very strong emphasis on Jewish culture, which I appreciated. Don't expect to be rolling with laughter during every class but humor is definitely there. I took this class my freshman fall, but in retrospect it was a fairly easy course. The concepts were well developed in class and the assignments were fairly easy.\""
        ]
    },
    "COLT040.01": {
        "Jessica Beckman": [
            "review 1: \"23W with Jessica Beckman: Came into this class just for my lit distrib but left with so much more. You get to look at cool books in Rauner and learn about how knowledge has been preserved and passed down throughout the course of human history. Our class also made a book together in the Book Arts Workshop which was lots of fun. Professor Beckman is kind, very knowledgeable about the subject, and lenient with her grading (maybe even too much). She's going on sabbatical for the 23/24 academic year but definitely take this class with her when she's back!\"",
            "review 2: \"23S with Jessica Beckman: Super super cool class. Basically every class you spend half of it looking at old books dug up from the Rauner archives. We also got a lot of time to explore the Book Arts Workshop, which is such a hidden gem on campus. There were a handful of weeks spent reading Tristram Shandy which isn't the most enjoyable thing, but everything else makes up for it. Beckman is lovely and would highly recommend taking this class if you have any interest in the history/literature/printing!\"",
            "review 3: \"21F with Jessica Beckman: Love love love this class! Professor Beckman is amazing and you get to work with really cool books in Rauner. Manageable workload, hidden gem of a class, take it!\""
        ],
        "Alexandra Halasz": [
            "review 1: \"20F with Alexandra Halasz: This is like one tier below the iconic Dartmouth layups. Just do your homework and enjoy the fruits of your labor. Took it for the LIT distrib and didn't disappoint – she basically takes you on a tour of Rauner through the term and I found that super interesting and enjoyable.\""
        ]
    },
    "COLT039": {
        "Nancy Canepa": [
            "review 1: \"08W with Nancy Canepa: Canepa kind of missed the boat on this class. Every day, we did the same thing--listen to everyone rehash the reading for a full hour and five minutes. Canepa hardly ever lectured, but when she did it was pretty boring. There was so much reading that it was pretty much impossible to finish it by the deadline, and she didn't always tell you what assignment was due on which day, either. Instead of a writing project, like the ORC suggested, the final project was a 5-7 minute video. It took our group 20+ hours to make and was hellish to edit. There was no foray into multicultural fairy tales, only western European and American ones. Overall, not what I expected.\"",
            "review 2: \"08W with Nancy Canepa: First of all, it is important to have a real interest in fairy tales to take this course. I enjoyed this class the most because of the great readings. It was so fun to be able to read short, entertaining and easy fairy tales for homework. The discussions were also a highlight of the class. Since it was capped at 25 students, it was a really great discussion environment and everyone contributed. I learned the most from the discussions and they were really interesting. This course covered a lot of gender studies topics and the like. I had never thought of fairy tales as statements about feminism, either negative or positive, but after this class i have a whole new appreciation for the literary genre of fairy tales. The assignments were enjoyable and easy, and i especially liked the group video project at the end. Professor Canepa is also really great and knowledgeable about her subject. She is really personable too, and easy to get to know. I would recommend this class as an easy class that is interesting and really fun. Its important to be interested or curious about fairy tales, though.\"",
            "review 3: \"08W with Nancy Canepa: This class was very fun and interesting, for the most part, but it has a lot of work. In particular there was an end of the term video project that ate up our time, as well as an elementary school activity, leading class discussion, and a paper. However, the material is very interesting and it's fun to talk about and offers a nice third class. Prof. Canepa is nice and interesting and understanding of her students. Just leave for the extra projects.\"",
            "review 4: \"08W with Nancy Canepa: This was a pretty cool class. Canepa's a really great prof, although I've had another class with her, and she was significantly better in it. The material is cool, really not hard at all, and she definitely makes an effort to make it a varied course--not just discussion. That said, her lectures were not drop-dead amazing. She also had the TA do some multi-media stuff which wasn't all that interesting to me, but that's probably just me. Anyway, not too hard, cool material, mildly embarrassing final project (I'm a REAL bad actress), probably going to be a class of all girls, really caring prof, kind of close to her specialty material, but if she ever taught a course on italian fairy tales, I'd take that in a second.\""
        ],
        "Jonathan Smolin": [
            "review 1: \"08S with Jonathan Smolin: This class had nothing to do with my major, but I promised myself I was going to take some classes in college purely for fun, and this course fit that billing well. The books are fun to read and fun to discuss. The work is very managable, unless you don't like reading the books for some reason.Professor Smolin is a great prof and a really nice guy.\""
        ]
    },
    "COLT035": {
        "Hussein Kadhim": [
            "review 1: \"05S with Hussein Kadhim: This class consisted mainly of reading Arabian Nights and additional handouts for every single class. There was only one paper and that is a 20-25 pg final. So, very reading intensive to say the least. Professor knew material very well. Stories were amsuing and interesting.\"",
            "review 2: \"05S with Hussein Kadhim: This class was ok. The Arabian Nights is an interesting book so I enjoyed reading it couldnt finish it thouh...was too busy. but it was a good class.\""
        ]
    },
    "COLT034.01": {
        "Lawrence Kritzman": [
            "review 1: \"20F with Lawrence Kritzman: Great, chill professor. Class is all discussion based, and the only assignments are 3 papers (2 that are 5-6 pages, 1 final one that is 8-9) and then an oral presentation where you basically just lead the class discussion about one of the plays after talking about it for like 5 minutes. Pretty chill grader but also knows what he is talking about. Class may delve into philosophical discussions so if you struggle with that you may find yourself lost, but overall it doesn't really matter too much. The plays are pretty interesting and relatively short. Overall, good class and great prof.\"",
            "review 2: \"20F with Lawrence Kritzman: Professors like Kritzman are what make schools like Dartmouth great institutions. I seriously cannot stress how wonderful, kind, empathetic, interesting, and many other positive adjectives describe Kritzman. The material itself was interesting, though there were lulls as in every class, and the effectiveness of the class depended greatly upon student participation (and Kritzman figuring out technology). The grading was more than fair, but more important are the couple ideas that, if you pay attention throughout the term, help shape you as an academic and person after the term ends. Would definitely recommend.\""
        ]
    },
    "COLT033": {
        "Annabelle Melzer": [
            "review 1: \"08F with Annabelle Melzer: is terrible. Do not take this class, or any other class with her.\"",
            "review 2: \"08F with Annabelle Melzer: Annabelle is a brilliant lecturer, and the material is incredibly interesting. Take this course!\"",
            "review 3: \"08F with Annabelle Melzer: Prof. Winograd is a great lecturer. But do not miss her class. And do NOT be late ! She really shows her passion for the theater and really makes you enjoy the theory of drama and not just the practice. There are two papers. Midterm and Final. It is in your best interest if you take this course to go to office hours. She is a great resource and really helpful. If you go to office hours she is very clear about what she wants to see in the papers.\"",
            "review 4: \"08F with Annabelle Melzer: I don't know if it was because I am not a Theater major, but this professor was horrible! I never knoew what she was talking about, I never knew what information was actually relavent because she was often on some tangent. She was just a wierd prof with very wierd expectations, which I never understood. I felt that she was a little offensive at times (and I'm not one who is easily offended) and the material we covered was offensive and just plain strange...\"",
            "review 5: \"08F with Annabelle Melzer: The class is very engaging and interesting. the readings are usually good. Prof. Melzer is a very energetic lecture and inspires interest. the only issue is the midterm and final which make up the entire grade. Melzer is a very strange grader. I got a C on the midterm, which she decided to change to a B after i had a meeting with her. I recieved a C- in the class, which means i must have recieved about a D on the final (which i never got back). The final consists of a ten page paper almost completely removed from the course topic and asks a ridiculous amount from the students. a good trick for her is to spout back at her what she's been preaching about in her class. if you can weasel your way onto her good side, this is a great class to take\"",
            "review 6: \"07F with Annabelle Melzer: This class is absolutely phenomenal! Annabelle knows what she's talking about; her lectures are brilliant and sometimes out-there, but she always makes the material fascinating! She somehow makes the inhuman two-hour lecture length work, often by showing short clips of films and productions She doesn't put up with any B.S. from students, but she's always willing to help you if you have the right attitude towards the course and towards the material. Seriously, take this class if you're at all interested in theater or even if this is the one arts class you're going to take. The projects require a lot of time and effort but they're worth it!\"",
            "review 7: \"07F with Annabelle Melzer: i had heard going in to the course that you either love or hate annabelle. i happened to love her. her lectures are really performances, she is engaging, funny, committed - she doesn't let students pontificate, which I love (she knows it better than we do, guys), but at some points it seems like it's her way or the highway. I just happened to agree with her. there are only two papers: a five-page midterm and a 10 page final. the course also surveys lit theory a bit and how it applies to theater. it is very broad, interesting .. I would recommend it to anyone. TAKE IT!!\"",
            "review 8: \"07F with Annabelle Melzer: I was bored a lot of the time-being a 10A was brutal. There were only 2 papers and they didn't require listening to all the lectures or doing all the reading. The prof is really willing to help, but she easily passes judgment on people so you have to be careful to not make her mad. The material was ok, not amazing. The emphasis was more on theater than comp lit.\"",
            "review 9: \"07F with Annabelle Melzer: audited the class and loved it. she's a clear lecturer. idiosyncratic as they come. (don't be late for class, only ask for an extension if you really need one - and do it early.) it's fascinating material - using the post-modern to explain the modern. i wish i had taken this class first year fall because it explains a lot of 'ism's and ideas that pervade everything else i've done in my time here. take it. it's great.\"",
            "review 10: \"07F with Annabelle Melzer: The lectures were captivating and the readings (many of them plays) interesting. Overall, this course definately gave me a stronger interest in theater study and dramaturgy.\"",
            "review 11: \"06F with Annabelle Melzer: Very interesting theater class. Lots of attention paid to the development of modernist theatrical and performance technique. However, this should NOT be listed as a comparative literature class! The text of the plays are ignored and there is no discussion of the plays themselves. In the words of the professor, \"This is not a literature class.\" If you're looking for an acting/theater class, this is definitely worth a look. But if you want to take a literature class, best to look elsewhere.\"",
            "review 12: \"03F with Annabelle Melzer: Overall, it was a great course for people interested in theatre.\"",
            "review 13: \"03F with Annabelle Melzer: Annabelle is a beautifully eccentric professor that inspires you to tackle the world of humanities and theater with vigour. She's my favourite professor at Dartmouth and I continually learn from her about myself and the subject matter. Although the readings look daunting (you dont have to do all of them -- and she doesnt expect you to -- she merely puts them out there for those that wish to know more about particular subjects and in the hope that she will inspire you someday to read them...) TAKE ONE OF HER CLASSES.\"",
            "review 14: \"03F with Annabelle Melzer: This was a great class...I learned a lot, and Annabelle really knows what she's talking about. The papers were challenging but ultimately rewarding,and as long as you kept up with the basic reading you were set for understanding the lectures. All the other printouts she gives you aren't necessary at all...I would recommend reading as much as you can from the course reader and maybe from her book as well, and definitely reading the plays she assigns, but you don't have to read all the other stuff. She is so passionate about the subject that it really gets you interested: I liked it so much I'm taking Modern Drama 2 next term. It helps if you have a theater background, and I almost think she judges people on that: she was really helpful to me and incredible outside of class in appreciating my theatrical endeavors, but I think some other students without any prior theater experience had some issues with her. This is a shame, because I think theater should be available and open for everyone, but perhaps Annabelle is a bit of a theater snob. In short, if you're a \"theater person\" this class is amazing, if not it can still be but you're unfortunately going to have to try harder. I still think it's worthwhile, because the stuff she talks about is certainly not limited to theater and she doesn't present it that way either. Overall an awesome, engaging, and lively class.\"",
            "review 15: \"03F with Annabelle Melzer: The course was very good. I came into it knowing nothing about theater, and I learned a significant amount. I thought the class would be mostly text-based, but it was very focused on the theatrical elements of staging the classic modern plays. There were two papers and one exam, so you didn't always have to be constantly writing or studying, but when there were assignments, they were challenging and work-intensive. Professor Winograd was very excited and informed about the material. She would lecture throughout the entire two hours. Sometimes she would digress, talking about politics or unrelated material, and other times she could be hard to follow, but her evident passion more than made up for this.\"",
            "review 16: \"03F with Annabelle Melzer: professor melzer has to be seen to be believed. she really brings the material to life. before i took the course i thought that post-modernism was just a bunch of bullshit that art critics spouted to seem like they knew what they were talking about, but professor melzer convinced me otherwise. the only thing i didn't really like was that we got 10 or 12 handouts a week, most of which were very optional (although you sort of had to figure that out on your own). she is very energetic, but also a little disorganized. the papers are a challenge, but if you're willing to put in the time, they're a very rewarding experience (not your average Dartmouth paper).\"",
            "review 17: \"03F with Annabelle Melzer: Professor Winograd clearly is skilled at creating a vision of class material and conveying it to others. I believe that this is why her lectures are enjoyable, which they certainly are. However, she is terrible at fostering critical thinking skills in her students; she is dictatorial in her responses to students both in the classroom and on the written page. The result is a class that does not test one's ability to explore the depths of the material, but rather how well one can play the guessing game of what the professor wants to hear in response to her cryptic assignments. I frankly would have dropped the class had I known this in time, but it is currently the end of the term and the only concrete grade I currently have was for one exam (there are also two papers). This exam, moreover, is of indetrminate worth to the class- Professor Winograd refuses to assign it a specific value. This method of grading contributes to the feeling that the class is a guessing-game of her mentality, and not a legitimate intellectual exploration. The result was a class that, despite my being a major in a humanities field, was the single worst academic experience I have had at Dartmouth.\"",
            "review 18: \"03F with Annabelle Melzer: The material was incredibly interesting and Annabelle's knowledge is vast. She loves what she is teaching and tries to pass that passion on to her students. whether or not you know anything about theater, you can find some connection to the material. I highly recommend this course to anyone!\"",
            "review 19: \"03F with Annabelle Melzer: I took this class because it was different from my major and anything else I've taken and it sounded interesting. The lectures were fairly boring but the actual material for the class is interesting and you learn a lot. The tests are not really difficult as long as you understand the concepts of what you read (like the different movements and time periods). The final is fun because it allows you to be very creative\"",
            "review 20: \"02F with Annabelle Melzer: This class was absolutely great. Annabelle is a phenomenal professor. While I don't particularly recommend this class for first-years, it's definitely great if you're interested in the material. The professor moves quickly, but explains everything and is clearly very passionate about the subject matter. This is definitely my favorite class i\"ve taken at Dartmouth; it was both challenging and interesting. Although intense and at times overwhelming, I never wanted to miss a lecture because they were so inspiring.\"",
            "review 21: \"02F with Annabelle Melzer: Annabelle is easily my favorite teacher at Dartmouth. I had several classes with her, and each turned out outstanding. She knows theatre, international, classical, and avant-garde inside out, and links it to other arts: literature, music, painting, sculputre, film, photography, dance. Taking a class with her is an immersion in the worlds of art, performance and otherwise. Her lectures connect concepts picked up elsewhere into a coherent whole. She opened up my mind to things I would never have seen otherwise.\"",
            "review 22: \"02F with Annabelle Melzer: I would definitely recommend this class to anyone, ANYONE. Some will say not to as a freshman, but that's ridiculous, I took it freshman fall and it was my favorite class, with an inspiring teacher and fascinating work. I loved this class, and it really was what I needed, with my other two courses being made up of large, introductory lectures. Everything we did was relavent, classes were never boring, Annabelle is a fantastic teacher and a wise person...this class was a great experience. Don't be intimidated if you take it and are a freshman amid a lot of theater majors - it's really fine, Annabelle will be happy you are there and will help you through. Take this class!\"",
            "review 23: \"01F with Annabelle Melzer: Annabelle is a great lecturer. She's very entertaining. The course also covers interesting material, but it focuses much too much on dadaism and the avant garde. Little to no attention was paid to the part of the class that I most looked forward to, the last section, because Annabelle ran out of time due to poor planning. But, overall, I enjoyed the class.\"",
            "review 24: \"01F with Annabelle Melzer: Not being a theater major, I jumped into the class a little blindly. I was initially interested in it for it's Comp Lit credit. I went through waves of being completely overwhelmed and somewhat confident about my grade. There was only two papers and one midterm, with the papers carrying much heavier weight. I received my first F of my Dartmouth career on the first paper, thought the world was ending, and then she let us rewrite them. I think I will end the class with an A-, and I thoroughly enjoyed the material. The only unpleasantness of the class was thinking it would disasterously lower my GPA, but now that I know that's not true, I can appreciate the material, which was more or less all new to me, and very interesting. I would recommend to someone if they are at all interested in international (mostly European) theater and if they are confident that they can be creative upon command.\"",
            "review 25: \"01F with Annabelle Melzer: Professor Melzer gives wonderful lectures. She is very interested in her material, and has an enormous wealth of knowledge in the subject.\"",
            "review 26: \"01F with Annabelle Melzer: This class was really interesting and I feel like I learned a lot, but it was a pretty bad experience for my first term of freshman year. The readings were great, but if you missed one or two, you could catch up from the lectures. I say lectures rather than discussions because she spoke with such fervor that it seemed like she was performing, and no one really wanted to interrupt her most of the time. Unfortunately, I had no idea what she wanted from me as far as the two big papers were concerned. The assignments were more abstract than traditional straight-forward analysis papers. She gave us an opportunity to rewrite the first paper, on which I was able to improve, but then I proceeded to screw up the final paper almost as badly as the first, even though the content was almost entirely correct. By the last two weeks of the term, I was oddly intimidated by the professor and felt certain I would fail the class. I didn't, but it made me eliminate a theatre minor from consideration.\"",
            "review 27: \"01F with Annabelle Melzer: My favorite class this term. I took it for fun and it was definitely the most enjoyable class. The lectures are a solid two hours, but they are worth it. I learned more in this class just by staying awake than I did in my other classes by studying for tests. You have to have a general interest in theater and at least some experience with plays to get the full experience though.\"",
            "review 28: \"01F with Annabelle Melzer: Annabelle knows what she's talking about. She may have her quirky moments, but she's so interesting. Through her use of not only text, but artwork and film, I really got a feel for the material and completely understood it. There's a lot of reading and a couple of papers, but it's fun, fascinating stuff. Take this class.\""
        ]
    },
    "COLT031": {
        "Melissa Zeiger": [
            "review 1: \"12F with Melissa Zeiger: Course: I loved this course so much - I felt I had gained so much knowledge of literary criticism and poetic theory in a short space of ten weeks. That said, it was a bit fast-paced and there is an awful lot of reading. I personally enjoyed the reading, both on theory and the actual poetry itself. Take it even if you feel that poetry's not your thing - the professors and the poets! make the class. Professor: Professors Crewe and Zeiger are the cutest. Don't miss this chance to have them co-teach your class - they are extremely willing to help and sit down and talk at length about your paper, your lives, the rain falling outside, walking across the green with the sun out... They infuse each class period with their obvious passion for poetry and two hours can blink past in a jiffy. Workload: The profs are pretty conscientious about not over-assigning reading, although what we do have to read is pretty hefty at times.\""
        ]
    },
    "COLT029": {
        "Annabel Martin": [
            "review 1: \"05S with Annabel Martin: I found this course to be very interesting, even thought the theory reading was difficult. Prof is ver nice.\"",
            "review 2: \"05S with Annabel Martin: This class was a blast and the work in very interesting. The work load is a bit heavy but the work is fun. The movies are amazing and the readings are just as interesting.\"",
            "review 3: \"05S with Annabel Martin: Prof. Martin is the best professor I've had here. She is so responsive to the students and really teaches for the value of the students, rather than to get a syllabus of work in. This course inspired an interest and appreciation for melodrama where there was not one before.\"",
            "review 4: \"05S with Annabel Martin: Martin is a fantastic prof, available during office hours, really funny, engaging, demanding, just fantastic in the sort of class this was, which was a discussion based small class of about 20-25. You really had to do the reading though, or you would be hopelessly lost in class and unable to contribute. Participation counts heavily towards your grade. You should either take this class, which was a great way to get rid of my LIT and my EU, or take this prof, she is absolutely amazing!\"",
            "review 5: \"05S with Annabel Martin: This course provided the opportunity to reexamine popular culture with attention to social power structures. An essential for anyone interested in equity issues - whether racial, gender, national, sexual orientation, etc.\""
        ]
    },
    "COLT028": {
        "Laurence J.": [
            "review 1: \"04X with Laurence J.: This class was somewhat disorganized and discussions usually weren't focused on the literature we were assigned to read, but a vast digression of peripherally related subjects. Prof Davies is very knowledgable and is more than happy to spend time helping students understand the material and discussing papers. If you hand in a draft before a paper is due, he is willing to read it and give comments.\"",
            "review 2: \"04X with Laurence J.: We read interesting books, even though we couldn't read the books listed in the ORC description because of what was available in good translations/editions. Davies is a very interesting guy with good stories, htough sometimes a little long. Even as a slow reader who never had the whole reading assignment done, I felt like we talked about the books very little. Those of us who were not in the comp-lit loop sometimes felt out-of-it, like we didn't understand all the cross references to other literature. Davies is relaxed, helpful, and considerate about assignments, but I found it challenging to be in class. I'm a go-too-class person, but I wanted to figure out what was going on in the book in addition to what was happening in the world, or similarly. Sometimes we looked a themes and such, but I think that could've been balanced better. Perhaps I'm supposed to understand the greater meanings on my own and instantaneously, but I've never taken a comp lit class before and I felt like no one told me that until it was too late. I hope this class can be more accessible to the masses in future years.\""
        ]
    },
    "COLT027": {
        "Keala Jewell": [
            "review 1: \"04X with Keala Jewell: If you like gothic literature, creepy stuff, sex, vampires, the 18th century, or religion, this course should be interesting to you. The novels are pretty good, although the amount of theory is minimal and most of the secondary readings are pretty basic (some people will appreciate this.) The problem with this course is that Professor Jewell is pretty unwilling to accept new ideas, especially in class. her teaching style is stiff and sometimes confusing. She asks questions that no one knows the answers to, and on the rare occasions that discussions occur, she continually rephrases students' comments so that they say what she wants them to say - and not just a little, the whole class will be snickering. She doesn't seem to trust the class to function as intelligent human beings - she doesn't thing the students know how to write papers, read novels, or discuss their ideas, but her condescension is pretty painful. This may be because this class was in sophomore summer and in English and she usually teachers older students in Italian. I can't recommend this course, although for all it's problems, it's fun to read the literature, and she's not a particularly tough grader.\"",
            "review 2: \"04X with Keala Jewell: This course was ok. The material was fun and It was great to be able to read such cool stuff, but It was paced VERY quickly. we were reading 100-200 pages per night, and the books were what we were tested on, not in class lectures, so we had to keep up, which sometimes was impossible. most of the kids in the class just couldnt read everything assigned. Keala was very interested in what she was teaching but failed to generate good class discussion. often class felt wasted since noone had interesting things to say and she couldnt generate a good discussion. The readings were cool, but many were missed due to lack of time. I still got an ok grade though even though I couldnt read everything. She grades fairly.\""
        ]
    },
    "COLT023": {
        "Jonathan Crewe": [
            "review 1: \"06S with Jonathan Crewe: I took both my period 1's from Crewe. He does a decent job with boring material. He is incredibly excited, gives great off-the-cuff lectures, is available outside class and loves to hear students speak. Had I had interest in this period, I would have chosen him as my advisor. His papers are decently graded and he asks a very doable amount of reading. Not easy, but certainly manageable as a distrib.\"",
            "review 2: \"06S with Jonathan Crewe: crewe is a traditional prof with strong theoretical grounding. his attention to language in close readings is amazing, and his knowledge of theory helped to open up the text to interpretation and rereading. the scholarly essays focused mostly on gender and sexuality. he is very open to paper topics. he encourges students' ideas. the fairie queene is tough.\"",
            "review 3: \"06S with Jonathan Crewe: This class can be painfully boring if you don't do the reading. And maybe even if you do. If you don't do the reading, the workload is not that bad: 3 papers which increase in length. (First paper is 2-3, final paper is 12-15 pages.) He knows good writing and was not too harsh when it comes to grading. If you are a strong writer, you'll get As. He may seem like a hardass (especially with those idiotic mult choice reading quizzes and his supposedly no-tolerance attendence policy) but in the end, if you get good grades on the papers, you'll probably get an A. There is some interesting stuff to think about in some of the books, and he'll sometimes vaguely lead you in those directions, but a lot of the time when he's lecturing it's like he's speaking a totally different language. The only times I felt really challenged or excited by the class were outside of class, when I chose my topics and wrote papers-- you kind of have to find something that gets you going in order not to go insane from boredom. (I wrote papers about s&m violence and transvestism, which distracted me from the fact that I was reading in my opinion otherwise very boring books from boring time periods) In office hours, he's perfectly nice and it's clear he's brilliant and well-read, but he's not the best prof in the world. he kind of leaves you on your own a lot of the time (the first paper he assigned a topic and offered no guidance whatsoever really... and some of the books were more difficult than others, in verse or in middle english etc and he didn't accomodate or take more time on those) bottom line: don't take this class unless you need to for the english major. if you do need to, you don't have to read all of the books (or very carefully at least), just the ones you write on. get through his multiple choice reading quizzes using plot summaries, which he often posts on blackboard\""
        ],
        "J. Kathleen": [
            "review 1: \"03F with J. Kathleen: This class was one of the ones that made me realyl appreciate going to Dartmouth and being surrounded by other intelligent motivated people. Having other students who were facinated by the material and a psyched prof made this very very fast moving class go well. There was a ton of reading every night, but it was the kind of reading that is very interesting, and the class discussions and papers were excellent ways to express ones self about the fun and funny material. Awesome class all around!\""
        ]
    },
    "COLT022": {
        "David P.": [
            "review 1: \"09F with David P.: I needed a third class so I took this class on a whim and it was such a great decision. This was such an interesting class in terms of both the reading material and the class discussions. The class is completely discussion-based and the discussions themselves were very free-form. They were driven both by what the professor wanted to cover and what students wanted to talk about and the conversation did not always stay strictly to the text, though often was still linked by some theme or concept that came up in the texts. If you take this class it's very important to be engaged in the material and the class because otherwise you won't get much out of it, or get a good grade for that matter since 40% of the grade is class participation. We had three 4-5 page papers and a final 10-page paper. Otherwise all you have to do is read the material, which did not constitute a lot of reading at all. Professor LaGuardia is great and I recommend taking this class.\""
        ]
    },
    "COLT022.01": {
        "David Laguardia": [],
        "Paul Carranza": []
    },
    "COLT021": {
        "Monika Otter": [
            "review 1: \"09W with Monika Otter: This class was amazing. It was a lot of reading, but I was interested in the material and so I didn't mind. Prof. Otter is an amazing teacher, and I loved the way she led the class discussions. She also helped me to learn to write better. She wants narrow theses that actually have something to say. The most challenging aspect of this course was coming up with a thesis that was important and answered the question \"so what?\".\"",
            "review 2: \"05S with Monika Otter: I was ridiculed for going to the bathroom during class, \"an adult should be able to hold it for 60 minutes\", as well as faulted for missing three classes for Track Meets. Also I was berated for being late, yet as of my knowledge today the grad student that is continually late/absent, recieves no reprimand. It just seemed really unfair and it definitly was reflected in my grades and her irrational grading of my papers. Outside of that, the subject was really interesting, the songs/poems really fun to read, and a good class atmosphere because there were so few of us. If I could have gotten beyond her biases, I could have enjoyed the class more.\""
        ]
    },
    "COLT019.01": {
        "Nancy Canepa": [
            "review 1: \"23W with Nancy Canepa: A very cool course that requires a *lot* of work, especially in terms of reading. I'd say we averaged somewhere around 80 pages of reading per week. Most classes are centered around a discussion about the assigned readings for that class -- the discussion can be led by Nancy herself, or by a pair of students. To lead a discussion, you need to prepare some sort of in-class dynamics in order to get people engaged, make slides and an online post with some key takeaways and quotes to discuss in class, and Nancy will consider that to be a part of your final grade. The best part about it is that you really only have to do it once. Be prepared, because your peers will not read the text, especially a couple of weeks in. :) A couple of classes are workshops, to discuss the translation homeworks. In those, you get together with one or more other students, read each other's translations and offer (hopefully) useful feedback. You are expected to incorporate the feedback from the workshops into your translation explicitly (mention it in the commentary!), or Nancy will take off points. Nancy is an unexpectedly easy grader, and a very understanding lady -- she doesn't want to fail you, and she cares about any outside circumstances that happen to befall you, but she does need to see you putting in effort. You can also write the commentary in somewhat non-academic language (at least I did) and she won't really mind, as long as you are being honestly thoughtful about your own translation. The course will wear you down as time goes by, but it's a nice experience.\""
        ],
        "James Dorsey": [],
        "Michael Wyatt": [],
        "Monika Otter": []
    },
    "COLT019": {
        "Monika Otter": [
            "review 1: \"09F with Monika Otter: Otter is good, but she can be a little scary at times, so be on time for the sake of everyone in the class because she is a scolder Beyond that the class was really interesting especially if you are in any way curious about translation. The work is pretty easy and there is not too much reading at all. The assignments, while longish, are not hard at all. I would recommend this class for sure! I NROed it and it worked out perfect\"",
            "review 2: \"07W with Monika Otter: You really have to love the language and culture you're working with in order to take this course. It was a ton of work but I had lots of fun doing it. Otter is a good prof--the main problem I had with her was that she isn't the best listener, and a little biased in her opinions. She also only knows European languages, which is unfortunate for those who want to work outside Romance and Germanic languages (a minority, I admit). That's a pretty minor issue, though.\"",
            "review 3: \"07W with Monika Otter: This was an interesting class, different from any other class that I've taken so far and will probably take. For each class, other than when a written assignment was due, there would be a reading assignment. These varied in length and difficulty. Sometimes the readings would be really hard and you'd have to spend twice as much time trying to figure out what was being said and sometimes there were more \"lite\" reading and could be done really quickly. The written assignments could be fun because you got to pick something you want to translated in the particular genre for the assignment and pretty much do what you want with it. This is definitely a class where you have to be self-motivated in order to do the work. Professor Otter had a lot of things to say in class and during the teacher-student meetings on the final project. Overall I really enjoyed the class. All this being said, you're probably better off if you're translating from a language that she doesn't know as opposed to one she knows really well.\"",
            "review 4: \"07W with Monika Otter: Near the end of this course I suddenly had a realization: no one will ever make me translate something for an assignment again. This made me sad. I realllllly like translating. I also really like theories of translation, which you get a lot of different perspectives on. Therefore the class itself was a great fit for me. If you are so-so interested in translating, it might not be as good. Oh, and you should be fairly competent in your other language but it's not at all necessary to be fluent (you're allowed to get help from native speakers/professors of your language). You always translate from your second language into English. Otter is good. Not great. I liked her a lot at first, but I got a little more frustrated with her as time went on. Some of our readings were \"harder\" and she tried to scare us with how difficult they would be. Yeah, they were a little more theoretical, but she seemed to think we were not capable of handling them and was surprised when she realized we had understood them. She told us that our assignments would be graded more on the commentary than on the quality of our translations, though those still mattered. What I found, though, is that she would give me the final grade of whichever was worse. I mean, I guess it makes sense, it was just difficult to understand her grading. Also, she didn't like my final project. I did. I thought it was pretty damn cool. But she didn't understand why I was doing what I was doing (you would think it was cool if you saw it) and thus I sort of knew I was destined to not get an A in the class. Ah well. I'm still glad I took the class.\"",
            "review 5: \"07W with Monika Otter: If you find translation or languages at all interesting, TAKE THIS CLASS! It was really an incredible experience that shook my fundamental ideas about language. The reading is all fascinating; mostly it consists of philosophical discussions of translations, resulting in the fact that you come to believe that translation is impossible. And then you do it. The work, outside of the readings (which were substantial), consisted of small exercise translations and a larger final project, as well as essays/responses commenting on the translation process. Honestly none of this felt like work; if you are interested in the subject, the translations may be hard but they will not get boring, and if you've engaged in them on any level the commentary is easy to write. Professor Otter negotiates this unusual academic territory with enthusiasm and remarkable clarity, taking a personal interest in everyone's projects even if she didn't speak the language they worked with (although she knows about 6 languages). If you work with German, don't be scared away by the fact that she's a native German speaker; I worked mostly with German(although no one else did!), and although her criticism was perhaps harsher and more detailed for my exercises, she saw quite clearly the effort I put into them, and could tell when they were well done. This is the best class I have taken at Dartmouth! Don't miss it! And certainly don't phone it in; it's well worth the effort!\"",
            "review 6: \"05W with Margaret Williamson: This course with Margaret Williamson did not quite live up to the reviews it got under Monika Otter, but it was still very interesting and loads of fun. Every thing depended to a great extent on personal initiative, because the readings were never tested, and the translation assignments were easy to fudge. However, the discussions about the readings were very stimulating (Class size: 15), and the mere fact of translating things however well made it an interesting course. Don't expect to gain a lot of solid, articulable facts in this course, but do anticipate an arsenal of approaches to be acquired.\"",
            "review 7: \"03W with Monika Otter: This is a great class. It is tons of work if you want to do well, and more importantly, if you want to get a lot out of it. It is very geared toward personal freedom and creativity, and is by far the most hands on learning experience i've had at dartmouth. I would strongly recommend it to anyone who enjoys languages, and has a term where they don't mind putting a lot of work into a very rewarding project\""
        ],
        "Margaret Williamson": [
            "review 1: \"05W with Margaret Williamson: The class was fantastic. We had a great class dynamic that I think was half fluke and half Margaret Williamson being a delightful lady who never got discouraged when/if discussions lagged and who always made funny little quips that kept the atmosphere personable yet light. I absolutely loved learning the fine details of translating and was encouraged by the general enthusiam by the prof. The only criticism I have is that we read too much Greek translation stuff (for the reading component of the class), which doesn't really interest me. I suspect we did because Prof Williamson's a classics prof.\"",
            "review 2: \"05W with Margaret Williamson: This course with Margaret Williamson did not quite live up to the reviews it got under Monika Otter, but it was still very interesting and loads of fun. Every thing depended to a great extent on personal initiative, because the readings were never tested, and the translation assignments were easy to fudge. However, the discussions about the readings were very stimulating (Class size: 15), and the mere fact of translating things however well made it an interesting course. Don't expect to gain a lot of solid, articulable facts in this course, but do anticipate an arsenal of approaches to be acquired.\"",
            "review 3: \"05W with Margaret Williamson: This was a very interesting class, and well-taught by Prof. Williamson. The readings were very informative, and the small class made for useful discussion and group work. The class is a lot of work, though... probably more than most if not all classes I've taken at Dartmouth. We had reading for every class, which were often tough theoretical readings, 6 weekly translation assignments, and then a huge final translation project of 10 pages of translation and 10-15 pages of commentary. I don't think I've ever worked harder for a class, and she's a tough grader, but I still leave having learned a lot and happy I took it.\"",
            "review 4: \"05W with Margaret Williamson: The readings and assignments for this course were very time-consuming, especially the final project, but if language and translation is something that interests you, definitely take it. The class discussions were really interesting and often spilled over into the next class, meaning we were constantly behind. Because everyone in the class is working with different languages you end up learning a lot about how languages work in general. Overall there was a nice balance between theoretical and practical considerations, although some of the more difficult theorists were frustrating to read at times. You should have a fairly good reading ability in your foreign language, but it's OK not to be fluent. A word of advice: the assignments are a lot more fun if you challenge yourself a little bit and pick pieces that pose interesting problems to translate.\"",
            "review 5: \"05W with Margaret Williamson: First of all, translation = hard. I had no idea that translation could be this demanding. However, this course ended up being my favorite course of the term. You needed to be somewhat fluent in a foreign language to enroll. It was really cool to have so many different languages in one classroom. We did not really have lectures. The class was discussion-oriented based on the readings. The readings were fun, thought-provoking, and very relevant to our own translation practices. They exposed me to many complex and mind-boggling theories of translation that I did not know of before. As for the written assignments, we had six translation exercises and one big final project. Although the exercises were challenging, I found them to be fun. I definitely don't look at translation the same way after taking this class. Overall, Professor Williamson is a very nice and friendly lady. I thought she was a reasonable grader. I strongly recommend this class for anyone interested in translation and languages in general.\""
        ],
        "Nancy Canepa": [
            "review 1: \"23W with Nancy Canepa: This is, to date, my favourite class I've taken at Dartmouth. The area of translation studies is not something a lot of us think about on a regular basis, and yet it is absolutely fascinating and definitely a skill that I think everyone should try their hand at - and this is a perfect opportunity to do so. Not only do you get to read through many foundational works of translation theory, but you are also almost constantly putting it into practice, first through small translation excerpts, and finally through a big translation project. Of course, Prof Canepa is also an incredible woman, with great insight and an infectious passion for her trade, so much so that you can't help but be really passionate, too. She gives very thorough and constructive feedback, and if you implement it she will be quite lenient with her grading. She is also very pleasant in general, and seems very excited to get to know her students and their work, as well as being very hands-off during the discussions, which ends up creating a very rich atmosphere. The one thing I would note about this class is that the readings are A LOT; like, averaging 30 pages per class a lot. This can quickly get quite draining if your other courses are also reading-heavy, but happily, you can read the assignments in a cursory way and still go through the course just fine. And, believe me, it is definitely worth it just to experience the wonders of COLT19. Wholeheartedly recommend!\"",
            "review 2: \"20W with Nancy Canepa: Nancy is a nice lady; very serious about the translation life. The class has a lot of dense, repetitive readings and honestly at some points I could not care less about the theory of translation. If you don’t at least skim the reading material, class WILL become very hard as it is so discussion based and Nancy notices if you don’t talk or know what you’re talking about. I also noticed she really favors Italian and me being German, she would bring up often in our required bi termly meetings how in Italian they do this or that and I should ask an Italian speaking student for examples instead of focusing on the nuances of my work. She does expect a language mentor to meet with often which I didn’t really enjoy, but you need to do it or else she gets involved as she did with a Spanish classmate. I found the class by nature evokes a lot of tedious work and she really has a specific way of wanting things justified in your writing( you type out a translation and the same amount of pages needs to be an explanation as to why.) I did 10 pages of translation and 10 pages of explanation for the final and it got so unnecessary at some points I nearly blew my ears off. The discussions were interesting but very pretentious and the banter was oddly very elitist in how inaccessible it was. The privilege necessary to have that sort of banter was very WASPy and elitists and it was not endearing at all, AND I AM EUROPEAN. It was like hearing Gilmore Girls or Buffy in English, like I couldn’t believe people talk like this. Regardless the class is intensive but Nancy won’t fail you.\""
        ]
    },
    "COLT018": {
        "Amy Lawrence": [
            "review 1: \"08S with Amy Lawrence: This class could be great. COULD be great. We were shown videos/books/went to performances around Hanover and at Dartmouth etc. but the class lectures were 2 hours with no break in between and VERY VERY boring. Prof Lawrence had a diverse group of students in the class with strong, energetic personalities, but has no personality herself. I never looked forward to attending this class, grading was harsh, and Prof. Lawrence did not get to know her students well. It would be a wonderful class if it were taught by another prof. with some energy. The material covered was central to the ideas of gender/race in dance. There were 4 or 5 papers and a final presentation.\""
        ]
    },
    "COLT010": {
        "Jeffrey Santa": [
            "review 1: \"07F with Jeffrey Santa: Some of the course material wasn't particularly interesting, especially the theoretical secondary readings, but I suppose those readings are just a natural part of introductory comparative literature courses. Some of the novels are quite enjoyable and the class discussion, provided that you're prepared, is enjoyable. The posted questions and projects were a good way of wrapping things up. Prof. Santa Ana is also great during office hours and he is always accessible.\"",
            "review 2: \"07F with Jeffrey Santa: Professor Santa Ana is a very accessible and nice professor. Class discussions weren't always terribly stimulating, but he was great to talk to outside of class. The books were very interesting, but the class did involve a lot of work. Fortunately, Professor Santa Ana was very approachable and amenable to altering the syllabus according to needs of the students in the class.\"",
            "review 3: \"07F with Jeffrey Santa: I *really* enjoyed this class; although not hugely intellectual (prob due to my comments), it was relaxing and fun. Professor Santa Ana conducts class like a book club and was great in incorporating everyone's opinions. The readings were well chosen and fun to read. I am glad I had the chance to read them because I otherwise would have never even picked them up/heard of them. The secondary readings were sometimes dull though; luckily Professor Santa Ana revised the syllabus and took a lot of them out. The films were great as well. Professor Santa Ana is really really nice and approachable. I couldn't use his office hours, but he was always willing to help over blitz (he blitzed me a huge long e-mail at 3 am once). He is also a genuinely nice and caring guy. Great class! I recommend it. :)\"",
            "review 4: \"07F with Jeffrey Santa: This class was great--the novels were really interesting and the films were awesome. Professor Santa Ana was really nice about making some secondary reading optional, which helped with the workload. This course requires a lot of time to be put into the readings, but it's worth it. Always attend class, because in-class discussion is crucial for close analysis, which you'll need for papers/oral presentation. And definitely visit the professor during his office hours--he's really nice and welcoming, and can also help you with your assignments. And he's just a nice person to talk with and get to know better.\"",
            "review 5: \"07F with Jeffrey Santa: This is my favorite class I've taken at Dartmouth so far, and it made me decide to be a comp lit major. Santa Ana is both a great lecturer and facilitator of discussion, and as silly as it sounds, I left every class feeling like I had gotten smarter. Class discussions were intense and thought-provoking, and the environment was such that it was easy to participate. For the most part, the books we read were all awesome; I didn't feel like I was reading for a class. The workload really isn't that bad- there's a 10 minute presentation, a take-home midterm, a 5-page paper, and an 8-page final paper. Santa Ana ended up cutting back on secondary readings so the workload wasn't as time-consuming and we could focus on the primary readings. Take this class, you really won't regret it!!\""
        ],
        "Irene Kacandes": [
            "review 1: \"06W with Irene Kacandes: kacandes is a tough prof, but she knows what she is doing and led a good class. i really liked this course overall...if you like to read, you probably will too. good class discussion and good materials\"",
            "review 2: \"06W with Irene Kacandes: You read great books and great poetry and this course exposes you to a breadth of literature that you should not leave college without some familiarity with.\"",
            "review 3: \"06W with Irene Kacandes: Irene Kacandes is a prof who does not foster creativity or any original intellectual thought. Her lectures were mundane and uninspiring and her conservative approach to literature made for a class that peaked in the course description. The texts read in class were absolutely amazing- the execution of the class is truly a shame. Kacandes's excessive and bizarre affinity for 'paratext exercises' was suffocating, and supplanted any meaningful discussion on texts such as Joyce's Ulysses or Derek Walcott's Omeros. Overall, go for the class, but avoid this prof!!\"",
            "review 4: \"06W with Irene Kacandes: Prof. Kacandes didn't go over the readings well simply because there was too much reading for the alotted class time. While it would be difficult to imagine the course without one of the readings, it would have definitely been more helpful to have a more comprehensive review of the books. We were mostly assumed to have done our assigned readings and couldn't really gauge what we needed to know for the course.\"",
            "review 5: \"06W with Irene Kacandes: Irene Kacandes is actually the worst professor I've had at Dartmouth. This class will haunt me for years to come. Rather than reading and discussing James Joyce as a class, we spent most classes discussing the colors on the covers of the books. This might sound like an easy A, but Kacandes is incredibly fickle and has no idea what she's actually doing. Take a class with her, and you'll hear more about how she went to Harvard than you will about the material. I'm telling you- Irene Kacandes is the worst thing that ever happened to me at Dartmouth. And don't try to talk to her about it if you have similar problems- she'll tell you you're doing fine during office hours, and when someone else knocks at the door, she'll be angry you didn't coordinate your time better so you both could have met with her at the same time. This is not a professor who likes students. Avoid Kacandes.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"06S with Ulrike Rainer: The idea for the course was centered around Orpheus and works that are about people who make those works, like poems about poets and movies about movie makers. The class seemed very large but there was still room for class discussions and it was interesting to be assigned to watch movies. There isn't too much work for the class, one paper, one midterm, and one final paper. There were readings for each class and we were supposed to keep a reading journal. I enjoyed the class but am not sure if I could necessarily recomend the class to other people since the topics and professors change every term.\"",
            "review 2: \"06S with Ulrike Rainer: Professor Rainer is such a nice person, it makes it impossible not to like her course. She gave interesting readings, informative lectures, and still managed to deliver the information with a touch of sweetness that I believe is sometimes lacking in some professors, many of which believe that being nice is irrelevant to teaching well. The reading never takes too long, and Prof Rainer always asks if the length was appropriate. (To be fair, everyone always said yes, and I have wonder what she would have done if someone had said it was too long.) The papers and take-home midterm of essays were all very manageable. The first paper she even took step by step, teaching the process she wanted the student to take with the prompt, and she followed up with a meeting afterward on the student's perfomance on the paper,in the class, and anything else the student may wish to discuss. Overall, Comp Lit 10 was an excellent class, especially for a freshman who is still adjusting to Dartmouth's decidedly gruff academic atmosphere.\"",
            "review 3: \"06S with Ulrike Rainer: The reading was interesting... But Prof Rainer, as nice as she is, seems to just point out the obvious and leaves too much to student discussion. Sometimes the reading was a lot, sometimes only a little, but always the lectures were class discussions with only some good information to be found. Still, she is a very nice Prof who grades extremely nicely, and was very responsive to students in class. It's a prereq for the major in complit, so if you HAVE to take this class, it really isn't that bad, it's just not very intellectually stimulating (yes, sounds dorky but it's true). The movies were really good though, even though it's hard to watch them online. Overall, not bad but not amazing, but definitely a smooth ride.\"",
            "review 4: \"06S with Ulrike Rainer: this class was a complete joke. nobody took it seriously. there is basically no work and you don't have to do any of the readings, which is a shame because the books on the syllabus are actually really good (although you probably read them in high school). unfortunately our discussions of these books were idiotic. she's a nice lady and the class was so easy (median was an A) but sitting through class was absolutely unbearable. i've heard this class is actually challenging and interesting with other profs. i do not recommend taking it with rainer\""
        ],
        "Ayo Coly": [
            "review 1: \"04F with Ayo Coly: This was a worthwhile class. Good books, not too much work. The prof was also helpful\"",
            "review 2: \"04F with Ayo Coly: Professor Coly is a great teacher and promotes very interesting discussions. Bein Senegalese she has a very interesting perspective on the readings and keeps the class interesting. The books are also definately worth reading\"",
            "review 3: \"04F with Ayo Coly: Prof Coly was the most energetic teacher i'd ever had. She was truly intrested in the subject and the students, and she is what made this class great. I don't know if this would be such an amazing class of Prof Coly was not teaching it.\"",
            "review 4: \"04F with Ayo Coly: I cannot more highly reccomend Ayo Coly. She definitely made the topic seem interesting, with our comprehensive in-class discussions and her occasional lecture. The class felt more like an exploration of the topic, rather than following a set curriculum. We were allowed to draw our own conclusions from the material, and present our viewpoints and get good feedback. This made class a lot better for me. We didn't do very many papers (about 5 or 6 I think?), and the average grades were fairly high, so if you pay attention, show up and do your work, you should be able to get an easy A. It also fulfilled the new \"CI\" requirement, which was why I primarily joined. I discovered, however, that the class was a lot more fun and interesting than I had ever expected. I feel like I learned a lot from this course. I'd love to get another class under Coly, if I can spare the course. Take classes from her!\""
        ],
        "Keala Jewell": [
            "review 1: \"03F with Keala Jewell: Not bad.\"",
            "review 2: \"03F with Keala Jewell: I saw the description of this course and was immediately hooked, since gothic literature is something I've always been interested in. Plus, a class about monsters seemed pretty cool. What I got, however, was very little worth doing; the books we read were wonderful and I thoroughly enjoyed them, but the time spent in class discussion them was a waste and a bore. Prof. Jewell tries to be likeable but ends up being rather boring. The papers were all open ended, which was very difficult for me to do since I took this class during my freshman fall and had never written a college paper before. Prof. Jewell offered very little guidance on this subject. Having a writing assistant was extremely helpful, however. The course was supposed to be the introductory Comparative Literature course, but I'm still clueless as to what the study of comparative literature actually entails. Overall, not a difficult class by any means, but not very interesting either.\"",
            "review 3: \"03F with Keala Jewell: Know that if I were grading this course solely on the merit of its academic material, it would have scored much higher. Though I was disappointed we never read 'Dracula,' I understand that a ten week term has its limits, and the course covered a wide variety of other Gothic literature, including several books like 'Frankenstein' and 'Dr. Jekyll and Mr. Hyde' which ought to be read by everybody anyway. Unfortunately, gleaning knowledge and insight from the text is, by and large, left to the students--Professor Jewell never really seemed to have a very keen grasp on what she wanted to cover in the lectures, and would often go off onto tangents. The worst part by far, however, was the fact that Prof. Jewell constantly tried to get the class to read feminist overtones into the text. Admittedly, there is gender imagery in the Gothic--but forcing the entire class to see a lecture entitled 'Penile Procedure: Police, Detection, and Sexual Violence in the Cinema of Dario Argento' really amounted to more a waste of time than an academic excursion. Ultimately, if you like interpreting literature, you'll get something out of the course--just don't expect Professor Jewell to help you very much.\"",
            "review 4: \"03F with Keala Jewell: This course had huge potential. The reading was good but Prof. Jewell just wasnt the right prof to be teaching the material. She is a language prof at heart and didnt do a great job with this class. The only plus was that she showed some great, crazy Daria Argento films which broke up classes nicely.\""
        ],
        "Alina Sokol": [
            "review 1: \"05F with Alina Sokol: Great course overall. The professor is extremely passionate about the subject and presented an eye-opening, critical view of literature. The readings and paper topics could be random, but if you buy into it, the course will be rewarding.\"",
            "review 2: \"05F with Alina Sokol: Prof Sokol promoted a tremendous amount of group discussion each class, and even through blitz outside of class. There was a wide variety of literature, ranging from Sophocles to 2 Nobel Prize winners from the past 5 years. Everything read was a foreign translation, adding an interesting twist to discussions, as well as offering persepectives on lots of diverse types of literature. Prof Sokol is a very demanding grader who challenges anything you say, forcing you to prove and think through any points that you make. This was good for inspiring thought, but sometimes was a bit overwhelming.\"",
            "review 3: \"05F with Alina Sokol: it can be tough, but it was fascinating material.\"",
            "review 4: \"05F with Alina Sokol: Sokol is young and extremely energetic. Her entusiasm for the books we read was palpable. What really made this class, though, was the discussion. We read books cronologically spanning from Sophocles to Jelinek (2004 Nobel Prize winner). The greatest thing I got from this course, in addition to discussions that really made me think differently about the triad: author, reader, text, was the writing. I felt like Sokol's high demanding attitude pushed me to become a much better writer. This is a great class. I would recomend it to anyone who is interested in literature and wants to become a better writer.\""
        ],
        "Laurence J.": [
            "review 1: \"05S with Laurence J.: Readings from Plato to Achebe to Dinesen and many others in between. Looking at the syllabus, one wonders how it all ties together, but Prof. Davies manages to do it. Lectures are nice in that you don't just get together and summarize the readings, you deal with the issues the reading raise. However, it does make note-taking difficult. It's not a problem though as ling as you pay attention. Definitely a fun class.\"",
            "review 2: \"05S with Laurence J.: Excellent course, fuddy-duddy but 1000% lovable and expert professor. What more could you ask for? PS: This review may not help much because Dr. Davies is leaving after the 2005 Spring Semester, but does provide perpsective on future Introductory Comparative Literature courses.\"",
            "review 3: \"04S with Laurence J.: I liked this class, I didn't really \"learn\" a lot but the readings and discussion were usually fun and it wasn't too much work\""
        ],
        "Dennis Washburn": [
            "review 1: \"06F with Dennis Washburn: Prof. Washburn is simply the best. He is very passionate and yet very objective and analytical of the material. He inspires a lot of interest in the material, which by itself is pretty fun, and makes you want to read/view everything to discuss it in class afterwards. The entire class is a discussion which I like since you can see multiple perspectives, and prof.Washburns agrees and disagrees, but even when he disagrees he finds a point in the argument so that he can understand the connection to the text. I find this intellectual flexibility very important in a literature course, and not many professors have this open and objective way of teaching. He is always available to students and flexible with deadlines, which always helps. The class can be overwhelming in the first half, since he puts all the secondary readings on the syllabus then. The other half is rather lay-back, and consist much more of movies. Students are required to watch a movie for every class, and he gives special attention to movies, sometimes taking the entire class on the movies and neglecting some of the texts. He does take everything into consideration when doing the final analysis and connects everything he assigns, although sometimes vaguely. Going to office hours can help when trying to come up with an idea for a paper. Definitely a great prof! Must take a colt class with him if you are not into Japanese!\"",
            "review 2: \"06F with Dennis Washburn: Dennis Washburn is a great teacher. He cares about the subject and his students in a way that makes them care in return. The class changed my perspectives about the genre of horror but was critical in a way that can be applicable to any other genre. Do the readings - they are placed at the beginning of the term, but they immensely help you understand the different theories of horror that will pervade the entire course. Check out the Baker horror section for great books and resources for your papers. The research takes a little time but it will help you form a solid thesis and outline for your work. This is the type of class they tell you you should take in college - entirely random, really interesting, and something you end up being thankful you took.\"",
            "review 3: \"06F with Dennis Washburn: Washburn is an amazing professor and he made the small seminar-like class so much fun. The discussions were lively and always interesting. He was always available to meet and was very cool about extentions. He graded papers fairly leniently. Overall amazing topic, even greater prof\""
        ],
        "Katharine Conley": [
            "review 1: \"03W with Katharine Conley: Prof. Conley is a friendly woman and excellent teacher. She's inspired by Surrealism and made the readings all the more interesting with her inside knowledge. Many of the texts were dense and nearly impossible to understand (esp. the automatic writings), but Conley made them more accessible with her lectures. This class is a great way to learn more deeply about Surrealism, past the paintings of Dali and Magritte. The professor is wonderful and the workload is more than reasonable: two 3-5 page papers and one 7-10 page paper.\"",
            "review 2: \"03W with Katharine Conley: Prof. Conley loves this subject matter. She is very well versed in all aspects of it, from the writing to the painting. In lectures and readings, she ties the overall themes of surrealism, the lives of the artisits, and their work together seamlessly. This is a really interesting and inspiring class that opens up your eyes to a movement that is often hard to understand.\""
        ],
        "Michelle Warren": [
            "review 1: \"09S with Michelle Warren: This was a very interesting class and very manageable workload. It was a very good mixture of theory and primary texts. Professor Warren is great. I would recommend taking this class.\"",
            "review 2: \"08F with Michelle Warren: I signed up for this class because of the title and was really surprised at how much I liked it. It was a lot of work - I NROed the class, but Professor Warren has this incredible skill of subtly guilting you into doing all the reading in order to avoid being embarrassed if called upon, so I ended up not feeling like I could slack off. But the class was engaging and Professor Warren as a teacher was great, enthusiastic and understanding. The material was all really interesting. Even reading Romeo and Juliet for the trillionth time felt new.\""
        ],
        "Manuele Gragnolati": [
            "review 1: \"02W with Manuele Gragnolati: This was one of my favorite classes at Dartmouth so far. With a hilarious, yet knowledgeable prof., every class is a joy. We read great historical texts throughout the greek, roman, and western tradition. The lectures were interesting, and the papers were good. Meeting with the ta to discuss your first paper is required and extremely helpful. I enjoy literature of all sorts, so I thoroughly loved this class. Manuele is a good professor who makes helpful comments on papers and excites you in this subject. I would absolutely take this class again.\"",
            "review 2: \"02W with Manuele Gragnolati: You should read in your life to really consider yourself educated. Manuele was also a great professor, although I think he was visiting, and might not be back. The readings are great if you're into the foundations of literature (think Greek), and the papers make you think and are interesting. A great way to get a start in Comparative Literature, without a doubt.\""
        ],
        "Rebecca Biron": [
            "review 1: \"08W with Rebecca Biron: The class was interesting, but Prof Biron was simply amazing. She really knows her stuff and shows a passion for her subject that she actually manages to share with her students! Although the assignments seem intimidating at first and there was a ton of reading, Prof Biron is a fair grader and always helpful! Take a class with her!!!\"",
            "review 2: \"08W with Rebecca Biron: Professor Biron is great and the authors in this course make the readings very, very fun and easy to get through. The Frida diary was really random and should not have been included, but other than that, it was an easy class that was quite fun.\""
        ],
        "Gerd Gemunden": [
            "review 1: \"02F with Gerd Gemunden: Interesting reading- papers are usually open topic so you can just read what interests you and write on that. Good class overall.\""
        ],
        "Lawrence Kritzman": [
            "review 1: \"09W with Lawrence Kritzman: This was an awesome course. We started with some of the canonical perspectives on friendship - Aristotle, Cicero, Montaigne, read a bit of Derrida, then moved onto plays - Shakespeare, Wilson & Beckett, movies - Truffaut & Almodovar, & novels - Morrison, Puig & Auster. Class is a mixture of lecture and discussion, and though Kritzman often went pretty far off topics, the discussions were always interesting. Work-wise, there was a midterm (basically an in-class essay with an assigned topic given a few days beforehand), two 4-5 page papers, and a final 8-10 page paper - very manageable. Kritzman is very interested in getting to know each of us his students, and is very enthusiastic about all of the material. I'd recommend this for anyone interested in taking something a little different.\""
        ]
    },
    "COLT010.15": {
        "Jung Ja Choi": []
    },
    "COLT010.11": {
        "Lawrence Kritzman": []
    },
    "COLT007": {
        "Annabelle Cone": [
            "review 1: \"05F with Annabelle Cone: This class was a very individualized experience, totally cerebral and complex and different. Now I see the significance of the family EVERYWHERE, i have gone over my own thoughts in such isolation and detail for the papers that i really worked through and came to terms with some great concepts and reacted strongly to the readings... this professor is great in helping you find your own strong assertions and defending them, she challenges your articulation and you find your writing improving rapidly and without warning.\"",
            "review 2: \"05F with Annabelle Cone: The subject material was great and very interesting, but Professor Cone seems to express and advocate strong feminist biases - at times she seemed to tell us that our opinions were just wrong. She was very scattered and disorganized. Also, the papers were unnecessarily long and I found myself struggling just to fill space at times. Saying that, Professor Cone was fairly flexible and approachable; she really tried to help us and is a very nice person.\"",
            "review 3: \"05F with Annabelle Cone: This class was not very hard. Prof Cone tried to plan out discussion topics, but we usually just ended up talking about random things that didn't really relate to the readings during class. There are only three papers, and the final paper you can basically write about anything you want.\"",
            "review 4: \"05F with Annabelle Cone: Class was really easy. You didnt really have to do any of the readings because your assignments (3 papers) have nothing to do with the majority of the readings. We watched some interesting movies. You can write your papers on really interesting topics (Sex and the City, movies, etc). She gives you a lot of freedom with your paper topic. The professor is really disorganized with where each class goes....usually turns into really random discussions that don't really have to do with anything.\"",
            "review 5: \"03F with Annabelle Cone: This class is not that bad, it's actually very easy, compared to other freshman seminars. The unfortunate thing was that I wish I had taken a more challenging seminar. It did get harder towards the end. Professor Cone is a very nice lady, but her choice of reading material was unfortunate. At best, it was boring, and I had never heard of most of it. Many class periods I felt were wasted talking about unrelated topics, too. I had hoped in taking a lit class I would read actual literature, but I really only feel I read one book that should be taught at the college level. Basically, take this if you want an easier seminar. The papers are graded very easily\"",
            "review 6: \"03F with Annabelle Cone: This course quickly became the bane of my existance during the fall. I went into the course thinking that it would focus on Hemmingway, Fitzgerald, McAlmon and other expatriates who for the most part traveled to Europe. Instead, we read about Forster's travels in India (somewhat entertaining), Chatwin in Australia (the epitome of inane ramblings), and some broad named Flora Tristan traveling to Peru in the 18th Century (made me want to stick needles in my eyes). The secondary readings brought up minimally interesting points which the class attempted in vain to discuss. Everytime one person would start to bring up a worthwhile point, Professor Cone would cut him or her off and move onto another topic. After the first or second class meeting, the discussions lost all focus, highlighting only what the professor wanted to hear or say. Oftentimes, this meant focusing only on female travel and why it was more important than life itself. To that end, she spoke ad nauseum about her own travel experiences and those of her European husband. During the discussions, she heavily favored the girls in the class, particularly anyone who had experiece traveling in Western Europe. Early on in the course, we all realized that the papers assigned were not meant to allow us to give our own interpretations of the readings, but rather an exercise in expressing Professor Cone's viewpoints and ideas. While she rarely gave out any grade below a B on a paper (one of the saving graces of this class), those who wrote papers in agreement with her consistently received higher grades than those who made arguments than ran counter to hers. I got back one paper with a comment that essentially said, \"This is well written, strongly argued, etc. But I don't agree. B+\" While I had no issues with the grade, the reasoning was so upsetting as to drive me to play pong at 3 PM, and not stop for the next nine hours. In another student's final paper, Prof. Cone returned comments suggested that he add in several paragraphs about female travelers, just for good measure. While it would not have taken any herculean effort to conform to her views and get my A- instead of a B+, the mental anguish of bending to the feminist ideals of an eccentric professor was too much for me, and I instead concentrated my efforts on expressing opinions exactly opposite of hers. Fortunately, most of my classmates felt exactly the same way. If we could not wallow in our collective misery together, I doubt that anyone would have made it through the class sane.\"",
            "review 7: \"03F with Annabelle Cone: it's fine.\"",
            "review 8: \"03F with Annabelle Cone: There were times in this course that I really, seriously would rather shoot myself than be in class. This class has an awesome premise: just imagine a class about travel, exploring different ideas about it, and reading different perspectives. Now forget that idea altogether. Because what you see in the ORC or Seminar Booklet is NOT NOT NOT what you get. The course is EXTREMELY frustrating. FRUSTRATING is not even the perfect word for it. I don't know where to begin. Let me preface this by saying that I know a lot of classmates agree with me. A large number of us have 3 am or 4 am blitzes (and blitzes venting about this class from the rest of the days and nights, too, but the really firey ones happened around this time of night) in our \"Sent Mail\" boxes that are chock-full of expletives and serve as proof that we hated this class, with a burning passion. fu On that note, I must also say that Professor Cone is an amazing person. She is extremely nice and is helpful in general. Don't get me wrong. However, the Prof. tends to be very passively aggressive. I don't ever remember a time in class when the discussion was not explicitly controlled by her. If we were just about to hit a point that she didn't agree with, she cut the conversation short. Essays were chock-full of the comments \"I don't agree with you that [insert concept you were asserting here],\" and your grade would suffer because she just didn't agree with you. She is very strong-minded. No amount of evidence or support that you give your claim can please her. This class is effectively a training camp in How To Think Like Prof. Cone. You will get \"whipped\" (rather, your grade will) if you don't begin to think like her. That is sad, because frosh seminars are supposed to build critical thinking skills and foster discussion among students. None of this happened. We all came out being drones of Prof. Cone: we now think the way she does, and we only discussed what she liked (open atmosphere?...yeah right!). This seminar totally missed the point of what a seminar is supposed to be, save the small class size. The reading was, honestly, boring. I know Prof. Cone teaches French, and she must think that anything and everything French is exciting. Unfortunately, most of us don't. The French culture (of which there is none, in my opinion, compared to cultures studied in Spanish cultures, but that's a whole different issue) is known for its haughtiness, and the French reading reflected this. Have you ever tried reading the travel journal of a stuck-up, self-righteous French hag, in this case, Flora Tristan? If you haven't put yourself through this royal torture, DON'T. There was only one student in our class who seemed marginally interested in the goings-on, as she had been to France, etc. The class was also very India-centric, as we spent time on \"Passage to India\" and \"Interpreter of Maladies.\" Fair enough, though, because we were warned of that in the ORC/Seminar Booklet description. Most of the reading was POINTLESS. For example, the syllabus clearly stated that for our fourth paper, we would be writing an essay on either \"Passage to India,\" \"Interpreter of Maladies,\" or \"The Songlines.\" (Don't get me started on \"The Songlines\"--it's yet another criminally boring book.) The thing is, everyone in the class was quick to realize that there was no point in reading all three, since we'd only be so most people only read the one they were going to write on at the conclusion of the three weeks (we wasted one week on each piece of literature I just named). The discussion in class is something I've already touched on. But to put it lightly, you could discuss your heart out without reading a word of the reading assignments, SERIOUSLY! I already talked about the essay grading -- it was arbitrary and we all ended up giving her what she wanted in the essays, in order to maximize our grades, and we never once got to express our OWN ideas. Sad for a seminar. This class really has no purpose. Its theme is travel, but what about travel? We never really came to any closure or major revelation about travel, as I was really hoping to do so by taking this class. And the major positive: we got off majorly EASY on the seminar requirement. My roomate and others on my floor took seminars in which they were writing 12-page papers complete with citations starting in early October. The only paper we had to do research for was the final one, which we didn't even touch until the last week of November/December. All the others were 3-5 pagers with no extra research. We had it a lot easier than most other seminars. In that sense, I enjoyed this class because I fulfilled the seminar requirement for my degree with less effort tha0n 99% of freshmen. The travel journal, before I forget, was another utterly useless assignment. It had no bearing in our grades, so there was no point in doing it. Everyone did their travel journal the night before she wanted it--I have blitzes in my blitz account to prove it. It was a waste of time, and frankly, I could've used the time I wasted on the travel journal during Thanksgiving to kick back and relax. My last bone of contention with this class is the way essays were done. Yes, they were short and required no research, but they had no prompt. The writing prompts she gave us were so open-ended it was utterly ridiculous. You could've seriously written about ANYTHING, as long as you tied in anything from the reader (she was big on making tie-ins to the reader, for some reason or another). Even the final paper was a big joke -- there was ZERO sense of direction to the prompt (who on this Earth would consider \"Americans abroad\" as a prompt anyway?) and none of us had any idea what we were doing...on any paper. If I got $1 for EVERY time I got a blitz from a classmate the night before we had ANY writing assignment saying \"Does anyone know what we're supposed to do here? I'm lost,\" then I would be a MILLIONAIRE today, seriously. On the flip side, I made some awesome friends in this class. We went through the torture together, some of us have really bonded. Prof. Cone has great intentions with this class. She is a great person. It's just a terrible, terrible case of great idea, awful execution! If you want an easy yet frustrating way to fulfill your seminar requirement for your degree, take this class. But beware...\"",
            "review 9: \"03F with Annabelle Cone: the class wasn't too bad. from what i hear, its a lot less work than most other seminars. she played favorites a little. overall, im glad i ended up in this seminar, though it was far from perfect.\"",
            "review 10: \"03F with Annabelle Cone: Definitely not what i expected. One saving grace was that grading was lenient.\"",
            "review 11: \"02W with Annabelle Cone: I enjoyed the course for the most part. It was not what I expected but I enjoyed it still.\"",
            "review 12: \"02W with Annabelle Cone: Since we have to take a freshman seminar, you should really pick one with a good teacher not necessarily an interesting topic. In the case of this class, the course description had nothing to do with the actual class. The prof, while somewhat interesting and helpful, is not an english teacher and constantly forces her views about the oppression/plight of women on the students during lectures. She is very nice, but the class focused much more on women studies then on the city. Some of the readings were very interesting and the papers and grades were fair, but class discussion was frustrating at times.\"",
            "review 13: \"02F with Annabelle Cone: I enjoyed the subject of this class, though the seminar hardly matched its ORC description. The material was definitely not what I had hoped or expected, rather than being good novels or travel writing; it was more or less reading stuffy articles by pretentious people about the history of travel. Not to mention the fact that the articles rarely had any relevence to the literature we read. Additionally, I felt the prof imposed her feminist views too often, which was annoying. While the discussion was good I think that was due to the makeup of an exciting class. The class wasn't horrible, but just definitely a big let-down.\"",
            "review 14: \"02F with Annabelle Cone: Prof Cone is a perfectly nice person, and a good writer, but her main focus is in the French language. Thus, a lot of the authors we read, suggestions she made for researching our papers and even words used in class were French. There was little direction in the class; however, that may have been a function of the lack of course structure, as this was the first time this course was run. An ok time, and the readings were good, but not what it was made out to be.\"",
            "review 15: \"02F with Annabelle Cone: This class was pretty fun and entertaining, but if it had been different people in the class it could have been pretty worthless. It reminded me a lot of a highschool class in that the students didn't listen to the teacher. It was pretty much a class of tangents mediated occasionally by our syllabus. If you like to talk a lot though it's not bad.\"",
            "review 16: \"02F with Annabelle Cone: I was excited about this class going into it - on paper, it sounded terrific. Reality proved to be a let-down. Our shorter assigned readings were generally dry, pretentious, snobby-sounding. The four books were more entertaining, particularly those of Chatwin and Gauguin. I have heard that Prof. Cone is an excellent French teacher, but she had great difficulty guiding meaningful class discussions - she stepped back, made comments about how happy she was that we were so talkative, only to obtrusively cut in and impose her views. Several of her comments were shockingly impolite and misguided, not things a professor should say, particularly not in a first-year seminar, when freshman should be encouraged to share their views. Because of this, I often left classes feeling misunderstood and insulted. My fellow students were very friendly and had great stories to share, and I enjoyed our small group activities done outside of class. Though I dreaded discussions due to the presence of Prof. Cone, I must say the class was a learning experience - I came into contact with people unlike any I've ever known, and that in itself has value.\"",
            "review 17: \"02F with Annabelle Cone: The course had a lot of potential. The idea of studying travel literature was fascinating. However, class discussions, though sometimes fun and interesting, veered away from subjects and the Prof frequently cut them off just when they were beginning to be productive. Comments on papers were pretty unhelpful, and made it difficult to improve writing, which is especially a problem because her grading was rather ambiguous, and she gave little explanation for the erratic grades on papers. She did not allow rewrites. A prof that definitely plays favorites (mostly with girls).\""
        ],
        "Richard": [
            "review 1: \"07S with Richard: If you believe that the professor's perspective is the best one that could possibly exist, this course is the perfect one for you. Prof.Stamelman had wonderful ideas, but was not willing to accept the good ideas of his students unless they matched his own. I find this sad. However, I did learn a lot in the class and enjoyed it. I guess this is what a typical professor is like...\"",
            "review 2: \"07S with Richard: It seems like a lot of work first but it is totally manageable and not too bad at all. I just expected a little more from this class but Prof. Stamelman is a wonderful professor.\"",
            "review 3: \"07S with Richard: I really enjoyed this class. The material is interesting, and the readings add to the class. Professor Stamelman is a cute old man, and he can do no harm. Some people struggled with the papers, but for others, they were easy, so the course was not very much work. The papers follow the course outline very closely, so if you pay attention in class, you can use your notes to write the papers and they will turn out fine.\"",
            "review 4: \"07F with Richard: Professor Stamelman's class was about European Modernism, which quickly became quite clear when he admitted his title was rather sensationalist. With a reading list of Woolf, Proust, Freud, Kafka, Plath, and more, this was just not a subject I was interested in. He was pretty good in terms of helping me with my writing, but writing papers was difficult because I didn't understand a fair amount of the material. However, your paper grades will be significantly higher if you take him a rough draft or outline in office hours. You probably won't like all of his suggestions (he's one of those professors who twists your words to say whatever he actually agrees with), but at least he'll know you did multiple drafts and planned ahead. Not bad or particularly time consuming, but not something I would continue studying.\"",
            "review 5: \"07F with Richard: Most class days had far more reading than was covered in class. Completing the reading would take as much as 5+ hours per class fairly often. Most books were covered in 5-15 minutes in class, while some (which then became essay topics) got most or all of a class period (or several). If you really like reading European Modernism, go for it. But if you're looking for lectures or any kind of instruction, try a different class.\"",
            "review 6: \"07F with Richard: The readings were great, and the essays were graded fairly easily. The course didn't quite match its title... sex was mostly gender, and some of the more \"mature\" topics were sidestepped a bit: hard to tell, however, if this was entirely the fault of the prof., or if the students didn't pursue the topics. Again, the readings were excellent - although I did pick the course because of its reading list, having had previous positive experiences with the genre (but, unfortunately, nothing which we read in class)\"",
            "review 7: \"07F with Richard: The readings were interesting and thought provoking. Professor Stamelman is really nice and pretty helpful with writing. The class itself wasn't particularly inspiring although I thought the readings were. For some reason discussions never really got lively in class. I would say take the class for the reader and the books alone.\""
        ],
        "Ayo Coly": [
            "review 1: \"11W with Ayo Coly: The readings and material for this class really changed my way of thinking. I honestly wish so many of my friends had read the books and had the discussions we did in this class. Colonial literature is fascinating, and the way it universally affects so many concepts of identity and culture is really powerful. Professor Coly is nice but pretty strict, she expects the best from her students. But honestly, the strictness is a nice change. Regardless, the topic for this class overshadows any shortcomings in Coly. My only grievance would be there were way too many readings per week, I recommend you never get behind because come paper time, she will expect you to be able to write about the readings, and I was behind and had to do tons of cram reading before the paper. In the end, definitely definitely take this class for the material. If you have a slight interest, it will really make you sit back and think in amazement.\"",
            "review 2: \"06W with Ayo Coly: This wasn't my first choice seminar class, but it ended up being quite enjoyable and interesting. Professor Coly is very interesting and inspires great discussion.\"",
            "review 3: \"06W with Ayo Coly: not too much work. lots of reading at times, but sometimes not any at all.\"",
            "review 4: \"06W with Ayo Coly: Prof is good. A lot of reading, but at least it's interesting.\"",
            "review 5: \"06W with Ayo Coly: the course is based on the theme of colonialism and post-colonialism; you will read many many interesting books.. the professor is good, attentive, and receptive to students; there are 4 papers throughout the course, on top of about 9 books to read.. if you're interested in the subject material, then definitely take this course, it's very worthwhile!\"",
            "review 6: \"06W with Ayo Coly: the material was interesting but more non-specific than i'd have liked. much of the reading is not directly focused on colonial and postcolonial discussions, and i felt like the subject of the class was sometimes forced. be prepared for a lot of reading. ayo is a very intelligent person. good prof. not the most friendly prof i've ever had, but she's very knowledgeable and makes class interesting.\""
        ],
        "Piers Armstrong": [
            "review 1: \"05S with Piers Armstrong: Professor Armstrong is incredibly long-winded. This made class really boring. But the papers we got to write were awesome. You can basically pick to write about whatever music you want and are interested in. I mean, I got to compare Britney Spears to the Rolling Stones. Where else can you do that?\"",
            "review 2: \"05S with Piers Armstrong: The essays you have to write are fairy easy and you pretty much get to write on what you want. I found the readings somewhat boring and dense/ difficult. The in-class time and the readings didn't help me with my papers, but they were interesting.\"",
            "review 3: \"05S with Piers Armstrong: I LOVED this course. It was so interesting and the work was just the right amount. Professor Armstrong brought up some great topics and he helped us discuss things we wanted to discuss. Sometimes he went on far a while talking about this and that...but you get used to it after the first couple classes. The material was awesome and the class was interesting.\""
        ],
        "Klaus Mladek": [
            "review 1: \"06F with Klaus Mladek: A really good class for a discussion-seeking freshman...student contributions based on prepared readings made up most of the classtime. 3 papers, 2 5 pagers and 10-pager term paper... Incredibly warm, nice prof, good discussion, interesting material. A great seminar pick.\"",
            "review 2: \"06F with Klaus Mladek: Of course Nietzsche Kafka and Freud are all fascinating and necessary writers to study, but Mladek truly brought them to life. Discussions, though dominated by certain individuals, were interesting and lively, and Mladek was responsive and effective as a lecturer. Despite his thick German accent and occassional lack of familiarity with certain English words, he speaks like an academic paper is always clear. Great freshman seminar.\""
        ],
        "Michael Wyatt": [
            "review 1: \"23S with Michael Wyatt: GLOBAL TRADITIONS OF PUPPETRY first year seminar: BIGGEST LAYUP EVER! take this class. we had weekly readings (which took about 15 mins each but you didnt have to do). in class we would either discuss the readings or watch puppet shows. There was 1 in class writing in week 2 which was graded for completion (750 words) and another similar to this but take home in week 3. We had two graded pieces of work, each 1500 words long (sooo short for a first year seminar). This was all the work for the whole term. One thing is that he never gave work back, never got a single graded piece of work (but there were pros to this too as he never told us to change anything). super easy and very light work. Take it with him!!\"",
            "review 2: \"23S with Michael Wyatt: He is a very nice professor and we barely had any work. We had 1 short, hand-written in-class essay on week 1, a short typed in-class essay on week 2, a midterm paper of your choice around week 5, and a final paper of your choice that included an in-class 15-minute presentation. The readings were very short and pretty easy. He never grades anything so you have no idea of how you are doing. I gotta say that this was one of the most disorganized classes I've taken at Dartmouth. He had 2 other classes to teach and it felt like our class wasn't really a priority. Personally, I didn't mind it because it meant that we barely had any work. If you are looking for a class that actually pushes you to become a better writer with quality feedback, take another class. If you are looking for a chill layup, take this class.\""
        ],
        "Virginia E.": [
            "review 1: \"05W with Virginia E.: if you like reading lame french books and poems and suffering through overly simple lectures, have fun with this one. the best part was watching one marx brothers film, which was pretty good. the rest of the class was fairly dull in terms of the material. i felt like i went backwards in terms of my writing. swain overly stressed topic sentences at the beginning of each paragraph and really stifled your writing. she had to approve your paper topic to what she liked. was not a fan of this class or prof.\"",
            "review 2: \"05W with Virginia E.: teacher wasnt good and the material was suspect. only good part was watching marx brothers movie. before that, class was not good. dont recommend it.\""
        ],
        "Annabelle Melzer": [
            "review 1: \"05W with Annabelle Melzer: this class really opened my eyes to the outside world of wars and war zones. i learned to be more aware of the world and war. professor winograd is very inspiring and has a wonderful approach to her teaching, making the students feel like she is talking to them one on one. if you want to gain more than your typical class, then take this class, you will gain much more than expected, guaranteed.\"",
            "review 2: \"05W with Annabelle Melzer: I had no idea I would find this so interesting! The paper assignments were the best I have ever had to do! The prof really knows what she is talking about, so she is wonderful to listen to, but it is very frustrating that she just talks and doesn't allow for conversation or questions. A great seminar because it covers a topic I would never had explored!\""
        ],
        "Dennis Washburn": [
            "review 1: \"09F with Dennis Washburn: This class does entail a lot of reading, which is a given since you use Murasaki Shikibu's \"The Tale of Genji\" (about 1,100 pages) as your main text, but the professor makes it all worth it. The readings are fairly heavy and take a lot of time and effort, but that's the bulk of the class. There were 3 short response papers and two research papers but the writing was bearable and manageable. Class lectures were a combination of discussions about the book and other topics and the professor's insights on the book. What makes this class really worth it is the professor. Professor Washburn was great, he is so responsive and caring about students, and at the same time he makes the class very interesting even if you (like me) never thought ancient Japanese literature would interest you. Washburn is a great professor--I would highly recommend any class taught by him!!\"",
            "review 2: \"09F with Dennis Washburn: Prof. Washburn is a brilliant scholar and teacher. I stress both aspects of him. The bulk of the course dealt with the 1,100 page novel, The Tale of Genji, which Prof. Washburn is retranslating from the Japanese. He has a clear passion for his subject which manifests itself everyday in class. In addition to his translation, Prof. Washburn seems to have come across every article or modern culture reference to Genji. Furthermore, Prof. Washburn managed to inspire a group of freshmen to jump into a dense text. He not only effectively lectured on especially confusing aspects of the text but encourage the students to build their own coherent discussions. Prof. Washburn was willing to talk about anything, be it Eminem or Victorian literature, in relation to the course theme. As a result, the students seemed to truly comprehend that Genji is truly a living text. There was a fair amount of writing involved in the class; however, the assignments were more stressful than the quantity thereof. The questions did not point in any direction. The students learned to critically approach a question and narrow their focus, an extremely vital skill.\""
        ],
        "John Kopper": [
            "review 1: \"05F with John Kopper: A so-so class with a so-so prof. Not a class you have to take, but definitely not one to be disappointed with if you get it. Can be boring at times. I wouldn't bother reading the books.\"",
            "review 2: \"05F with John Kopper: some of the readings were great, others were horrible. there was also an awesome (because it was badly done movie), listening to newscasts, etc - lots of different media. the prof was quirky and a little strange, but ok. don't avoid this class, it's easy and somewhat interesting.\""
        ],
        "Margaret J.": [
            "review 1: \"01F with Margaret J.: Prof Burland is very knowledgeable, understanding, and helpful with the writing process. She made a great effort to get to know us, and make the class an effective seminar, even though she had to haev major surgery during the class. Her comments on papers were helpful, and she was always willing to consider dissenting opinions. A great reading list which had a broad range, from Beowulf to de Troyes.\""
        ],
        "Joseph Aguado": [
            "review 1: \"11F with Joseph Aguado: Professor Aguado is very friendly, warm and welcoming. He is personally concerned with each of his students and makes the course material interesting and engaging to everyone.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"04S with Ulrike Rainer: I enjoyed this class. I had many friends who had not so great experiences with their freshman seminars. This one, however, was interesting and fairly easy. It was also fun to go back and read some fairy tales that I hadn't read since my childhood:)\""
        ],
        "Jessica Smolin": [
            "review 1: \"17W with Jessica Smolin: She is AWFUL. Do not take a class with Jessica Smolin. I took this class for my LIT distrib, but boy was it misery. Everybody hated the class. Before each class we had to write a paragraph response, and also 4 essays. She is A TERRIBLE teacher. I generally enjoy writing, but I'd go into office hours and she would offer absolutely no helpful advice. You'd ask for advice shaping yoru argument, and she'd be like, \"Go read the text more carefully.\" or like \"You need to read the text for deeper meaning.\" She was never ever helpful. I have a lot of friends in the class and everybody felt the same way. She doesn't know how to teach writing, and the essays were graded SO harshly. She was also passive aggressive in class. The readings were incredibly boring; nobody even cared and we had to do all this bullshit discussion about readings nobody cared about. One class she had us watch videos of a naked production of the bacchae. like, complete, full on, frontal male nudity. She would show us long videos of brazilian stuff and not bother to translate it, so everybody in the class who couldn't speak Portuguese was like ???? Overall, just a miserable, miserable class. Smolin was passive aggressive and annoying and just a terrible, terrible, teacher. 0/10.\""
        ]
    },
    "COLT001": {
        "Michelle Warren": [
            "review 1: \"23W with Michelle Warren: I luv dis class plz dont take it its my secret class where i luv it so so muchyyyyyyyyyyyyyyyyy! we luv panopticon and we luv colt\"",
            "review 2: \"23F with Michelle Warren: class is a HUGE layup—never had to do any of the readings and ended with an A. However, there are lots of small but tedious assignments and uses every x-hour. Overall, the class is just so strange, but if you are looking for a lay up that fulfills a lot of disturbs this class is perfect.\"",
            "review 3: \"23F with Michelle Warren: Is this class a layup? I guess so, but in the most annoying way possible. The grading scheme, at first glance, really isn't too bad: 20% of your grade are Canvas responses which are graded for completion. 20% of your grade are \"Projects\", which is basically also graded for completion. 10% of your grade is this group presentation that is graded on a point scale, but is pretty easy to do. 35% of your grade are 4 short 500-1000 word essays (one every 2 weeks) where you write about a difficulty you encountered on one of the readings in the past two weeks. Prof. Warren grades these seriously, but you should be fine so long as you make sure to mention a few keywords she mentioned in class (make sure to check the slideshows she posts after class); also maybe even mention an activity done in class. So far, not too bad. However, the last 15% of your grade is a 3 hour final exam where you have to support / counter / quantify 4 different propositions (so essentially 4 mini essays!!) using only (and I mean only) quotes from various readings in the year. I literally wrote more on this final exam than the other 4 short essays combined---not a fun experience. And Prof. Warren won't even hand back what you got on the final exam. This is why I think the stated grade breakdown is actually useless---I suspect Prof. Warren doesn't actually grade the final exams, and instead just assigns your final grade based on a vibe check; I know several people who had >99% before the final exam, only to not end up with an A. (It's possible they just tanked the final, but annoying as that final was, I personally doubt it.) I also don't even think the median in this class is going to be an A moving forward---be warned. But really, the most annoying part of this class is that this class uses every X-Hour and attendance is mandatory and tracked (I think attendance is where Prof. Warren's vibe check partially comes into play.) And going to class is truly mind-numbing stuff---watching people put chairs onto tables for god knows why, or \"playing out the rhythm of the writing,\" or whatever postmodernist BS the week is flavored. TL:DR, COLT 001 is a layup so long as Prof. Warren likes you and you're willing to feel your brain rot each time you step foot into the class. P.S.: freshman have priority for this course and only 10 slots are available for non-freshman, so good luck getting in. P.P.S: There are a lot of readings but you don't have to do any of them, just make sure you can BS them well enough such that you leave a good impression to your TA/LF/Prof. Warren.\"",
            "review 4: \"22F with Michelle Warren: Mega layup. There are readings for each class, but you literally don’t have to do any of them. Uses every X-Hour and gets really boring towards the end, but worth it for the easy A. Generositu.\"",
            "review 5: \"22F with Michelle Warren: Honestly don’t know if i learned anything from this course. There were super interesting readings and concepts at times, but most weeks it was really boring. I took it as an athlete on season and honestly take it as a 3rd class. If you’re looking to get something out of the class, this one definitely isn’t it. Prof Warren was great though, and offered a lot of time if you need it (you won’t ever need it). The class was honestly very well organized and you learn exactly what Prof Warren wants from you, but you literally use every X hour and have so much busy (but easy) work.\"",
            "review 6: \"22F with Michelle Warren: Total layup. Hardly any work and you barely have to do any of the readings. The class itself is pretty weird and boring at times but you get used to it quickly.\"",
            "review 7: \"22F with Michelle Warren: The definition of a layup. Some busywork but if you put in the work, you'll get an A super easily. Also, generositu.\"",
            "review 8: \"21F with Michelle Warren: Prof. Warren is so fun. She is very high-energy. Her lectures are pure chaos and the discussions are not much better. The readings will confuse you and the following discussions will also confuse you. But that's ok because you're supposed to be confused! Ambiguity is kind of the goal? Like, the essays are literally just writing like 700 words about a \"difficulty,\" which is just something that you want to talk about more because you don't quite get it. If open-ended assignments aren't your thing, then you probably won't love the class; however, if you like a little freedom in assignments (which I do), it's absolutely amazing. She lets you revise stuff and gives extensions. The great part about the revisions is that they aren't actual revisions! You just respond to her comments on your essay and if she thinks you got her point, she increases your grade. Oh, all X hours are used--that might be upsetting for some people, but I found the class amusing enough that I didn't mind. Get comfortable with not knowing exactly what's happening and you'll be fine, Prof Warren isn't necessarily looking for a \"right\" answer. I wrote an essay arguing that words aren't real. Just let go and enjoy the ride.\"",
            "review 9: \"21F with Michelle Warren: It was easy, but besides that this course was not good. First of all THEY USED EVERY X-HOUR. Second, every class felt like a complete waste of time. Finally, the assignments were confusing and poorly explained. Overall, wasn't a huge fan of Prof. Warren for these reasons. The course felt poorly designed and executed and I don't feel like I really learned anything nor did my writing improve at all.\"",
            "review 10: \"21F with Michelle Warren: The other reviews are probably 25s who are not used to classes like this but I actually liked this class. Yeah the assignments could be vague but they were graded credit/no credit so who cares. 50% of our grade was credit/no credit. 30% from four short (500-700 words) papers. 10% final group presentation and 10% final exam (four short essay response questions). We used every x-hour, and every other Friday we had a guest lecturer. Sometimes readings could be dense but they were pretty interesting. Prof. Warren is super nice and really cares. Also has great distribs (INT or LIT, and CI). Overall, good class, take it as a third class.\"",
            "review 11: \"21F with Michelle Warren: There was a lot of busywork in this class and the assignments aren't clearly outlined. But if you put in the effort, then you will do well. The prof supports her students and gives lots of extra credit opportunities, which is good. Take it if you're looking for a layup and you're cool with doing a lot of busy work.\"",
            "review 12: \"21F with Michelle Warren: Unlike some other students, I didn't feel that the assignments were vague. Rather, there was a lot of room for personal interpretation of the assignments which made it so that I could focus on topics that were interesting to me rather than being told exactly what to do. The readings (there were readings for almost every class period) were sometimes pretty dense and difficult to get through, but some of them were quite interesting and manageable. The one thing that I did not like about this class was that in explaining these readings, Prof Warren sometimes got deep into super theoretical stuff that neither my classmates nor I were able to understand. I'm not a lit person but I found this class more than manageable. You can kind of put as much time into it as you want to.\"",
            "review 13: \"21F with Michelle Warren: Great and understanding Professor! The class will introduce you to texts about a variety of subjects but not go in deep about anything. About 20-40 pages of reading per class. Class is mainly discussing the readings, with a guest speaker about every other week. I personally enjoyed the class and the professor. Most grades are marked for complete/incomplete and the only graded assignments are the 4 papers (500-700 words), the final presentation, and the final exam (2-hour exam with 4 short writing prompts). Every x-hour is used. I would recommend this class to those wanting an easy class to start with for their fall term.\"",
            "review 14: \"21F with Michelle Warren: This class did not take very much time at all outside class and if you do the work that is assigned you are guaranteed a good grade. Also, some of the assigned short stories are extremely interesting. On the other hand, I don't think my writing improved much and I didn't feel super challenged by the assignments or course texts.\""
        ],
        "Dennis Washburn": [
            "review 1: \"20F with Dennis Washburn: This was an awesome class. The workload is not significant, and if you do all of the work and put in good effort, you are almost guaranteed to get a good grade. That being said, this was a genuinely enlightening class for me, and it leaves you looking at the world and the process of reading in a new light. It is the most impactful class I have taken so far at Dartmouth. Professor Washburn did an excellent job of managing remote learning, and although he did prefer everyone to keep their video on, his teaching was genuinely interactive and informative. There were breakout rooms which were heavily used, but those were even easier, and the online breakout rooms actually approximated what it would have felt like in-person. The weekly discussion boards were mostly organic and served as a good refresher on the week's subjects. Sometimes the guest-speakers seemed to drone on, but that was probably one class period worth every two weeks, and is attributable to the remote format. I genuinely recommend this class\"",
            "review 2: \"20F with Dennis Washburn: Great class. If you do the work, you will get an A. You can get by not doing all of the readings and paying close attention in class and making generic comments when called to speak.\"",
            "review 3: \"20F with Dennis Washburn: This class is a lot of work day to day if you do all the readings (~2-3 hrs/class) because we met four times a week. You get assigned a discussion group for the entire term and you spend parts of class talking with others in your group in the breakout room. Personally I really liked this format and the discussions were pretty fun. However class routinely went 10-15 minutes over and Washburn sometimes called on students randomly. Some of the guest speakers were cool, others were eh. Grading was as follows: weekly Canvas discussions (20%), 4 class projects (5% each), 2 short essays (15% each), final essay (30%). The grading was pretty lenient because the class \"projects\" were graded pass/fail and they literally took less than an hour to do. The Canvas discussions were also graded P/F and I think he was pretty lenient on the essays too as long as you had a solid argument. Overall, not a bad way to fulfill the LIT distrib but was more time-consuming than I had expected.\"",
            "review 4: \"20F with Dennis Washburn: Like someone else mentioned, this class was more work than expected for a 'layup.' Getting an A is not difficult if you put in the time. Washburn is entertaining and tries to be 'relatable to the students' (i.e. pop culture, social media, occasional swearing). Was a little annoyed that he used every single X hour, but understandable because the class is so discussion-based.\"",
            "review 5: \"20F with Dennis Washburn: One of my all time favorite classes at Dartmouth, I genuinely looked forward to class. As previous reviewers have mentioned, the readings can be a little heavy, but they're usually not that dense and very interesting. Also, sometimes we only had videos or a movie to watch for class. Would highly recommend this class if you're looking for something that really makes you think and question some of your beliefs but is also not difficult grade-wise!!\"",
            "review 6: \"19F with Dennis Washburn: \"This class is a layup,\" Professor Washburn admitted on the first day of classes. Note that \"layups\" do not imply no work. They simply mean that you are guaranteed a decent grade if you put in the work on assignments. Many people come to class not having done the readings, and they typically can BS their way through (be aware that the professor does sometimes calls on random people). This class gives priority to first-years (and is only offered in the fall), so consider taking this class if you need a layup and a way to fulfill the INT or LIT distrib and/or the CI WC. Some of the readings are dense, but there are nonetheless quite a lot of interesting readings. The professor asks thought-provoking questions that challenge your preconceived beliefs, and there are also five good movies that are \"readings\" for classes. Each group of 6-7 students is assigned a learning fellow, and they facilitate discussions. You stay in the same group for the entire term, and you also have some group projects with them, so hopefully, you get in the same group as people you work well with. If you sit at the same table with your friends on the first day of class, you will be split. The discussion entries can sometimes get tedious, but they are mostly completion-based. There are three main papers in the class, the first two of which are 4 pages, and the final paper is 6 pages. He grades relatively generously by college standards and cares more about how you argue rather than what you argue. Overall, this class does meet the expectations of a liberal arts class and is quite engaging and low-stress. You will likely have a lot of fun in this class with Washburn's sense of humor (if you can tolerate his obsessions with Japanese literature)!\"",
            "review 7: \"17F with Dennis Washburn: Unfortunately, I was taking this course concurrently with Chem 10 and Econ 1 and was consequently not able to do most of the readings. The few times I did do the readings, however, I found them interesting and mind-opening. If you don't do the readings though, you can't really participate in class. Grade-wise, just make sure you do well on the journals and the final paper. I didn't realize that each journal entry was worth 10% of the overall grade until it was too late. Because I never participated in class nor went to office hours, I did not get to know Professor Washburn very well. However, I can tell that he's a great guy (has a great sense of humor too) and is very willing to help his students with assignments, answer questions about the material, or hold discussions. Professor Washburn noted once that this class is meant to have 50 students tops – our class had 90 people. The dynamics of the class were definitely not the same as that of a smaller class and it's a shame that it wasn't. I'm sure a smaller class would've held me accountable for the reading assignments, and I probably would've participated more.\"",
            "review 8: \"17F with Dennis Washburn: This was a super chill class, most people didn't really do the readings and got by. The readings themselves are actually quite interesting, they are sometimes classic movies or just videos. I highly recommend this class with Washburn, it is a lot of fun and provokes fairly interesting discussion.\"",
            "review 9: \"16F with Dennis Washburn: Washburn is a beast. I signed up for this class after he gave a lecture about the benefits of a liberal arts education during freshman orientation. The class was large and laid-back. Washburn's lectures are interesting and provocative, so much that most people didn't have their laptops out during class. The course itself is completely conceptual with small assignments (not at all noteworthy) and one, big final paper on any topic of your choosing that relates to the course. I met some really cool people here. 10/10 would take again.\""
        ],
        "Rebecca Biron": [
            "review 1: \"18F with Rebecca Biron: Don't take this class with Biron if possible. The readings that she assigns are so dense and boring that a large majority of the class didn't even bother to try reading them by the end of the term. That being said, it's very easy to get through the class without doing the readings. She assigns a 600 word paper every other week but they're very easy to write and she's a pretty easy grader. Overall, the class isn't hard to do well in but it's insanely boring and pretty much a waste of time.\"",
            "review 2: \"18F with Rebecca Biron: I thought this class wasn't too bad. I know a lot of people in my class didn't do the readings, but I did get through them all, and they really were not that bad- maybe a bit dry but overall interesting. Professor BIron was a pretty good lecturer, and some of the guest lectures were eye-opening and pretty intriguing. The class is mostly graded on completion of discussion posts and group projects, with the exception of 4 journal entries (600 word papers) that are worth 40% of your grade. I personally enjoyed writing the journal entries, as I got to apply my own experiences to the material we learned in class, which solidified my understanding of the concepts, and going to RWIT to brainstorm and edit was also a great decision for me. Professor Washburn was a guest lecturer for one of our classes, and he was also a really engaging lectuerer, and I've heard that his class has more interesting readings so definitely recommend!\"",
            "review 3: \"18F with Rebecca Biron: Honestly, one of the best layups at Dartmouth. Although the readings on their own were fairly dry, class discussions and guest speakers/readers usually clarified what the hell was going on in them in a way that made sense, even if you didn't do the readings. Lots of little assignments and weekly projects so be careful about deadlines. The only challenge came from journal entries, which are only 600 words and worth 10% each. Biron is super open to giving feedback/discussing confusing pieces outside of class and there are plenty of ways to apply this class in everyday life. Highly, highly recommend as both a layup and course to take at some point.\"",
            "review 4: \"18F with Rebecca Biron: I highly recommend this class! Even if the readings were hard or boring at times, the class discussions were interesting, and Professor Biron is a good lecturer and passionate about the class. The class made me a better thinker and reader. Lots of the grade are from completion and projects. The hardest part of the class is the journal entries (each 10% of your grade), but if you start them ahead of time they are fine. Professor Biron is always available to answer questions and emails. Good class to take for the lit distribution.\"",
            "review 5: \"18F with Rebecca Biron: Biron is not the greatest professor, and the readings that she assigned were often super long, dense, and confusing. However, you don't need to them in order to do well in the class. The class discussions will give you all the information that you need, and the assignments are mostly completion based. You will get full credit for the research posts and projects as long as you do them and show a little bit of effort. The journals are a bit harder, but you can do well if you give them a few hours, and you can always ask for her advice during office hours. In the end, the class will be very boring, but you can get an A with little effort as long as you are good with deadlines and remember to submit assignments.\"",
            "review 6: \"18F with Rebecca Biron: Trap class with Biron. Somewhat interesting and you will learn if you dedicate yourself. I would not discourage someone from taking the class if it interests you, but I would not consider this class with Biron a layup by any means. Meets every X-hour and attendance is mandatory. Discussion posts are confusing at times and readings are dense.\""
        ]
    }
}