{
    "GERM042.15": {
        "Veronika Fuechtner": []
    },
    "GERM043.04": {
        "Gerd Gemunden": []
    },
    "GERM007.07": {
        "Veronika Fuechtner": []
    },
    "GERM007.06": {
        "Heidi Denzel": [
            "review 1: \"23W with Heidi Denzel: Not super hard but kind of disorganized. I would say do the discussion posts and readings just bc they never took that long. Papers were graded pretty leniently.\""
        ]
    },
    "GERM082.09": {
        "Ulrike Draesner": []
    },
    "GERM046.04": {
        "Antonio Gomez": [],
        "Klaus Mladek": []
    },
    "GERM044.07": {
        "Petra McGillen": []
    },
    "GERM042.14": {
        "Michael McGillen": []
    },
    "GERM042.13": {
        "Irmela von der Luehe": []
    },
    "GERM002.03": {
        "Petra McGillen": []
    },
    "GERM046.03": {
        "Klaus Mladek": [
            "review 1: \"21X with Klaus Mladek: Pretty fun and interesting class. I took it for German credit, which was a bit more work, but generally not a ton of work and the readings were interesting and worth reading. Class was only 2 days a week and the assignments were all quick except for the final. Klaus is great and cared a lot about us learning.\""
        ]
    },
    "GERM082.08": {
        "Margareth Obexer": []
    },
    "GERM043.06": {
        "Heidi Denzel": [
            "review 1: \"20W with Heidi Denzel: Prof. Denzel is a great professor and an even better person. She checked in on us frequently and adjusted the pace and organization of the course based on our feedback, which made for a very manageable yet engaging workload. I always looked forward to this class and even the homework (which, to be fair, was usually a film and a short reflection). I would absolutely take this course again, and I think it is definitely a hidden gem in an underrated department.\""
        ]
    },
    "GERM042.11": {
        "Jessica Resvick": []
    },
    "GERM065.09": {
        "Nicolay Ostrau": []
    },
    "GERM046.02": {
        "Klaus Mladek": []
    },
    "GERM044.05": {
        "Yuliya Komska": [
            "review 1: \"21W with Yuliya Komska: Lovely! Yuliya is so kind and engaging, great class format, really intriguing material, etc. The feedback she provides on the final research paper is more comprehensive than that which most writing / FYS profs provide, so that's an added plus. Highly recommend if you're looking for a lit distrib or an introduction to German culture.\""
        ]
    },
    "GERM043.05": {
        "Gerd Gemunden": [
            "review 1: \"21F with Gerd Gemunden: Prof Gemunden can be a little boring at times and the lectures are pretty unstructured. There's not much work in this course other than a few assignments, watching films, and writing discussion posts, so it seems like a layup. However, my final grade surprised me and he didn't give any feedback on assignments unless you asked (which I did). Felt like I participated a lot and put enough into this course to get an A so the lower grade stung. Avoid if you're looking for your first film class/want a solid layup.\"",
            "review 2: \"21F with Gerd Gemunden: The ideas discussed in class are not at all complex. There is little homework. I didn't find the class boring at all. Grading seems fair but the criteria he applies to the film projects are not all that clear to me. Still, you don't have to put much effort in for a good grade.\""
        ]
    },
    "GERM065.08": {
        "Jessica Resvick": []
    },
    "GERM042.10": {
        "Nicolay Ostrau": []
    },
    "GERM007.05": {
        "Eric Miller": [
            "review 1: \"23W with Eric Miller: This is probably the best class offered at Dartmouth. Miller is a great and helpful guy that makes the 2A worth it. There are 4 major papers that you write throughout the class, but besides this all you do is discussion, weekly 1-page reaction papers, and some peer-editing. This class solely covers Kafka, but it never was too boring. Some works like The Trial could get a little confusing, but Miller is very helpful. This is the best seminar to take.\"",
            "review 2: \"23W with Eric Miller: Undoubtedly the best seminar out there. Professor Miller is an expert on Kafka, genuinely cares about his students, and is all-around a great guy. Class is never boring with him and I always looked towards this 2A. Grading is gentle and the professor explicitly mentions that he values learning over grades. Of course, this all makes getting the class near-impossible -- but, always be on the lookout for the timetable during add-drop -- that is how I miraculously got it (after initially not getting it).\"",
            "review 3: \"21W with Eric Miller: One of the best first year seminars out there - would highly recommend for anyone looking for an easy layup to get the LIT distributive out of the way. Classes are 100% discussion where you talk about the reading that was assigned for that week. Professor is super knowledgeable about Kafka so the discussions are engaging and go in depth on a wide variety of topics. The best part about this class is that he says from day 1 that he hates grades so you will get an A as long as you do the work assigned for this course. There was four essays overall, each of them about 4-5 pages in length, where you answer a question from a big list of questions that the Prof provides related to the reading. The class ends up going over all of the questions during discussions so just pay attention to what is being said and incorporate it into your paper. Aside from essays, there's also reaction pages every week, where you just freely jot down your reactions to the readings that were assigned for that week. Super informal and graded on completion. Would highly recommend this course to anyone...it was my biggest layup of 21W :)\"",
            "review 4: \"21W with Eric Miller: if you have the opportunity to take this class TAKE IT. seriously. super interesting. Focus is on learning not grades. He is incredibly knowledgeable, but super open for discussion and opposing views. He was always looking for someone to disagree with him, seriously think he got a lot of joy from it. Also, after a 2 hour class I spent another hour and a half vibing with him, and he is such an interesting person. You will get so much from this course, Professor Miller asks you to think very deeply, sometimes so deeply the thought disappears, but you will get so much from the class.\"",
            "review 5: \"21W with Eric Miller: Definitely a layup as everyone else has said. My only complaint about the class was that two hours straight of class could make it very difficult to focus, especially given the postmodern concepts that were discussed. 4 4-5 page essays, 9 1-page reaction pieces and all are graded for completion and effort. A very much needed layup for me in an otherwise busy and difficult term :)\"",
            "review 6: \"21W with Eric Miller: Super nice professor. Super glad I took this class. 60% of your grade is based on participation in class and homework thats an easy weekly reflection. The other 40% is on the 4, 5 page papers. If you're willing to come to class and engage in conversation this makes it super easy to get a good grade and your papers super low-stakes. Highly recommend.\"",
            "review 7: \"20W with Eric Miller: Very engaging professor and very interesting readings. Grades essays very gently and gives a full page interesting, handwritten response. Makes it clear that he really read your essay and its arguments. Class is 50 percent participation so make sure to show up and contribute to discussion. Glad I took this class, and glad it had this professor. Probably a bit easier than other first year seminars, judging from the experience of my friends. Three 4 page papers and one 5-6 page paper. Nine response papers that are essentially reaction posts that are graded on completion. Would highly recommend.\"",
            "review 8: \"20W with Eric Miller: Absolute layup of a class - prof stated straight up at beginning of the quarter that if we did all the work and showed up that he would give us As. He genuinely seems interested in Kafka too which is nice, although sometimes his discussions on philsophy and metaphysics took me out of the zone. While I would definitely say he's \"scatter brained\" at times, the material is easy enough to do well on that this class is worth your time.\""
        ]
    },
    "GERM042.08": {
        "Eric Miller": [
            "review 1: \"24W with Eric Miller: Such a badass class. Miller is super nice and super easygoing. There are essentially no hard deadlines in this class and the papers are all simple and short. Take it if you want an A or if you are interested. The lit itself was pretty good as well - lots of Kafka. I recommend.\""
        ],
        "Jessica Resvick": []
    },
    "GERM064.04": {
        "Klaus Mladek": []
    },
    "GERM042.07": {
        "Heidi Denzel": []
    },
    "GERM065.07": {
        "Veronika Fuechtner": []
    },
    "GERM065": {
        "Michael Mcgillen": [
            "review 1: \"24W with Michael Mcgillen: THIS IS A REVIEW FOR GERM 65.10 (CULTURES OF MEMORY). This class focused a lot on the Holocaust as well as literature about/reactions to it. It is just like any other senior seminar w Michael McGillen. He is a nice guy, but kind of cold in class. Good conversations, but people were kind of quite so it was sometimes awkward to be there when he asked a question to the void...\""
        ],
        "Jessica Resvick": [],
        "Veronika Fuechtner": []
    },
    "GERM042.05": {
        "Petra McGillen": []
    },
    "GERM015": {
        "Irene Kacandes": [
            "review 1: \"21F with Irene Kacandes: Honestly, not a layup in terms of the grade, and the grading was pretty arbitrary who she would give an A or A- to. For day-to-day work, you really don't have to do much, so I guess a layup in that sense. A lot of the grade is about participation, but it is a 70 person lecture without much opportunity to participate. Kacandes's methods of assessment are quite frankly arbitrary and graded with a lot of bias. Kacandes picks her favorites and gives them A's, and she is rude and unapproachable to everyone else. She grades papers super arbitrarily and is unhelpful in the writing process. The class is incredibly unorganized and there is no incentive to pay attention in class. Good thing she is retiring because she was a bad teacher.\"",
            "review 2: \"20F with Irene Kacandes: A very interesting class and would recommend taking if you're interested in German history and current radical movements, but fair warning, Kacandes is very passionate about her own views and this frequently dictates what topics she brings up and how she portrays certain groups (she has entire lectures dedicated to the nuances of the modern radical left) but then makes overly generalized comments about the right wing. Before every class, you had to do some readings or research and submit a short response, and outside of that we had a 4 page paper, a group presentation (and short paper) and then a final group presentation of ~20 minutes. The presentations were pretty fun though if you put it together well and knew what you were talking about. I wouldn't say this class is a layup but it is very interesting and fairly easy to do well in if you submit the assignments on timen and put some work into the papers/presentations.\""
        ],
        "Michael Mcgillen": [
            "review 1: \"23F with Michael Mcgillen: Decent class. Short assignments before almost every class. Map/history quiz 5%. Final project was a skit/dramatization about course topics. It might be helpful to go to office hours before the writing assignments, but I don't think anything was graded too harshly.\""
        ]
    },
    "GERM064.03": {
        "Veronika Fuechtner": []
    },
    "GERM042.06": {
        "Veronika Fuechtner": []
    },
    "GERM007.01": {
        "Yuliya Komska": [
            "review 1: \"18W with Yuliya Komska: I really enjoyed this class. It is almost entirely narrative writing, so it's great for people who are interested in creative writing and not in research papers. It's a TON of reading, but you can definitely skim some of it. Class discussions are really interesting, and include analysis of readings, films, photos, and propaganda. Professor Komska is a really sweet woman who grades fairly. While I personally really enjoyed the narrative writing (first as 5 ~500 word diary entries, then a memoir), this is definitely not a class that teaches you creative writing. Take this class if you can already write a good research paper and want to get some narrative stuff in. If you wanna learn how to write a research paper, you're not going to learn that in this class. The only research you have to do outside of the readings is for the 1000 word introduction to the memoir that you write as the final.\""
        ]
    },
    "GERM065.03": {
        "Ellis Shookman": []
    },
    "GERM014": {
        "Nicolay Ostrau": [
            "review 1: \"22S with Nicolay Ostrau: Incredible class, biggest and truest layup I've ever had at Dartmouth. I know plenty of people who never came to class and did just fine. I did try to come to most classes but never did a reading and was able to get through the exams and papers just fine. Just stay on top of the HW assignments (1 per class, never will take you more than 5 minutes tops) and work in groups on the midterm and final (both Canvas, untimed exams that are open for 2 days and open note/internet/everything) and it will be a breeze. It's also just pretty interesting material, and the prof is hilarious!\"",
            "review 2: \"22S with Nicolay Ostrau: This class was insanely fun and laid back, much more than what you could expect from a college class. Ostrau is the most engaging faculty member you can find on this campus, and he knows what he is talking about. He makes the material incredibly fun and is very welcoming. His jokes and hilarious cold-calling made this class literally enjoyable. You can get a pretty good grade if you do the homework assignments, even without attending all lectures. This class was my favorite academic experience at Dartmouth. I definitely recommend it, make sure you get in somehow because I assure you, everyone will sign up for this course next year. It was 250 this year anyway. The prof is literally the best.\"",
            "review 3: \"22S with Nicolay Ostrau: Took it for a LIT distrib. Workload is totally manageable and if you don't want to work, you can easily get through. I personally hate the group element in this course because it just made things harder. Prof. Ostrau is an interesting person and teaches well. Overall I would recommend this class if you want a fun and easy LIT distrib.\"",
            "review 4: \"22S with Nicolay Ostrau: Hilariously easy class. Stay on top of your daily(ish) homework and you’ll be chilling. Exams and bigger assignments were low stress. As far as I can tell the prof is a nice guy too. I stopped going to class after the first week, and still managed to swing an A.\"",
            "review 5: \"22S with Nicolay Ostrau: A fun layup! This class is all about the background of some of your favorite childhood fairytales and stories. Even if you don't go to class, I would say it's still pretty easy to secure an A.\"",
            "review 6: \"21S with Nicolay Ostrau: TAKE IT! If you want a LIT distrib, JUST TAKE THIS. The prof is so nice. I can't stress this enough.\"",
            "review 7: \"21S with Nicolay Ostrau: THIS PROF IS SO FUNNY I literally had so much fun in this class even on Zoom. Class work assignments was either uploading a 1 minute audio or writing a brief discussion post to talk about the main ideas of the stories/topics we discussed. Final project is turning one of the Grimms fairy tales into another \"medium\" to tell the story, so people even made card games, cookies, gingerbread houses, etc. Super fun, such an easy layup, highly recommend.\"",
            "review 8: \"21S with Nicolay Ostrau: One of the most funny, interesting, and engaging courses I've taken here. Ostrau is great and it is 100% worth it to show up to class even though you don't really have to.\"",
            "review 9: \"20S with Nicolay Ostrau: An excellent course with an excellent professor. Prof. Ostrau is both knowledgable and passionate about the material. The workload is definitely manageable and includes just a few quizzes, a small paper, and a project. As far as online instruction goes as well, this course is very well designed. I highly recommend this course to anybody with an extra class available or somebody looking to fulfill a distrib.\""
        ]
    },
    "GERM010.06": {
        "Ellis Shookman": [
            "review 1: \"21W with Ellis Shookman: Prof. Shookman really wants to engage with students with German history, mainly by reading picture descriptions and poems/songs in German and English. I found the constant technology issues to a bit annoying, but this term was really hard for everyone. I loved the content, spanning from the middle ages to today, in Germany. We had three papers and a final that wasn't too bad. Cool little nuggets of German history will stick with me for awhile.\""
        ],
        "Michael Mcgillen": [
            "review 1: \"18W with Michael Mcgillen: Good class. Professor is a little dry so the lectures have the ability to make you doze off. When we looked at images on the projector, the lights in the class were off so falling asleep was a problem for everyone. There's a ~350 words image description due each Monday which is the bulk of the class's work. Otherwise there's grammar hw which isn't long or collected. Some grammar quizzes throughout the term and very fair midterm/final. If you're into art history especially, then this is a great class for you.\""
        ],
        "Heidi Denzel": [],
        "Michael McGillen": []
    },
    "GERM046.01": {
        "Eric Miller": []
    },
    "GERM082.05": {
        "Kristof Magnusson-Weitemeier": []
    },
    "GERM007.04": {
        "Klaus Mladek": []
    },
    "GERM044.02": {
        "Susannah Heschel": []
    },
    "GERM007.02": {
        "Petra McGillen": []
    },
    "GERM087": {
        "Ellis Shookman": [],
        "Klaus Mladek": [],
        "Veronika Fuechtner": []
    },
    "GERM085": {
        "Ellis Shookman": [],
        "Klaus Mladek": [],
        "Veronika Fuechtner": []
    },
    "GERM084": {
        "Klaus Mladek": [
            "review 1: \"06F with Klaus Mladek: ...who's willing to take a German-language, 2-hr hard-core theory class about Kafka, that is. The Prof. was very interested in helping everyone to understand and stay afloat in the course, so don't worry about it if your language is weak or you don't know a thing about Kafka before day one (me, on both counts). If that doesn't suit, try his simpler Kafka course in English.\""
        ]
    },
    "GERM082": {
        "Durs Grunbein": [
            "review 1: \"05S with Durs Grunbein: The material in this course was interesting, and the Prof very knowledgeable, but the course seemed to move very fast. We were assigned large packets of poetry and essays to read for each class, which made it hard to really understand the material we were reading, take the time to look up words we didn't understand, etc. We also had a hard time maintaining class discussion- most of it was lecture- I think because people hadn't really grasped the homework readings.\"",
            "review 2: \"05S with Durs Grunbein: He was definitely a great poet, but was not a good prof at all in terms of providing a structure for the class\""
        ],
        "Josef A.": [
            "review 1: \"07S with Josef A.: The readings were great, but the class wasn't always the most focused. Nonetheless, it was pretty good.\""
        ]
    },
    "GERM082.04": {
        "Carolyn Hoven": []
    },
    "GERM082.03": {
        "Ilija Trojanow": []
    },
    "GERM067": {
        "Klaus Mladek": [
            "review 1: \"05W with Klaus Mladek: He is interesting and really just wants you to be interested in what you are doing. Very reasonable and adaptive.\""
        ],
        "Veronika Fuechtner": [
            "review 1: \"06W with Veronika Fuechtner: I was really disapointed by this class. The material was interesting, but Prof. Fuechtner gave us way too much work. We had to read 2 plays in german per week (even when we had a miterm or a performance), and as a result we read them really superficially. In class discussions were very superficial (in part because our class was small, most of us couldn't do all the reading, and those of us who did did not have a background in theater so we weren't very good at interpreting the material). The midterm didn't really have anything to do with what we had done in class, it was based on a list of terms we had looked over the 1st day of classes and never talked about again. We also had to learn and perform a monologue, write and perform a theater piece, and we had a take-home final. This class is A LOT of work, and more importantly it was not worth all that amount of work. I don't really think I got anything out of it.\""
        ]
    },
    "GERM065.06": {
        "Yuliya Komska": [
            "review 1: \"23W with Yuliya Komska: Really cool class and great for improving German skills. Yulia is really nice and cares a lot about her students. A lot of grades are based on presentations/speaking, which I wasn't used to, but ended up being really helpful. Get started on the final project early and pick something that you care about.\""
        ]
    },
    "GERM065.05": {
        "Eric Miller": []
    },
    "GERM064.02": {
        "Petra Mcgillen": [
            "review 1: \"22F with Petra Mcgillen: Prof. McGillen is fantastic. She is beyond well read and so passionate about the subject. She is one of the best professors I have had at Dartmouth thus far. The class itself is not easy––most readings are of 19th century German literature. However, McGillen is really understanding and wants to make the class accessible to different many levels of German abilities. She is very helpful during office hours; a strong communicator and always well planned at least 3 weeks in advanced. With that said, she is a true academic. She values quality work and will look for it. But, in the mean time she is very nice and always let us have a break during the 2 hour class for Kaffe und Küchen. The final was a research paper. This is difficult if you do not have extensive experience writing/researching in German. It was only 1500 words and she is very helpful to students throughout the process. Just start early and it shouldn't be too bad, but it certainly is a challenge if you are coming out of the German 10 sequence.\"",
            "review 2: \"21F with Petra Mcgillen: Really liked this class! Prof McGillen is very understanding, a great lecturer, and is really accommodating in terms of different German levels in the class. My German definitely got a lot better during the term. Some of the readings can be very difficult, especially the longer ones, but we generally talked about them in class in a way that didn't require a total understanding of the text. Would definitely recommend this to any German major/minor looking for a 60-level.\""
        ],
        "Petra McGillen": []
    },
    "GERM064.01": {
        "Michael McGillen": []
    },
    "GERM061": {
        "Bruce Duncan": [
            "review 1: \"05F with Bruce Duncan: Prof. Duncan is a great prof and fun to get to know outside of class. The readings are good. Lectures are sometimes all over the place. German doesn't have to be that good for the class.\"",
            "review 2: \"01F with Bruce Duncan: This class is a great overview of must-reads like Faust and Werther. But it is NOT the best way to really get into them. If you are looking for that reason to read these things in German (so that you can feel educated), this is the way to go. If you're looking for deep, thoughtful, discussion-oriented interpretation, wait for it to be offered in translation in the summer. Reading this many fairly long works in a foreign language really cuts down on your thinking time. The papers (three longish, and one final 10-15 pg papers): You can use the questions the prof gives or make us your own to suit your interest. If you are a person who wants/needs detailed input for papers, this is not for you. But if you like picking your own topic (like me), this is the way to go. The lectures include lots of random stories and Dartmouth history lessons in the \"Pause\" at halftime :)\""
        ],
        "Eric Miller": []
    },
    "GERM047": {
        "Ulrike Rainer": [
            "review 1: \"08F with Ulrike Rainer: i thought the readings for this class were really great and the discussions in class were good too. the background prof rainer gave on the authors and texts were great and the extra essays tied everything together well. really fun class if you like reading plays and discussing them.\""
        ]
    },
    "GERM046": {
        "Klaus Mladek": [
            "review 1: \"08X with Klaus Mladek: Prof. Mladek is awesome. Even though his focus is on a specific period of German literature he knows a lot about the literature and history of other periods and places. The reading he assigns is interesting, and he never assigns too much at a time so you have time to do a really in depth reading of all that is assigned. The down side to this was that we didn't end up getting to all the books that were on the syllabus. Weekly 1-2pg (casual!) response papers, a 5-7(?)pg midterm and a longer (~12pg) final paper with 2 short (1-2pg) responses as a take home. Classes usually made up of a short introductory background lecture on the reading/author/history followed by a class discussion. Really awesome class- take it!!- even if you're not a German major or minor you can do well in and learn a lot from this class.\""
        ]
    },
    "GERM044.04": {
        "Klaus Mladek": []
    },
    "GERM044.03": {
        "Ellis Shookman": []
    },
    "GERM044": {
        "Ellis Shookman": [
            "review 1: \"07F with Ellis Shookman: Shookman is a great guy. He's clearly very interested in the subject and clearly knows a LOT about it. He comes to class in a good mood every day and is just generally a good guy to be around. I'm not a german major, I'm not particularly interested in Faust, and I dislike writing but I took the class and I enjoyed it because of him. There was a lot of reading, and it was at times hard to get through. Some of it was sligthly boring/dense but some of it was also very interesting. paper topics are broad. He gives you some ideas but you can also make up your own and from what I've seen he'll let you write about whatever you feel like. Very fair grader. He'll sit down with you after every paper and really help your writing. Take this class if you are even remotely intersted in Faust. 3 5-page papers, an oral report, and a 10-page term paper.\""
        ],
        "Yuliya Komska": [
            "review 1: \"14W with Yuliya Komska: Course: The course was well paced and covered German history and culture as it pertains to Germany's present views on environmentalism. Since we always looked at new material, I was never bored. Professor: Professor Komska is very flexible and adapts the course to what the students want. She's always available outside of class and loves to share her knowledge about Germany. Workload: There was never any busy work but there is quite a bit of reading. No tests, just papers, presentations and discussions. However, Professor Komska will work with you to set deadlines that don't overlap with your other courses.\""
        ]
    },
    "GERM043": {
        "Irene Kacandes": [
            "review 1: \"04F with Irene Kacandes: The readings are great for the most part: very interesting and relevant to the topic but the professor is hard to figure out. Sometimes she wants lots of detail on tests, other times she wants more analysis but for the most part the tests are fair and she is a fair grader. Also, be careful what you say in class. If she doesn't like what you say, there's no point to your comment or your are digressing, she will dismiss your comments in the most tactless manner and continue the lecture. Aside from the Prof's fickle behavior in class and her wants on tests and evaluations, she teaches the material well and assigns some of the best readings on the holocaust and the Nazi past I have ever read. I highly suggest this class but with cautions about her heavy stress on detail and analysis on tests and evaluations.\"",
            "review 2: \"04F with Irene Kacandes: interesting subject, bad prof\"",
            "review 3: \"04F with Irene Kacandes: This is a good class, well worth it. Kacandes is an intelligent person, but one who only likes things done her way. It's a good class, I learned a lot of information that I'm glad to know. You should take it.\"",
            "review 4: \"04F with Irene Kacandes: The material covered in the course is truly fascinating and well-worth the time spent on readings. Prof. Kacandes is a very well-spoken and intelligent professor, but during class she seems a little tense and some students find her intimidating. As long as you stay on top of your reading you'll do very well in her courses. The only real complaint I have is that she does not specify point/percentage values for exam questions and her comments tend to be minimal, which often leads to confusion and frustration over her grading criteria.\"",
            "review 5: \"04F with Irene Kacandes: It was okay...i took it because i was semi interested but i'm not that psyched about it after. three letters for ya, meh\"",
            "review 6: \"04F with Irene Kacandes: 10 books and a source book says it all. I would have expected most to be interesting given the subject and my interest in it. However, we mostly read novels which turned out to be slow and boring. The class got progressively less interesting as the year went on. As someone interested more specifically in the Holocaust, which was covered in the first four weeks, that part was interesting. However, after the midterm, the class focuses, and rightly so given its description, on postwar German identity, which I found to be taught rather poorly. I felt we looked at rather boring aspects and never fully addressed the central question of German guilt in one cohesive discussion. Her lectures are average at best and for tests regurgitation is the name of the game. Tell her what she told you in class and you'll be fine. Also, the class was at least 80 degrees every day, but that seemed to have only bothered me.\"",
            "review 7: \"04F with Irene Kacandes: Interesting course--will make you think about issues you may not havee thought about before. Kacandes, I thought, was a good prof--inspired, passionate, and good at making ideas clear. Many of the other students found her too intense to the point of being insulting, but I disagreed with them. Her exams are tough, though. Not a course to take if you are looking for a gut.\"",
            "review 8: \"04F with Irene Kacandes: Honestly, I was tremendously humbled by this class. It is so important to learn about WWII and the reprocussions of the Nazi regime both here in America and in Germany. The reading material was great, easy to read and very entertaining. There was a good mix of novels and historical reading to keep you on your toes and interested. Professor Kacandes was great (seemed a little harsh at times) but really inspired me to learn the material. There were two exams that were long but not difficult and a group presentation. Also class participation and attendance were huge. Take this class if for no other reason that you want to feel good about how much you have and how lucky you are,\"",
            "review 9: \"04F with Irene Kacandes: The class is great, the information and ideas and perspective you get out of it invaluable. The prof is really smart and engaging, her lectures great, but her attempts at discussion are quite frustrating. She's a bit of a control freak and it comes out in class when she tries to ask students questions but only wants certain answers. By the end of the class I was pretty tired of talking about this Nazi past psychology stuff, but I guess that's sort of the point. Great class, just be prepared to get frustrated with the Prof from time to time.\""
        ],
        "Ellis Shookman": [
            "review 1: \"07W with Ellis Shookman: So if you were expecting to take a German Drama course and not do a lot of reading you're a bit of a flake... This course was fun because of the range of topics to explore while doing your readings and papers, but also a ton of reading. You read eight plays, granted they are mostly short plays, in a very short amount of time. It's much easier to understand them when read at your leisure, but alas winter term is short and wasteful. Do the readings on time and during the weekends so that you can participate in class, but don't stress too much. He's not a stickler and you can always be honest when you don't understand the material.\"",
            "review 2: \"07W with Ellis Shookman: I always enjoy courses taught by Prof. Shookman. He has a knack for making any material seem interesting, and for making the class period fly by. This particular course was interesting by itself, for anyone who likes German culture OR literature and theater in general.\"",
            "review 3: \"05F with Ellis Shookman: If you're curious about the concept of forbidden knowledge or Faustian bargains, this class is cool.\"",
            "review 4: \"05F with Ellis Shookman: is the best prof Ive had so far at Dartmouth. Any course he teaches will be a lot of reading, but very interesting and well taught. Shooky is also very good in sharpening essay writing skills.\"",
            "review 5: \"05F with Ellis Shookman: Shookman is a great prof. He is the quintessential gentleman, knows how to guide discussions, and really knows his stuff. The material itself is interesting, and gets better as the course goes on. Goethe's Faust and the 2 novels are great reads, though challenging at times. There tends to be a lot of reading, especially towards the end of the term, so it helps to get ahead a bit. My only complaint might be the student presentations, which took up 4 class periods. Some of the presentations are good, but its a shame to lose 2 weeks of time that might be spent taking a closer look at the readings, allowing Shookman to impart more of his knowledge on the subject.\"",
            "review 6: \"05F with Ellis Shookman: ...one of, if not THE best profs here. I don't know if he's capable of not being interesting or helpful, or making his subject fascinating. If you have any curiosity about Faust, or German literature, or the cause behind these good reviews, you would be foolish not to take this class when it cycles around again.\"",
            "review 7: \"02W with Ellis Shookman: I mean \"save your soul\" in the most spiritual of senses. This class is tough, it requires a lot of reading and writing, but it never fails to be enlightening. Shookman is a very kind and sensitive professor, always available in and out of class for questions on the reading and on papers. And he is passionate about Faust. We started off reading excerpts from the first published work on Faust, a chapbook called \"The History of the Damnable Life and Deserved Death of Dr. John Faustus\" (yup, guess the bias), otherwise known as the English Faustbook. We then read Christopher Marlowe's play, which was based on the Faustbook, and read a fabulous translation of Goethe's Faust, Parts I and II. The class took a two-week break for presentations (we researched a film, piece of music, piece of art or artist, or other work of literature that put a spin on the Faust theme). We then sped through Bulgakov's Master and Margarita and Thomas Mann's 500-page concrete block of a book, Doctor Faustus. We even read parts of the Bible relevant to certain works and examined different translations of works. Prof. Shookman assigned three 5 to 6-page papers and a 10 to 12-page term paper based on the oral report. The work can build up, for he had us write a revision of the previous paper due at the time of the next paper (and he seemed to only grade the revision). At times I had trouble keeping up with the reading, but this was my own fault. (Prof. Shookman repeatedly warned us to start the two last books ahead of time because he forsaw a time crunch--I found I never had time.) To trace the Faust theme throughout literature, art, film, music, and even advertisements is fascinating, indeed. Prof. Shookman was a helpful guide--and often he felt like just that, a guide, for some of the books are so rich and complex that there was just not enough time to discuss everything. Prof. Shookman makes you work--in that gentle, mild-mannered way of his--and when the class is over you feel like you can take anything; you feel tough. And a little light-headed. Thus heavenly. Okay, take the class no matter what you feel. Take it to go to hell. (Sorry, I've been waiting for a chance to say that, and I never had the guts to say it aloud.)\""
        ],
        "Heidi Denzel": []
    },
    "GERM042": {
        "Veronika Fuechtner": [
            "review 1: \"09S with Veronika Fuechtner: This course was great in all aspects. You get to read some of Freud's key writings and discuss the materials in class. Readings were fairly challenging, and it was a lot. It is expected since you get to read Freud's writings, along with secondary readings from other psychologists and philosophers, such as Carl Jung, Karen Horney, Zizek, or Judith Butler. Also, you had to read some books at its entirety - since I also had readings for my Freshman Seminar, I could not complete readings, which is unfortunate. Discussions were very interesting. The class had two graduate students pursuing a graduate degree on Liberal Studies. They provided deep insights on the readings, which enriched the discussion. Furthermore, Prof. Fuechtner did a marvelous job in bringing, and encouraging, diverse viewpoints. She was great in leading discussions. Students asked thoughtful, intelligent questions. She also had students contribute on Blackboard discussions (20% of your grade). This trend continued there. Another unique feature was \"Freud blog,\" where students upload any interesting articles/video clips related to Freud (minimum of 2 entries). She probably wanted students to engage themselves with Freud outside the classroom - I believe it served its function. Furthermore, in consideration of students who have difficulty speaking out in front of people, she counted Freud Blog contributions (if 3+) to participation grade. The major assignment is, of course, a final research paper. Here, you can choose whatever topic you want to explore. If you have difficulty, you can certainly go to the office hour. She gives insightful guidance whenever you are stuck. While writing a 15-page paper was challenging, I enjoyed exploring my chosen topic, partially due to the prof's helpful advice on my paper. The professor was passionate on the subject, and she showed it. As a hard-core math/science person, I think it will be one of the few courses I really enjoyed throughout my Dartmouth career - despite being a Humanities course, that is.\"",
            "review 2: \"06W with Veronika Fuechtner: This course was average all around... The prof assigned way too much reading. However, you didn't have to do the readings b/c the prof doesn't make you speak in class. Overall, only 4-5 people spoke every day. The class was therefore lacking in energy, enthusiasm and interest... as a result, it was pretty boring. Your grade is made up of 3 one page thought papers and a final research paper at the end. I have no idea how the prof grades b/c she never once handed back an assignment that we handed in or provided us with any comments. As a result, it is really hard to know where you stand in the class, which is incredibly frustrating. Overall - I think the class was somewhat interesting, but I wouldn't recommend it and I wouldn't take it again if I had to go back.\"",
            "review 3: \"06W with Veronika Fuechtner: This class was great. There was a lot of outside reading that did take a lot of time to read. That said, this material was very interesting. Class every day was made up of very engaging class discussions, something that I would look forward to very much. The final paper, which was the only major assignment, was great because it allowed for exploration of personal interests rather than necesitating strict guidelines. Would recommend very highly.\"",
            "review 4: \"06W with Veronika Fuechtner: I came for the material - I'm staying with the professor for another course next term. Great all around.\"",
            "review 5: \"06W with Veronika Fuechtner: I have mixed feelings about this course. On the one hand, the course was very ambitious and sought to tackle Freud from many different angles (as is evident from the many cross-listings). We also read a substantial body of Freud's work, which was a great, and I think the WGST, and Jewish Studies angles were covered quiet well, as was the Germanistic side of the course (which is my interest). On the other hand, the material for the course was overwhelming for the class. The course attracted a diverse group of students some freshman, some seniors -- all from different majors and different places. Unforunately, the reading level and theoretical difficulty of the texts made it suitable to an upper-level seminar. Thus, discussion was often halting, slow and superficial -- frustrating both for the younger students trying to understand and the older students wishing to take the discussion to a higher level. Prof. Fuechtner should have stepped in and provided more lecture, especially in the beginning, to make sure we were all at the same level. Another problem with this course that is probably mentioned in other reviews was the lack of feedback. We didn't receive any grades until our final grade, which I consider to be a poor effort on Prof. Fuechtner's part. I have had her many times before and find her to be a brilliant scholar and mentor, so I was somewhat disappointed by this class in that regard, but feel I should add that this experience was out of sync with my other experiences of her as a professor, in all of which she was very well organized. My only critique of the course material is the actual focus on \"pscyhoanalysis.\" We focused so much on studying Freud from a cultural studies angle that our grounding in the theory of pyschoanalysis was somewhat weak. We read all of his published case studies, but only one of the introductory lectures, leaving us to derive his theories from his cases.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"05X with Ulrike Rainer: Great selection of books, but I wasn't able to finish a couple. The books weren't exactly what was on the syllabus. This class was a lot of reading--a book a week and some of the books were 600+ pages (and written by Thomas Mann on top of that). There are 3 papers--2 5 page ones and one 10 page one in the middle. The grading wasn't too tough. Nice prof. Discussion focused on German history/ideologies more than I'd expected.\"",
            "review 2: \"05X with Ulrike Rainer: <span class=\"not-found\">no comment</span>\"",
            "review 3: \"05X with Ulrike Rainer: ...the readings, although I am a fast reader and was not bothered by the one-book-a-week assignment. I liked the material: the books were interesting, and I kept my copies after term was over. Prof. Rainer can be very strict when slacking appears to be an issue. She knows her stuff, though, and if you don't appear to be lazy, she'll be good to you.\""
        ],
        "Gerd Gemunden": [
            "review 1: \"03X with Gerd Gemunden: This course was so interesting. The literature of the exiles from Nazi Germany is fascinating. Professor Gemuenden provided a wide range of works to cover not just the point of view of a German exile but also those raised in their country of exile and those of the Nazi-conquered nations. I really enjoyed writing the papers for this course and I feel that the class discussions actually helped me formulate my paper topics. We were required to give presentations for about certain topics ranging from analysis of an exile's career and biography to in-depth analysis of a specific work. In order to have this class count towards the German major (since it was taught in English) those wishing for the credit had to read approximately half the reading assignments in their original German versions and write either the midterm paper or the final in German. This course is great to take for those who have an interest in World War II Germany and the victims of the Nazi regime.\""
        ],
        "Klaus Mladek": [
            "review 1: \"07X with Klaus Mladek: This is a survey course of the highlights of German Lit from Werther until now (Guenther Grass)...it has a little bit of everything- there are bound to be some readings you love and some you don't like, but they're all important and exciting in some way. Mladek is a wonderful prof; he's SO excited about the material and it's truly contagious. He's also really supportive of students and their ideas, which really fuels discussion. There's a bit more work than with other classes, because we had to write short responses (2-3 pgs) to the readings once a week, in German if we wanted major credit. While this forces a student to both do the reading and think about it, Mladek used them to generate discussion, so he really let the students take the class in the direction they want to. He's generally really helpful, and a great guy, and you should take a class with him if you get a chance.\""
        ]
    },
    "GERM031": {
        "Irene Kacandes": [
            "review 1: \"05F with Irene Kacandes: Prof. Kacandes is a great professional to work with. I think she is a sensitive human being and at the same time a leader who set things right for those having problems --was not a common issue-- with their guestparents, with Germany in general, and with the courses. She may be rough at times; but overall she's great if you agree to do things her way (i.e. work hard).\"",
            "review 2: \"05F with Irene Kacandes: For an FSP whose only pre-requisites were 5 quarters of german study (two of them being literature courses that don't really help with language skill development), the expectations of the program, and especially professor kacandes's course, were unreasonable. over the course of 7.5 weeks, we were expected to read 8 plays (a bit over 1200 pages of reading in german. 3 of the plays also came out of the 18th century--faust 1 and 2, nathan der weise), write 4 essays, and complete a final project- without the benefit of a reading period- that included reading a play of our choice, seeing it performed, preparing a 25 minute oral presentation (with the expectation of perfect german), a 2 page handout, and a 3 page essay in german comparing text and prodcution. overall, the academic experience of this program was a disaster. while always willing to give her time to discuss personal issues and review difficult material during office hours (to her credit, she was very generous with her time and was understanding of personal issues--very willing to grant extensions with papers, etc...), professor kacandes never once prepared a literary lecture and conducted her class through a quasi-socratic method. rarely did the class discussion concerning the texts revolve around anything literary. instead she nitpicked with details of content, seldomly attempting to discuss literary or intellectual themes with any depth or originality.\""
        ],
        "Christine Rinne": [
            "review 1: \"04F with Christine Rinne: Many of the plays we read were pretty bad, and so were some of the performances. In fact, I would describe most of the plays as mediocre; only one was fantastic. But maybe that doesn't matter to you so much, since the repertory changes every year. I found Professor Rinne to be a good professor--she led very good classroom discussions, was quite funny, and did a great job overall.\""
        ],
        "Nicolay Ostrau": [
            "review 1: \"22F with Nicolay Ostrau: Ostrau is truly great at teaching and he's just a really nice guy all around. He assigned too much work at the beginning but as time went on he got a better sense of things and it got better. Class consisted of reading and discussing a few plays over the course of the term and seeing about a play or two a week in Berlin or wherever we were at the moment. My only gripe is I wish the plays we read were the same as the ones we saw, because a lot of the plays were hard to understand unless you were truly fluent, so reading and then seeing it would have been more valuable. The assignments we did were mainly short papers of a few pages - nothing terrible and all fairly graded with Ostrau's usual revision policy, and a few projects which were a little eccentric but if you tried you did fine.\""
        ],
        "Gerd Gemunden": [],
        "Klaus Mladek": [],
        "Yuliya Komska": []
    },
    "GERM030": {
        "Christine Rinne": [
            "review 1: \"04F with Christine Rinne: It seems strange to write this ever, but this course could actually have benefitted from more homework. It would not have been unpleasant, since Berlin's history is just so interesting. NOTE: THE ACTUAL PROFESSOR WAS DR. SIEGFRIED HEIMANN, NOT PROFESSOR RINNE. He was extremely knowledgable and funny.\""
        ],
        "Uwe Fuhrmann": [
            "review 1: \"22F with Uwe Fuhrmann: Uwe was a great guy. He was one of the local professors who worked with Ostrau. We had a little trouble at first as a class understanding his fast German (it was his first time teaching a class of non-native speakers) but as time went on we all got the hang of it and he slowed down too. Class itself is mainly just discussions of short readings and then excursions to sites in Berlin. Easiest class of the FSP by far. Definitely a lot of fun though. I would have appreciated a little more depth but that would likely have been hard for the LSA people.\""
        ],
        "Gerd Gemunden": [],
        "Irene Kacandes": [],
        "Klaus Mladek": [],
        "Nicolay Ostrau": [],
        "Yuliya Komska": []
    },
    "GERM029": {
        "Christine Rinne": [
            "review 1: \"04F with Christine Rinne: The professor was actually named Gesine (her first name). She was extremely funny and knowledgable about the German language. Our classes were ususally fun, which one does not often encounter at Dartmouth. The biggest problem was that we had to spend lots of time reviewing things I knew already--like passive and subjuctive--because some of my classmates were pretty poor at those structures.\"",
            "review 2: \"04F with Christine Rinne: This course was part of the German FSP to Berlin, a program which I would highly reccommend to anyone who's remotely interested. There were ups and downs to the couse/program, but overall, I feel like the setup encourages interest in theater, literature, German culture, and of course, the language.\""
        ],
        "Birga Meyer": [
            "review 1: \"22F with Birga Meyer: Birga is one of the local profs who worked with Ostrau to teach the FSP - she's a really sweet person and I enjoyed her class a lot. We went on a good number of excursions to local museums/sites and even a climate change rally, which was probably my favorite. Only downside is the class is a lot of reading at times, which is extra annoying because it cuts into your exploring Berlin time. Assignments were weekly short 1 page essays graded on completion and a final 10 page paper, which was a lot of work and graded fairly strictly but not unfairly.\""
        ],
        "Bruce Duncan": [
            "review 1: \"06F with Bruce Duncan: The course work on this FSP was way too much. Every day after class everyone would go back to their host family house and just work. No one was able to go out and explore Berlin. I would strongly suggest that if people want to go to Germany with Dartmouth profs that they do the LSA or go on the FSP with another Professor. Duncan certainly expected a lot. We had several students do more than 5 drafts on papers and still get fair grades. I personally put a lot more work into this program than I have ever put into a term at dartmouth. I also did worse than I have ever done before. It was very frustrating. Duncan is a nice guy. He is willing to meet with students, and put in a lot of time; however, he doesn't seem to realize that part of being in Berlin is being able to see it. If I had wanted to spend a term locked in the library, I could have done that at Dartmouth and saved the cost of a ticket over.\""
        ],
        "Gerd Gemunden": [],
        "Irene Kacandes": [],
        "Klaus Mladek": [],
        "Nicolay Ostrau": [],
        "Yuliya Komska": []
    },
    "GERM013": {
        "Gerd Gemunden": [
            "review 1: \"13S with Gerd Gemunden: Course: The class's materials were interesting, but they were crammed together. The lectures wavered between being interesting and incredibly boring. It really depends on the guest lecturer that day. I would have much preferred to read this stuff on my own than to take this class. The class setting was also tough because nobody was engaged, and almost nobody participated. I learned a lot about what three students had to think about German literature. Still, they took attendance daily (again high school), which was certainly the main attraction. Professor: The professor did not do a whole lot, since every lecturer was a guest, except make absolutely awful tests. A large portion of the grade was based on bi-weekly reading quizzes with fill in the blanks. These tests were trivial, eerily reminiscent of high school, and difficult. I read every shred of the material in this class, and the reading quizzes were still impossible. Simultaneously, they were prone to cheating, which made it difficult to keep up with what I would estimate to be more than a quarter of the class. The exams were a little more insightful, but they still asked surface level questions about the reading. At the end of the day, I wonder whether some thorough wikipedia research would be just as adequate as the readings. Workload: There was a lot of work. Every lecture required a good two hours of reading or a film. At the end of the course these got crammed together. Mostly, the work was frustrating because the sense of purpose in this class was very low. You could read all you wanted, and you would probably still do poorly on the reading quizzes. Then, since the exam questions were simple, you would probably not have much of an edge even if you did do the work. Somehow this class turned out to be fairly difficult, and not in an engaging sort of way. It was more that easy material turned out to yield low grades.\"",
            "review 2: \"08S with Gerd Gemunden: German 13 is definitely a survey course. This was the first term it was taught, and it wasn't a huge class, but we covered about a century of material. A lot of it was quite interesting, but we did have to rush through some things that I'd have liked to spend some more time on (Kafka, Nietzsche, Gunter Grass). Since about half of all classes are taught by guest lecturers, those vary. Gemunden himself is excellent. He's extremely knowledgeable, especially about film, which is a main interest of his. He's also a really nice guy and a pleasure to talk with.\"",
            "review 3: \"08S with Gerd Gemunden: German 13 is a pretty easy way to fill the CI requirement. There are two very short papers throughout the term, a midterm, and a final. Although Dr. Gemunden expected a lot, the grading was reasonable and fair. Professor Gemunden is a fantastic lecturer, and knows a great deal about Weimar film, a unit which was one of the most interesting parts of the course. All in all, a really interesting survey of German culture, and the frequent guest lecturers were all great.\""
        ],
        "Klaus Mladek": [
            "review 1: \"09S with Klaus Mladek: This class is a survey course, meaning that you are introduced to a variety of texts from different periods of time. To name a few, we read The Nibelungenlied, Goethe's Faust, Beyond Good and Evil and Civilization and its Discontents. Classes took the form of guest lectures. Prof. Mladek is very friendly and passionate about the material, so it's hard not to be engaged. I didn't have any background in German or German studies and I did just fine, so don't let that discourage you. There's a take-home midterm, a 2 page paper and a take-home final.\""
        ],
        "Veronika Fuechtner": [
            "review 1: \"22F with Veronika Fuechtner: No German required, though apparently you can have it contribute to your major/minor if you do extra work. Two big grades: final exam (4 hours straight of typing responses, not terribly difficult though) and group project (assigned partners, you can kind of select your general topic). Kind of excessive amount of reading and movie viewing for homework, but if you look up summaries of what you can and skim around in the films, you can get a few things to talk about when end of lecture questions come up. It's a true survey class; you literally get a dozen+ guest lecturers across the term, who are all hit or miss, majority hit. Fuechtner does the rest and she's relatively interesting. Super nice and accommodating professor. A solid portion of the readings either are meh or just super complicated, but decent material throughout. I would definitely lean calling this a layup.\""
        ],
        "Ellis Shookman": []
    },
    "GERM010.03": {
        "Michael Mcgillen": [
            "review 1: \"21S with Michael Mcgillen: Interesting topic but not a very exciting delivery of it. It was cool to read german newspapers, watch german tv, etc. but a significant portion of the class/our grade was grammar and vocab. The grammar was always difficult to follow and not well explained in class, we didn't have an answer key for the few practice problems we were assigned so you never knew if you were doing things right until you got the exams back, and the vocab was just memorizing definitions and conjugations from this sheet we were given each week. Also no idea how he graded participation or the essays. I thought I did well participating but got marked down for that, and for the essays I got the exact same grade for 3 of the 4. Oh well.\"",
            "review 2: \"21S with Michael Mcgillen: This class was ok. The grammar concepts were difficult to follow and most of the grade was based on quizzes/tests/essays. Didn't get a ton of feedback which made it hard to improve. Definitely not a bad class and not a bad prof but I would probably have rather taken a different 10-level - 10.1 is great so this one didn't really live up to expectations.\""
        ],
        "Petra Mcgillen": [
            "review 1: \"19S with Petra Mcgillen: A great class! Prof McGillen manages to make the media topics we covered genuinely interesting, without being too political or anything. Homework was very manageable, usually really short readings, radio clips, tv shows etc. depending on what genre we were covering, and grammar exercises. We had 4 ~250 word writing assignments, 4 quizzes and the final as the main parts of the grade. Quizzes were pretty easy if you put in a small amount of studying. We also had a very small class size, about 8, so you really can't get away with not participating in discussion, but it really helps your speaking skills.\"",
            "review 2: \"19S with Petra Mcgillen: This was a good course. The class was small so there was a lot of conversation which is great in a language class. There was a decent amount of grammar sprinkled in between interesting material on German media history and how it compares to the rest of the world. Professor McGillen is amazing. She is extremely accommodating, entertaining and engaging in class. Writing assignments are graded leniently and tests are easy to do well on if you learn the vocab.\""
        ],
        "Gerd Gemunden": [],
        "Michael McGillen": [],
        "Nicolay Ostrau": [],
        "Petra McGillen": [],
        "Yuliya Komska": []
    },
    "GERM010.02": {
        "Michael McGillen": [],
        "Nicolay Ostrau": []
    },
    "GERM010.01": {
        "Nicolay Ostrau": [
            "review 1: \"20F with Nicolay Ostrau: Yeah, all the other reviews hit the nail on the head. Ostrau is an incredible prof who really likes engaging with his students. My German speaking and writing improved by a lot because of this class. The content was interesting and used a lot of literature and film. Deutsch macht Spass!\"",
            "review 2: \"20F with Nicolay Ostrau: Great class! Would be better in-person but Ostrau is a very good professor and clearly cares about his students. If you show that you care about the class you'll get a good grade. Definitely made me a more confident speaker and the content of the class was all relevant and interesting.\"",
            "review 3: \"20F with Nicolay Ostrau: Ostrau is a truly great professor, and this class is a great way to improve your German in a low-stress environment. The content isn't incredibly deep (it's kind of a survey of German children's experiences across the past), so don't fret if you aren't super excited about the topic, but that's because the class is more about practicing your German, which Ostrau really knows how to help you do most effectively. The topic is more or less just the vector via which you do so. That being said, Ostrau had us watch some great German movies and has interesting readings too. Plus he's just a fun guy to be around.\"",
            "review 4: \"19F with Nicolay Ostrau: Great class. Medium workload but an almost guaranteed A if you do it all and study for the midterm (open book final). Worth taking just to hang with Ostrau although my German definitely improved too.\"",
            "review 5: \"19F with Nicolay Ostrau: Excellent class. If you have the necessary prerequisites for taking the class, I fully recommend taking this class. The workload is very manageable and as long as you do all the required assignments and don't give a poor effort, you will get an A. I still learned a lot about children throughout time in Germany and my German definitely improved. Professor Ostrau is a great teacher and always makes class fun, he's always laid back and very helpful.\"",
            "review 6: \"19F with Nicolay Ostrau: Great class! You read some really good stories and watch some of the masterpieces of German cinema, while you improve your German. Ostrau is a chill and really fun person to hang out with. The workload was a bit more than I expected, still I can say it was manageable. If you put in enough effort for this class you will definitely get an A as you improve your German.\"",
            "review 7: \"18F with Nicolay Ostrau: This class was amazing! Really enjoyable if you like speaking German. The grading is incredibly generous and Ostrau is a wonderful teacher. He explains things very well and is such a fun professor. It is impossible to do poorly in the class as long as you give some effort, and there are a lot of different grades so messing up one assignment is not the end of the world. German improved significantly and it was definitely a layup. Would highly recommend for anyone who can place into it.\"",
            "review 8: \"18F with Nicolay Ostrau: Fantastic professor and class!!!!! Ostrau is always such a fun professor to have and he did not disappoint this time. Very easy workload, very easy exams. Grammar quizzes were on Canvas and you have 1 week to complete them, open notes. So if you know enough German to qualify for this class, take it.\"",
            "review 9: \"18F with Nicolay Ostrau: This is a fantastic class and I would highly recommend! The discussions and assignments did huge things for my German speaking/reading/writing abilities. The course content itself is really interesting, and centers around German children's and youth literature and media. Assignments mostly consisted of readings of varying lengths and difficulty levels, a few films throughout the term, grammar exercises and quizzes, and four short essays. We also did a few presentations to the class. Overall, not an overwhelming amount of work. Professor Ostrau is fantastic and super friendly. As long as you put effort into the assignments and tests and do things on time, you should be able to get an A in the class.\""
        ],
        "Veronika Fuechtner": [
            "review 1: \"22X with Veronika Fuechtner: Prof. Fuechtner is a great teacher. She is caring, witty, and very understanding. For every class, there is a 1 - 2 minute recording to submit just discussing something relevant to the topic at hand in German. The actual material is fairly dry and not super interesting; but as a gateway language course, I felt it was a good environment to learn and improve in. Would recommend.\""
        ],
        "Gerd Gemunden": [],
        "Klaus Mladek": []
    },
    "GERM010": {
        "Ellis Shookman": [],
        "Eric Miller": [],
        "Gerd Gemunden": [],
        "Irene Kacandes": [],
        "Klaus Mladek": [],
        "Nicolay Ostrau": [],
        "Petra McGillen": [],
        "Veronika Fuechtner": [],
        "Yuliya Komska": []
    },
    "GERM007": {
        "Ellis Shookman": [
            "review 1: \"07F with Ellis Shookman: This class is revered by a very large number of students who have heard of it. Prof. Shookman is widely acknowledged as one of the best profs at Dartmouth. With respect to the material: it can be dense, but it offers a very interesting perspective on art, history, drama, and Greek culture, and I probably would not have encountered most of these works if I had not taken the class. And that's what college is all about, right? -- exploring new subjects, new perspectives you couldn't imagine existed before. Do the reading, and participate in the discussions.\"",
            "review 2: \"07F with Ellis Shookman: Course work: For us, the workload comprised of one oral presentation and four papers, one of which required a revision, two of which were revision-optional, and one which was research-based and did not allow a revision. Professor: Professor Shookman is an educated, wise, and very kind man. He fosters a great class dynamic and is a helpful critic and editor of writing. Worth taking? Absolutely.\"",
            "review 3: \"07F with Ellis Shookman: This was a really great class, and Professor Shookman is a really good Professor. I really loved the material and know that I will have continued interest in everything we discussed. Professor Shookman didn't spend too much time lecturing to us, first letting us discuss the works on our own, and then stepping in when we faltered. I think that this was certainly the most effective way to teach the course. The only warning I have for this course would be the research paper we had at the end. Since this class is through the German Department and the authors are all German, most of the library books are in German, which makes in extremely difficult to find sources when you don't speak German.\"",
            "review 4: \"07F with Ellis Shookman: The readings for this class are sometimes very dense and hard to understand, but overall the class was great and extremely rewarding. The classes are almost entirely discussion based, so a lot depends on the students, but I found that mostly everyone did the reading so the discussion was usually very engaging. Professor Shookman knows the material inside/out but he genuinely cares about our opinions, and he has greatly improved my writing with his meticulous comments on my papers. When the professor does comment on the reading after a long discussion, which might just consist of a few definitions from his favorite dictionary or encyclopedia or some quotes from the homework, he has an uncanny ability to shed light on problems that couldn't be resolved during the previous hour. His insights always made it easier to understand the reading, and if I come across a more organized professor at Dartmouth I would be very surprised. You do not need any previous knowledge of German literature, and if you do the reading and participate in class, by the end you may have a new appreciation for the study of humanities.\"",
            "review 5: \"07F with Ellis Shookman: I had doubts about the class at first, mainly because of the fact I was unfamiliar with the subject matter that the first works covered (art). However, I soon came to realize how great a teacher and overall human being Professor Shookman was, and his brilliance saved our discussions and enlightened us whenever they took a turn for the worse. Professor Shookman truly cares about the material and knows it incredibly well; he wants to inspire an interest in his students as well, and in the majority of cases, he succeeds. Even if the seminar itself was awful, it would be worth taking just to have Shookman, but the material, though tough to get through at times, grows on you as you go through the course.\"",
            "review 6: \"07F with Ellis Shookman: at the beginning of the class, i was wondering what i had gotten myself into. the readings bordered on horrendously dull. however, shookman is absolutely amazing. there is no other word for it. he is nice, interested, brilliant, yet not intimidating. he also offers many suggestions for improving your writing, which is really the goal of the class. if you stick with it through the rough early readings, you will be rewarded at the end with some awesome books. the class is discussion based, and i enjoyed that. you get to know how to express yourself. the freshman seminars are a mixed bag, so go with this one. you won't regret it, if only because you got to know shookman.\"",
            "review 7: \"07F with Ellis Shookman: Having taken this class, I honestly cannot understand why students gripe so much about First-Year Seminars. Not only was this class great fun but I learned a lot about both German and Greek culture, all kinds of philosophical outlooks, and ability to express myself in speaking and in writing. Definitely happy I choose this one. The only problem was that while student participation in the seminar style makes the class more fun and engaging, it cut down on Prof. Shookman talking. Since he understood the material far better than any of us, I feel like I could have learned more from him than I already did (this is not to say he never told us his interpretations). He's a great prof; though somewhat softspoken he's surpisingly articulate and creative in the material he brings in to accompany the literature. Always open to chat (and eventually to a laugh), and has plenty of good advice.\"",
            "review 8: \"07F with Ellis Shookman: I signed up for this seminar because Professor Shookman received great reviews from previous classes, and he did not disappoint. The class covers everything from dense philosophical texts to novels, poetry, and music. Some of the readings were very hard to get through, but Professor Shookman manages to explain the material and the context in which it was written. He also improved my writing a lot and is always available for meetings to discuss corrections. You'll grow to love his blue pencil.\"",
            "review 9: \"07F with Ellis Shookman: While this was a rather difficult course, it is worth taking if only for Shookman. The readings are dense, long, and filled with material many of us knew nothing about. However Shookman is very knowledgeable on the subject and his lectures are very thorough. Most of the class is discussion based so it is important to do the reading / know what you are talking about. There are also three papers of 4-5 pages and a research paper of 8-10 pages. These papers require a lot of work, and Shookman is a meticulous grader. That being said I have formed lasting friendships with many of the students in the class... mostly from complaining about assignments and bonding over last minute attempts to get work done! Shookman also teaches you to become a great writer, so if you are looking to improve your written communication this seminar is for you!\"",
            "review 10: \"06F with Ellis Shookman: Professor Shookman made what would have been a boring class (German notions of Ancient Greek Culture) into an interesting, fun class with intelligent discussions and insightful lectures.He's intelligent and you can tell he loves what he's teaching. I think most people in our class can say that they really loved going to class and didn't even mind walking all the way to the River for his lectures. One of the nicest and smartest professors I've met since I came here. He has standards and he critiques, but you know he's trying to help you with your writing and not doing it to give you a hard time. I know my papers weren't exactly what he was looking for, but he ended up being very generous with grades. Fantastic\"",
            "review 11: \"06F with Ellis Shookman: The title really says it all. Professor Shookman is amazing. I've only been here for one term and have had three awesome professors, but Professor Shookman definitely takes the cake. I wasn't originally remotely interested in the course material but Professor Shookman made it extremely intriguing: at the classes' end I could really see the tremendous influence of the Greeks on everything. The material is pretty cool -- you get to read Herder, Hegel, Nietzsche. The course starts off a bit slow with many essays (that you have to read). Essays are a bit hard to read and pretty boring at times. That just makes the plays and novels we read later on that much more exciting. You don't have to be interested in Greek culture or German literature to appreciate this course; it gets interesting anyway. We only had to write four essays and Professor Shookman gave us plenty of time on all of them. That's pretty much it for the course. Now for Professor Shookman, he is indeed the nicest, most cultured gentleman perhaps anywhere. Though he is soft-spoken, everything he says has a profound impact. He really clarifies difficult course material and facilitates discussion. In terms of writing, Professor Shookman is the best teacher you could possibly have. I disagree with the person who made Shookman out to be a mean editing fiend. On the contrary, all of Professor Shookman's edits are helpful and never critical. I would say that every single person in this seminar has improved as a writer. So if the goal of this class is to improve writing, Professor Shookman is definitely the teacher to learn from. On top of that, he's the nicest guy ever. He's also always (and I stress always) available during office hours. When he's not teaching a class, you can definitely find him in his office. He's always willing to help you out on essays and talk to you about anything that may be bothering you.\"",
            "review 12: \"04F with Ellis Shookman: Prof Shookman was great; hes a very intelligent guy and expresses himself well. I thought the books we read were all very good with the exception of Cassandra. Shookman is probably the nicest man ever, but he wants a very specific writing style and seems to care more about form that about content for the papers. I also thought that we didnt have enough time to go over some of the novels we read. The acutal work required for each class wasnt bad as far as pace is concerned, but two days is not enough to discuss Nietzsche or Hegel. That said I often found myself wishing we had less than two days to discuss other works (read: Cassandra).\"",
            "review 13: \"04F with Ellis Shookman: I didn't know what to expect when I signed up for this seminar, but it was much more fascinating than I could have guessed. Professor Shookman is great and really loves this subject. Definitely go to office hours. Also, do all the readings because discussion is alot more fun if you can participate.\"",
            "review 14: \"04F with Ellis Shookman: Prof. Shookman is a well-cultured, kind, quiet, and very intelligent man. He gives very insightful lectures and facilitated meaningful discussion. The course material was surprisingly interesting as well, including some of the great German writers and thinkers and their take on Ancient Greece. This course was a great introduction to writing and researching at Dartmouth, and I only wish more of my classes could be like this one.\"",
            "review 15: \"04F with Ellis Shookman: Professor Shookman is a very knowledgable and polite person. He is the epitome of those cultured gentlemen in western literature at the turn of the last century that you read about. However, when he gets his hands on your papers, all that politeness is gone as a sea of blue corrections sets in. I knew I wasn't a good writer when I went into the class, but I didn't think I was incompetent. (I mean, I did get exempt from English 5.) Now I really think I'm an incompetent writer. I'm just not a liberal arts person, so I didn't find the class extremely inspiring, but I suppose it's an alright class; it does knock out W and LIT distribs.\"",
            "review 16: \"04F with Ellis Shookman: Although I have only been here one term, I must say that Professor Shookman is one of the best teachers I have ever had. His passion for German and Greek culture, as well as for literature and the arts, led to fascinating lectures and discussions. I have not heard any complaints from my colleagues, nor do I have any myself. Just be prepared not to get an A on the essays, although my friends and I frequently got A-'s and B+'s. Prof. Shookman is a very thorough critic and will improve your writing significantly. This course is well worth the effort required to discuss the subject intelligently in class. I have learned much after one term.\"",
            "review 17: \"04F with Ellis Shookman: Although he doesnt teach it every year, professor Shookman runs an awesome class. If you have the opportunity to take this class, I would highly recommend it. In fact, I feel like any class with Shookman as prof would be a good choice. The reading here is interesting, and Shookman will really help with your writing.\""
        ],
        "Bruce Duncan": [
            "review 1: \"11F with Bruce Duncan: Course: Very intriguing course. You get exposed to a lot of german authors who are considered the greats of german literature. Lots of movie clips (or entire movies). Very philosophical, high-level class, very enjoyable. Professor: Great professor. Makes his expectations clear, encourages you to write about anything you want, and is a fair grader. Allows you to resubmit work. Duncan is a character, you need to take a class with him! Workload: Reading Dr. Faustus took a little more time than he expected it to, and we had to read fast to catch up. Otherwise, well paced and not too much work. Only around 4 papers, usually around 6 pages each, with a final paper of 10 to 12 pages.\"",
            "review 2: \"09F with Bruce Duncan: Professor Duncan is one of the true stars at Dartmouth. His avuncular nature and vast knowledge of both the course's subject matter and most anything else made the class not only enjoyable but a true educational experience.\"",
            "review 3: \"05F with Bruce Duncan: Professor Duncan is a great guy- very humble and surprisingly funny. He's also great at promoting class discussion. There's a lot of flexibility in the class- 3 papers and a final umbrella paper, but watch out- he'll come down on you hard for grammar and word syntax! Mostly nitpicky grammatical stuff I didn't feel really helped my writing technique or style any. Fairly objective grader though. The subject material is really what we concentrated most on, and that was pretty interesting. Occasionally he'd meander into random abstract philosophical discussions about life and art, but eventually we'd get back on track and come to some interesting conclusions about artwork and genius. It didn't really help with the essays, but it made for some interesting brain food. Some of the works are easy to read, but then you have works like Dr. Faustus which are denser than the Hanover snow in the winter time. Take those slowly and ask a LOT of questions during class- otherwise you're stuck deciphering Mann the night before the essay's due. Bottom line: if you put in the time and show up to class, you'll get a solid grade. It's really tough to get above a B+/A- though, unless you come up with some brilliant new concepts of your own and they're well organized. And go to office hours!!\"",
            "review 4: \"05F with Bruce Duncan: Prof. Duncan is very interesting and inspires exciting discussion. He doesn't mind be argued with and i think he might actually enjoy it. Dr. Faustus was a hard read, and the time alotted was not nearly enough, but Prof. Duncan was pretty understanding. Be prepared to spend a lot of time reading and be prepped for class. There are no real lecture plans, student questions and comments drive discussion. He's a tough essay grader, but always accepts rewrites and give lots of helpful comments. I definitely recommend this class!\"",
            "review 5: \"05F with Bruce Duncan: Although the subject is somewhat abstract, the discussions were usually interesting and for the most part the works we read were interesting and not too difficult. Professor Duncan is really helpful and very understanding. The amount of writing was about average, but with no research paper the time spent on essays was fairly minimal. I would definitely recommend this for your seminar, and I would take another class with Professor Duncan if he didn't teach the rest of his classes in German!\"",
            "review 6: \"05F with Bruce Duncan: this is a really great class, it had the potential to be extremely boring, i think, but the prof inspired good discussion most of the time - the readings were all very interesting *with the exception of dr. faustus* for which you should defintely spend the time on pink monkey or cliff notes or whatever because it's dense, long, uninteresting, and the prof gives you like two weeks to read it. despite faustus and the fact i ended up with an unsatisfactory grade, if i had to pick a freshman seminar all over again i'd pick this class.\"",
            "review 7: \"05F with Bruce Duncan: Prof. Duncan is a cool guy. He's very enthusiastic, but can also be very nit-picky. Most of the readings were awesome, except for Doctor Faustus which was huge and long and unbearable.\"",
            "review 8: \"05F with Bruce Duncan: Bruce Duncan is a good professor and knows the material well. I personally had not read any german authors prior to this course except for Grass (who was *not* one of the authors we studied, disappointingly,) and I felt like this course was an excellent introduction to german literature. Nothing much experimental or controversial here, the works are fairly straightforward and, although more challenging than leisure reading, were not difficult. Overall a great class.\""
        ],
        "Steven P.": [
            "review 1: \"03F with Steven P.: Professor Scher has a great sense of humor and clearly knows his subject. the only problem i ever encountered with him was that sometimes i felt he didn't understand what i was asking, but perhaps that was more my fault than his. the reading is difficult, the pace is quick, but the discussions are not that demanding. You are expected to give an oral report on one assigned aspect of each major novel, but you get to do it with a partner. this class is for people that don't mind reading good but dense literature.\"",
            "review 2: \"03F with Steven P.: The material is interesting, but gets redundant after reading about 2000 pages of the same style in a very condensed amount of time. Professor definitely knows his stuff, but tends to interupt students and say things liek \"you've never heard of (insert write/composer X here)?!?! how can you not have heard of him, thats a crime!\"\"",
            "review 3: \"03F with Steven P.: While i wasnt that interested in Thomas Mann after reading so much of his work, the class was still solid in terms of its general academic characteristics.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"01F with Ulrike Rainer: I really like Thomas Mann's writing, but I'm not sure this class did it justice. The pace was extremely fast, so it felt like the students barely had time to absorb the material. I found myself needing to read for four or more hours at a sitting, which meant that I was simply reading to get through the pages and not to digest any of the content. In addition, the lectures tended to drag on (it was a 10A class, and two hours discussing books which most of the students haven't had a chance to finish can get a bit dull). I definitely recommend reading Mann, but I'm just not sure this class was the best setting in which to do it.\"",
            "review 2: \"01F with Ulrike Rainer: Thomas Mann is an excellent author who addresses many topics in his works. His prose is humorous and ironic, and he incorporates many elements of philosophy, theology, politics, etc . . . in his books. Professor Rainer is a kind woman who seems to thoroughly enjoy teaching. Class was interesting as she incorporated music, movies, and other media that related to Thomas Mann. She did dominate class discussion though, and there were only a few instances in which the students engaged each other in active discussion. The German Studies department as a whole is quite sound. Professor Shookman, who won a best teacher prize at Dartmouth a few years ago, gave our class an informative presentation on the Faust tradition. Professors Shookman and Rainer even offered a dramatic reading of Goethe in German. Even though I don't understand a word of German, it was nice to see that they care enough to make that kind of effort.\""
        ],
        "Klaus Mladek": []
    },
    "GERM006": {
        "Ellis Shookman": [
            "review 1: \"06W with Ellis Shookman: This class - German 06- has got to be a difficult one to teach. It's the intro class for German literature, for kids who go into it having had only 2 terms of German at Dartmouth, taught on the LSA simultaneously w/ German 3 (a run-through of basic German grammar) & German 5 (history/art history). The content of this course, from what I hear, is basically up to the prof, & Shookman did an excellent job making it manageable and not too intimidating, but at the same time providing us with decent, interesting literature. We read out of a book called \"Mitlesen, Mitteilen\" (roughly, read together, share together, i think) which includes a bunch of short stories by fairly contemporary authors. The 1st one, \"Mittagpause,\" is only a page long. you read approximately 1 story per class, not always... the reading's very reasonable, although if you really want to understand everything, it can take a while to look up all the words, 'cause you're vocabulary's (obviously) not very good at the beginning of the term especially. The essays are very doable too. Because it's our 1st class of literature in German (reading, discussions, writing, answers to questions - everything's in German) the essays we're supposed to write are really short - 1 to 2 pp. tops. You turn in rough drafts of everything, which the prof corrects for you, then make corrections & turn in final copies for a grade. Shookman's a very fair grader - he's demanding & doesn't like mistakes on papers (understandably, when he's corrected them once) and demands good work for a good grade. You need to have something to say & support it with textual citations- bs won't fly. But the grades are fair & not horribly hard. In discussions, Shookman is absolutely amazing - highly recommended in German or English - his English German in translation classes are without question among the best classes in the school. Especially in those, he says very little, but asks incredibly thought-provoking questions that somehow make the students themselves come to insights about the works, on their own, as it were. He has to talk more in this class than sometimes, considering he's the only one who really knows German, but it's still a thought-provoking discussion class impressively so for how little of the language you go in knowing. There are also lots of little group excercises that we did in class - fun, mostly, & helped a lot with language practice.\""
        ],
        "Irene Kacandes": [],
        "Klaus Mladek": [],
        "Petra McGillen": [],
        "Veronika Fuechtner": [],
        "Yuliya Komska": []
    },
    "GERM005": {
        "Christine Joppich": [
            "review 1: \"19X with Christine Joppich: This review contains some identifying info but I really don't care because this class was the low point of my (otherwise terrific) LSA experience. Don't let this class stop you from going on the LSA, because it's incredible otherwise. But dear god this class was almost insufferable. In class, we only covered one topic in detail, the Brandenburger Tor. I did learn a lot from the presentations of classmates, but these were presented under the specter of very unclear presentation requirements. For example, my presentation date was the first in the class. On the syllabus this project was marked as “Thesenpapier/Referat/Filmprojekt.” Noting that, my partner and I each wrote Thesenpapiers for our respective topics, I put five hours into preparing a short film about our topic, and they worked towards creating a brief slideshow for our presentation. On the presentation date, Christine was surprised that I’d made a film for the “Filmprojekt” and did not want me to play it for the class out of fear that any grammatical mistakes in the text fields of the film would be seen by classmates and subconsciously replicated. We did play the film but only after she explained that the “Filmprojekt” part of this large project did not actually require creating a film; rather, one from YouTube would suffice. In later presentations other classmates created films but they had to be without text. I found this to be frustrating, especially considering that after her grades were filed, I still have no clue how my partner and I performed on this project worth 40% of our term grade. Only 30% worth of our grades were ever returned, and my final grade in the class was equal to the worst graded assignment that I'd received back. On the bright side she did bring breakfast once and Haribo a few times.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"07S with Ulrike Rainer: Frau Dr. Joppich, who taught this course, was a great prof. She was often really enthusiastic about the class, would be unbelievably accommodating about deadlines, and although she'd be picky about making sure we'd pronounce things correctly and write correctly, she was always very polite about it. She also uses \"du\" instead of \"Sie\", unlike the other profs, which I though was good.\""
        ],
        "Irene Kacandes": [],
        "Klaus Mladek": [],
        "Petra McGillen": [],
        "Veronika Fuechtner": [],
        "Yuliya Komska": []
    },
    "GERM003": {
        "Konrad Kenkel": [
            "review 1: \"04F with Konrad Kenkel: Professor Kenkel is very fair and has a fun personality. He always lets you know exactly what you need to know for papers, tests and quizes. If you enjoy the german language, I highly recommend taking classes with Professor Kenkel.\"",
            "review 2: \"04F with Konrad Kenkel: Kenkel is great. Really nice and understanding about assignments, needing help, etc.\"",
            "review 3: \"04F with Konrad Kenkel: His grading system seems arbitrary and his tests draw from such a large area as to make studying very difficult.\"",
            "review 4: \"02S with Konrad Kenkel: The language departments at Dartmouth are ranked high for a reason, the profs (most of them) are very personable and enthusiastic! They can motivate you to continue go to class, and learn learn learn--for fun. And learning any language is such a practical thing, don't just do it for the requirement. I took German 1,2, 3 senior year just for interest and once again my belief that the language program at Dartmouth is one of the best holds true. Prof. Kenkel knows his stuff and knows how to get across to students. Prof. Alfers, always with a smile, is great to talk to, she's very understanding and approaches teaching in a more active way, she's really energized and that's great for a morning class. Learn German, learn any language and don't stop!\""
        ],
        "Ulrike Rainer": [
            "review 1: \"07S with Ulrike Rainer: Frau Gesine Voesthe-Scherer, who taught this course, was a good prof. My main issue is, another student in the class would ask the same question of \"Why\" about some aspect of grammar, and the student persisted with the question after she didn't get a decent response (of course you can never ask \"why\" for a language's grammar - it just is). The quizzes were good, generally, as were most things in the course, though I felt we went too slowly - we didn't need to do Konjunktiv II again, really, since we did it in German 2. I didn't like how we could write about absolutely anything for our diary entries, as it made it harder to think about what to write about. Otherwise, the course was cool, and not much work (100 words per diary entry, which means per week, a weekly quiz, and a 5 min presentation at some point during the term on something in Berlin).\"",
            "review 2: \"05S with Ulrike Rainer: This class was terrible. It was a mix of students who want to continue with german and people who are trying to fullfill the language requirement. The latter fell easily behind. Rainer moves too quickly wiht the material and expects students to spend an unreasonable amount of time learning the massive numbers of vocab words.\"",
            "review 3: \"05S with Ulrike Rainer: While I really liked Professor Rainer and found her lectures on the readings fairly interesting, I think she came into this class thinking we were a lot more comfortable with the German language than we actually were. There was too much vocabularly to learn in each assignment for the pace that the assignments were given. I had to put a lot of time into this class just to complete the homework assignments and as a result I didn't have time to review and really absorb the material. My grade was saved by the open-book take-home final exam. This class required too much effort for the little I ended up taking away from it. I reccomend taking German 3 with another professor, but Rainer's higher-level courses might be worthwhile if you have the language down already.\"",
            "review 4: \"01F with Ulrike Rainer: This course is designed to reinforce material learned in German 1 and 2. It wasn't terribly exciting, and it didn't require too much effort as compared to most courses here at Dartmouth. I would only recommend it to those who have a strong interest in improving their German skills or wish to get a further education in the German language. Frau Rainer made the information as interesting as possible, and I would be interested in taking another course with her.\""
        ],
        "Eric Miller": [
            "review 1: \"21W with Eric Miller: I strongly recommend taking this class with Professor Miller. He is very understanding and the class discussions are a lot of fun. The work load is not bad at all, personally I found it much more manageable than German 2. Learning is really fun with Professor Miller without any stress about trying to keep up or get a good grade.\"",
            "review 2: \"07F with Eric Miller: Professor Miller is a definite scatterbrain, but in the best way possible. It's not only a lesson on German grammar, but all his tangents really bring in a lot of other information. He's a very animated, passionate professor and it helps make an easily boring subject pretty entertaining.\"",
            "review 3: \"07F with Eric Miller: this course was phenomenal! Professor Miller is scatterbrained and pins way too much on his \"middle-aged\" condition, but it just endears you to him all the more. This term was almost a complete bust for me, and Professor Miller was there at random hours just to hang out and talk or to discuss classwork or whatever came up. I don't normally go to office hours, but I was a frequent visitor at his. The textbook wasn't great, but we also got to read a detective novel in class. What other class lets you read that kind of stuff?! For a mystery junkie, it was heaven. Oh, and if you are looking for your German to improve, never fear; it will.\""
        ],
        "Heidi Denzel": [
            "review 1: \"21W with Heidi Denzel: Heidi is really sweet. She's an engaging lecturer and is quite good at explaining minutiae from German grammar to current issues re: gender and race in Germany. She sometimes gets behind with grading but was generally very receptive to my needs as a student amidst Covid.\"",
            "review 2: \"21F with Heidi Denzel: Heidi is an amazing professor! She cares a lot about her students and really focuses on learning from mistakes instead of penalizing them. The small class could feel a little slow sometimes due to the virtual format, but I think overall she did a really good job of engaging students and adapting to Zoom. Having had her in person and virtually, I can say that she's just as enthusiastic through a camera as she is in real life. If you want a fun language-learning experience without a ton of pressure, you should absolutely take this class with her!\""
        ],
        "Nicolay Ostrau": [
            "review 1: \"17F with Nicolay Ostrau: Fantastic!! Professor Ostrau is such an outstanding professor. Each morning as the students walk into class, he has a mini conversation with each one, asking how their weekend was or what their plans for the day are. He is great at involving all the students during the class discussion and makes you feel comfortable learning a new language.\""
        ],
        "Christine Rinne": [
            "review 1: \"03F with Christine Rinne: I doubt my experience is very representative of the department or the prof. this class had only 5 students and most of these didnt come to class a lot of the time. these presented a lot of problems with the format of the class and it was pretty bogged down. Nevertheless, Christine Rinne is a good teacher and a very cool person, and I'd Recommend her as a prof, and I'd recommend the class, under normal circumstances\""
        ],
        "Veronika Fuechtner": [
            "review 1: \"06S with Veronika Fuechtner: German 3 with Veronika Fuechtner is a very demanding class. The average workload is about one essay per week and multiple readings and workbook assignments due for each class period. The movies and readings are very interesting and usually so are the coinciding class discussions. However, the tests have nothing to do with what we covered in class. Veronika Fuechtner has many redeeming qualities as a professor; she is young, energetic, and knowledgeable. All attributes suggest that she will be an excellent professor in the future. Currently, however, she has several things that must change. She assigns so much homework that I did not have enough time to actually retain much from what I was studying â€“ I only thought about finishing the assignments. Also, her class lectures are pretty interesting, but there is no logical connection between her lectures and her tests. Overall, she is an energetic professor who cares about her students but needs some time to develop. Oh, and the text book sucks!\""
        ],
        "Christopher Schnader": [
            "review 1: \"07S with Christopher Schnader: but my german got tons better. schnader is a great and really understanding prof.\""
        ],
        "Gesine Voeste-scherer": [
            "review 1: \"19X with Gesine Voeste-scherer: I would return to Berlin solely to take a class from Gesine at the Goethe Institut, where she also occasionally teaches. This class made me want to speak German better every single day. As a note -- this class only covers grammar and writing but goes beyond Dartmouth German 3 standards in both. It was the single best language class I've ever had.\""
        ],
        "Klaus Mladek": [
            "review 1: \"20S with Klaus Mladek: I took the class online in spring, but I could still tell that Klaus was a really good prof. Definitely learned a lot despite bad circumstances. The class is a lot of work but not too hard to manage and very fairly graded. Definitely take german 3 with Klaus if you like film/literature, he definitely incorporates a lot of cool cultural stuff into the class!\""
        ],
        "Ellis Shookman": [],
        "Irene Kacandes": [],
        "Michael McGillen": [],
        "Petra McGillen": [],
        "Yuliya Komska": []
    },
    "GERM002": {
        "Bruce Duncan": [
            "review 1: \"08W with Bruce Duncan: If you want to learn a lot about the German culture/ mentality/ customs, Professor Duncan loves to help you on that. He'll spend aprox. 60-80% of the class talking, mostly in English, about Germany/Germans, depending on the questions students ask. We had people who were going on the LSA and wanted to know more and they kept feeding his enthusiasm. The prof is really sweet, however, and is helpful in explaining grammar/vocab etc. if you ask questions. The bad thing is that he puts almost no importance on the vocabulary, but that makes it very difficult to handle gender of the nouns and cases later. My advice would be to translate the sentences he sends and to do work on a regular basis and not get caught up in the apparent low expectations the teacher has from you.\"",
            "review 2: \"08W with Bruce Duncan: While German 2 may not seem like the most exciting class on paper, Bruce Duncan definitely makes this class awesome. He is one of the most hilarious and entertaining teachers I have ever had, and he definitely made this class worthwhile. In terms of the actual coursework, it can be hard at times to know how well you're doing because the quizzes aren't actually graded, and the only grade that really counts at the end is the final. So in a way it's good if you don't do well on one quiz, but it also puts some extra pressure on the final exam. Duncan made this class really fun and enjoyable for everyone, and really tries to cater to each student's need. Even if you're not a huge fan of German, I would definitely recommend taking this class.\"",
            "review 3: \"07S with Bruce Duncan: Duncan is a very nice professor, who tends to be tangential in his lectures, but is generally animated and interesting. However is grading policy is difficult--only exams count, and the exams are extremely difficult; thus it is very hard to get a decent grade in this class.\"",
            "review 4: \"05W with Bruce Duncan: Duncan is a really interesting Prof, and would probably be great in a upper level class. While he does a great job covering cultural material, Duncan spends less than one class period a chapter on grammatical points. This makes the class really challenging, especially in the last week when you learn three tenses of verbs. Duncan is a really nice prof, but I wouldn't recommend him for an intro level course\"",
            "review 5: \"05W with Bruce Duncan: Professor Duncan is great. He's like a 60-year old, rosy-cheeked, silver-haired drill instructor with 30 years of experience. I never had any problems paying attention in class, even when he talked for almost the whole hour in class. I think professor D is very liberal/progressive in both his politics and his methods, which meeds that you don't get any grades, except on the midterm. Everything else is \"schon\" or \"gut\" or \"gemischt\". It's entirely subjective, based on his analysis of your objective mastery of the subject at the end of term. On tests you can cross out words you don't know and replace them with ones you do. I think this was the easiest course I've had at Dartmouth so far\"",
            "review 6: \"05W with Bruce Duncan: Prof Duncan is a great guy whose love for German is what really makes this class interesting. He explains the grammar but balances it with lots of anecdotes, activities, etc. about German culture. He lets you learn at your own pace and takes a very practical approach to what is important to test and what isn't. He doesn't count the chapter quizzes, which is great if you can still make yourself study the material without being forced to. His teaching style can be a little less interactive than that of other profs at times. Despite the fact that this class revolves around learning lots and lots of extremely technical grammar, I was hardly ever bored. If you need or want to take German 2, take it with Duncan.\"",
            "review 7: \"02F with Bruce Duncan: Professor Duncan is such a cute, sprightly little man who obviously loves German and everything about Germany. SOoo energetic, so cheerful (not in an annoying way), and love the little anecdotes he tells in class. It's a little tough, but SO worth it, and he's a very fair grader. I mean, crossing out words you don't know? Seriously? Awesome. PS- Lexiconomon kind of blows\"",
            "review 8: \"02F with Bruce Duncan: The course is a pretty standard language class, except for the prof. Prof Duncan is probably one of the top ten profs on campus. He is inspired, and enthusiastic, and a great lecturer. Also, his grading system is set up in a way that favors the student and gives you the benefit of the doubt. The other nice thing about German is that drill only meets 4 times a week, not 5, so you get to sleep in one day during the week as well!!\"",
            "review 9: \"02F with Bruce Duncan: After high school German, I dreaded the subject, yet Professor Duncan inspired within me a love for it, to such an extent that I will continue past the requirement, and plan to obtain a German minor. Professor Duncan's wide knowledge of language and his many personal stories allow him to make even grammar a fascinating course of study. I recommend this course without any reservation, and with much enthusiasm. It is for courses and professors such as these that I attend Dartmouth.\""
        ],
        "Ellis Shookman": [
            "review 1: \"08F with Ellis Shookman: shookman was a decent prof. he tried hard to make 10 weeks of german grammar seem exciting, but he didn't really succeed. that said, he was an excellent instructor as far as explaining the necessary concepts. the time commitment for this class was almost entirely built around mandatory class using every x-hour and drill 4x per week. outside of that, there weren't really any assignments.\"",
            "review 2: \"06F with Ellis Shookman: Shookman is the man. He is probably one of the best professors I've had at Dartmouth. I learned more German in this one term than I did all 4 years I took it in high school.\"",
            "review 3: \"05F with Ellis Shookman: Shookman is a complete riot in the classroom, making his students feel comfortable with making the inevitable errors in learning a language as well as keeping up interested in the gritty grammar work that accompanies learning a language. Shookman is the BEST language teacher I have ever had (I also have taken spanish at dartmouth through lower to upper levels). He is one of the best language professors at this school. I reccommend his class to anyone who wants to learn German. Do the necessary work and you will be speaking German in no time.\"",
            "review 4: \"05F with Ellis Shookman: Professor Shookman was engaging and explained all gramatical concepts and new words clearly and with flair. My only complaint is that he stuck too closely to the exercises in the book and could therefore be slightly boring in class.\"",
            "review 5: \"05F with Ellis Shookman: Professor Shookman is amazing. He's really entertaining and engaging, classes just flew by. It has been one of my favorite classes so far at Dartmouth. If you get a chance definitely take a class with him.\"",
            "review 6: \"05F with Ellis Shookman: This course was a very comprehensive review of basic German grammar. It didn't feel tedious, though, due to the fact that every class was more like a performance than a lecture. Prof. Shookman is incredibly entertaining and very in tune with the material. The supplements to the book provided (music in German, tidbits of interesting vocabulary/idiomatic expression) were truly interesting and helpful in truly understanding and appreciating the language. The drill component was also very helpful. Friends who took German for years in high school tell me that I am learning things in this course that they never came across even in passing. While the pace is rather quick, the course and professor facilitate quick and lasting comprehension. German 2 was certainly a wonderful introduction to Dartmouth, and it is perfect evidence to support the claim that Dartmouth professors are among the best teachers in the country.\"",
            "review 7: \"01F with Ellis Shookman: I consider myself very fortunate to have had Prof Shookman this term. He definitely has a mastery of the language, that this course only scratched the surface of. for that reason, however, he inspires interest in higher level german classes. For those going on an LSA for german 3, this is a great lead-up. Although, there was not much deviation from the course materials (videos, language lab, textbook)we did go over those materials very thoroughly. overall, the course and prof were thorough and interesting.\""
        ],
        "Gerd Gemunden": [
            "review 1: \"05S with Gerd Gemunden: Prof. GemÃ¼nden is a nice guy, but the class was paced a little too fast.\"",
            "review 2: \"05S with Gerd Gemunden: Prof Gemunden is the best professor I've had at Dartmouth. He's so receptive to students' needs and understands the difficulty of learning a foreign language. The class material and homework assignments were really helpful.\"",
            "review 3: \"05S with Gerd Gemunden: He teaches the class well and gives several useful handouts. It was a bit quick-paced though. It seemed as though as soon as we took a quiz on one chapter we had another quiz on the next chapter. Prof. Gemunden is very willing to answer all and any questions, and only uses English when necessary.\"",
            "review 4: \"05S with Gerd Gemunden: Make sure to take a GemÃ¼nden class. His classes are something to look forward to each day because they're exciting and he runs them with a great sense of humor, which is helpful when you're just learning the language. It makes you want to learn more and inspires interest in German.\"",
            "review 5: \"04F with Gerd Gemunden: Prof Gemunden is amazing, but he makes you work harder than some other german profs.\"",
            "review 6: \"04F with Gerd Gemunden: I enjoyed the class and the professor is really nice.\""
        ],
        "Nicolay Ostrau": [
            "review 1: \"21F with Nicolay Ostrau: I loved this class! Professor Ostrau always made an effort to make his classes engaging and fun. My German got so much better without me ever having to stress about it. There are a lot of assignments but nothing undoable.\"",
            "review 2: \"20F with Nicolay Ostrau: Incredible class, and Prof Ostrau is probably one of my favorite professors at Dartmouth. Before class starts he always checks in with you and asks how things are going (in German ofc), and he's always open to questions, whether in class or in office hours. Took German 1 with him and German 2 only made me like the department more. Tests were extremely fair and not graded harshly, and he gives you a lot of feedback on writing which definitely helped me improve with that.\"",
            "review 3: \"19W with Nicolay Ostrau: Prof Ostrau is a great professor. My German ability improved a lot over this term. His marking is fair and easy. Although the workload is not light, if you do it, you will get an A in this class no problem. Take this class with Ostrau if you can.\"",
            "review 4: \"19S with Nicolay Ostrau: A very solid class. Lots of work but all of it is clear and with an obvious goal towards better mastery of the language. Ostrau is great -- funny, forgiving, and clear. The class is a big step up from German 1, with much more writing required. I felt like my German improved a lot. Assessment for the class is largely based off of short essays and communicative tasks, whereas all of the tests (including the final) are worth 25%. There is one short presentation and daily homework. Grading is generally lenient, and I felt like most of the class was rewarded for the amount of time they dedicated. Would highly highly recommend taking any introductory class with Ostrau.\""
        ],
        "Christopher Schnader": [
            "review 1: \"07W with Christopher Schnader: schnader is a pretty fair grader, and if you do the homework you can do well. there isnt much work and is a pretty stressless course.\"",
            "review 2: \"07W with Christopher Schnader: Most of the class was pretty easy. Just be sure to go over everything grammar-related for finals, and quickly review the genders of some key words (though don't borther trying to learn them all at the end). I should add that since I took some German in high school, and had the option of taking German 3 instead, my perspective might be a little different.\"",
            "review 3: \"07W with Christopher Schnader: not a bad class. I learned german, without too much work. Prof. Schnader needs a little bit more time. He has good intentions, but has new prof syndrome.\"",
            "review 4: \"07W with Christopher Schnader: I love German, but this prof has really inspired me to stop here and not bother with German 3. He never really teaches, he just reiterates the homework and asks if we had questions on the previous night's reading. Then he manages to waste the remaining 45 minutes of class by stading up and doing some juvenile activities on the board. That might sound like fun, but not at 9 AM, when you've already been awake for 2 hours due to moring drill. Do yourself a favor and take German 2 with Shookman the next time he teaches it.\""
        ],
        "Sandra Alfers": [
            "review 1: \"02W with Sandra Alfers: This class had potential to be very good, but ended up just being frustrating instead. A lot of the frustration comes from the very, very rigid grading. A translation on a test may be worth only 2 points and you may do it entirely correct, except, for example, a misplaced umlaut and you will lose a full point for it. This is a class that definietly does not suffer from the current \"grade inflation\" hysteria. Prof Alfers was a generally good prof especially in class. Unfortunately, she wasn't as helpful outside of class and most of her help was just to tell students to get a tutor. She was also interviewing for jobs elsewhere and therefore missed a lot of classes for that. We ended the class being taught by Prof Kenkel because Prof Alfers hurt herself in a car accident, which was still too bad. I did generally like Kenkel better, though.\"",
            "review 2: \"02W with Sandra Alfers: I don't know if my experience is going to be anyone else's experience. But for German 1 I had 3 different teachers, and for German 2 I had something like 8. For some reason the department couldn't find anyone to teach my class. One morning our quiz was actually given by the German Department secretary. It was incredibly boring - never challenging or creative - and still because of the changing teachers it was hard to learn the basic stuff. As I said, this probably won't happen to anyone else, but it has happened to me for two terms in a row. The reasons for the chaos are all things like sickness and so on, so I don't want to blame the German department for having all these bad things happen to them. But maybe it's just a department to steer clear of for a little while until they get themselves organised again. I am very frustrated with it all.\"",
            "review 3: \"02W with Sandra Alfers: See this review along with the \"Learn German\" review for German 3. I'm so happy I decided to take on a language for interest and not for the requirement. The class had great dynamics, go to know the others well. This is usually the case for any language class! Drill can be a tight group if you open up to the experience, especially the bonding from having to get up for 7:45am together. As for Prof. Alfers, she has the makings to be one of the great profs that make Dartmouth such a strong college. I hope she can stay on many years here, take a class with her and you'll see how worthwhile it is. Profs. can be inspiring and she's one of them. Learning German is fun and the same goes for any language so I highly recommed this and other language courses as well =)\""
        ],
        "Christine Rinne": [
            "review 1: \"06W with Christine Rinne: Professor Rinne is an awesome teacher. I think it helps out that she is pretty young and seems more in tune with the needs of students and seems to know what will interest us. The quizes are pretty straightforward and so are the homework assignments. All in all a pretty simple course for fulfilling your language requirement.\"",
            "review 2: \"05W with Christine Rinne: After taking German 2 with Professor Rinne, my German has definitely improved, though I wonder if that's a function of her teaching or just reading the book. Rinne is easy to get along with, doesn't assign too much work, and teaches effectively. I found class often dragged, though this perhaps was due more to an underwhelming course scope than to anything Prof. Rinne did. Exams and quizzes were fair and not too difficult. All in all, I would recommend Prof. Rinne.\"",
            "review 3: \"05W with Christine Rinne: When reading the reviews from last year, it made it seem like Professor Rinne wasn't a good prof. Contrary to that belief, she's young but energetic and excited about teaching german. It's wonderful to see. There are some odd times when you have to do excercises in the book and it's silent, but it's not that bad. The course itself isn't too bad either. It helps to write out a sheet of grammer as you go along and relate it back to the grammer you learned previously, otherwise it's easy to get lost in all the different forms.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"06W with Ulrike Rainer: Nothing to wild or wooly in this class. It was pretty straight forward, yet quite a bit of fun. Professor Rainer knows the language very well and is full of energy.\"",
            "review 2: \"04W with Ulrike Rainer: prof rainer is energetic, enthusiastic and a great teacher. i thoroughly enjoyed class and looked forward to it.\"",
            "review 3: \"04W with Ulrike Rainer: ...the water's fine. Seriously, I have 3 years plus between me and this course, but from what I recall Prof. Rainer is very fair, although she has little patience for slackers. The material itself was what one expects in an introductory level language class. I'd recommend it!\""
        ],
        "Yuliya Komska": [
            "review 1: \"18W with Yuliya Komska: Great class and amazing prof. Yuliya really cares about pushing students to their limits and forcing them to be good at German. She wants everyone to succeed. At first I thought she was too intense. Really, she is deeply invested in her students and maximizing their abilities. This is a little tough to keep up with, but I learned so much, and I really love and admire Yuliya.\"",
            "review 2: \"08W with Yuliya Komska: i would say that if you take german classes with prof komska, you learn A LOT. but you will definitely have to put in time too. the other german section was a lot easier but definitely not as interested and upbeat. yuliya really keeps the class interesting but at the end, esp around exam time, be prepared to spend time studying for quizzes, write essays, and other homework. it can really add up and that can be really frustrating at times esp for such an introductory level language course. overall, enjoyable time though. and yuliya is really nice.\""
        ],
        "Heidi Denzel": [
            "review 1: \"20W with Heidi Denzel: Heidi was great! She was super helpful in class and really cared about our learning. Tests weren't graded very harshly but I definitely still learned a ton even if the grading itself wasn't strict. Would definitely recommend her classes to anyone who wants to learn german!\""
        ],
        "": [
            "review 1: \"21F with Nicolay Ostrau: I loved this class! Professor Ostrau always made an effort to make his classes engaging and fun. My German got so much better without me ever having to stress about it. There are a lot of assignments but nothing undoable.\"",
            "review 2: \"20W with Heidi Denzel: Heidi was great! She was super helpful in class and really cared about our learning. Tests weren't graded very harshly but I definitely still learned a ton even if the grading itself wasn't strict. Would definitely recommend her classes to anyone who wants to learn german!\"",
            "review 3: \"20F with Nicolay Ostrau: Incredible class, and Prof Ostrau is probably one of my favorite professors at Dartmouth. Before class starts he always checks in with you and asks how things are going (in German ofc), and he's always open to questions, whether in class or in office hours. Took German 1 with him and German 2 only made me like the department more. Tests were extremely fair and not graded harshly, and he gives you a lot of feedback on writing which definitely helped me improve with that.\"",
            "review 4: \"19W with Nicolay Ostrau: Prof Ostrau is a great professor. My German ability improved a lot over this term. His marking is fair and easy. Although the workload is not light, if you do it, you will get an A in this class no problem. Take this class with Ostrau if you can.\"",
            "review 5: \"19S with Nicolay Ostrau: A very solid class. Lots of work but all of it is clear and with an obvious goal towards better mastery of the language. Ostrau is great -- funny, forgiving, and clear. The class is a big step up from German 1, with much more writing required. I felt like my German improved a lot. Assessment for the class is largely based off of short essays and communicative tasks, whereas all of the tests (including the final) are worth 25%. There is one short presentation and daily homework. Grading is generally lenient, and I felt like most of the class was rewarded for the amount of time they dedicated. Would highly highly recommend taking any introductory class with Ostrau.\"",
            "review 6: \"18W with Yuliya Komska: Great class and amazing prof. Yuliya really cares about pushing students to their limits and forcing them to be good at German. She wants everyone to succeed. At first I thought she was too intense. Really, she is deeply invested in her students and maximizing their abilities. This is a little tough to keep up with, but I learned so much, and I really love and admire Yuliya.\"",
            "review 7: \"08W with Yuliya Komska: i would say that if you take german classes with prof komska, you learn A LOT. but you will definitely have to put in time too. the other german section was a lot easier but definitely not as interested and upbeat. yuliya really keeps the class interesting but at the end, esp around exam time, be prepared to spend time studying for quizzes, write essays, and other homework. it can really add up and that can be really frustrating at times esp for such an introductory level language course. overall, enjoyable time though. and yuliya is really nice.\"",
            "review 8: \"08W with Bruce Duncan: While German 2 may not seem like the most exciting class on paper, Bruce Duncan definitely makes this class awesome. He is one of the most hilarious and entertaining teachers I have ever had, and he definitely made this class worthwhile. In terms of the actual coursework, it can be hard at times to know how well you're doing because the quizzes aren't actually graded, and the only grade that really counts at the end is the final. So in a way it's good if you don't do well on one quiz, but it also puts some extra pressure on the final exam. Duncan made this class really fun and enjoyable for everyone, and really tries to cater to each student's need. Even if you're not a huge fan of German, I would definitely recommend taking this class.\"",
            "review 9: \"08W with Bruce Duncan: If you want to learn a lot about the German culture/ mentality/ customs, Professor Duncan loves to help you on that. He'll spend aprox. 60-80% of the class talking, mostly in English, about Germany/Germans, depending on the questions students ask. We had people who were going on the LSA and wanted to know more and they kept feeding his enthusiasm. The prof is really sweet, however, and is helpful in explaining grammar/vocab etc. if you ask questions. The bad thing is that he puts almost no importance on the vocabulary, but that makes it very difficult to handle gender of the nouns and cases later. My advice would be to translate the sentences he sends and to do work on a regular basis and not get caught up in the apparent low expectations the teacher has from you.\"",
            "review 10: \"08F with Ellis Shookman: shookman was a decent prof. he tried hard to make 10 weeks of german grammar seem exciting, but he didn't really succeed. that said, he was an excellent instructor as far as explaining the necessary concepts. the time commitment for this class was almost entirely built around mandatory class using every x-hour and drill 4x per week. outside of that, there weren't really any assignments.\"",
            "review 11: \"07W with Christopher Schnader: schnader is a pretty fair grader, and if you do the homework you can do well. there isnt much work and is a pretty stressless course.\"",
            "review 12: \"07W with Christopher Schnader: I love German, but this prof has really inspired me to stop here and not bother with German 3. He never really teaches, he just reiterates the homework and asks if we had questions on the previous night's reading. Then he manages to waste the remaining 45 minutes of class by stading up and doing some juvenile activities on the board. That might sound like fun, but not at 9 AM, when you've already been awake for 2 hours due to moring drill. Do yourself a favor and take German 2 with Shookman the next time he teaches it.\"",
            "review 13: \"07W with Christopher Schnader: not a bad class. I learned german, without too much work. Prof. Schnader needs a little bit more time. He has good intentions, but has new prof syndrome.\"",
            "review 14: \"07W with Christopher Schnader: Most of the class was pretty easy. Just be sure to go over everything grammar-related for finals, and quickly review the genders of some key words (though don't borther trying to learn them all at the end). I should add that since I took some German in high school, and had the option of taking German 3 instead, my perspective might be a little different.\"",
            "review 15: \"07S with Bruce Duncan: Duncan is a very nice professor, who tends to be tangential in his lectures, but is generally animated and interesting. However is grading policy is difficult--only exams count, and the exams are extremely difficult; thus it is very hard to get a decent grade in this class.\"",
            "review 16: \"06W with Christine Rinne: Professor Rinne is an awesome teacher. I think it helps out that she is pretty young and seems more in tune with the needs of students and seems to know what will interest us. The quizes are pretty straightforward and so are the homework assignments. All in all a pretty simple course for fulfilling your language requirement.\"",
            "review 17: \"06W with Ulrike Rainer: Nothing to wild or wooly in this class. It was pretty straight forward, yet quite a bit of fun. Professor Rainer knows the language very well and is full of energy.\"",
            "review 18: \"06F with Ellis Shookman: Shookman is the man. He is probably one of the best professors I've had at Dartmouth. I learned more German in this one term than I did all 4 years I took it in high school.\"",
            "review 19: \"05W with Bruce Duncan: Duncan is a really interesting Prof, and would probably be great in a upper level class. While he does a great job covering cultural material, Duncan spends less than one class period a chapter on grammatical points. This makes the class really challenging, especially in the last week when you learn three tenses of verbs. Duncan is a really nice prof, but I wouldn't recommend him for an intro level course\"",
            "review 20: \"05W with Bruce Duncan: Prof Duncan is a great guy whose love for German is what really makes this class interesting. He explains the grammar but balances it with lots of anecdotes, activities, etc. about German culture. He lets you learn at your own pace and takes a very practical approach to what is important to test and what isn't. He doesn't count the chapter quizzes, which is great if you can still make yourself study the material without being forced to. His teaching style can be a little less interactive than that of other profs at times. Despite the fact that this class revolves around learning lots and lots of extremely technical grammar, I was hardly ever bored. If you need or want to take German 2, take it with Duncan.\"",
            "review 21: \"05W with Bruce Duncan: Professor Duncan is great. He's like a 60-year old, rosy-cheeked, silver-haired drill instructor with 30 years of experience. I never had any problems paying attention in class, even when he talked for almost the whole hour in class. I think professor D is very liberal/progressive in both his politics and his methods, which meeds that you don't get any grades, except on the midterm. Everything else is \"schon\" or \"gut\" or \"gemischt\". It's entirely subjective, based on his analysis of your objective mastery of the subject at the end of term. On tests you can cross out words you don't know and replace them with ones you do. I think this was the easiest course I've had at Dartmouth so far\"",
            "review 22: \"05W with Christine Rinne: After taking German 2 with Professor Rinne, my German has definitely improved, though I wonder if that's a function of her teaching or just reading the book. Rinne is easy to get along with, doesn't assign too much work, and teaches effectively. I found class often dragged, though this perhaps was due more to an underwhelming course scope than to anything Prof. Rinne did. Exams and quizzes were fair and not too difficult. All in all, I would recommend Prof. Rinne.\"",
            "review 23: \"05W with Christine Rinne: When reading the reviews from last year, it made it seem like Professor Rinne wasn't a good prof. Contrary to that belief, she's young but energetic and excited about teaching german. It's wonderful to see. There are some odd times when you have to do excercises in the book and it's silent, but it's not that bad. The course itself isn't too bad either. It helps to write out a sheet of grammer as you go along and relate it back to the grammer you learned previously, otherwise it's easy to get lost in all the different forms.\"",
            "review 24: \"05S with Gerd Gemunden: Prof Gemunden is the best professor I've had at Dartmouth. He's so receptive to students' needs and understands the difficulty of learning a foreign language. The class material and homework assignments were really helpful.\"",
            "review 25: \"05S with Gerd Gemunden: Prof. GemÃ¼nden is a nice guy, but the class was paced a little too fast.\"",
            "review 26: \"05S with Gerd Gemunden: He teaches the class well and gives several useful handouts. It was a bit quick-paced though. It seemed as though as soon as we took a quiz on one chapter we had another quiz on the next chapter. Prof. Gemunden is very willing to answer all and any questions, and only uses English when necessary.\"",
            "review 27: \"05S with Gerd Gemunden: Make sure to take a GemÃ¼nden class. His classes are something to look forward to each day because they're exciting and he runs them with a great sense of humor, which is helpful when you're just learning the language. It makes you want to learn more and inspires interest in German.\"",
            "review 28: \"05F with Ellis Shookman: Professor Shookman is amazing. He's really entertaining and engaging, classes just flew by. It has been one of my favorite classes so far at Dartmouth. If you get a chance definitely take a class with him.\"",
            "review 29: \"05F with Ellis Shookman: Shookman is a complete riot in the classroom, making his students feel comfortable with making the inevitable errors in learning a language as well as keeping up interested in the gritty grammar work that accompanies learning a language. Shookman is the BEST language teacher I have ever had (I also have taken spanish at dartmouth through lower to upper levels). He is one of the best language professors at this school. I reccommend his class to anyone who wants to learn German. Do the necessary work and you will be speaking German in no time.\"",
            "review 30: \"05F with Ellis Shookman: This course was a very comprehensive review of basic German grammar. It didn't feel tedious, though, due to the fact that every class was more like a performance than a lecture. Prof. Shookman is incredibly entertaining and very in tune with the material. The supplements to the book provided (music in German, tidbits of interesting vocabulary/idiomatic expression) were truly interesting and helpful in truly understanding and appreciating the language. The drill component was also very helpful. Friends who took German for years in high school tell me that I am learning things in this course that they never came across even in passing. While the pace is rather quick, the course and professor facilitate quick and lasting comprehension. German 2 was certainly a wonderful introduction to Dartmouth, and it is perfect evidence to support the claim that Dartmouth professors are among the best teachers in the country.\"",
            "review 31: \"05F with Ellis Shookman: Professor Shookman was engaging and explained all gramatical concepts and new words clearly and with flair. My only complaint is that he stuck too closely to the exercises in the book and could therefore be slightly boring in class.\"",
            "review 32: \"04W with Ulrike Rainer: prof rainer is energetic, enthusiastic and a great teacher. i thoroughly enjoyed class and looked forward to it.\"",
            "review 33: \"04W with Ulrike Rainer: ...the water's fine. Seriously, I have 3 years plus between me and this course, but from what I recall Prof. Rainer is very fair, although she has little patience for slackers. The material itself was what one expects in an introductory level language class. I'd recommend it!\"",
            "review 34: \"04F with Gerd Gemunden: I enjoyed the class and the professor is really nice.\"",
            "review 35: \"04F with Gerd Gemunden: Prof Gemunden is amazing, but he makes you work harder than some other german profs.\"",
            "review 36: \"03F with Veronika Fuechtner: The prof is laid back and very friendly. She makes time at the beginning of each class for informal discussions. Then she keeps class moving along with little daily partner activity worksheets which were sometimes less than thrilling, but it's an introductory language course so we have to learn the language somehow. Then about half the class or less was spent going through the book's lessons, which was bearable. Her lectures made sense, and she was good at addressing any questions that came up. Tests were fair and there really was very little work outside of class, other than just keeping up with grammar and vocab.\"",
            "review 37: \"02W with Sandra Alfers: See this review along with the \"Learn German\" review for German 3. I'm so happy I decided to take on a language for interest and not for the requirement. The class had great dynamics, go to know the others well. This is usually the case for any language class! Drill can be a tight group if you open up to the experience, especially the bonding from having to get up for 7:45am together. As for Prof. Alfers, she has the makings to be one of the great profs that make Dartmouth such a strong college. I hope she can stay on many years here, take a class with her and you'll see how worthwhile it is. Profs. can be inspiring and she's one of them. Learning German is fun and the same goes for any language so I highly recommed this and other language courses as well =)\"",
            "review 38: \"02W with Sandra Alfers: This class had potential to be very good, but ended up just being frustrating instead. A lot of the frustration comes from the very, very rigid grading. A translation on a test may be worth only 2 points and you may do it entirely correct, except, for example, a misplaced umlaut and you will lose a full point for it. This is a class that definietly does not suffer from the current \"grade inflation\" hysteria. Prof Alfers was a generally good prof especially in class. Unfortunately, she wasn't as helpful outside of class and most of her help was just to tell students to get a tutor. She was also interviewing for jobs elsewhere and therefore missed a lot of classes for that. We ended the class being taught by Prof Kenkel because Prof Alfers hurt herself in a car accident, which was still too bad. I did generally like Kenkel better, though.\"",
            "review 39: \"02W : The professor was not altogether bad but failed to teach much per se, rather expecting students to do so in their own busy time and resorting to criticism and correction during class meetings.\"",
            "review 40: \"02W with Sandra Alfers: I don't know if my experience is going to be anyone else's experience. But for German 1 I had 3 different teachers, and for German 2 I had something like 8. For some reason the department couldn't find anyone to teach my class. One morning our quiz was actually given by the German Department secretary. It was incredibly boring - never challenging or creative - and still because of the changing teachers it was hard to learn the basic stuff. As I said, this probably won't happen to anyone else, but it has happened to me for two terms in a row. The reasons for the chaos are all things like sickness and so on, so I don't want to blame the German department for having all these bad things happen to them. But maybe it's just a department to steer clear of for a little while until they get themselves organised again. I am very frustrated with it all.\"",
            "review 41: \"02F with Bruce Duncan: Professor Duncan is such a cute, sprightly little man who obviously loves German and everything about Germany. SOoo energetic, so cheerful (not in an annoying way), and love the little anecdotes he tells in class. It's a little tough, but SO worth it, and he's a very fair grader. I mean, crossing out words you don't know? Seriously? Awesome. PS- Lexiconomon kind of blows\"",
            "review 42: \"02F with Bruce Duncan: After high school German, I dreaded the subject, yet Professor Duncan inspired within me a love for it, to such an extent that I will continue past the requirement, and plan to obtain a German minor. Professor Duncan's wide knowledge of language and his many personal stories allow him to make even grammar a fascinating course of study. I recommend this course without any reservation, and with much enthusiasm. It is for courses and professors such as these that I attend Dartmouth.\"",
            "review 43: \"02F with Bruce Duncan: The course is a pretty standard language class, except for the prof. Prof Duncan is probably one of the top ten profs on campus. He is inspired, and enthusiastic, and a great lecturer. Also, his grading system is set up in a way that favors the student and gives you the benefit of the doubt. The other nice thing about German is that drill only meets 4 times a week, not 5, so you get to sleep in one day during the week as well!!\"",
            "review 44: \"01F with Ellis Shookman: I consider myself very fortunate to have had Prof Shookman this term. He definitely has a mastery of the language, that this course only scratched the surface of. for that reason, however, he inspires interest in higher level german classes. For those going on an LSA for german 3, this is a great lead-up. Although, there was not much deviation from the course materials (videos, language lab, textbook)we did go over those materials very thoroughly. overall, the course and prof were thorough and interesting.\""
        ],
        "Veronika Fuechtner": [
            "review 1: \"03F with Veronika Fuechtner: The prof is laid back and very friendly. She makes time at the beginning of each class for informal discussions. Then she keeps class moving along with little daily partner activity worksheets which were sometimes less than thrilling, but it's an introductory language course so we have to learn the language somehow. Then about half the class or less was spent going through the book's lessons, which was bearable. Her lectures made sense, and she was good at addressing any questions that came up. Tests were fair and there really was very little work outside of class, other than just keeping up with grammar and vocab.\""
        ],
        "Eric Miller": [],
        "Michael McGillen": [],
        "Petra McGillen": []
    },
    "GERM001": {
        "Konrad Kenkel": [
            "review 1: \"06F with Konrad Kenkel: This is a great intro class to German. You might be a little overwhelmed by the fast pace but you really do get an amazing amount out of this class. As long as you put in efforts consistently, you'll do well for this class.\"",
            "review 2: \"05F with Konrad Kenkel: Professor Kenkel has been teaching German for 30 some years and his experience is evident.\"",
            "review 3: \"05F with Konrad Kenkel: The class itself is paced slowly, and the grading is easy as well. Still, you learn everything that you need to, and the prof is a great dude.\"",
            "review 4: \"05F with Konrad Kenkel: Nothing out of the ordinary. Prof. Kenkel is a solid professor with a good sense of humor. He isn't dependent on the textbook or the workbook, which is nice. German isn't too difficult to learn as long as you give it a steady effort.\"",
            "review 5: \"03F with Konrad Kenkel: Languages come far easier to some than others. If you have a natural talent for linguistics, than you'll have no trouble, otherwise you have to put in the time a work. Prof. Kenkel had a good sense of humor and taught the subject well. Some quizzes were very easy while others seemed very difficult. He's a bit difficult to get ahold of outside of class (Our syllabus and his door apparently had office hours different from his real office hours) but he's a good prof.\"",
            "review 6: \"03F with Konrad Kenkel: Prof Kenkel is an old school style of foreign language teacher. You won't be doing much of the boring \"sally meets jane\" elementary sentences, nor will you be speaking much German in class. He goes right into the grammar, goes through it fast, and then takes a few days to let it sink in. You basically have to do the vocab on your own, which isn't hard, but you learn the grammar pretty well in class. Also, he's pretty entertaining too. Drill in the morning is terrible; if you can get get it in the afternoon take it then.\"",
            "review 7: \"03F with Konrad Kenkel: If you are looking to take German 1 (for credit, a major, or just for fun), Prof. Kenkel is the guy to take it with. He made the material fun and related it to the students in the class. Also took the chance to get to know all of us. Very fun class.\"",
            "review 8: \"03F with Konrad Kenkel: German 1 is exactly what you should expect out of a beginner language couse. It seemed like the quizes came very fast after we learned the material, but surprisingly you can absorb the material in time. His translation sections on quizzes and tests are pretty tricky, but he grades on a curve, so not to worry. His grading on tests was a little funky. there was only about 5 points that separated an A from a B on several of them. For my drill section, drill was miserable, since our instructor was terrible, but i hear that some actually care about drill/show up on time regurlarly Also, Kenkel will tell you very often of his love of german beer, as well as the inferiority of weak, American beer.\"",
            "review 9: \"03F with Konrad Kenkel: If you have an interest in German, take German 1 with Professor Kenkel. He was funny in class, which made the lectures more interesting and entertaining. He engaged the class by asking students questions in German that they had to answer back in German. It was a fun class.\"",
            "review 10: \"01F with Konrad Kenkel: Kenkel teaches everything in terms of grammar. At first this is very confusing, but after a while it all starts coming togethr into an over-all picture. He teaches in a fairly old-fashioned way. There won't be songs and games and skits and jokes. More like verb conjugations. Go ahead and take German, it's a good language - fairly easy to understand and similar to English. And the course is not much work at all. But get a different teacher (I recommend Ulrike Rainer who I had for the first half of the year, and Sandra Alfers who I had for one day. There is more fun and games in their classes.)\"",
            "review 11: \"01F with Konrad Kenkel: I really didn’t want to learn German. I took this course because I had to and because I had a little German in high school. I wouldn’t recommend you take it unless you have taken German before otherwise it will be too much to learn. Lectures were worthless and tests were graded too harshly.\"",
            "review 12: \"01F with Konrad Kenkel: Foreign language intros are better than any other introductary courses. I love the small class size. Drill stinks. Everyone knows that. Waking up for a 745 class 4 days a week is not fun. Think about evening drill if it fits into your schedule. It's hard to rate to the prof for this course, because we had 3. Ulrike Rainer taught the first 4 weeks. There was an illness in the department which switched all the profs around. Konrad Kenkel taught the last 6 weeks. He had a few obligations so he missed class and Bruce Duncan taught about 4 classes. As you can imagine there was some material that was missed and some material that was covered twice. I think this is a fluke thing though. One prof for the whole term would have made this class go more smoothly. I actually enjoyed class. It's fun to learn the language and have frequent opportunities to speak in the small class.\""
        ],
        "Christine Rinne": [
            "review 1: \"06W with Christine Rinne: Each week we covered a new chapter in the book and each chapter had tons of material so you gotta stay on top of the grammar and vocab. The material itself is easy especially if u have a background in grammar of another language, but even if you don't it's still pretty easy\"",
            "review 2: \"06W with Christine Rinne: the class is pretty easy, as long as u stay on top of the material. it starts to weigh on you wen u start falling behind. helps if ur good at grammar in general, since that's wat the class is mostly about.\"",
            "review 3: \"06W with Christine Rinne: German 1 was a really fun class! Prof Rinne is great. She explained things simply and practically (ex. if you go to Germany, this is what you need to know). She also has a great sense of humor. She gave us plenty of activities and handouts to supplement the textbook/workbook, so it was very easy to learn the material in class.\"",
            "review 4: \"06W with Christine Rinne: good intro language class.\"",
            "review 5: \"05W with Christine Rinne: German department is gr8. Take this class for sure. Material is covered at just the right pace, and homework is useful, and not too abundant.\"",
            "review 6: \"05W with Christine Rinne: This class made it easy to start learning German; Prof Rinne does a good job. I would recommend taking it.\"",
            "review 7: \"05F with Christine Rinne: German 1 was a pretty interesting class and fair. While some of the material was presented and testing upon ridiculously quickly, it wasn't terrible. Professor Rinne is very nice and good at explaining things, not too hard. Enjoyable class.\"",
            "review 8: \"03F with Christine Rinne: For me, this class was 3 1/2 years ago, and memories are dimming. I remember that it was not too stressful, and for the non-previously-taught-German kids, it was not too difficult. I'd recommend it to anyone needing a language credit, and to anyone wanting to brush-up their German.\"",
            "review 9: \"03F with Christine Rinne: I had no knowledge of German at all before I took the course. It seemed daunting at the beginning but turned out not hard. The professor is really nice and helpful. I enjoyed the class.\"",
            "review 10: \"03F with Christine Rinne: I thought the proff was really good at trying to give us things that would be relevent to us and keep our interest as well as the regular course matterial.\""
        ],
        "Irene Kacandes": [
            "review 1: \"09F with Irene Kacandes: The material is your standard Intro German, and, as a foreign language, is actually very manageable. I wasn't a very big fan of the textbook. I thought it was weak on grammar explanation, but it had a lot of example problems for you to work out. There are tests every week or two with an oral component, a midterm, and a final. The tests aren't too difficult, but they are graded very strictly. Missing capitalization on any nouns, misplaced umlauts, etc.. will all result in points taken off. One problem I had with the class was that grades were somewhat arbitrary. You get a score of +x or -x (there is extra credit) on your tests, but they don't correlate to any specific grade. I got the feeling that Prof. Kacandes simply picked everyone's grades at the end of the term. I would describe Professor Kacandes as a double edged sword. She knows a lot about German, cares about the subject, and is a committed teacher. At the same time, she is simply too intense for German I. She expects every student to act like a German major, and she will jump on students for not understanding the material. A common theme in any review of her is a conflicted view of how sensitive she is towards her students. In one sense, she is sensitive because she will go out of her way to make sure that students of different ethnical, religious, sexual, and educational background feel equally welcome. But, she will not hesitate to tear students down, she demands complete respect, and maintains a very high view of herself. All in all, I give a mixed recommendation of her as a German I teacher. She would be fantastic to take an upper-level German class with, but she was too intense for German I and it really turned me off to the language. At the same time, I did learn a lot and I probably could have put more effort in from my side.\"",
            "review 2: \"04F with Irene Kacandes: Kacandes is a good prof, and by the end of the term, the students have a very solid grasp of the languange. For an intro level language course, she is very intimidating. You're either right or you're wrong. If you can get over that, though, I would highly recommend taking any of the beginning German classes with Kacandes\"",
            "review 3: \"04F with Irene Kacandes: Prof Kacandes was pretty solid and I learned most of the material in class.\"",
            "review 4: \"04F with Irene Kacandes: This was a great experience for my first term at Dartmouth! I'm still amazed by how much German I was able to learn in 10 weeks. Like any language class, this one required some out-of-class studying to do well, but it wasn't a ridiculous time commitment and there's really no way around the need for memorization and practice. I found that the class was paced in a way that made it challenging enough to be interesting without being impossible. Prof Kacandes was wonderful and really knew how to explain things clearly. I found her comments and corrections in class and on the homeworks very helpful. She did a great job trying to make the learning process fun and she also taught us a lot about the best ways way to efficiently study a language so that you retain what you learn. If you want or need to take a language at Dartmouth, German with Prof Kacandes is a great choice. You'll learn a lot in a little time and have fun doing it.\"",
            "review 5: \"04F with Irene Kacandes: People I had spoken to about introductory German had told me that Kacandes was not the professor to take it with. I had to take the 9 section, however, so I had no choice. Fortunately, I ended up LOVING this class. I enjoy being challenged by language learning, and Kacandes definitely did that. It's not a course where the material is spoon-fed - you're supposed to come to it on your own. You're also expected to be prepared every day, because it helps keep up the speed of the course. I couldn't have asked for a better introduction to German!\"",
            "review 6: \"04F with Irene Kacandes: I liked learning the German language. The professor was difficult and very demanding in class. The teaching method was effective though and I have learned a large amount of German for my first term.\""
        ],
        "Heidi Denzel": [
            "review 1: \"23W with Heidi Denzel: Heidi Denzel is a great prof, takes you through all the content at the right pace. This class is definitely a lot of work if you’ve done no German before, but put in the work, and you should get an A. Online interactive is very time consuming, but straightforward and good practice. Expecting the class to be an A/A- median. Plenty of extra credit opportunities, grading is nice. No final exam, only a pretty chill final presentation. Tests every alternate week on material. First three tests were in person, last 2 were online, which was great. The material of the class is also pretty interesting, with a couple of modules on German geography and culture. Highly recommend taking GERM 1 with Heidi Denzel.\"",
            "review 2: \"23W with Heidi Denzel: Heidi is an awesome prof. Very flexible with deadlines and she makes the class super low stress. There is quite a bit work but I found learning German to be pretty fun and you will be rewarded as long as you put in the effort. Highly recommend taking this class with Heidi.\"",
            "review 3: \"23W with Heidi Denzel: THIS CLASS IS NOT A LAYUP. If you take it with Heidi, you can bs your way to an A no doubt, but you might not be as prepared as you could be for German 2 -- she is a good teacher though and if you want to put in the effort you'll learn a lot. Heidi is an incredibly compassionate person. Very kind yet fair grader, but she'll give you extra work to raise your grade if you do badly on the tests and want an A. If you do all the HW for the class, it's a lot.\"",
            "review 4: \"20F with Heidi Denzel: Not really a layup. Soooooo much work and the tests are hard af. Take in mind I have never taken any German in my life. Anyway, the prof is very engaging, sweet, fun and understanding. If you take German 1 take it with HEIDI DENZEL. She's hands down one of the sweetest and most charismatic profs I've taken at Dartmouth. She is a fair grader and who's out of her way to get to know you. TAKE IT WITH HER\"",
            "review 5: \"19F with Heidi Denzel: Great class with a very happy professor! Professor Heidi is one of those professors that really wants to see you do well in her class so she's willing to meet with you outside of class, change test dates, take in homework late (and not mark it as such), etc. She likes to throw in little tidbits about the culture of Germany into her lessons and even teaches you random words that she thinks are fun to learn. Really not a hard class if you study the vocab and grammar aspects for each test and go to drill.\""
        ],
        "Christopher Schnader": [
            "review 1: \"09F with Christopher Schnader: I took this class to learn German and to satisfy my language requirement. It was a good choice. Schnader is a good language teacher; the best one I have had. At Dartmouth, the amount of class time (including drill) for languages is very large, so I had a lot of exposure to the language. For non-natural language learners, it will take some extra work to keep up completely, but it is not bad.\"",
            "review 2: \"08W with Christopher Schnader: ... maybe. I don't have that much experience with beginning language classes, but it seemed fairly standard - and thus at times rather dull. At least, I feel that it takes an amazing professor to make the first steps of learning a language at all interesting - and Schnader wasn't an amazing prof. He wasn't bad, though, either, although a few people in my class seemed to react horribly to him. His grading was sometimes anal-retentive.\"",
            "review 3: \"07F with Christopher Schnader: This course wasn't really that bad-in order to really nail the quizzes and tests, you'll have to put in a decent amount of work and memorization every day, just because the class is paced really fast, but the material itself is not overly difficult. Schnader knows what he's talking about and is a bit quirky, but he wants people to do well. If you're willing to stick out the early morning drill and class, then it's worth it.\"",
            "review 4: \"06F with Christopher Schnader: Schnader is just a visiting lecturer, and while some of his in-class activities felt a little juvenile and pointless sometimes, he actually turned out to be a very good teacher. He covers all aspects of learning a language well, and includes plenty of cultural knowledge too. His quizzes were always on the easier side, and he is a very fair grader (almost to a fault). When it came time for the final, which was written by a different professor, we all did fine. Professor Schnader can be a little neurotic sometimes, but he provided a solid foundation for learning German. Definitely a recommended course/professor.\""
        ],
        "Klaus Mladek": [
            "review 1: \"04F with Klaus Mladek: When a prof walks in on the first day and only speaks German, it can be really overwhelming. But as the classes went on, things became more and more clear. Prof. Mladek is a really great teacher; he always answers our questions, always encourages us, and always, always smiles. The class is challenging yet very fulfilling and worthwhile. Jetzt, ich spreche gern Deutsch!\"",
            "review 2: \"04F with Klaus Mladek: This class is a great class. Prof Mladek is an enthusiastic teacher who tries to ensure that all students understand what is going on. The tests are fair and the pacing is just right. I would be hard-pressed to find any complaints with this course. Definitely do not be worried about taking this course, just do it.\"",
            "review 3: \"04F with Klaus Mladek: If you can take German 1 (or any other German course) with Professor Mladek, do so! Mladek teaches effectively, is incredibly responsive, kind, and hilarious. I really enjoyed this course, and hope that I can take another with Prof. Mladek.\"",
            "review 4: \"04F with Klaus Mladek: work load just right. prof was excellent.\""
        ],
        "Yuliya Komska": [
            "review 1: \"20F with Yuliya Komska: I love Yuliya!!! she is an amazing professor. She really pushes students to learn and it was by far my favorite class this term. She's willing to and often offers to meet after class for individual assistance. The class can be time consuming but it is not hard, if you do your work you will do well and learn a lot of German. Take it with Yuliya if you can!\"",
            "review 2: \"07F with Yuliya Komska: i decided to take german1 randomly and sat in on the first class and loved it so decided to stay with it! the prof is awesome - yuliya is very entertaining and makes the class a lot of fun! definitely recommended. though it was a lot more work for an intro language class than i expected but definitely easily do-able\"",
            "review 3: \"07F with Yuliya Komska: This class was a lot of work at times but was overall not too difficult and a great way to start learning German.\""
        ],
        "Eric Miller": [
            "review 1: \"18F with Eric Miller: I highly recommend taking this class with Erich. He is hilarious and has great stories that accompany the teaching really well. There's a fair amount of work each night but it is very structured. If you keep up and study for the short quizzes that are given each day then it is difficult to do poorly. B+/A- is very attainable without too much studying beyond each night's work. Getting an A would be easier if you practice the ungraded Quizlets as they came up in the homework instead of only doing the reading and graded exercises. I've heard good things about other German instructors but Erich is the man. Wish he was teaching German 2/3 in the near future.\"",
            "review 2: \"18F with Eric Miller: Eric Miller is an incredibly easy going and nice professor. So fun to be in his class. He goes on tangents all the time, so we didn't learn a lot, but the tests are easy, and you'll learn enough from the homework. This class is practically a guaranteed A, but the homework is a lot. Take it with Eric if you want an easy A.\"",
            "review 3: \"18F with Eric Miller: This is a class with a substantial amount of work, but it's easy work. The hardest part is completing the homework, but tests aren't graded harshly at all, and his class is always a good time. Prof Miller is hilarious and goes on a lot of tangents, but it was always a class that I didn't dread because of how fun it was. He's also very open to extensions provided you have a reason, and overall he's just an incredibly chill guy, and I wish I could take another class with him. And, you do learn a fair bit of German at the same time.\""
        ],
        "Sandra Alfers": [
            "review 1: \"02F with Sandra Alfers: This was a really good class and Sandra Alfers is an excellent professor. She is dynamic and funny and makes a genuine interest to get to know each student in the class. Although I have no basis for comparison, I've been told that Alfers is the best professor to take intro level German with. Her lectures are clear and even though she is from Germany, she speaks flawleess English and can effectively answer questions put to her. If you are at all interested in German, I recommend taking German I with Alfers.\"",
            "review 2: \"01F with Sandra Alfers: Not to say that it is hard to inspire interest in the German language and German studies, but just to say it is difficult to get students to want to participate in extra/activity events related to a class in general, shows how wonderful a Prof Alfers is. She not only helped us learn the language as much as in her power, made class fun, and was kind and interesting, she also, I would say, got at least 3/4 of the class to attend some extra events on our own free will, because she had inspired the interest/desire in us. She's amazing!!!\"",
            "review 3: \"01F with Konrad Kenkel: Kenkel teaches everything in terms of grammar. At first this is very confusing, but after a while it all starts coming togethr into an over-all picture. He teaches in a fairly old-fashioned way. There won't be songs and games and skits and jokes. More like verb conjugations. Go ahead and take German, it's a good language - fairly easy to understand and similar to English. And the course is not much work at all. But get a different teacher (I recommend Ulrike Rainer who I had for the first half of the year, and Sandra Alfers who I had for one day. There is more fun and games in their classes.)\""
        ],
        "Ulrike Rainer": [
            "review 1: \"05S with Ulrike Rainer: This class gives you a strong grasp of the material, although it can sometimes not be tedious. On-line exercises are very convenient and effective. Not too much work.\"",
            "review 2: \"05S with Ulrike Rainer: Prof Rainer seems like she really enjoys teaching this class and is always excited to be there. She's really good - I highly reccomend her.\"",
            "review 3: \"01F with Konrad Kenkel: Kenkel teaches everything in terms of grammar. At first this is very confusing, but after a while it all starts coming togethr into an over-all picture. He teaches in a fairly old-fashioned way. There won't be songs and games and skits and jokes. More like verb conjugations. Go ahead and take German, it's a good language - fairly easy to understand and similar to English. And the course is not much work at all. But get a different teacher (I recommend Ulrike Rainer who I had for the first half of the year, and Sandra Alfers who I had for one day. There is more fun and games in their classes.)\"",
            "review 4: \"01F with Konrad Kenkel: Foreign language intros are better than any other introductary courses. I love the small class size. Drill stinks. Everyone knows that. Waking up for a 745 class 4 days a week is not fun. Think about evening drill if it fits into your schedule. It's hard to rate to the prof for this course, because we had 3. Ulrike Rainer taught the first 4 weeks. There was an illness in the department which switched all the profs around. Konrad Kenkel taught the last 6 weeks. He had a few obligations so he missed class and Bruce Duncan taught about 4 classes. As you can imagine there was some material that was missed and some material that was covered twice. I think this is a fluke thing though. One prof for the whole term would have made this class go more smoothly. I actually enjoyed class. It's fun to learn the language and have frequent opportunities to speak in the small class.\""
        ],
        "Petra Mcgillen": [
            "review 1: \"22F with Petra Mcgillen: One of the great things about the class was that if your grade on the final exam was higher than your overall grade in the class, the final grade in your transcript would be the grade from your final exam. I didn’t put as much effort as I should’ve because of taking other challenging classes at the same time and I still got a great grade because of this policy. The prof is absolutely lovely. Professor McGillen was the sunshine in my life lighting up the gloomy autumn days and confusing German grammar. If you have an opportunity to take this class with her, DO IT. Most people in the class also had a crush on our Austrian TA, which was a very funny thing to observe.\""
        ],
        "Eric A.": [
            "review 1: \"11F with Eric A.: Prof. Miller is a very exciting prof. But he gets off topic A LOT, which can be good or bad. When it gets close to a chapter test/exam time its hard to get him to answer questions directly and stay on topic. He is also a tough grader, even when you put in extra effort. So just a warning, he won't cut you any slack. Besides that his random tangents and stories about Hamburg (his birthplace) can make for some very entertaining classes. Also, very good about meeting you whenever you need him even at the last moment.\""
        ],
        "Bruce Duncan": [
            "review 1: \"06S with Bruce Duncan: Standard entry level language course. I will be the first to admist that I didn't put the time I should have into this course (story of my college career), but I learned a bunch and never wanted to let Prof. Duncan down. Hands down one of the coolest profs at dartmouth. Super friendly, super reponsive, super laid back. You know he was one of those guys back in the day you would want to party with. The best part of class is when he goes on these random (yet pertinent) tangets and some of the mose ridiculous stuff comes out of his mouth. He makes a lot of funny sexual/drinking/partying innuedo jokes. If you take German, hope to get prof Dunc\"",
            "review 2: \"01F with Konrad Kenkel: Foreign language intros are better than any other introductary courses. I love the small class size. Drill stinks. Everyone knows that. Waking up for a 745 class 4 days a week is not fun. Think about evening drill if it fits into your schedule. It's hard to rate to the prof for this course, because we had 3. Ulrike Rainer taught the first 4 weeks. There was an illness in the department which switched all the profs around. Konrad Kenkel taught the last 6 weeks. He had a few obligations so he missed class and Bruce Duncan taught about 4 classes. As you can imagine there was some material that was missed and some material that was covered twice. I think this is a fluke thing though. One prof for the whole term would have made this class go more smoothly. I actually enjoyed class. It's fun to learn the language and have frequent opportunities to speak in the small class.\""
        ],
        "Veronika Fuechtner": [
            "review 1: \"02F with Veronika Fuechtner: This course was very quick-paced, and it was a good introduction to the German language. My previous experience with languages in high school was much more laid back, so I struggled to keep up with the material during the first few weeks. Although I found the language interesting, the classes themselves were somewhat boring. The professor didn't have a lot of enthusiasm for the subject and just kind of flew through the material without explaining it well. I was able to keep up only by doing extensive work on my own outside of class and also because I had a fantastic drill instructor who really encouraged me to learn German. I would recommend the language to anyone, however, I would suggest possibly looking for a class with a different professor.\""
        ],
        "Ellis Shookman": [
            "review 1: \"09W with Ellis Shookman: He is, I swear. I needed to take German to fulfil my language requirement and have always been really interested in German culture but Shookman's class totally engaged me and I loved going to every 745am drill and every 50 minute class with him. I learnt more in this one 9-week (winter term is short) class than I did in 2 full years of high school spanish and when I realised Shookman wouldn't be continuing German 2 with us I was kind of let off. He makes every class interesting, has a just right mixture of English and German spoken during class so you understand everything he's saying and even learning grammar is a breeze, even though German grammar is a lot different to many other languages. He encourages lots of class participation, and his exams (though I heard are harder than a lot of other intro german classes) are fair, and always have a listening, reading and speaking portion to encompass the whole language experience. Though the final (40% of the grade) was a lot harder and longer than the quizzes and midterms (50 minutes each only) I was amazed at how much I learnt in such a short period of time and how much interest he inspired in me for the language and the culture. The Deutsch Heute textbook also has a great structure/format which makes it easy to learn and also easy to review when it comes time for quizzes which grammar summaries at the end of each chapter and vocab lists included throughout. I decided to apply for the LSA before taking the class and German 1 totally multiplied my interest in going to Berlin thousandfold. If you're undecided on what language to take to fulfil your requirement TAKE GERMAN WITH SHOOKMAN.\""
        ],
        "Gerd Gemunden": [],
        "Michael McGillen": [],
        "Nicolay Ostrau": [],
        "Petra McGillen": []
    }
}