{
    "HEBR063.01": {
        "Lewis Glinert": []
    },
    "HEBR061.01": {
        "Lewis Glinert": []
    },
    "HEBR059": {
        "James Dorsey": [],
        "Jonathan Smolin": [],
        "Lewis Glinert": [],
        "Tarek El-Ariss": []
    },
    "HEBR051": {
        "Nurit Ben-Yehuda": []
    },
    "HEBR022": {
        "Nurit Ben-Yehuda": []
    },
    "HEBR021": {
        "Nurit Ben-yehuda": [
            "review 1: \"22S with Nurit Ben-yehuda: I have taken many Hebrew classes with Nurit (who only plans on teaching a few more years after 2022). She is a typical Israeli professor full of tough love for her students. Her archaic, worksheet and memorization based teaching style certainly teaches the basics of the language. I walk away from each class with a better understanding of Hebrew. Her tests are hard and require studying, and you must go to office hours with her or set up meetings to get on her good side. That said, she is extremely knowledgeable about the grammar and ancient/modern structure of Hebrew words and her lessons can be quite interesting. I recommend investing yourself into her class style and it will pay off. Take Hebrew to help continue Hebrew education at Dartmouth!\""
        ],
        "Nurit Ben-Yehuda": []
    },
    "HEBR010": {
        "Lewis Glinert": []
    },
    "HEBR003": {
        "Ilona Bretschneider": [
            "review 1: \"07S with Ilona Bretschneider: Most amazing prof ever. too bad she's leaving.\"",
            "review 2: \"06S with Ilona Bretschneider: ilona is amazing and the class is a lot of fun. hebrew is a great language and the class had made me feel really confident speaking it... great way to fulfill the language requirement and also a lot of fun - im continuing my studies in israel this summer\"",
            "review 3: \"06S with Ilona Bretschneider: Professor Illona is an incredibly nice professor, and Hebrew 1, 2, and 3 are enjoyable and easy classes, and an amazing way to fulfill your language requirements (no drill)\"",
            "review 4: \"06S with Ilona Bretschneider: honestly everyone with any interet in hebrew whatsoever should take this course. its relatively easy but also really interesting.. you learn a lot and have fun at the same time. ilona is a great teacher and makes class really enjoyable. this course definitely enhanced my dartmouth experience.\"",
            "review 5: \"05S with Ilona Bretschneider: this class is good for ppl who want to get an intro to modern hebrew. you cover all the basics, and after hebrew 1,2,3 you come out not as a fluent speaker, but you can formulate your thoughts into sentences. its an easy class in terms of workload. def. the hardest part is memorizing vocab which just takes time. one bad thing, which i guess some ppl would say is a good thing, is that the class was too easy. it wasn't challenging because we went at a slow pace.\"",
            "review 6: \"02S with Ilona Bretschneider: i loved taking hebrew at dartmouth! if you need to fill your language requirement, or you're interested in hebrew, DEFINITELY take hebrew 1-3! i was disappointed that we didn't get through even more material during the year, but overall it was a wonderful course. hebrew is an easy language to learn - we didn't have much homework (other than attending drill), and i'm really glad i took hebrew 3. ilona is great!\""
        ],
        "Nurit Ben-yehuda": [
            "review 1: \"23S with Nurit Ben-yehuda: Nurit is incredibly knowledgeable about Hebrew. While the class requires some time and effort, it is not unreasonable. We had drill four times a week. Some weeks we used the x-hour, some weeks we didn't. What Nurit cares most about is you showing her that you care about that class and that you're putting effort in. As long as you try your best and she can see that you're trying your best, you will likely do fine. Homeworks are usually worksheets and tests look very similar to the homeworks. In Hebrew 3, we started doing more presentations compared to Hebrews 1 and 2. Nurit is still the most passionate professor I have had. Overall, a great class, as long as you are willing to dedicate roughly 7 hours outside of class each week on homeworks and drlls.\"",
            "review 2: \"22S with Nurit Ben-yehuda: Do not take this class. It is not worth the ridiculous amount of time you will be expected to put into it. Nurit is an unreasonable professor\"",
            "review 3: \"22S with Nurit Ben-yehuda: I have taken many Hebrew classes with Nurit (who only plans on teaching a few more years after 2022). She is a typical Israeli professor full of tough love for her students. Her archaic, worksheet and memorization based teaching style certainly teaches the basics of the language. I walk away from each class with a better understanding of Hebrew. Her tests are hard and require studying, and you must go to office hours with her or set up meetings to get on her good side. That said, she is extremely knowledgeable about the grammar and ancient/modern structure of Hebrew words and her lessons can be quite interesting. I recommend investing yourself into her class style and it will pay off. Take Hebrew to help continue Hebrew education at Dartmouth!\"",
            "review 4: \"21S with Nurit Ben-yehuda: I took this class online and understand that it likely would have been much easier in person, but I found this to be an incredibly frustrating class. Nurit is oftentimes very hard to deal with and is a bit short-tempered, and she had no respect for our time throughout the term. We ran over by 10 minutes every class, and she would often demand that we take quizzes in the middle of the day on a Saturday or that we come early to class so that she could teach us additional content. Her grading seems to be completely arbitrary, and she obviously favors some students over others. While the class is occasionally fun and rewarding, I felt extremely frustrated more often than not. I would not recommend this class for a language requirement, but perhaps take it if you're extremely interested in learning hebrew.\"",
            "review 5: \"21S with Nurit Ben-yehuda: I wish I hadn't already left a review for Hebrew 1 so that I could warn future students sooner about the quality of this professor. I have never had such a blatantly disrespectful, rude, and mean professor in the history of my academic experience. She would comment on students eating in class, saying weird and inappropriate things about their weight. A friend had to leave town for a memorial service and the professor whined \"You'll be missing a really important class...\" It is truly a shame that she is the only Hebrew professor because I cannot imagine how many students are turned away from an amazing subject due to her absolute inability to act appropriately towards her students. Not to mention ridiculous grading policies and insanely hard tests. Steer clear.\"",
            "review 6: \"08S with Nurit Ben-Yehuda: Fun and simple way to fulfill language requirement. One con is that it's one of the only language 3 classes that has drill, but overall it's still good.\""
        ],
        "Nurit Ben-Yehuda": [
            "review 1: \"23S with Nurit Ben-yehuda: Nurit is incredibly knowledgeable about Hebrew. While the class requires some time and effort, it is not unreasonable. We had drill four times a week. Some weeks we used the x-hour, some weeks we didn't. What Nurit cares most about is you showing her that you care about that class and that you're putting effort in. As long as you try your best and she can see that you're trying your best, you will likely do fine. Homeworks are usually worksheets and tests look very similar to the homeworks. In Hebrew 3, we started doing more presentations compared to Hebrews 1 and 2. Nurit is still the most passionate professor I have had. Overall, a great class, as long as you are willing to dedicate roughly 7 hours outside of class each week on homeworks and drlls.\"",
            "review 2: \"22S with Nurit Ben-yehuda: Do not take this class. It is not worth the ridiculous amount of time you will be expected to put into it. Nurit is an unreasonable professor\"",
            "review 3: \"22S with Nurit Ben-yehuda: I have taken many Hebrew classes with Nurit (who only plans on teaching a few more years after 2022). She is a typical Israeli professor full of tough love for her students. Her archaic, worksheet and memorization based teaching style certainly teaches the basics of the language. I walk away from each class with a better understanding of Hebrew. Her tests are hard and require studying, and you must go to office hours with her or set up meetings to get on her good side. That said, she is extremely knowledgeable about the grammar and ancient/modern structure of Hebrew words and her lessons can be quite interesting. I recommend investing yourself into her class style and it will pay off. Take Hebrew to help continue Hebrew education at Dartmouth!\"",
            "review 4: \"21S with Nurit Ben-yehuda: I took this class online and understand that it likely would have been much easier in person, but I found this to be an incredibly frustrating class. Nurit is oftentimes very hard to deal with and is a bit short-tempered, and she had no respect for our time throughout the term. We ran over by 10 minutes every class, and she would often demand that we take quizzes in the middle of the day on a Saturday or that we come early to class so that she could teach us additional content. Her grading seems to be completely arbitrary, and she obviously favors some students over others. While the class is occasionally fun and rewarding, I felt extremely frustrated more often than not. I would not recommend this class for a language requirement, but perhaps take it if you're extremely interested in learning hebrew.\"",
            "review 5: \"21S with Nurit Ben-yehuda: I wish I hadn't already left a review for Hebrew 1 so that I could warn future students sooner about the quality of this professor. I have never had such a blatantly disrespectful, rude, and mean professor in the history of my academic experience. She would comment on students eating in class, saying weird and inappropriate things about their weight. A friend had to leave town for a memorial service and the professor whined \"You'll be missing a really important class...\" It is truly a shame that she is the only Hebrew professor because I cannot imagine how many students are turned away from an amazing subject due to her absolute inability to act appropriately towards her students. Not to mention ridiculous grading policies and insanely hard tests. Steer clear.\"",
            "review 6: \"08S with Nurit Ben-Yehuda: Fun and simple way to fulfill language requirement. One con is that it's one of the only language 3 classes that has drill, but overall it's still good.\""
        ]
    },
    "HEBR002": {
        "Ilona Bretschneider": [
            "review 1: \"06W with Ilona Bretschneider: hebrew 2 is great. it's the perfect continuation of hebrew 1, in which you actually get to learn the past tense and enough hebrew to carry on a decent converation. great way to fulfill the language requirement, and if you want to actually get good, you can go to israel after 1-2-3 and study there for fairly cheap for transfer credit.\"",
            "review 2: \"06W with Ilona Bretschneider: Hebrew 1, 2, and 3 is such an easy and fun way to fulfill your language requirement. Classes are fun, and you get to know everyone because it's so small. (There's also no drill - which is clutch)\"",
            "review 3: \"02W with Ilona Bretschneider: I loved taking this course - Ilona is a wonderful professor and I feel like my Hebrew has become much stronger this term. If you need to fulfill your language requirement, or are interested in learning about Judaism, Israel, Hebrew, etc, DEFINITELY take Hebrew 1-3! They are terrific!\""
        ],
        "Nurit Ben-Yehuda": [
            "review 1: \"23W with Nurit Ben-yehuda: Nurit is a fantastic prof. Due to the small class size (we had three students this term), she develops bonds with each of her students. She is very kind and is clearly incredibly knowledgeable in Hebrew. She can be a tad unpredictable (assigning several worksheets as homework at the end of class, scheduling our final about a week before it will be. As long as you treat her with respect and show her that you genuinely care about the course, you will be fine.\"",
            "review 2: \"21W with Nurit Ben-yehuda: Nurit is extremely unpredictable and does not value students' time. She runs over by five minutes minimum every single class, and will often assign online quizzes on Sundays, which is very annoying. She is nice enough in class, though she will occasionally assign an overwhelming amount of work. If you are just doing this class for a language requirement, I would say it's not worth it. Most other language classes at Dartmouth are much easier. If you are actually interested in learning Hebrew, then this class is just ok.\"",
            "review 3: \"09W with Nurit Ben-Yehuda: Nurit is wonderful, Hebrew is great\"",
            "review 4: \"08W with Nurit Ben-Yehuda: the prof is just awesome. she's enthusiastic and really understanding. it's a really fun and easy class.\"",
            "review 5: \"08W with Nurit Ben-Yehuda: This was a fun class. Paced well, good prof, etc. The only downside is that there is of course drill, but this isn't too bad, as it's only three times a week as compared to four with other language courses.\""
        ],
        "Nurit Ben-yehuda": [
            "review 1: \"23W with Nurit Ben-yehuda: Nurit is a fantastic prof. Due to the small class size (we had three students this term), she develops bonds with each of her students. She is very kind and is clearly incredibly knowledgeable in Hebrew. She can be a tad unpredictable (assigning several worksheets as homework at the end of class, scheduling our final about a week before it will be. As long as you treat her with respect and show her that you genuinely care about the course, you will be fine.\"",
            "review 2: \"21W with Nurit Ben-yehuda: Nurit is extremely unpredictable and does not value students' time. She runs over by five minutes minimum every single class, and will often assign online quizzes on Sundays, which is very annoying. She is nice enough in class, though she will occasionally assign an overwhelming amount of work. If you are just doing this class for a language requirement, I would say it's not worth it. Most other language classes at Dartmouth are much easier. If you are actually interested in learning Hebrew, then this class is just ok.\"",
            "review 3: \"09W with Nurit Ben-Yehuda: Nurit is wonderful, Hebrew is great\"",
            "review 4: \"08W with Nurit Ben-Yehuda: the prof is just awesome. she's enthusiastic and really understanding. it's a really fun and easy class.\"",
            "review 5: \"08W with Nurit Ben-Yehuda: This was a fun class. Paced well, good prof, etc. The only downside is that there is of course drill, but this isn't too bad, as it's only three times a week as compared to four with other language courses.\""
        ]
    },
    "HEBR001": {
        "Nurit Ben-yehuda": [
            "review 1: \"22F with Nurit Ben-yehuda: A fantastic professor. We had four students this term, so she got close with each of us. She definitely has the \"tough love\" approach to teaching, and I walked away from the term feeling I learned a significant amount of Hebrew. The class can be time-consuming but it is not necessarily difficult. If you do not do the homeworks and the read the material, it shows.\"",
            "review 2: \"20F with Nurit Ben-yehuda: Super fun! Can imagine it'd be challenging if you knew zero hebrew going in. Nurit is super nice and approachable.\"",
            "review 3: \"20F with Nurit Ben-yehuda: Nurit is a good instructor and the course is pretty fun for a language class. The classes are extremely small so you can have lots of one-on-one interaction with Nurit if needed. Be advised if you are coming into this class with no Hebrew knowledge that there will definitely be multiple other students in the class who have already taken hebrew in some capacity, so it can be hard to keep up at times. The class moves pretty fast, so it's easy to get behind, but it's not too hard to get an A if you stay engaged in class and do all the homework.\"",
            "review 4: \"19F with Nurit Ben-yehuda: I have taken many Hebrew classes with Nurit (who only plans on teaching a few more years after 2022). She is a typical Israeli professor full of tough love for her students. Her archaic, worksheet and memorization based teaching style certainly teaches the basics of the language. I walk away from each class with a better understanding of Hebrew. Her tests are hard and require studying, and you must go to office hours with her or set up meetings to get on her good side. That said, she is extremely knowledgeable about the grammar and ancient/modern structure of Hebrew words and her lessons can be quite interesting. I recommend investing yourself into her class style and it will pay off. Take Hebrew to help continue Hebrew education at Dartmouth!\"",
            "review 5: \"17F with Nurit Ben-yehuda: Nurit is wonderful. She can be a little intense at times, and the course can go between moving really fast and slow, but Nurit works with the small class to ensure that everyone understands. Great language class to take, lots of fun.\""
        ],
        "Nurit Ben-Yehuda": []
    }
}