{
    "ITAL007.08": {
        "Matteo Gilebbi": [
            "review 1: \"22S with Matteo Gilebbi: I mean, there's probably seminars with lighter workloads but he's not a harsh grader so yeah. Had to watch 4 movies, on your own time, and wrote 3 papers with flexibility on topics (2000, 2000 and 3000 words, respectively). Also had discussion posts some weeks about readings that went along with the movies.\""
        ]
    },
    "ITAL037.11": {
        "Graziella Parati": []
    },
    "ITAL037.10": {
        "Nancy Canepa": []
    },
    "ITAL035.02": {
        "Graziella Parati": []
    },
    "ITAL035.01": {
        "Graziella Parati": [
            "review 1: \"24W with Graziella Parati: Prof. Parati is a lovely woman who wants to educate students on the Italian American experience. The class is the easiest I've ever taken at Dartmouth and the reading are interesting if you care to do them. I would recommend talking in class, as participation is a good percentage of your grade. Unfortunately, Prof. Parati was suffering from health issues throughout the term and cut the class short for the last few sessions; we are all hoping that she recovers quickly!\""
        ]
    },
    "ITAL026": {
        "Graziella Parati": []
    },
    "ITAL035.03": {
        "Graziella Parati": []
    },
    "ITAL033.01": {
        "Danielle Callegari": [
            "review 1: \"22F with Danielle Callegari: Great class! The material was super interesting and the workload was not demanding at all. Just come to class prepared by doing the readings and ready to discuss, and our midterm was an outline for our final project, which is really the only \"work\" we do for the class. The professor is super passionate about Dante and encourages participation from everyone, and she is also just super nice and always willing to answer any and every question you have whether it be about the class or your final project.\"",
            "review 2: \"22F with Danielle Callegari: I used this class as an introduction to classical literature, and I'm satisfied with that decision. The content was nice break-material from my other classes' coursework. Her grading policy is lenient. The bulk of your actual assignments all builds into your final project. It's a creative final, so you could do anything from writing a term paper to making a music video. While the lectures were sometimes stagnant, Prof. Callegari is definitely passionate about Dante. Also, this is a discussion-based class without many repercussions for not participating. But if you take this class, you should try adding to the lectures.\""
        ]
    },
    "ITAL037.09": {
        "Damiano Benvegnu": []
    },
    "ITAL007.07": {
        "Nancy Canepa": []
    },
    "ITAL087": {
        "David Laguardia": []
    },
    "ITAL034": {
        "Danielle Callegari": [
            "review 1: \"23W with Danielle Callegari: Interesting class, the prof usually teaches with no presentation. The class is really all discussion based on whatever the prof thinks is relevant to discuss. The readings can help but don't seem to be super helpful because they rarely come up in discussion. We only had a final creative project with not many guidelines, as long as it connected to the big ideas of the course that were talked about in class. Overall, good.\""
        ]
    },
    "ITAL014": {
        "Tonia Convertini": [
            "review 1: \"24W with Tonia Convertini: Gigantic layup. I found the prof to be quite passive aggressive and annoying. The content is easy and it's mostly busy work.\"",
            "review 2: \"22F with Tonia Convertini: Such a great class. Prof Convertini is super nice and this is probably one of the biggest layups on campus. Final project was actually pretty fun to do (definitely better than having a final exam) and an A is honestly achievable without really participating in class discussions that much\"",
            "review 3: \"21F with Tonia Convertini: Prof. Convertini is wonderful and this class is super easy. Not sure why some have said it isn't a layup, because it has been probably my second easiest class outside of Arabian Nights. Also, some of the stuff is pretty interesting to learn about, like fashion/food/opera/futbol/etc... Great class, would recommend.\"",
            "review 4: \"21F with Tonia Convertini: This class is easier that the layup count suggests, tania is super sweet and leads convo well. You only really need to read enough to keep up class conversations.\"",
            "review 5: \"20F with Tonia Convertini: This class was awesome. Although online, the format of the class has largely changed compared to the previous review. The class is actually a huge layup and overall super interesting. Tonia is a super nice professor and makes the course super interesting. She also brought in extremely high profile guest speakers. The final exam is essentially a project on anything you want. Weekly blog posts once a week and a midterm essay. There's some reading but its super interesting and relevant. If you're looking for an overall interesting layup, this is the one for you\"",
            "review 6: \"19F with Tonia Convertini: I thought this would be a chill third class. It's not. This class met during 10A and for some of the x-hours too. You have to post about your thoughts on the readings on canvas on top of the 2-3+ hours of readings assigned each Tuesday or Thursday which seemed like a lot of busywork. Additionally, since this was the first time the class was ever taught, Prof Convertini would assign 500 word blog posts or discussion leading assignments on top of the regular work. She also shifted around the amount of weight each assignment was worth and changed some things in the syllabus around which was not necessarily bad. However, the workload during the weekend of the take-home midterm was brutal because she assigned discussion-leading, a Canvas post, and a regular amount of reading. The one good thing about this class was that there was no final exam, just a final project that you present during Week 9 and a 3-paged single spaced final essay reflecting on your experience in the course. I would only take this course if you're really desperate for a distrib or genuinely interested in the topic. But, if you put in a solid effort, talk a lot during class and show that you care, you will not get a bad grade.\""
        ]
    },
    "ITAL007.06": {
        "Damiano Benvegnu": []
    },
    "ITAL010.21": {
        "Giorgio Alberti": []
    },
    "ITAL010.20": {
        "Tonia Convertini": []
    },
    "ITAL004": {
        "Nancy Canepa": []
    },
    "ITAL011": {
        "Giorgio Alberti": [
            "review 1: \"22F with Giorgio Alberti: Amazing course! I took it my first term at Dartmouth and I did not regret it! Alberti is super engaging and funny and he makes learning Italian in 10 weeks and reaching conversational proficiency much more achievable. The workload is quite extensive but for someone with a background in another Romance language, it is not difficult at all. I found that Italian sounds like Spanish and shares many similarities with Spanish; it does also have a strong overlap with certain parts of French grammar. Drill—which for our class was held at either 2:30 or 5:30—seemed daunting at first but once you get an idea of how it works and pay attention, it will lose a lot of that previously held fear. Events were a meaningful part of the class. There were events hosted by the Italian Department very often and we were **strongly encouraged** to attend. They had one where you made bruschetta! Just go to class ready to engage and participate; get your work done ASAP; go to drill and try your best; and practice vocab, speaking, and writing. If you do all that, you'll be in good shape for the exams and quizzes and the final assignments; getting an A with very good effort put into the course is very doable. Plus, you'll have made some amazing (and frankly astonishing) progress in learning Italian!\"",
            "review 2: \"22F with Giorgio Alberti: Giorgio is a wonderfully entertaining and engaged professor. The class goes pretty quickly but that doesn't mean that it's a lot of work, you end up just skimming most of the vocab and picking out a few words from each to learn. You do have to learn all of the grammar structures from Ital 1&2 but if you know Spanish or French it's not very difficult. Come to class, participate a bunch and look mildly enthusiastic and it will be fine.\"",
            "review 3: \"21S with Giorgio Alberti: I loved this class so much! It was really fast paced and at first it might seem like you will never understand anything, but that changes in just the first three weeks! This is not a layup, you need to study a lot outside of class. I would recommend to attend office hours and watch other videos if you still need grammatical clarification. The cultural presentations are very fun and interesting to create. Professor Alberti was very kind along with the TA Andrea, and they always made sure you understood certain concepts and work on pronunciation. Would totally recommend even if you just want to complete your language requirement.\"",
            "review 4: \"21F with Giorgio Alberti: I really loved this class! Professor Alberti is a great professor, always super kind and helpful. If you have a solid grasp of a Romance language, the class won't be too bad, just be sure to practice outside of class.\"",
            "review 5: \"21F with Giorgio Alberti: This class was pretty good. I can say that I left the class as a conversational speaker. I would say that knowing Spanish will help you a lot! Giorgio is kind of intense and expects a lot from his students, but if you just laugh when he does and turn in your work on time then you will do well. Make sure to practice before class! And after! I would say most definitely take this class! Btw, you do not necessarily need to know another Romance language well to succeed in this class. Most students just had a few years of High school Spanish under their belt and still performed well in the class.\"",
            "review 6: \"21F with Giorgio Alberti: GIORGIO IS THE MOST AMAZING PROFESSOR EVER! I love him so much! He is kind, funny and a really chill professor. This class is hard and requires students to be dedicated and meticulous but Giorgio made me excited to come to class every day and learn a new language.\"",
            "review 7: \"20S with Giorgio Alberti: Great class if you already speak a Romance language at a high level. Love Prof. Alberti, just organize yourself and do all the work before class. This was Zoom University, btw, in case future students don't remember how ass 20S was.\"",
            "review 8: \"20S with Giorgio Alberti: I cannot recommend this class enough if you already know another Romance Language. Although the class has a lot of homework and topics to study (since it's ITAL 1+2), it was a lot of fun and I think everyone's Italian improved so much throughout the course. Professor Alberti is a really great prof and is always available for extra practice and explanation, plus he's just a really amazing person to talk with. It's not a layup tho - if you really want to learn the language, you have to put on a good amount of work and practice outside of class.\""
        ],
        "Damiano Benvegnu": [
            "review 1: \"19F with Damiano Benvegnu: Damiano is like a strict dad in the best and worst ways. He expects a lot which can be a great motivator for studying hard, especially if you have some trouble. Though he is a bit of a northern Italy language purist, and has low tolerance for tardiness. If you speak a romance language he expects MUCH more from you, especially in fixing those cognate habits (porque instead of perche, le instead of il) he hates that. Still you WILL learn Italian and he is an interesting, good guy. Just VERY Italian I guess.\""
        ],
        "Tonia Convertini": []
    },
    "ITAL010.06": {
        "Matteo Gilebbi": [],
        "Tonia Convertini": []
    },
    "ITAL007.05": {
        "Laurence Hooper": []
    },
    "ITAL089": {
        "Andrea Tarnowski": [],
        "David Laguardia": []
    },
    "ITAL088": {
        "Andrea Tarnowski": [],
        "David Laguardia": []
    },
    "ITAL085": {
        "Andrea Tarnowski": [],
        "David Laguardia": [],
        "Matteo Gilebbi": [],
        "Tonia Convertini": []
    },
    "ITAL027.02": {
        "Nancy Canepa": []
    },
    "ITAL027.01": {
        "Damiano Benvegnu": []
    },
    "ITAL025": {
        "Damiano Benvegnu": [],
        "Graziella Parati": []
    },
    "ITAL024": {
        "Damiano Benvegnu": []
    },
    "ITAL023": {
        "Nancy Canepa": []
    },
    "ITAL022": {
        "Danielle Callegari": [],
        "Nancy Canepa": []
    },
    "ITAL021": {
        "Laurence Hooper": [],
        "Michael Wyatt": []
    },
    "ITAL015": {
        "Tonia Convertini": []
    },
    "ITAL012": {
        "Courtney Quaintance": [],
        "Danielle Callegari": [],
        "Giorgio Alberti": [],
        "Graziella Parati": [],
        "Jonathan Mullins": [],
        "Laurence Hooper": [],
        "Matteo Gilebbi": [],
        "Tonia Convertini": []
    },
    "ITAL010": {
        "Courtney Quaintance": [],
        "Danielle Callegari": [],
        "Giorgio Alberti": [],
        "Graziella Parati": [],
        "Jonathan Mullins": [],
        "Matteo Gilebbi": [],
        "Tonia Convertini": []
    },
    "ITAL010.05": {
        "Damiano Benvegnu": []
    },
    "ITAL009": {
        "Danielle Callegari": [
            "review 1: \"22F with Danielle Callegari: Great class! Try to talk at least twice each class period just to make it seem like you know what you're doing though. It's minimal amount of work compared to how much work you must do in ITAL 1 2, and 3.\""
        ],
        "Courtney Quaintance": [],
        "Damiano Benvegnu": [],
        "Giorgio Alberti": [],
        "Matteo Gilebbi": [],
        "Michael Wyatt": [],
        "Nancy Canepa": [],
        "Tonia Convertini": []
    },
    "ITAL008": {
        "Courtney Quaintance": [],
        "Danielle Callegari": [],
        "Giorgio Alberti": [],
        "Graziella Parati": [],
        "Jonathan Mullins": [],
        "Laurence Hooper": [],
        "Matteo Gilebbi": [],
        "Tonia Convertini": []
    },
    "ITAL006": {
        "Danielle Callegari": [],
        "Giorgio Alberti": [],
        "Jonathan Mullins": [],
        "Matteo Gilebbi": [],
        "Tonia Convertini": []
    },
    "ITAL005": {
        "Giorgio Alberti": [],
        "Jonathan Mullins": [],
        "Tonia Convertini": []
    },
    "ITAL003": {
        "Damiano Benvegnu": [
            "review 1: \"21F with Damiano Benvegnu: Best Italian Prof! Professor Benvegnu is extremely considerate and supportive of his students. He wants every single one of his students to succeed and understand that they have the potential to speak Italian, whether it be perfect or not. He gave several weekly oral or writing assignments to practice speaking and writing in Italian, which were super helpful. There are also modules to be done before class, but they were always some fun topic! Studying the grammar and vocab before class is crucial if you want to understand what's going on, but overall, the class discussions and activities are very engaging. I don't know where the \"strict\" reviews came from in the previous years, but that's their experience I guess. Like any professor, he would like to see participation and engagement with the class, especially because he'd like to see how each students' Italian is progressing in the course. Overall, I really enjoyed Prof. Benvegnu's teaching style, his class was very well organized and his assessments were not super hard given that you study well beforehand. I definitely feel more comfortable speaking Italian with other native Italian speakers and hope to take more Italian courses later on.\"",
            "review 2: \"20S with Damiano Benvegnu: This is the worst experience that I've had with a professor at Dartmouth. I would never recommend Professor Benvengnú or the Italian program in general after taking this course. He treated me harshly, even though the administration had recommended that professors be understanding at the onset of the pandemic and after I had continuously shown that I had additional barriers and difficulties to face compared to my classmates. This man made an assumption early on that I wanted \"a free pass\" for his class because I was not turning in the assignments on time -- even though I completed all of them. Even though I spoke Italian very well - to his admission - and even though I attended every single meeting and event, he was not hesitant to tell me at the end of the term that he was \"so very disappointed that I held no respect for my professors or coursework.\" This was after I had completed every assignment and proven competence in the language. I was also really delighted that he was so certain of my character, even though a professor had given me a citation the previous term for my dedication and my character after having had taken multiple courses with her.\"",
            "review 3: \"18W with Damiano Benvegnu: Benvegnu is probably the hardest Italian teacher out there. That being said, if you want to learn Italian right, take Benvegnu. He gives a lot of work, but his grading system makes it not too hard to do well. He's a strict professor and can be a little scary sometimes. Just make sure you learn the vocab and study for his exams, and you'll be fine.\"",
            "review 4: \"18S with Damiano Benvegnu: Damiano is probaly the hardest Italian instructor. He grades the harshest, and expects full participation. That being said, you will learn a lot in this course. The key to getting him to like you is talking a lot, and it will show in your grade.\"",
            "review 5: \"16F with Damiano Benvegnu: Good class. The professor gives out a lot of homework and readings to discuss during class. Major emphasis on knowing all the vocabulary words for each section before class. Exams are not too hard. Professor is kind of strict.\""
        ],
        "Matteo Gilebbi": [
            "review 1: \"23W with Matteo Gilebbi: Best italian prof in department. He is so chill and makes the environment stress free- on tests you can literally ask him questions about conjugations and how to say certain phrases. Weekly assignments so that if you do bad on a test or composition you can easily make it up. Blinklearnings and modules are busy work but never too intense. He is really nice abt extensions too. You can go to the extra curricular events and count them as extra credit. Participate in class and he will like you. Overall easier than italian 1. Great class! Matteo is such a great prof.\""
        ],
        "Danielle Callegari": [],
        "Giorgio Alberti": [],
        "Jonathan Mullins": [],
        "Tonia Convertini": []
    },
    "ITAL002": {
        "Anna Minardi": [
            "review 1: \"13W with Anna Minardi: Course: Not too fast, not too slow. you learn a lot of different tenses, and vocabulary, but that is to be expected. Overall though the topics were useful and interesting. The only bad part of the class is that it was in the morning. Professor: Mullins is an awesome guy and very enthusiastic about teaching. He is very fair and very willing to help you out with anything. He got us talking in Italian basically the whole time, which really helped our speaking skills. Workload: The online practice sets can be tedious and sometimes difficult to figure out what is going on, but they don't take much time. Weekly tweets can be annoying at times.\""
        ],
        "Damiano Benvegnu": [
            "review 1: \"19W with Damiano Benvegnu: Great professor and solid class. Lots of busy work but it was rewarding. No one thing takes up a great portion of the grade, but consistent progress is expected throughout. Drill is a bit of a hassle, but I have seen tremendous progress in my confidence with the language.\""
        ],
        "Julia Viazmenski": [
            "review 1: \"12F with Julia Viazmenski: Course: I really liked this course, the material was pretty easy and it was structured well - nothing really counted for a huge part of your grade though, so you have to make sure to keep up with every single thing the prof assigns. But if you bomb a couple of things also, it doesn't really matter. I liked the work for this class, it was actually pretty fun. Professor: Professor Millspaugh is really nice but he's also new to Dartmouth so he had trouble keeping up with things - we got a lot of our grades very late. I didn't really know how I was doing in this class until the end. He wasn't very clear about our performance in the midterm evaluation either. Workload: Not hard at all. Time consuming sometimes, and there are a lot of little things you have to keep track of. But it's easy.\""
        ],
        "Letizia Mancuso": [
            "review 1: \"19F with Letizia Mancuso: The class isn't very difficult, but I wouldn't call it a layup due to the volume of work. The hardest part of the course was probably that none of never really quite understood the assignments over how certain things were particularly Italian. All five of us agreed Letizia was pretty great, but she usually teaches in Rome unfortunately.\""
        ],
        "Giorgio Alberti": [],
        "Laurence Hooper": [],
        "Matteo Gilebbi": [],
        "Nancy Canepa": [],
        "Tonia Convertini": []
    },
    "ITAL001": {
        "Andrea Zoller": [
            "review 1: \"22S with Andrea Zoller: Professor Zoller was very nice and understanding! Sometimes he tries to act scary and strict, but he's really very lenient and his class is super fun. 10/10 would recommend Italian 001 with Professor Zoller if you can take it with him, or even any other Italian class! Just don't take advantage of him please 🥺\"",
            "review 2: \"22F with Andrea Zoller: YES, YES, YES! Take this class! If you’re already taking a language, it’s not too late, switch to Italian. Professor Zoller is absolutely amazing! I genuinely have such a fun time in Italian. You’ll never have a greater time taking a language than this class. Italian in general is amazing. It’s not a very to pick up. Professor Zoller, is one of the nicest profs you’ll have. Italian only has drill twice a week. You learn about Italian culture, food, art, etc… all super interesting. There’s also a lot of great outside of class opportunities like pasta making, dance, (trip to Eataly Boston). It’s a really amazing immersive experience. If you commit yourself to learning Italian, you can get a lot out of the class!\"",
            "review 3: \"22F with Andrea Zoller: Andrea is such a great prof! He's a super nice guy, and the rare occasions he gets \"angry\" are pretty hilarious. He's one of those people who is never intentionally funny but always just is. The workload is light for a language class (although that's partially due to me having the chillest drill instructor at Dartmouth), and you leave feeling like you could have a very basic conversation in Italian. Can't say enough good things about Andrea, this was my favorite class this term.\"",
            "review 4: \"22F with Andrea Zoller: Great class! Prof Zoller is super passionate and fun to learn with, and cares a lot about every student. If you want to fulfill your language requirement and not have it be a super challenging or time-consuming course, Italian 1 is the way to go. To get an A, you basically just have to do the daily assignments (maybe an hour each, if that) and you've got it. Tests are pretty easy and don't count for much of the grade, and you have to do a couple longer compositions which are also not a big part of the grade. Even with it being very easy, I learned a TON of Italian in this class. I highly recommend this class.\"",
            "review 5: \"22F with Andrea Zoller: Please take this class! The only reason I registered is because I didn't get into Spanish 1 and I wanted to try something new. This class definitely did not disappoint. Professor Zoller is very kind and personable. His passion for teaching is palpable, and he makes the class engaging and fun. I would recommend studying the vocabulary a lot, as my class period often did not do this and he got a little peeved at us. Besides that, the coursework is not difficult at all. It's an introductory course, so he does not expect you to be perfect. Just speak in class and practice!\""
        ],
        "Giorgio Alberti": [
            "review 1: \"23W with Giorgio Alberti: This is a super fun class, especially since Italian classes tend to be pretty small so everyone in mine got close. Giorgio is super energetic and funny. Lots of busy work but the repetition helps with learning. There was one week towards the middle when we had a bunch of assignments all at once but otherwise the workload was manageable. Also if you are overwhelmed and need an extension on something he will more than likely grant it. Participation and engagement is super big for this class--the final is a conversation with him and a series of reflections. The grading scale much more represents that of a high school class (different types of assignments, participation, etc.) than a college one. You are also required to go to 3 of the Italian department's events during the term but they are very relaxed and were honestly enjoyable. An A is a 94 but if you put in the work it's more than achievable.\"",
            "review 2: \"18F with Giorgio Alberti: Easy class, layup in the sense that it is very easy to get an A but there is a lot of busy work. The pace moves very fast so you need to stay on top of your work and it is very confusing in the beginning if you have never taken Italian. If you have taken a romance language before it is much easier. Giorgio is a good professor, but he definitely plays favorite so its good to get him on your side early. Also he really likes it if you just try to speak even if you mess up (within reason of course). Effort is a big part of this class.\"",
            "review 3: \"18F with Giorgio Alberti: Giorgio is the GOAT. The class is pretty easy if you put in effort, but there is a good amount of busy work. Giorgio has a lot of energy which helps you learn a lot of Italian in just 10 weeks. One of my favorite profs at Dartmouth.\""
        ],
        "Danielle Callegari": [
            "review 1: \"22W with Danielle Callegari: This class was awesome! Professor Callegari is a very kid person and teaches the class well! Definitely recommending to take this class! Easy rewarding work!\"",
            "review 2: \"22W with Danielle Callegari: This class was awesome! Professor Callegari is a very kid person and teaches the class well! Definitely recommending to take this class! Easy rewarding work!\""
        ],
        "Anna Minardi": [
            "review 1: \"16F with Anna Minardi: Minardi was amazing- Made the class extremely fun and somehow was able to fully immerse us in Italian from day one. Median is generally an A- for all Italian classes and I would definitely recommend Italian to anyone looking for a relatively fun and rewarding language distrib.\"",
            "review 2: \"15F with Anna Minardi: Easy class to take if you have taken a romance language before and want to learn Italian. Minardi will only speak in Italian, but if you show effort, she will help you a great deal with assignments. She likes to see her students succeed, and will more than meet you halfway.\""
        ],
        "Matteo Gilebbi": [
            "review 1: \"22W with Matteo Gilebbi: gilebbi is a great guy and super nice and helpful. this class requires a decent amount of busy work but it actually teaches you italian fairly well and if you do the busy work you're basically guaranteed an A or A-. very chill overall\"",
            "review 2: \"20F with Matteo Gilebbi: Matteo Gilebbi is such an awesome professor. He brings such good energy to the class and always wants you to be having fun. He was always smiling and happy to see students do well. The class was definitely pretty easy, with a couple of exams and writeups that were totally manageable. One of my favorite professors so far at dartmouth.\""
        ],
        "Nancy Canepa": [
            "review 1: \"12S with Nancy Canepa: Course: I really liked this course. There were only 4 people in the class and that gave us a lot of time to speak, and Italian is such a fun language to learn. Drill was super useful and our instructor actually cared which was awesome. Professor: Professor Canepa is awesome! She's strict definitely and she doesn't like it when you don't prepare, but she was actually really lenient with grading. She's always willing to help, she's very accessible. Workload: The workload is very manageable if you keep up. It seemed very consistent with what we did in class, it definitely wasn't busy work\""
        ],
        "": [
            "review 1: \"23W with Giorgio Alberti: This is a super fun class, especially since Italian classes tend to be pretty small so everyone in mine got close. Giorgio is super energetic and funny. Lots of busy work but the repetition helps with learning. There was one week towards the middle when we had a bunch of assignments all at once but otherwise the workload was manageable. Also if you are overwhelmed and need an extension on something he will more than likely grant it. Participation and engagement is super big for this class--the final is a conversation with him and a series of reflections. The grading scale much more represents that of a high school class (different types of assignments, participation, etc.) than a college one. You are also required to go to 3 of the Italian department's events during the term but they are very relaxed and were honestly enjoyable. An A is a 94 but if you put in the work it's more than achievable.\"",
            "review 2: \"22W with Danielle Callegari: This class was awesome! Professor Callegari is a very kid person and teaches the class well! Definitely recommending to take this class! Easy rewarding work!\"",
            "review 3: \"22W with Danielle Callegari: This class was awesome! Professor Callegari is a very kid person and teaches the class well! Definitely recommending to take this class! Easy rewarding work!\"",
            "review 4: \"22W with Matteo Gilebbi: gilebbi is a great guy and super nice and helpful. this class requires a decent amount of busy work but it actually teaches you italian fairly well and if you do the busy work you're basically guaranteed an A or A-. very chill overall\"",
            "review 5: \"22S with Andrea Zoller: Professor Zoller was very nice and understanding! Sometimes he tries to act scary and strict, but he's really very lenient and his class is super fun. 10/10 would recommend Italian 001 with Professor Zoller if you can take it with him, or even any other Italian class! Just don't take advantage of him please 🥺\"",
            "review 6: \"22F with Andrea Zoller: Great class! Prof Zoller is super passionate and fun to learn with, and cares a lot about every student. If you want to fulfill your language requirement and not have it be a super challenging or time-consuming course, Italian 1 is the way to go. To get an A, you basically just have to do the daily assignments (maybe an hour each, if that) and you've got it. Tests are pretty easy and don't count for much of the grade, and you have to do a couple longer compositions which are also not a big part of the grade. Even with it being very easy, I learned a TON of Italian in this class. I highly recommend this class.\"",
            "review 7: \"22F with Andrea Zoller: Please take this class! The only reason I registered is because I didn't get into Spanish 1 and I wanted to try something new. This class definitely did not disappoint. Professor Zoller is very kind and personable. His passion for teaching is palpable, and he makes the class engaging and fun. I would recommend studying the vocabulary a lot, as my class period often did not do this and he got a little peeved at us. Besides that, the coursework is not difficult at all. It's an introductory course, so he does not expect you to be perfect. Just speak in class and practice!\"",
            "review 8: \"22F with Andrea Zoller: YES, YES, YES! Take this class! If you’re already taking a language, it’s not too late, switch to Italian. Professor Zoller is absolutely amazing! I genuinely have such a fun time in Italian. You’ll never have a greater time taking a language than this class. Italian in general is amazing. It’s not a very to pick up. Professor Zoller, is one of the nicest profs you’ll have. Italian only has drill twice a week. You learn about Italian culture, food, art, etc… all super interesting. There’s also a lot of great outside of class opportunities like pasta making, dance, (trip to Eataly Boston). It’s a really amazing immersive experience. If you commit yourself to learning Italian, you can get a lot out of the class!\"",
            "review 9: \"22F with Andrea Zoller: Andrea is such a great prof! He's a super nice guy, and the rare occasions he gets \"angry\" are pretty hilarious. He's one of those people who is never intentionally funny but always just is. The workload is light for a language class (although that's partially due to me having the chillest drill instructor at Dartmouth), and you leave feeling like you could have a very basic conversation in Italian. Can't say enough good things about Andrea, this was my favorite class this term.\"",
            "review 10: \"20F with Matteo Gilebbi: Matteo Gilebbi is such an awesome professor. He brings such good energy to the class and always wants you to be having fun. He was always smiling and happy to see students do well. The class was definitely pretty easy, with a couple of exams and writeups that were totally manageable. One of my favorite professors so far at dartmouth.\"",
            "review 11: \"18F with Giorgio Alberti: Easy class, layup in the sense that it is very easy to get an A but there is a lot of busy work. The pace moves very fast so you need to stay on top of your work and it is very confusing in the beginning if you have never taken Italian. If you have taken a romance language before it is much easier. Giorgio is a good professor, but he definitely plays favorite so its good to get him on your side early. Also he really likes it if you just try to speak even if you mess up (within reason of course). Effort is a big part of this class.\"",
            "review 12: \"18F with Giorgio Alberti: Giorgio is the GOAT. The class is pretty easy if you put in effort, but there is a good amount of busy work. Giorgio has a lot of energy which helps you learn a lot of Italian in just 10 weeks. One of my favorite profs at Dartmouth.\"",
            "review 13: \"16F with Anna Minardi: Minardi was amazing- Made the class extremely fun and somehow was able to fully immerse us in Italian from day one. Median is generally an A- for all Italian classes and I would definitely recommend Italian to anyone looking for a relatively fun and rewarding language distrib.\"",
            "review 14: \"15F with Anna Minardi: Easy class to take if you have taken a romance language before and want to learn Italian. Minardi will only speak in Italian, but if you show effort, she will help you a great deal with assignments. She likes to see her students succeed, and will more than meet you halfway.\"",
            "review 15: \"12S with Nancy Canepa: Course: I really liked this course. There were only 4 people in the class and that gave us a lot of time to speak, and Italian is such a fun language to learn. Drill was super useful and our instructor actually cared which was awesome. Professor: Professor Canepa is awesome! She's strict definitely and she doesn't like it when you don't prepare, but she was actually really lenient with grading. She's always willing to help, she's very accessible. Workload: The workload is very manageable if you keep up. It seemed very consistent with what we did in class, it definitely wasn't busy work\"",
            "review 16: \"11F : Course: So fun, great intro to the language and culture. Professor: Prof Viazmenski was exciting, happy, and very understanding. I had a challenging schedule and she really was accommodating. Lectures and readings went together well. Workload: A couple pages of reading per night, evenly spaced exams, weekly assignments (I spent maybe an hour a week on them), and one final project on a topic of our choice. Easy, effective, engaging.\""
        ],
        "Damiano Benvegnu": [],
        "Jonathan Mullins": [],
        "Letizia Mancuso": [],
        "Tonia Convertini": []
    }
}