{
    "MES012.15": {
        "Moshe Naor": []
    },
    "MES017.20": {
        "A. Kevin Reinhart": []
    },
    "MES016.40": {
        "Michael Wyatt": []
    },
    "MES012.14": {
        "Jonathan Smolin": [],
        "Michelle Clarke": []
    },
    "MES007.05": {
        "Samantha Wray": []
    },
    "MES016.15": {
        "Rachel Greenblatt": []
    },
    "MES013.12": {
        "Joseph Vignone": []
    },
    "MES018.03": {
        "Nicola Camerlenghi": []
    },
    "MES017.07": {
        "A. Kevin Reinhart": [
            "review 1: \"22X with A. Kevin Reinhart: I wouldn't recommend this class as a layup, or generally. The median this term was a B+ and that grade was pulled from a total of 5 assignments and participation. Prof Reinhart is an extremely unforgiving prof and will glare at you and stop class if you're literally 10 seconds late to class. He takes attendance 5 minutes or more before class starts. In terms of the workload its very reasonable- daily readings, 3 responses picked from 6 prompts, a midterm and a final (written). The first 7 weeks of the class are pretty dull. His powerpoints are abysmal for taking notes so you have to be tuned in at all times. He's a harsh grader, and will return assignments to you if they dont have the correct formatting. I was not very invested in this class and didn't do very well because of it. only take this class if you want to put a lot of time into the midterm and final, like the content, and if you can suck up to a prof.\"",
            "review 2: \"22X with A. Kevin Reinhart: Copied from the posting on REL 16.04 The other two reviewers talked about the personality of AKR, and I would agree. He knows the subject and can relay information quite well. There were points where he aired frustration because the class was not engaging in conversation, and he did call out BS answers. What bothered me was requiring students to arrive early, yet class regularly ran over time, showing that he values his time more than the students' time. AKR is a strict grader, and you will learn to write better. BUT, due to his inability to stay organized, the first feedback we received on a graded assignment was in week 7ish. This was after we submitted all three short papers, meaning the only thing we could apply feedback to was the final paper. If a professor wants strict writing standards, that is OK, but only if the students get feedback early so they can apply it. The material is good, and the classes were engaging. The course will give you a better understanding of Islam and the War on Terror and improve your writing abilities. I enjoyed the class, but some peculiarities of the prof would make it hard for me to recommend it.\""
        ]
    },
    "MES017.19": {
        "Susannah Heschel": [
            "review 1: \"23S with Susannah Heschel: This class is co-taught by Heschel and Ariss, and it is BY FAR my favorite class at Dartmouth so far. I seriously cant put into words how much I loved this class. The material is incredibly interesting and the professors are so, so qualified to teach it - both of them are leaders in their fields and do incredibly important work. Make no mistake, this isn't really a political/partisan class - the Israel/Palestine conflict, while mentioned, is not the focus. Its more so about identity, and how the idea of \"modernness\" gets looped into how people view themselves and the world (the idea of \"the Arab\" and \"the Jew\"). Think literature, film, short stories, social life, etc. It was absolutely fascinating for me. In terms of difficulty, the class really isn't hard, even though the class manages to teach you SO MUCH and challenge how you view the world. Its one of those rare classes which is a layup and yet teaches you and leaves an impact (I think this class is going to stick with me for a very, very long time). There's weekly discussion posts (150-250 words, mostly just assessed for completion), a short midterm (2 short answer questions about the readings, take-home. Total 1000 words), and a final paper (2000 words on anything loosely related to the topics of the class). None of these are graded super stringently, yet I found them very helpful in improving my understanding of the course material. Oh, not to mention that the professors are friends and joke around with each other in class! I cannot recommend this class enough - a MUST TAKE, even if you're not super into MES/JWST\""
        ],
        "Tarek El-Ariss": []
    },
    "MES015.12": {
        "Samantha Wray": []
    },
    "MES016.39": {
        "Andrew Caplan": []
    },
    "MES018.02": {
        "Elizabeth Kassler-Taub": []
    },
    "MES016.24": {
        "Daniel Behar": []
    },
    "MES015.11": {
        "Andrew Simon": [
            "review 1: \"23F with Andrew Simon: Wow. I am simply blown away. Today was our final class and I am honest to God emotional about it. This is a truly special class. Engaging, provocative, challenging (intellectually not workload wise) with an exceptional professor. Professor Simon reminds you why you pay the big bucks to go this school. He literally was in Cairo for Arab Spring -- the man is brilliant and funny and captivating to listen to. This is without a doubt the most I have learned in a Dartmouth class. The structure goes like this: two movies assigned per week plus some readings (and a discussion post). A couple students lead a discussion based on those materials and the whole class engages. Sounds simple yet it's quite effective. Beyond that, it's just a final! Not too shabby at all! You can write a 18 page paper, make a podcast + a 4 page paper, or do an art piece with an 8 page paper for that final. The last day of class, he brought us pizza and gave a little speech about how important this class was to him. I legitimately teared up. He is one of those professors that is intimidating, not because he is scary or intense, simply because you crave his approval. He is so eloquent and kind and just exactly what a professor should be. A+++++ for this class. I am a senior year and I am so happy I took this class. Wow. I am genuinely sad it is over.\""
        ]
    },
    "MES007.04": {
        "Andrew Simon": [
            "review 1: \"23W with Andrew Simon: looked at the layuplist reviews, thought they seemed positive, and took it. not a horrible class but it was a lot of work for a first year seminar. 6 writing reflections throughout the term that you have to put in hours into to get a good mark, and a 10-page final paper. Would be ok BUT the prof doesn't actually show you your grades, and is a nitpicky grader. Ended up causing me a lot of stress in the term, a lot of work, just to end up getting the median (A-, which doesnt sound bad but is annoying for the amount of work you put in). There are almost certainly better seminar options you could take\"",
            "review 2: \"21W with Andrew Simon: Super interesting FYS. I had no idea what to expect when I signed up and I was blown away by the course. Prof Simon is super engaging and makes the course content relevant. I would highly recommend this course to anyone, no background required. Course work is very manageable and you have a lot of freedom, essentially just 6 reflections and a final paper.\"",
            "review 3: \"21W with Andrew Simon: Pretty layup class with manageable workload especially towards end of the term (even when final project hits, he gives you a pretty stress free timeline). A lot of the material you end up looking at are movies, pictures, or short videos. Just learn how to analyze primary sources and you should do good in the class. Despite him not showing you what your grade throughout the term with reflections, do put some effort into reflections and make a clear concise argument to guarantee an A.\""
        ]
    },
    "MES018.01": {
        "Chad Elias": []
    },
    "MES002.03": {
        "Andrew Simon": [
            "review 1: \"23S with Andrew Simon: Ehh this class was okay. Minimal work was a major plus, but Dr. Simon was just such a condescending guy that it kind of ruined the whole experience for me. Very much taught like a high school class so if you're not a freshman, you might be checked out.\"",
            "review 2: \"23S with Andrew Simon: Light workload, but deceptively hard class to get a good grade in. Prof. Simon isn't the most transparent with grades (never posts on Canvas), which only makes it harder and more frustrating. Lectures were pretty boring. Pretty much just a midterm exam and a final paper, which was good for workload but deceptively difficult.\""
        ],
        "Golnar Nikpour": [
            "review 1: \"22F with Golnar Nikpour: Overall, this course was pretty interesting. I wish we had spent more time on contemporary issues, but it was still interesting to learn about the history of the region dating back to the advent of Islam. I took this course simply out of interest. There was a decent amount of reading (sometimes over 100 pages) that was normally front loaded and due on Monday or Wednesday (with oftentimes nothing due on Fridays). So, if you space out the reading it isn't too bad. We had two major assignments - a 2500ish word midterm paper and a 1500ish word final paper. If you gather together enough quotes and assemble a coherent argument you should do fine. Professor Nikpour also devotes a LOT of her time to helping students in 1 on 1 meetings before the due date, so if you have any questions definitely take advantage of that. Classes are mostly lectures, but there are lots of opportunities to ask questions if you have any. The class was not a layup per se (especially for me, a STEM person), but it was a pretty consistent workload of mostly reading (and a few occasional discussion posts). If you prepare/outline the two papers ahead of time, and meet with the professor you will do fine. Overall, this was a pretty interesting course that was not a layup, but also not absurdly hard either.\""
        ]
    },
    "MES019.02": {
        "Zahra Ayubi": [
            "review 1: \"20X with Zahra Ayubi: This term was asynchronous because of the pandemic, but the prof took this as an excuse to never teach? She never gave lectures nor did she post pre-recorded lectures so we really did not receive any guidance all term. I was wary to reach out to prof Ayubi about this because she tended to respond in a couple of words...literally...one of my emails actually consisted of 2 words. The term was structured around student-led discussions that Ayubi monitored only during the first term and then never again. When I reached the exam, I felt thoroughly unprepared and it took me 3 full days to complete it (it was a blessing it was posted early). I feel like I missed some major components of the course because I wasn't able to connect dots between readings on my own. All this being said, the course itself was interesting and I loved learning about feminist movements in the Muslim world–just don't take it with Ayubi if it's asynchronous.\""
        ]
    },
    "MES012.13": {
        "Golnar Nikpour": []
    },
    "MES089": {
        "Christopher MacEvitt": [],
        "Tarek El-Ariss": []
    },
    "MES019.05": {
        "Zahra Ayubi": []
    },
    "MES017.08": {
        "Deborah Forger": []
    },
    "MES016.37": {
        "Daniel Behar": []
    },
    "MES004.02": {
        "Andrew Simon": []
    },
    "MES016.38": {
        "Muhsin Al-Musawi": []
    },
    "MES015.10": {
        "Lewis Glinert": []
    },
    "MES012.12": {
        "Muhsin Al-Musawi": []
    },
    "MES012.02": {
        "Hussein Kadhim": [
            "review 1: \"20F with Hussein Kadhim: Kadhim is the greatest of all time. Best professor I've ever had at this school. If you don't take a Kadhim class you're a clown\"",
            "review 2: \"20F with Hussein Kadhim: Kadhim is an absolute legend. Definitely take this class - it is super easy and requires next to no work, but more than that, Kadhim is so passionate about the subject material. He meets with everyone one-on-one to discuss their final papers, and everything he says is so encouraging and supportive. He is one of the best and most understanding professors at this school, hands down.\"",
            "review 3: \"20F with Hussein Kadhim: Goat category. I really have nothing more to say but layup list requires 100 characters so just trying to meet that goal at this point. best layup out there. workload: 2 discussion posts + one 12-15 page final paper on literally anything about Iraq\""
        ]
    },
    "MES088": {
        "Christopher MacEvitt": [],
        "Tarek El-Ariss": []
    },
    "MES017.17": {
        "Daniel Behar": []
    },
    "MES016.30": {
        "Jonathan Smolin": []
    },
    "MES009.01": {
        "Joseph Vignone": [
            "review 1: \"21S with Joseph Vignone: This was a good NW/TMV. The professor is really nice and cares a lot about the topic. The content was interesting at some points, a bit boring in others, but never so complicated or boring that it really impeded the quality of the class. The readings are never very long or intense, but worth at least skimming since they do come up in class.\"",
            "review 2: \"21S with Joseph Vignone: Could be a bit boring at times and the reading was pretty long, but you just need to skim to know the basics and maybe read enough in one place to bring something up in class. Very easy layup as long as you do all the assignments. Loved the professor. He can drone on a bit, but is passionate and so understanding\""
        ]
    },
    "MES007.03": {
        "Lewis Glinert": [
            "review 1: \"23W with Lewis Glinert: This is an average writing seminar. Not too bad and not too good. Grading: 20%- 1st essay, 30% 2nd essay and 50%- 3rd essay. The class is entirely lectured based, which I liked. He is a fair and pretty nice grader in my opinion. He does not really about how good your writing is as long as it follows a strong flow of argument. You really only need to read the articles for the essays, not ones not listed for the essays if you have a time crunch. However, not bad, but def not the best class either.\"",
            "review 2: \"23W with Lewis Glinert: Very racist prof. Makes students feel uncomfortable in class and during office hours. If you can avoid this class, by all means please avoid it. The content is interesting but the class is poorly taught.\"",
            "review 3: \"23W with Lewis Glinert: I would say that this class in interesting in theory. The content itself has the potential to make for a great class. Unfortunately, in reality, that is not the case. First of the class is 2 hours of straight lecturing from Professor Glinert. There is discussion aspect and I felt like it made the class feel very slow. Also, our grades completely consist of only 3 essay grades. The first is 20%, second is 30% and the last is 50%. It’s nice not having a ton of work to do for the class, but Professor Glinert only grades the first draft which doesn’t allow for room of improvement. He’s also a strict and picky grader which can be frustrating. There is also a lot of reading to do for the class but you can easily avoid them due to the fact that only around 9 of those readings will be used for the essays. I would say that this class is survivable but if you can get a different writing seminar, please do.\"",
            "review 4: \"22W with Lewis Glinert: Also experienced the Zoom for 6 weeks because Glinert was worried about covid and wanted a better-ventilated room. Easy and interesting class, the most important thing is to read the Harevan book, other readings don't really matter as much as long as you're good at cherrypicking quotes for the few papers you have to write. Put just a hint (or a lot) of pro-Jewish sentiment in your writing and you're set.\"",
            "review 5: \"22W with Lewis Glinert: The course was online for 6 weeks because the College couldn’t assign a room that met the Professor’s needs. I think this course could have been so interesting, but the 10A Zoom was very tiring. You have three essays due: 20% Paper 1 (1000 words) 30% Paper 2 (1000 words) 50% Paper 3 (2000 words) The papers were straightforward with a question assigned. The workload was very reasonable. One thing that students should know is that the original draft is graded, not the revision! Professor Glinert is very passionate and kind, but could have incorporated much more discussion.\"",
            "review 6: \"22W with Lewis Glinert: This class was a layup, at least in my opinion. There are only three assignments as the other review says, and even though there's a lot of reading you can mostly just skim it. He stopped asking questions on the readings after like week 2 so you could skip the readings entirely if you really want to, but I found the passages interesting so I tried to at least skim them. His lectures are pretty interesting but the 2 hour 10A is painful so you might find yourself zoning out at times, especially since there is no discussion element to the class. In terms of grading, he curved our final grades so that 60-76 = B+, 77-89 = A-, 90-100 = A, which was pretty generous. As the previous reviewer said Professor Glinert is a very sweet and knowledgeable man, and I felt this class was worth taking in the end.\"",
            "review 7: \"20W with Lewis Glinert: I personally really enjoyed this course! Take it if you are interested in religion, sociology, geography, history, etc. The 2A is a little hard to sit through since the course is all lecture and no discussion (people fell asleep a lot during class), but Prof Glinert is very devoted to the subject and is quite understanding about the afternoon time slot. It is a little hard on grading since your entire grade is dependent on 3 papers and you don't get to revise or anything (I've heard that it is different for other writing courses), but that also means that you have less overall work since you only turn in things three times the entire term. The course is heavily Jewish-focused since Glinert is Jewish and studies Hebrew/Judaism studies, but there is still an adequate amount of Christian and Islamic thought thrown in. All readings (there are a lot!!) are put online, which is also nice. I loved this class but also think that one would fare better if you already had a strong interest/it was your first choice. Any other motivation (LIT distrib, didn't get into your first choice, etc.) would probably make the class seem like a lot of work.\""
        ]
    },
    "MES001": {
        "Jonathan Smolin": [
            "review 1: \"22S with Jonathan Smolin: Super chill class, Smolin is super nice and easy going- 10/10 layup, easy A if you pay attention in class\"",
            "review 2: \"22S with Jonathan Smolin: Really interesting class with a phenomenal lecturer! Smolin is very devoted to teaching, making his lectures entertaining, informative, highly efficient by emphasizing key points in his analyses of the readings. Highly recommend this class, whether you take it as a layup or not, and to those with no background in the Middle East/people who want to learn new perspectives. The class is basically comprised of lectures and readings/movies which quizzes or discussion posts about them. There is one midterm and one final and both are very doable as long as you attend class and take good notes/understand a general consensus about the readings. Even though he didn’t take attendance, it’s very useful to go to lectures because he doesn’t record them. He also is a very entertaining lecturer and explains things well which makes it more worthwhile to go. Smolin also offers office hours just to talk and is super nice and very well-versed into Middle Eastern Studies. I recommend going to them even if you’re just simply going to talk! Overall, great class…can be annoying to have to go to lectures, but if you take notes on them and are engaged with the material (esp via the quizzes and disicusion posts), you’ll be sure to succeed!\"",
            "review 3: \"22S with Jonathan Smolin: Super interesting material if you pay attention, even if you don't though this class was VERY chill. A good opportunity just to learn for the sake of curiosity rather than for a grade. Smolin is really nice and wants to see his students succeed, as long as you show up to class and take good notes he will provide you with all the tools necessary to do well.\""
        ]
    },
    "MES017.15": {
        "Ezzedine Fishere": [],
        "Klaus Milich": []
    },
    "MES019.04": {
        "Golnar Nikpour": [
            "review 1: \"19X with Golnar Nikpour: Excellent! Prof. Nikpour is very good! There was quite a bit of reading but spending about 2 hours reading for each class was generally sufficient. Nikpour is great at explaining things and this class focused on the histories of Iran, Egypt, and other areas of the Middle East and North Africa, and how women (and men) have helped to shape those histories. The readings were well-chosen and it was an interesting class that I'm very glad I took.\""
        ],
        "Andrew Simon": []
    },
    "MES012.09": {
        "Abigail Jacobson": [],
        "Bernard Avishai": [],
        "Ezzedine Fishere": [],
        "Shaul Magid": []
    },
    "MES012.08": {
        "Misagh Parsa": []
    },
    "MES012.07": {
        "Misagh Parsa": []
    },
    "MES015.09": {
        "Hoda Barakat": []
    },
    "MES015.08": {
        "Hoda Barakat": []
    },
    "MES015.01": {
        "Alaa Al-Aswany": [],
        "Alaaeldin Abdel Elasswany": []
    },
    "MES012.06": {
        "Alaa Al-Aswany": [],
        "Alaaeldin Abdel Elasswany": []
    },
    "MES006.02": {
        "Emily Silkaitis": [
            "review 1: \"23X with Emily Silkaitis: Don't take this course or any others with Emily Silkaitis. She is probably the worst professor I've had at Dartmouth. I don't mean to be so mean since this class was her first time teaching and she was in a new city while still being a PhD student, but I think half the people in the class could have taught it infinitely better than her. For a TMV, this class does not inspire any of the curiosity or interest that it should unless you really reach for it. It's much more of a history class than a religion class, and the dullest parts of Islamic history at that. Prof Silkaitis repeatedly used the excuse that it was the standard syllabus that she was given by the MES department, but I know for a fact this isn't true; friends who have taken the course with other professors say that they integrate more interesting, relevant, and student-driven information to the class than whatever was used for this one. There's a lot of class discussion (which accounts for 20% of your grade), but they're all really dull, so it's hard to participate (coming from someone who participated a decent amount). The midterm was easy enough – pick 10 terms out of 20 and define them in 2-3 sentences. However, the terms she selected are reflective of the fact that this class is useless to an understanding of modern-day Islam. There are weekly response papers that are supposed to be 1.5 pages but by the end of the term needed to be 2 for an A lol. They were also graded really arbitrarily – you could write something great and concise and get a B or write something longer that's incoherent, incorrect bullshit and get an A. The final exam was picking 2 out of 3 essay prompts to respond to. The essays were promised to be a little longer than a response paper – in actuality, they had to be around 5 pages. TLDR – unstable, weird, dull prof; bad content (for the most part); weird assignments; too much work to juggle all of this.\"",
            "review 2: \"23F with Emily Silkaitis: DO NOT TAKE THIS COURSE. I implore you. I don't write many layup lists, but I don't want people to go into this course thinking it's a layup. I needed a TMV requirement, so I hopped in this class hoping it wouldn't be too bad. It turned out to be easily the worst class I've ever taken at Dartmouth. I worked really hard in this class. I basically had to learn Islam from the ground level (I have no religious background), I participated in 90% of class days, and I went to office hours on multiple occasions. For an intro course like this, just showing that kind of engagement for a subject you know nothing about should get you an A, but the grades seem subjective and nobody really has a clue. It really starts with Prof Silkaitis. It was her first time ever teaching a class. She is a Princeton PhD student and was WAY over her skis. Sometimes, I was worried about her overall sanity because she didn't seem all that stable mentally. I feel for her and hope she gets help she needs because it was clear that things were not always alright. It was clear as soon as you entered the room what kind of mood she was in. If she was having a bad day, it was going to be a brutal 65 minutes of class. Beyond the teacher's mental health, the class was simply unpredictable. I remember the first day we had a pop quiz on the readings that were assigned the night before and people were freaking out because that wasn't written on the syllabus. The majority of the class is participation based, and it accounts for about 25% of your grade. This makes it extremely awkward since Prof Silkaitis isn't a good conductor to steer the class to a successful discussion. This makes it extremely difficult if you don't have a background in Islam. If you don't have a background in Islam, it's hard to do the readings because you don't know any of the characters, and you won't learn the characters until you go to lecture the next day. The class is completely backwards: lectures should tell you who the people are, then you should read, then you should be quizzed. But this class is too unorganized for that to make any sense. The midterm was 20 free response questions but only answer 10 of them (yes, weird format). It ended up being an insanely difficult midterm, and Prof Silkaitis had to grade it super easily so everyone didn't fail. Every week you have a reading response paper that's about 1.5 pages. Throughout the term, she pretty much changed that to 2+ pages if you want an A. Another fun curveball nobody saw coming. The final was pick 2 out of the 3 questions to answer and write a total of 10 pages on those two prompts.\"",
            "review 3: \"23F with Emily Silkaitis: I agree with the other reviewers for sure! Do NOT take this class, especially if you're looking for a TMV distrib or a \"layup.\" I feel like for an MES minor/major class, this is pretty comparable/decent for the credit, though, if you're interested in the topic/have prior knowledge about it. This class is a BUTTLOAD of work and is not the class that it used to be. I have a background in MES and have grown up with the faith. Even for me, as well as other people with similar experiences, this class was tough! The professor doesn't spend enough time discussing the basics (which would be really important to people with no background and even in general tbh) and also uses some stereotypes that aren't great at all. She is a nice woman for sure, but this is her first time teaching so be wary!!! Her grading scheme is purely on vibes (she takes off points for incorrect italics and tiny things like that). She also expects full-on analytical essays EVERY SINGLE WEEK. I only stayed in the class because I needed an MES major/minor distrib. Otherwise, would've probably dropped. Getting an A- is achievable but with a TON of work and effort.\""
        ],
        "Joseph Vignone": [
            "review 1: \"21W with Joseph Vignone: Very chill and good teacher. Knowledgable and easy to listen. Skim readings and take good notes in class and you'll get an A. No tests or quizzes. Midterm and final paper, 2-4 pages double spaced sounds right. Great overall class.\"",
            "review 2: \"21F with Joseph Vignone: Such a chill professor and super nice to everyone that shared in discussion (even when some points would be objectively not accurate/insightful). The class had 2 essays that were 3-4 pages (15% each), a written midterm exam (25%), participation (15%), and a final exam of 2 essay prompts for 3-4 pages (30% total). Lectures were informative and somewhat engaging. Instead, Vignone was a great lecturer that engaged the class with his passion for the subject. He would incorporate artwork, Arabic vocabulary, military history, etc to make the class interesting.\"",
            "review 3: \"21F with Joseph Vignone: Amazing class. Chillest professor ever who wants to make sure that this is an easy and understandable intro course to the Islamic religion. Would recommend for anyone looking for a layup - course structure consisted of participation (short discussion post before class), 2 essays (3-4 pgs), midterm exam (identifying vocab words from the class), and a final (two 3-4 pg essays). He specifies that he will only grade you on what you do know and will never deduct points for things you fail to mention/do not know. Easy grader, kind and knowledgeable professor, and interesting lectures all add up to making this a great course.\""
        ],
        "Candace Mixon": []
    },
    "MES081.01": {
        "Eman Morsi": []
    },
    "MES007.01": {
        "Ezzedine Fishere": [
            "review 1: \"22S with Ezzedine Fishere: I put in soo much work into this class. There are so many readings and reviews to write, and you can't BS them. Also the prof tries to give everyone similarly bad grades on the reviews. Overall this class negatively affected my performance in other classes and made my spring sucky. However, the content was super fascinating and Fishere is brilliant. Don't take this class unless you're taking other layups with it and are prepared to put in a ton of work and get a median grade :(\"",
            "review 2: \"22S with Ezzedine Fishere: This class is really amazing. Professor Fishere is probably the most interesting and accomplished professor I've had to date. While this class is a lot of work, the material is very engaging. You should definitely get to know Ezzedine because he is fantastic. Also, do your work. I would not say this class is difficult - I think it is a fair amount of work but totally reasonable and manageable. 100% recommend this course if you are remotely interested in the Middle East/North Africa/Arab Spring.\"",
            "review 3: \"21W with Ezzedine Fishere: This class is hard to explain: The professor is excellent. He comes across as mean at first but he really opens up the longer you know him and you'll get to realize that not only is he way overqualified to be teaching, but he's also done amazing work in both politics and writing. He grades at uniforms, usually giving everyone either a B+ or an A- for every assignment. His feedback can be quite harsh though, so even if you're doing well in the class it can feel like you're doing really poorly. My class was lucky because we all got along really well but I can imagine if that weren't the case then the class would have been a much tougher experience. Overall, if you have an interest in the topic or are looking to get better at your writing, this class is definitely worth it. Just be prepared to be uncomfortable the whole time.\"",
            "review 4: \"21W with Ezzedine Fishere: Professor Fishere is incredibly knowledgable and interesting... certainly one of the most qualified instructors I've ever had. He is, however, super harsh. In his own words, he \"doesn't waste time with niceties.\" This style of teaching is pretty demoralizing. The workload felt unreasonable at the beginning of the term, as you're expected to read and comment on every single one of your classmate's reading responses (on top of doing your own). Additionally, it can be hard to gauge his expectations. Sometimes I felt like I was writing vague nonsense and hoping for the best... and he could tell. Though, I found that as the term progresses, the work seems a lot more manageable. Anyways, I would take this class if it's REALLY something that interests you... otherwise it's just a huge blow to your academic ego. I would just pick a layup, honestly.\"",
            "review 5: \"19W with Ezzedine Fishere: Fishere is one of the best professors at Dartmouth. He is super knowledgable, very engaging, and (once you get to know him a little bit better) friendly. This class is not a lot of work. One short midterm paper and one medium length final. Moreover, the readings are not very long or challenging (even though you do have to write a short reflection on each reading). His grading can be frustrating at times, but if you consistently put in the effort, you will finish with a good grade. Please take a class with him; it will be very memorable and worthwhile.\"",
            "review 6: \"19S with Ezzedine Fishere: Don't do this to yourself. Fishere knows a lot. OK but he acts as if this class is the only class you take. Assignments due every class and you are supposed to guess what he wants for every assignment. There are no instructions, he tells you to go ahead and write a paper, even if you have no idea what to even pick as your topic. Also, not the most approachable prof.\""
        ]
    },
    "MES005.02": {
        "Lewis Glinert": []
    },
    "MES004.01": {
        "Chad Elias": [
            "review 1: \"23S with Chad Elias: Do NOT please do not take this class! Vandewalle, while a very intelligent, is an older professor much more concerned about his work with Tuck students than undergraduates. He is harmless, but once he stops teaching, he completely checks out and will not be available for office hours, consultations about the paper, or zooms. In fact, neither teacher lists office hours on their syllabi! Didn't know they were allowed to do that. Chad Elias, on the other hand, should not be employed by Dartmouth College. He has been inappropriate towards several students, both academically and personally. I went to him before the final with several paper ideas (after weeks of trying to track him down for office hours), and he tore each topic apart because of very minute problems. Since we had to get our topics approved by one teacher and Vandewalle was absent, he refused to approve my topic unless it was something he suggested (all of which were boring topics). This week on for about four days up until the final was due, in which I gave up trying to appease him. Towards the end of the term when I reached out with questions he just stopped replying or did not reply in a timely manner when it was time sensitive. He ultimately said he was incredibly disappointed that I had hobbled together a topic, and that I should be ashamed of my work. After getting the high on the midterm (which was an actual timed test), I was given the low on the final. What's worse is that this was all going on at a time when someone close to me had been in an accident and nearly died, to which Elias did not seem to care. He never once referred me to the dean (which I did not know handled those matters), until final grades were in and he emailed me saying that would have been a much better way to handle it. He is cruel and unusual, and his colleagues think so too apparently. Just don't take this class.\"",
            "review 2: \"22S with Chad Elias: Both Elias and Vandewalle taught the class with Vandewalle teaching the first half of the course on the geopolitics of oil while Elias \"taught,\" some would argue blurted out random things, the second half of the course on soft power. The first half of the class was highly interesting. The second half of the class was a different story. Elias was infatuated with making sure that the grades were in line with the curve rather than focusing on learning. Elias initially made the fifteen-page final paper due five days before the scheduled final date but was forced to change it after realizing that his idea was completely nonsensical. If you want to take this class, just don't sign up, show up to the first lectures taught by Vandewalle, and leave as soon as Elias starts teaching.\""
        ],
        "Diederik Vandewalle": [
            "review 1: \"22S with Diederik Vandewalle: Vandewalle was FANTASTIC. Elias was okay, would agree with other reviews that he seemed more focused on grades and particular details rather than quality discussion. Overall, the content of the course was fascinating, and would recommend for any gov major that like comparative politics classes or topics around the Middle East. Felt like I learned a lot by the end.\"",
            "review 2: \"21W with Diederik Vandewalle: It was both Elias and Vandewalle teaching. Absolutely outstanding class. Small class with two professors, so great conversations. There was no syllabus so everyone was confused on where we were going each week and what the midterms and finals would be until we got to them. We didn't know this at the beginning, but the class is split up into two parts - Vandewalle teaches the first part on the geopolitics of energy in the Middle East. Elias teaches the second half about culture and soft power. It is mostly a layup in that there is not too many readings and the weekly quizzes are only 150 words. But the final paper of 10+ pages kind of turned it into not a layup. Overall though, I really enjoyed it and would recommend.\""
        ]
    },
    "MES002.01": {
        "Andrew Simon": [
            "review 1: \"20S with Andrew Simon: I took this class during 20S so it was pass/fail but it was still a great class. Professor Simon is young, very enthusiastic, accomplished, and offers a variety of reading materials that mainly stem from primary sources. There are recorded and live lectures. Would recommend. Professor Simon is great!\""
        ]
    },
    "MES019.03": {
        "Eman Morsi": [
            "review 1: \"22W with Eman Morsi: The material is fascinating and I got a lot out of the class, but you definitely get out what you put in. Prof Morsi is very knowledgable and good at facilitating discussion, but the class was not always super engaged. I appreciated the mix of news articles, academic articles, documentaries, YouTube videos, etc. There is a decent amount of reading (this is coming from a STEM person, so it's not hundreds of pages every day or anything) but not a whole lot of assignments. Solid class on the upper workload end of layup.\""
        ]
    },
    "MES016.36": {
        "Yasser Elhariry": []
    },
    "MES016.35": {
        "Hussein Kadhim": [
            "review 1: \"22S with Hussein Kadhim: The famous Arabian Nights professor. So surely, this class would be the layups of layups, right... ? Yeah, no. Not really. To be fair, this class apparently was easy in prior terms, but it seems that the college has cracked down. There are two things that make this class a nightmare. First, there are now four 3-4 page response papers (10% each) that you have to do, which weren't present in prior terms of this course. The mere presence of that work is annoying, but what really makes it shit is the second problem: Kadhim no longer grades any of the work himself. He has outsourced the work to bitchy grad school TAs (yeah go fuck yourself AC '21) who love nothing more but to arbitrarily take off points whenever they can. As such, you essentially have to write full-fledged literary analyses of the books, which in turn, requires you to actually read the books in critical detail. Kadhim himself is also the most boring lecturer I've ever had---his slow, slurred speech makes you want to fall asleep. His lectures are essentially just plot summary of the books, which doesn't give you deep enough details to write the literary analyses the TAs want. And, if you try to contribute to the class, he will often make fun of you for not \"speaking loud enough\" (I think Kadhim has hearing problems? Well, that should be his problem, not the students'.) Oh, and attendance is mandatory and 20% of your grade, so you have to come to class. The final 15 page paper (40%) is the most excruciating paper I've ever written. The only positive things I'll say about this course is that there are no exams (which, to be fair, certainly matters to some people) and that you can 'skip' one of the books (there are 5 books---Kanafani's Men in the Sun, Khedairi's A Sky So Close, Mahfouz's Midaq Alley, Mahfouz's The Thief and the Dogs, Salih's Season of Migration to the North---but only 4 required response papers.) Please, if you need the LIT distrib, find a different class. Kadhim is NOT it.\""
        ]
    },
    "MES016.08": {
        "Eman Morsi": [
            "review 1: \"22W with Eman Morsi: Loved prof Morsi, incredibly helpful, engaging content and readings and films. It was a small seminar class so we had a collaborative, close-knit atmosphere. I never felt that this class took a toll on me and it was great because there was a lot of discussion. The material was carefully chosen. The reading workload was sometimes alright, sometimes challenging. Take the course if you want to learn and explore without burning yourself out.\""
        ]
    },
    "MES016.07": {
        "Hussein Kadhim": [
            "review 1: \"21W with Hussein Kadhim: Didn't do the discussion posts. Instead of 15 page final paper, wrote 10 pages double spaced including bibliography. Slept through class. Someone chatted on the phone while unmuted in the class. Still got an A. PLEASE DON'T CANCEL THIS CLASS Automatic A, even if you don't have a pulse. He is a nice prof and the class can be rewarding if you enjoy the material. (Some of the stories/movies can be very entertaining or very boring). Movie classes are fun, though some of the older effects can really wear thin. Easy fourth class.\"",
            "review 2: \"21W with Hussein Kadhim: I'm surprised how few reviews there are here of this class, given that around 350 students took it this term; I suppose people are still in layup mode. Professor Kadhim is truly passionate about the subject and does well to engage students. He even sets up slots at the end of the term for students to discuss their essay topics with him, something I'm sure very few Dartmouth professors would do, let alone doing so knowing that 350 students are taking their class. Overall, an amazing class taught by an amazing professor.\"",
            "review 3: \"21W with Hussein Kadhim: Rumors are that this may have been the last term this class was offered, but who knows. Anyways, as others have said, the only requirement during a normal term is the 15-page paper at the end having anything to do with the nights. Plus, because we took this during a remote term, we also had 5 or so canvas discussion posts about topics in class (200-300 words per response, which is honestly pretty easy as well). I personally liked reading the actual stories from the nights because they were actually pretty interesting, and I did read most of the actual stories, though skipped on some of the analysis topics later. Again, as others have said, Kadhim is really really passionate about the subject and really does hope that people enjoy the class once they've taken it, and there are certainly quite a few who take it that do attend all the lectures and who are super interested in the nights. Whether or not you're one of them or just looking for a layup, this class is definitely great\"",
            "review 4: \"21W with Hussein Kadhim: I know why you’re taking Arabian Nights. You know why you’re taking Arabian Nights. Professor Kadhim knows why you’re taking Arabian Nights. Sometimes, as a Dartmouth student you just need a break, and he is kind enough to offer it. This class has one assignment; a fifteen page paper on anything related to Arabian Nights. This term we also had 5 canvas discussion posts based on the readings and movies, but they’re so easy and literally take 10 minutes to complete. I think it might be impossible to fail this class since I literally went to class once, did one of the readings, wrote my paper on it and was done. He’s way to nice to us. He gives you a much of resources to use for your paper, which makes the writing process much easier. That being said if you’re actually interested in the material, this is also great. Professor Kadhim is so passionate about the material, and he’s a very entertaining lecturer. He sets up office hours for the literal 400 students taking this class and will help you find an interesting and fun topic to write about (I went in only knowing I liked one of the stories and ended the 15 minute with a full fledged topic). He’s actually a legit great dude. If you want to learn, you can. If you need that NW with the least effort possible, you also can.\"",
            "review 5: \"21W with Hussein Kadhim: Kadhim is a gem - one of the nicest professors you'll ever meet. That's all that needs to be said. A 15 page paper on practically ANYTHING related to the Nights and some discussion posts (since this was remote). I know why you are taking this class, but he's so flexible with what your topic is that as long as you hit 15 pages, find a topic to write about on something you personally find enjoyable.\"",
            "review 6: \"21W with Hussein Kadhim: Prof. Kadhim is a legend. Class is 5 discussion posts and a 15 pages final paper that is literally about anything related to the Nights. He is helpful with the material if you wanna learn, and he still likes you if you don't wanna learn. Didn't show up in any but 2 of the lectures, just did the assignments and got an A. I hope Dartmouth admin doesn't attempt to stop this class being offered.\"",
            "review 7: \"21W with Hussein Kadhim: An essential part of the Dartmouth experience now. If you can, take this class as your 3rd class in your toughest term. Just take it. You can have a good time and learn, or you can mess around and do the bare minimum. In the end, you'll get an A, learn at least a little about The Nights, and probably make a lot of jokes along the way.\"",
            "review 8: \"20W with Hussein Kadhim: This class is the layup of layups. Write a 12-15 page paper, double-spaced and attendance is optional. You can write it on anything related to Arabian Nights. I wrote it over winterim and had a friend send me the syllabus and requirements for the paper. Literally attended class twice and it was during the first week. I was done with the class before it even started. If you are genuinely interested in this class, still take it. Prof Kadhim is really a nice person and cares more about teaching than grades.\"",
            "review 9: \"19F with Hussein Kadhim: Take this class. End of story. I went to class but it's definitely optional. Go if you genuinely want to learn because he is genuinely trying to teach. The paper is the only grade and is pretty easy, just long. 10/10 would recommend.\"",
            "review 10: \"19F with Hussein Kadhim: Layup of layups. Class and readings completely optional, only assignment is 15 pg. final paper (doesn't have to be exactly \"15 pgs\"). Kadhim is a really nice man.\"",
            "review 11: \"19F with Hussein Kadhim: Biggest layup ever. You don't need to do the readings or go to class, he never takes attendance. Your whole grade comes from a 15-page research paper at the end of the term, but it's super easy to bang out and I don't think he grades anyone's harshly. Professor Kadhim is also the nicest guy so if you're genuinely interested in the topic you'll enjoy the readings and lectures.\"",
            "review 12: \"19F with Hussein Kadhim: Pretty easy class for sure, but also the prof is really passionate about teaching. Pretty sure he doesn't care about the grade because he's just THAT passionate about teaching the course\"",
            "review 13: \"19F with Hussein Kadhim: lol write 15 pages of anything to do with Arabian nights and get an A. doesn't have to be a coherent paper, don't have to go to class, don't have to even know what the Arabian nights are. What actually are the Arabian nights? Was this like a sociology class on the nightlife in the Middle East? who knows? still got an A\""
        ]
    },
    "MES016.03": {
        "Lewis Glinert": []
    },
    "MES012.05": {
        "Ezzedine Fishere": [
            "review 1: \"19S with Ezzedine Fishere: This is an awesome class with an incredible professor. The material is fascinating, and Fishere's ability to contribute to the readings is really valuable. There is a fair amount of dense reading in this course, but if you can just soldier through it, it will be entirely worthwhile. Fishere is one of the best professors at Dartmouth, and this is a class that he really enjoys teaching. Take this class!!\"",
            "review 2: \"19S with Ezzedine Fishere: Absolutely amazing course. Though the readings might seem long or confusing at first, Prof. Fishere's choice of readings and discussion topics are 100% relevant to the course. Prof. Fishere is incredibly well versed in the subject area, and is an excellent professor. This was a very rewarding, interesting, and reasonable class. I would strongly encourage students to take a course with Prof. Fishere if possible during their time at Dartmouth.\""
        ]
    },
    "MES012.04": {
        "Ezzedine Fishere": [
            "review 1: \"19W with Ezzedine Fishere: Prof Fishere is extremely knowledgeable, funny, well-connected (used to serve as ambassador to the UN), and has a good sense of humor. I absolutely LOVED this class- I'm probably going to be a govt minor and this is exactly what I was hoping for. We cover interesting topics like the Israel Lobby, Arab Israeli peace, Syrian conflict, terrorism, 9/11, etc. Prof is pretty unbiased and good at lecturing while drawing answer out of the class. Format: One midterm paper, one final paper, a final presentation with a group (pick from a list of topics & present the US policy options, then make your recommendation), 10 or so \"film reviews\" (each weekend on top of a normal amt of reading you watch a film that he picks out- most are p interesting- & write about 250 words reviewing it), and reading responses for each class (you must do the reading b/c you have to write a \"tweet- sized\" response to it summarizing the main argument and a question you have about it). Overall a great class! Highly recommend.\""
        ]
    },
    "MES010.10": {
        "Andrew Simon": [
            "review 1: \"24W with Andrew Simon: Really really enjoyed this course. Prof simon paints pictures when he lectures and he really KNOWS the content. Really enjoyed learning from him and can’t wait to take more courses with him. The final is 16-18 pages which was daunting and course was participation heavy, but I encourage people to take this.\"",
            "review 2: \"23S with Andrew Simon: Honestly such a fun class. Readings were a lot, but you could definitely get by through skimming and playing movies on 2x speed. Discussion-heavy class which was kind of intimidating with such a small class size (maybe like 7-10 people present per day) but over time it also makes speaking up less daunting because you'll hear from everyone at least once and you get so used to it. Content itself was very interesting and covered a wide range of material from the Arab Spring, colonial-era countries, nation building projects and pop culture. Requirements was just a single discussion you had to lead, several short weekly reflections which transitioned into the final project proposal and some chill milestones halfway through the term. Final project could either be a research paper (16-18 pages), podcast with a paper, or an art expression with a reflection. Overall, took this class for a distrib and had more fun than I thought I would! I also took a 4 course term for the spring and got an A so definitely a doable if you are willing to put in some work or if you're not scared to write a long research paper\"",
            "review 3: \"19W with Andrew Simon: This was a very strong class but certainly not a layup. The class is almost entirely discussion. Students led two discussions per term (graded) and there were a few lectures related to the Professor's research and lived experiences. There is a final paper (20 pages, 35% of final grade) that is not an easy task. The project felt daunting at first, but now that I am invested in it I've found it a really positive experience and I've loved the support from Prof. Simon to make that a reality. Weekly discussions and assignments were worth 25% of the grade in total. They were were good and interesting but sometimes felt like more of a checkpoint than something that actually moved us forward in the progression of the course. Professor Simon curated the course very well and I found every reading valuable. His comments on written assignments were very helpful and he always made himself available. His personal experience in Egypt in 2011 and afterwards was an incredible story, and I appreciate how he worked that into many lessons without centering the course around that experience. Would highly recommend the course with the reservation that it can feel like a significant commitment towards the end of the term.\""
        ]
    },
    "MES001.01": {
        "Jonathan Smolin": [
            "review 1: \"22W with Jonathan Smolin: The other reviewers covered most of my critiques. The material can either be engaging or completely boring. Most of the textbook reading was dull and hard to get through. However, the key points of the readings are reiterated in the lecture. If you pay attention to the lectures and take notes on the obvious key topics the tests are fairly easy. Definitely a lightly loaded course, requiring the smallest time commitment during my quarter.\"",
            "review 2: \"22W with Jonathan Smolin: Professor Smolin seemed to care very much about his students and the material. Unfortunately, I think he also cared about lowering the course median, as he made the final exam significantly harder than the midterm (for context, I did roughly 20% better on the midterm, despite studying more for the final and going into it feeling like I had a pretty good grasp of the material). He included several questions on incredibly niche Middle Eastern historical figures and events, as well as a couple of trick questions that didn't really test how much you learned in the class, they just tested how well you could memorize exact dates and read the questions critically. So that was disappointing. Other than that, though, I was very fascinated by the lectures and the assigned readings/movies for the class! Very different from every other class I've taken here, and I would say that the class was a great 3rd class with two other more time-consuming classes (needlessly hard final aside).\"",
            "review 3: \"22W with Jonathan Smolin: This course could have been incredible, but having a 150-person class with many students who clearly had no interest in the material, made the experience very underwhelming. The material and lectures are interesting and Prof. Smolin is very engaging and entertaining, but the course moves extremely slowly in my opinion. I also feel that some of the emphases were misplaced: we covered very little about the Islamic Revolution in Iran for example, but spent a lot of time on cultural issues and depictions. The assignments were easy, but the exams were quite time pressuring. Midterm 25% Final 40% - the MC here is a little difficult Attendance 10% - everyone was given full credit here Discussion posts 10% - completion Quizzes 15% - very easy; true/false or simple MC\"",
            "review 4: \"22W with Jonathan Smolin: Very interesting class. as was mentioned this class was 150 people who were almost all looking for a layup. Readings were ok but prof's lecturing was very well done even if a little dull sometimes. I learned a lot even though history is very hard for me to remember. Quizzes were kind of unreasonable because every question of the three short quizzes we had was a percentage off your grade. Prof assigned some questionably movies that were at least entertaining. would recommend if you're looking for a distrib\"",
            "review 5: \"22W with Jonathan Smolin: Big layup. Sorta interesting. Take if you need a light third class. Prof is engaging and enthusiastic but as others have said, most of my class just did not really care about learning.\"",
            "review 6: \"22S with Jonathan Smolin: Great professor, class was just too big and material got boring at times. Midterm/final are pretty simple, just keep up with the readings and this class is definitely a layup\"",
            "review 7: \"22S with Jonathan Smolin: Class was interesting in terms of material and the Professor was engaging in class at times but could also talk about boring literary themes. A lot of reading but could be skimmed. It was very anti-west and Israel. Two take home closed note exams were the majority of the grade.\"",
            "review 8: \"22S with Jonathan Smolin: Easy, interesting class with passionate professor -- would definitely recommend. He repeats himself hella so it's easy to get the main ideas and the readings are generally pretty interesting. Lots of movies.\"",
            "review 9: \"22S with Jonathan Smolin: Absolutely incredible class, and I say this as a STEM major who tries to stay away from humanities classes as much as possible. If you're even remotely into Middle Eastern politics, history, geography, cinema, or think you might be, take this class!! I've never enjoyed writing discussion posts as much as I did in this class, which sounds ridiculous, but it's true.\"",
            "review 10: \"21W with Jonathan Smolin: I loved Jonathan Smolin as a professor, on Zoom too, really engaging and straightforward lectures so it was easy to extrapolate the important ideas he wanted you to know. Readings or films (personally loved the films) before each class and discussion posts before Monday and Wednesday classes and are graded on completion. Our midterm was pretty straightforward, identifying 2 major people/topics we had discussed and then answering 3 short answer questions. Final is 3 essay questions and he gave us ~5 days to complete it. Would highly recommend, the content is really interesting and I learned a lot.\"",
            "review 11: \"21S with Jonathan Smolin: Super thoughtful prof. Work was very manageable. Material was accessible to non-experts. Grading was straight-forward. An unexpected highlight of the term. Prof asked about life beyond class in office hours and cared about his students.\""
        ],
        "Kevin Reinhart And Andrew Simon": [
            "review 1: \"23W with Kevin Reinhart And Andrew Simon: Reinhart is truly horrible and rude to students. Multiple racist remarks and comments degrading to students' intelligence. Do not take this class with him, you will be enraged.\"",
            "review 2: \"23W with Kevin Reinhart And Andrew Simon: The content of this class is interesting but somehow these professors are completely incompetent at doing their jobs. They don't know how to use canvas, grading feels completely arbitrary, they don't actually give you prompts for any assignments, and Reinhart at least is not helpful during office hours—I went in with a 5 minute question about my paper and he kept me there for an hour lecturing about Islamic economics and wouldn't let me leave when I said I had to go to my literal job. Simon is fine just kind of a boring lecturer. Overall not a hard class with interesting material but terrible profs.\"",
            "review 3: \"23W with Kevin Reinhart And Andrew Simon: Overall super interesting lectures - profs related material to modern issues in a really cool way. Reading was occasionally worth reading and optional if you could avoid the voracious cold-calling and interrogation tactics of Reinhart (kinda scary). Simon was much more chill. Had uber easy map quiz on the second class, and a short-answer+essay midterm (approx 2400words total) mainly on reading/lecture content, and a film review (12-1500words), and a final project(3-3600words). Profs did not know how to use canvas, and Reinhart graded super harshly whereas Simon graded super easy for the midterm...kinda unfair -- still have no idea how overall grades are gonna turn out. Both profs gave very little direction for what they wanted on the assignments, and refused requests for any sort of rubric. layup i guess? definitely learned a lot\"",
            "review 4: \"23W with Kevin Reinhart And Andrew Simon: DO NOT TAKE WITH THESE PROFS. boring and unorganized lectures, arbitrary grading after they don't even make their expectations clear, cold-calling, no prompt for 3,000-word final paper?? needed a layup and this was the biggest mistake I could've made. going to be my lowest grade with two engs classes. SMH\"",
            "review 5: \"23W with Kevin Reinhart And Andrew Simon: The content of the class if definitely interesting. I truly feel like I learned a lot and understood the Middle East more. The workload is not bad at all. There is a map quiz on the second day of class (5% of our grade), a midterm that consists of 1 essay and some short answer questions (25%), a 4-5 page film review (20%), and a 3000-3600 word final paper (35%). The downside of the final paper was the fact that it was so long and we weren’t given a prompt. The other 15% is for participation. The professors weren’t horrible, they just aren’t very engaging. They seemed to take themselves way too seriously. They also never provided rubrics which made it hard to decipher what they were looking for in the assignments. Professor Simon is a very easy grader which helped with the midterm, film review, and final paper grades. There are around 3-5 readings to do before each class that helped with discussion during class. I would say that you don’t really have to do them. There was occasional cold calling so it would help to skim. While I wouldn’t call it a complete layup, It’s pretty easy to get an A in this class. Put a decent amount of effort in the papers and show up to class occasionally and you’ll be fine.\"",
            "review 6: \"23W with Kevin Reinhart And Andrew Simon: This class could have been good but Reinhart truly ruined it. I have never seen a professor be as mean to students as he was. Even when I did the readings I still couldn't answer his questions because they were extremely vague. He would also get mad if you did not say exactly what he was thinking. When people don't raise their hands he cold calls. I was genuinely scared to go to class every day. Simon was better and the class was not a lot of work overall, but I still would never recommend it to anyone, at least not while Reinhart is teaching it.\"",
            "review 7: \"23W with Kevin Reinhart And Andrew Simon: B+ median for absolutely no reason. super unclear instructions for all assignments, but at least there weren't too many. found the lectures really interesting though, and i really liked reinhart. Overall, not a horrible class. Its possible to get an A but don't treat it as a layup, actually put in work. probably on the hard edge of layup\"",
            "review 8: \"23W with Kevin Reinhart And Andrew Simon: Do not take this class with Reinhart. He was simply unprofessional, and downright using intimidation tactics in class. There were several classes where not only did he cold-call everyone to answer his silly questions about the readings, but he would walk right up to a student, stand directly above them in their chair, faces literally 2 feet apart, and be interrogating them about the reading; or worse, whether they even did the reading. The majority of the class clearly did not do the readings, but the way to address that is not by beating a dead horse with scare tactics and intimidation. That's just cruelty and harassment. This was simply not okay and I am not proud to have been a part of this classroom environment. I surely hope I never have a repeat of this experience at Dartmouth.\"",
            "review 9: \"23W with Kevin Reinhart And Andrew Simon: This class was awful, they never gave any feedback and were extremely unorganized. Not a layup with these profs.\"",
            "review 10: \"23W with Kevin Reinhart And Andrew Simon: DO NOT TAKE THIS CLASS. Although the material was interesting, the profs were TERRIBLE. Lectures were redundant and boring. Assignments were graded very harshly and no rubrics were posted clarifying directions. The profs were so unhelpful and condescending during office hours. The class had a B median... NOT A LAYUP.\""
        ],
        "Tarek El-Ariss": []
    },
    "MES087": {
        "Christopher MacEvitt": [],
        "Tarek El-Ariss": []
    },
    "MES085": {
        "Andrew Simon": [],
        "Christopher MacEvitt": [],
        "Eman Morsi": [],
        "Tarek El-Ariss": []
    },
    "MES012.03": {
        "Ezzedine Fishere": []
    },
    "MES008.01": {
        "Ezzedine Fishere": [
            "review 1: \"20F with Ezzedine Fishere: OVERALL great class, appreciate your time with Fishere he is overqualified as a professor (imo) +insanely smart professor +impressive contacts for guest lectures +you will gain a truly valuable broad view of conflict in the middle east -LOTS of reading, many hours -cant BS your way out of pretending you did the reading, he always knows -professor can be intimidating Tip: do NOT introduce yourself as an expert on anything, he will then put you on the spot and test you when it's relevant. better to say on day 1 that you know nothing about the Middle East, those are his favorite students.\"",
            "review 2: \"20F with Ezzedine Fishere: Professor Fishere is a genius, so knowledgeable about everything you talk about in the class. He worked as an Egyptian diplomat and has so many connections from his time working in the field that came and spoke to the class as guest lecturers. The class is labelled as an introductory class, but would recommend taking this class with prior knowledge about Middle Eastern politics. The class is a lot of reading that you have to do to be able to participate in class discussions (20% of the final grade is participation) but you learn so much. Professor Fishere is slightly intimidating, however, overall a great class that was always interesting and engaging and I learned so much about politics in the Middle East.\"",
            "review 3: \"18F with Ezzedine Fishere: This class can be hard as heck. The readings are insane half the time. The first week was like 250 pages of reading. Fishere is a wonderful professor. He is extremely knowledgeable and well-connected/experienced. He is a genius and we were all lucky to be in his class. His class consists of weekly canvas discussions, an essay midterm, essay final, and LOTS of reading so it's not that bad. He doesn't grade too harshly but I would say that it's not easy because it's hard to be engaged in the discussion which promotes intense critical thinking and in-depth knowledge of the readings (so if you can't cram 80 pages you're screwed). It's stress-inducing for a lot of students but he's a really knowledgeable professor who really, REALLY knows his stuff and can pull facts out of thin air. He's amazing and I definitely recommend taking at least ONE class with him. It's intimidating and hard but so worth it because he's a really great professor and intellectual. He's a genius!\"",
            "review 4: \"18F with Ezzedine Fishere: Great class taught by a great prof. If you are at all interested in learning about how the Middle East got to be what it is today, take this class. Professor Fishere is extremely knowledgeable and pushes students to defend their positions during discussions. He draws a lot from personal experience, especially when discussing the Arab Spring, which makes the class so much more interesting. The midterm and final are short essays that you complete at home. Because Prof Fishere is a novelist, he can be a bit strict on the grading for these assignments. However, I felt that this made me a better writer overall.\""
        ]
    },
    "MES003.02": {
        "Jesse Casana": []
    },
    "MES002.02": {
        "Golnar Nikpour": []
    },
    "MES017.09": {
        "A. Kevin Reinhart": []
    },
    "MES016.12": {
        "Lewis Glinert": []
    },
    "MES016.11": {
        "Lewis Glinert": [
            "review 1: \"23W with Lewis Glinert: absolute sweet heart of a teacher. def recommend this class. prof is super understanding of any and all circumstances.\"",
            "review 2: \"22W with Lewis Glinert: this class is easy in the sense that you don’t have to go to class but the prof grades so stupid and gives to guidance on anything that you have no idea how to do well in the class or how to properly write assignments. In class you just speaks for 2 hours straight and is so freaking boring do not take this class im sure there are easier LIT layups.Very nice guy tho just really weird and specific grader\"",
            "review 3: \"22W with Lewis Glinert: I echo the same thoughts of the reviewer below me for 22W. Class is so easy in that you never have to attend but the Prof is a completely unhelpful, boring lecturer. He grades super harshly--your entire grade is basically 40% midterm, 50% final and 10% participation. The midterm was pretty decent as he gives you a set of prompts and you answer in 90 minutes, but the final was a 15 page paper on kind of niche Jewish humor topics and was dreadful to write.\"",
            "review 4: \"21S with Lewis Glinert: If you're looking for a layup, you've come to the right place. If you're looking for an interesting class, better keep looking. The idea of \"Genesis to Seinfeld\" is pretty skewed towards Genesis only. At times in the class I felt like I was in a bible study group and it wasn't all that engaging. Also, there's a fair amount of analyzing humor in the class, which is the death of all humor. No, seriously, there's some quote in the class about how the study of humor leads to the absence of humor and at times I thought the class was perpetuating that paradox. I wrote my final paper worth 60% of the final grade in 2 days (like 15 pages) and it was one of the worst papers of my life but somehow scooped an A. Prof Glinert is chill too\"",
            "review 5: \"19X with Lewis Glinert: If you're into Jewish comedy, definitely take this class. If you're not, still take it. The material is interesting, but hardly necessary to do well in the course. Professor Glinert is passionate about teaching and available for discussion outside of class. Videos and movies supplement some readings, and all of them are hilarious or otherwise memorable. The final grade is based solely on a straightforward midterm and a ~10-page paper.\""
        ]
    },
    "MES016.10": {
        "Tarek El-Ariss": []
    }
}