{
    "NAS030.25": {
        "Amanda Gokee": []
    },
    "NAS030.24": {
        "Sunaina Kale": []
    },
    "NAS007.07": {
        "Jeremy Mikecz": []
    },
    "NAS030.23": {
        "Michelle Brown": []
    },
    "NAS030.22": {
        "Jeremy Mikecz": []
    },
    "NAS081.04": {
        "Nicholas Reo": []
    },
    "NAS030.21": {
        "Jami Powell": [
            "review 1: \"21S with Jami Powell: I wouldn't quite call this course a layup because of the number of readings and the assignments that were assigned throughout the term, but this course wasn't difficult. Professor Powell is amazing and very understanding. You will do well as long as you do some of the readings and come to class with an open mind. This is probably one of my favorite courses so far at Dartmouth and I only originally signed up for the ART distrib.\"",
            "review 2: \"21S with Jami Powell: Super Kind professor, and super interesting class. She cares about you as a person and was great during online classes on checking in on students and maintaining a healthy amount of work and great class discussions. Great way to get art distrib without being graded on doing any art!\""
        ]
    },
    "NAS030.20": {
        "Jeremy Mikecz": [
            "review 1: \"20S with Jeremy Mikecz: This course was my best academic experience at Dartmouth so far. I ended up taking it as an independent study because I was the only student in it and the registrar's office canceled the course. However, the material was the same and it was fascinating!! It's a great small class to do online because I got the chance to learn so much from Professor Mikecz and study what interested me most. This is a great course to take during covid. I put a ton of work into this class and got a ton out of it but it does not have to be a super hard course. Professor Mikecz is a wonderful teacher who is really passionate about what he teaches. He is also super nice, approachable, and goes out of his way to help students. He often searched through his old records to send me stuff I needed for my research, digitized stuff I wanted to read and could not find online, and helped me search and translate Spanish documents for information relevant to my research. Sometimes we also had fascinating discussions about stuff unrelated to the class that ended up tieing into the themes of indigenous Peruvian history in unexpected ways. I highly recommend you give this course a shot and put as much into it as you can.\"",
            "review 2: \"20F with Jeremy Mikecz: Overall, this was a fun class. Professor Mikecz is still getting the hang of it so sometimes the workload was a lot. It was a lot of reading and the paper you work on throughout the term is a lot. But, it is super obvious that he cares a lot about the class and even hooked us up with a VR headset so we could experience Andean sites more realistically and had an old professor of his come in so we could talk to him. He helps you through the research process and gives you tips on the writing. I liked the class, and I am sure that it will get even better from here.\""
        ]
    },
    "NAS028": {
        "Maurice Crandall": []
    },
    "NAS030.19": {
        "Gordon Henry": [
            "review 1: \"19F with Gordon Henry: This class had a reasonable amount of reading that we discussed in class for only a fraction of the time. We mostly watched videos made from Indigenous perspectives and discussed them. We did one small project and one bigger one and did something similar to peer reviews on them. The professor is extremely kind and is very laidback. Definitely recommend this class to anyone interested in either NAS or FILM.\""
        ]
    },
    "NAS030.02": {
        "N Bruce Duthu": []
    },
    "NAS030.18": {
        "Davina Two Bears": []
    },
    "NAS030.17": {
        "Bernard Perley": []
    },
    "NAS007.06": {
        "Maurice Crandall": []
    },
    "NAS056": {
        "Maurice Crandall": [
            "review 1: \"22W with Maurice Crandall: Love this class and this prof. He's super chill and most of the time you can get by without doing the readings. Crandall is super nice and understanding! Definitely take this class if you have the chance!\"",
            "review 2: \"20W with Maurice Crandall: Professor Crandall is an awesome and entertaining professor. I found that if I needed to skip readings for other work I needed to focus on then I wouldn't miss too much because we would talk about the readings and the info about it in class anyways. He also has study materials for the exams which are great.\"",
            "review 3: \"18F with Maurice Crandall: Pretty chill and funny guy. Easy to take class without actually doing most of the readings. Class consists of him going through powerpoint slides (fairly interesting topics), and grading is based on short weekly reading response, attendance, a research paper, a midterm and a final. I suggest listening in class as it will come up on exams, but he also posts Powerpoint slides on line. Overall, easy and interesting class, but make sure to actually treat it like a real class when it comes time for exams/paper because grading is largely based on these assessments\""
        ]
    },
    "NAS013": {
        "Nicholas Reo": [
            "review 1: \"18F with Nicholas Reo: Professor Reo put some real effort to make this class engaging and exciting, as well as completely immersive into Indigenous food practices and cultures. This meant that it was composed of entirely native students, but not to be exclusive. It was extremely interesting and engaging, and was almost entirely field trip immersion based. Also, food in every class!!\""
        ]
    },
    "NAS051": {
        "Maurice Crandall": []
    },
    "NAS007.05": {
        "Dale Turner": [
            "review 1: \"18S with Dale Turner: This class was excellent. Not too much work, material can get slightly confusing at times, but Turner is willing to review everything with you if you go see him at his office hours. He will always give you extensions when necessary. Overall, you are taking this course because you either have an interest in Native American studies and/or are thinking about becoming a NAS major/minor. I can not over-hype Prof. Turner, as he is one of the nicest and most relaxed Profs at Dartmouth (fairly easy grader as well).\""
        ]
    },
    "NAS030.16": {
        "Gordon Henry": []
    },
    "NAS016": {
        "Maurice Crandall": [],
        "Preston McBride": []
    },
    "NAS030.15": {
        "Lara Evans": []
    },
    "NAS030.13": {
        "Nicholas Barron": [],
        "Sergei Kan": []
    },
    "NAS030.12": {
        "Sergei Kan": []
    },
    "NAS030.14": {
        "Greta Marchesi": []
    },
    "NAS030.11": {
        "William Fitzhugh": []
    },
    "NAS030.10": {
        "Bernard Perley": []
    },
    "NAS007.02": {
        "Melanie Benson Taylor": [
            "review 1: \"16S with Melanie Benson Taylor: Anything Melanie Benson Taylor says is the wisest thing you’ll hear all day. This woman’s vocabulary is through the roof, and at the same time, she’s completely down to earth and relatable and funny. Her lectures/insights in discussion are some of the best I’ve ever heard in my four years at Dartmouth. This seminar was the first (but not the last) course I took with her, and it changed my perspective on the world (especially advertising) and sparked my interest in NAS. The homework is fun and easy (watching and analyzing films, reading contemporary novels) but leads to deeply meaningful discussions.\""
        ]
    },
    "NAS087": {
        "Colin Calloway": [],
        "Melanie Benson Taylor": [],
        "N Bruce Duthu": []
    },
    "NAS086": {
        "Colin Calloway": [],
        "Melanie Benson Taylor": [],
        "N Bruce Duthu": []
    },
    "NAS085": {
        "Colin Calloway": [],
        "Melanie Benson Taylor": [],
        "N Bruce Duthu": []
    },
    "NAS081.03": {
        "Colin Calloway": [
            "review 1: \"23W with Colin Calloway: Enjoyed this class a lot! Workload is non-existent with the exception of a 25 page paper at the end (which can feel like a lot if you don't start early). Professor Calloway makes the lectures interesting and is pretty available outside class to discuss the paper.\""
        ]
    },
    "NAS081.02": {
        "Dale Turner": []
    },
    "NAS080.01": {
        "Vera Palmer": []
    },
    "NAS080": {
        "David E.": [
            "review 1: \"05F with David E.: Overall, this seminar was phenominal. The course work was interesting, indepth, and intense. The importance of this class lies in the knowledge acquired and the questions raised by the readings. If this class were to be offered again with the same professor, I would highly recommend it to any NAS or American History major.\""
        ],
        "Vera Palmer": []
    },
    "NAS055": {
        "Colin Calloway": []
    },
    "NAS050": {
        "David E.": [
            "review 1: \"05F with David E.: This was an ok class. The prof was visiting and he is excellent in his field but not a good prof. We talked in circles a lot. I would reccomend taking a class with Prof. Ranco to really get to understand Indian Politics.\""
        ],
        "N Bruce Duthu": []
    },
    "NAS048": {
        "Dale Turner": [
            "review 1: \"11F with Dale Turner: I took the class for the TMV distrib and my interest in Native American Studies. The readings were decent and drove the discussion. That being said, I don't think that many people did the reading. As a result, discussion was sometimes awkward. The professor was sometimes lackluster, but competent and helpful, especially with the final paper. The grading, for me, was 20% mid-term and 80% final paper. The final paper was 20 pages and not bad as you could integrate several topics under a central theme. A good grade is achievable IF you do all of the work and show up to class. Attendance was sparse.\""
        ]
    },
    "NAS047": {
        "Gordon Henry": [
            "review 1: \"22F with Gordon Henry: Very good class. Prof is hilarious and extremely kind and accommodating. The guest speakers were awesome and the class is overall not too demanding. 10/10 would recommend. Since its a poetry class the readings were not very intense so its a very easy way to get your lit distrib\"",
            "review 2: \"22F with Gordon Henry: Class was pretty good and professor was knowledgeable and hilarious. Assignments were very easy throughout the term, but Henry decided to make the mean on the final paper a 76 and gave people 0s on some class assignment for a day when most people didn’t realize there was class (Henry was out a lot throughout the term so the confusion was understandable). This made final grades lower than expected, which was annoying, but other than that a good class.\""
        ],
        "Vera Palmer": []
    },
    "NAS045": {
        "Dale Turner": [
            "review 1: \"06W with Dale Turner: NAS 45 was a class I took mostly on a whim, and it turned out being one of the most rewarding courses I've taken at Dartmouth. The first half of the course was spent establishing a context- the predicament of minority intellectuals. This is nothing I had ever been exposed to and Dale Turner was an insightful prof who truly provided a 'liberal arts experience'. The readings were interesting and practical... they are relevant to the course material but not obscure Native American discourses; Turner gave us a working background in Foucault, for example, which no Dartmouth student should graduate without. Plus, you don't have to do all the readings, and Turner is very flexible with assignments. As long as you talk to him and get them in, he doesn't really care if they're late. That being said, the work load is not difficult- a 2 page reading response every week, a short, and a final paper. The course is excellent, I give Turner a less than perfect review only because his lectures were at times repetitive.\"",
            "review 2: \"06W with Dale Turner: A large amount of reading was assigned for each class, but less than half was required reading. I read some of the best/most interesting pieces while in this class and also some of the most boring readings since I have been here. Turner is very funny and generally a very good prof, but he has a tendency to drag out lectures every once and a while.\""
        ]
    },
    "NAS042": {
        "Jami Powell": [
            "review 1: \"23W with Jami Powell: This was a great class and you learn a lot. Professor Powell is great and is very flexible with you, i.e. sickness, needing to leave, etc. She brought in a few guest speakers and you have to attend some outside-of-class events as assignments which are very interesting. The class is all discussion based with different groups leading discussions each class. Do the readings and you will be fine. The final was really simple and was left up to your own artistic perception which was cool. Overall great class and relatively easy.\""
        ],
        "Vera Palmer": []
    },
    "NAS041": {
        "N Bruce Duthu": [
            "review 1: \"23S with N Bruce Duthu: Duthu is awesome and so caring for all his students. Super interesting guy, lectured a lot but class is small and we all sit in a circle so felt interactive at the same time. As someone who had never taken a NAS class before, this was really interesting and approachable and helped me understand the nature of Native American life and society in the US in a new kind of light. There are a lot of books to read for this class as it is a literature class (5 books throughout the term), however I got by and managed to get an A just with spark notes and reading small parts of the books online. Workload is not light but not unreasonable and very back-ended. First essay (1,200 words) due week 4, second essay (1,200 words) due week 9, 30 minute group presentation where you essentially \"lead the class\" happened in week 10 and then a final research paper (3,500 words) due towards the end of finals period so the term starts off pretty chill but in the last 3 weeks he packs in 3 significant assignments.\""
        ]
    },
    "NAS040": {
        "Lindsay Whaley": [
            "review 1: \"21W with Lindsay Whaley: This class was honestly a joke. While I did learn things, it was just not worth it. A white man teaching me was really just the icing on this awful class cake.\""
        ],
        "Hilaria Cruz": []
    },
    "NAS038": {
        "Colin Calloway": []
    },
    "NAS037": {
        "Sergei Kan": []
    },
    "NAS036": {
        "Dale Turner": [
            "review 1: \"19W with Dale Turner: Would not recommend this class to anyone. Professor Turner has a tendency to ramble aimlessly during lectures and expect you to recall random obscurities. He takes forever to grade the essays. He talked about Canada for 8 weeks, then asked us to write a paper on New Zealand with one half of a 10A as preparation. If you're looking for a meaningful class to enrich your understanding of Indigenous issues, look elsewhere.\"",
            "review 2: \"09F with Dale Turner: The course has a ton of reading assigned, but much of the reading is unnecessary if you are engaged in the lectures (which is difficult at times). The courseload includes daily readings, plus two 4 page papers, a take home midterm and a take home final. The midterm and final are stressful as Turner gives only a few days to write around 10 pages. If you attend class and are engaged in lectures, the class is fair and easy enough. However, I must warn that it is easier said than done, and many students (myself included) in the class were playing games on their computers much of the class time.\""
        ]
    },
    "NAS035": {
        "Gordon Henry": [
            "review 1: \"19S with Gordon Henry: Henry is the best prof ever. Such a sweet man, and drew on a lot of his own experiences to make this class awesome. We would do nature walks, fun group activities, etc. He helped us learn without it seeming like learning. A decent amount of reading for the class but it was easy money.\""
        ],
        "Melanie Benson Taylor": [
            "review 1: \"22S with Melanie Benson Taylor: A lovely professor and an engaging class. Not the most cheerful reading, but important. She was very understanding if you needed an extension and talked to her in advance.\""
        ]
    },
    "NAS034": {
        "Dennis M.": [
            "review 1: \"07W with Dennis M.: the lectures dont really respond to the readings but D.Run is awesome and you get to learn a lot from the native students in the class\"",
            "review 2: \"07W with Dennis M.: Runnels is awesome. Realy chill. At the beginning of the term we had one-page responses due every class, but after we finished the first book, we kind of didn't have any work at all. He talks a lot and grading is pretty easy. But on top of all that, I feel like I learned a lot and I gained a whole new perspective.\"",
            "review 3: \"07W with Dennis M.: This class lost steam fast. By the end of the term, out of a class of 40, less than 10 would show up. There wasn't much reason to show up--class, especially towards the end, was spent viewing a series of redundant videos. Class usually began 15 min. late and ended early (or seemed like it should). Prof. Runnels did give some good lectures, but these seemed very few and far between (especially at the beginning of the class when stories and songs were studied when his guidance would have been most helpful). Instead, disproportionate amounts of class time were wasted in group discussion sections among students with no guidance whatsoever from the prof. Prof. Runnels said this was the best way to study the material, but often small group discussions were directionless and ran out of material quickly. The readings were great and included a diverse selection of tribes and oral traditions, but they could have easily been read independently without this class. This class had great potential (when Prof. Runnels didn't digress, his lectures truly were interesting), but class was almost always a disappointment. What a waste of a class!\"",
            "review 4: \"02X with Dennis M.: This class was remarkable~ I learned so much-- all 'outside the box' thinking, completely rocking the foundations of all other classes and even life perceptions. Highly recommended, especially to those who want to see different angles through different eyes, and even more so to those one-track dull focused cookie-cutter (you know who you are even if you don't want to admit it) types who need to see different angles through different eyes~\"",
            "review 5: \"02X with Dennis M.: Why is it that almost every term, one of three classes is little more than a pain? Save the final paper, which, at 20-30 pages, wastefully consumed my time, the demands made by the class were nonexistant. The lectures, discussions, and readings were, therefore, preempted by this behemoth of a final paper. But at 40+ students, this class couldn't serve the same function as an independent study because the professor just didn't have the time. Even if you are very interested in the Native American Oral Tradition, you can learn just as much by studying it independently. I would only recommend the class if you want to practice writing a lengthy paper. In short, there are better classes out there.\"",
            "review 6: \"02X with Dennis M.: This was an amazing class! We experienced many forms of oral tradition, from stories to songs to movies, through which various Native American cultures have expressed, passed on, and maintained their values over the centuries. Getting a sense of their diversity and timelessness was inspiring, and I felt a personal connection between events in my life and some of the stories we read. This class encourages reflection and introspection, something that life at Dartmouth doesn't easily allow time for. A wonderful class- I'd recommend it to anyone, just bring an open mind and a willingness to share your thoughts.\""
        ],
        "Vera Palmer": [
            "review 1: \"21W with Vera Palmer: Professor Palmer is so caring and knowledgeable. Go to office hours/meeting and talk with her. One of the kindest souls at Dartmouth\"",
            "review 2: \"08W with Vera Palmer: this class isnt too much work and is interesting (you read some really fascinating stories and not that much theory). there are 7 1-page response papers and a final paper. prof palmer has a sign in sheet for attendance, but the class is really interesting, so you'd actually want to go to class anyways. definitely worthwhile and a good way to get distribs out of the way too!\"",
            "review 3: \"08W with Vera Palmer: This course is what you make of it. It is clear based on the class discussions that some of the students were very into the subject whereas others were only there because it was an easy distrib (LIT, NW). In general though, if you know nothing about Native American tribal culture/tradition and would like an easy class where you get to read about and discuss it, NAS 34 is a great class to take. A total of seven one-page response papers keep you engaged with the readings and make up half of your grade. Other 50% is a 10-page final paper that your can write on pretty much anything you want.\"",
            "review 4: \"08W with Vera Palmer: Professor Palmer is one of the best professors that I have ever had. Going to class always warmed my heart, because Professor Palmer was so kind, generous, and intelligent. The course was a life experience, and you should not miss it!\""
        ]
    },
    "NAS032": {
        "Melanie R.": [
            "review 1: \"09F with Melanie R.: The class is very interesting as it addresses colonization and assimilation of Native Americans in both mystery novels and films. The material is only four books and four films. One popular film, The Shining, is dissected and explored for metaphors and symbolism. The class is run in an interactive discussion which further contributes to the engagement in the class. Professor Benson is knowledgeable in the field, an effective lecturer, and is willing to discuss papers and review material in office hours. The class requires two papers (1 4-6 pages and 1 8-10 pages), class participation, Blackboard posts, and a final. Overall, it is a great class and I would recommend it to anyone who is interested in the fascinating subject of Indian Killers or who wants to fulfill the LIT and/or CI requirements.\"",
            "review 2: \"09F with Melanie R.: The material is interesting, the professor does a great job explaining. If you like deep literary analysis, definitely a great class. The Professor was also very helpful with essay topics and gave great feedback.\"",
            "review 3: \"09F with Melanie R.: Professor Benson is one of the coolest profs I've ever had, and she is way chill about assignments and will grant extensions provided that you ask in advance. She is super nice, extremely knowledgeable, and is actually a really good writer herself. I thoroughly enjoyed this class, it was very little work (with the exception of the papers, which did take some thoughtful effort). Great class, lots of fun, very light coursework. Take this class!!\""
        ],
        "Melanie Benson Taylor": []
    },
    "NAS031": {
        "Melanie Benson Taylor": []
    },
    "NAS030.08": {
        "Jami Powell": [
            "review 1: \"23F with Jami Powell: Jami is literally mother. If you're a NAD, the same kind, loving, and passionate energy she has in the community carries into her teaching and cultivation of a chill course environment.\""
        ]
    },
    "NAS030": {
        "Vera Palmer": [
            "review 1: \"06W with Vera Palmer: The class isn't what you'd expect from a NAS course. there's about as much reading from old dead white men as there is from Native thinkers. Vera uses Hegel, Locke, Hobbes, and Foucault to describe Western thought and then challenges that with Inidgenous thinkers. the class confronts artificial assumtions of the dominant society, and does so in a purposive and thoughtful manner. Vera is a wonderful professor who teaches in a recognizably Native manner. Native students taking the class will likely appreciate this; i certainly found class theraputic in this manner. non-Native students will have a holistic and fair representation of NAS classes and of Indigenous thought as a whole; moreso exemplative of NAS than NAS 14/15/25. The class was a joy to attend, and quite enlightening.\""
        ]
    },
    "NAS025": {
        "Dale Turner": [
            "review 1: \"07F with Dale Turner: This class is exactly what you make it. Nothing more, nothing less. Readings are helpful, but it seemed like less than a quarter of the class was actually doing them, and I got the feeling that mentioning them on papers and on the ONE test we had was like brownie points. I'm not complaining - not having excessive reading is nice. But know that doing them will help you breeze through an already straightforward class. As for Turner - he is a very funny, casual guy who is genuinely nice. He obviously knows his stuff and he seems pretty lenient with grading. He cracks a joke a minute and says \"aboot\" a lot. Good stuff! Take this class if you expect your other two classes to kill you. You'll learn something, get a new perspective on issues you've most likely never thought of before, and you'll even get to discuss the mascot issue. (What Dartmouth student would pass that up?) Plus, you'll get your NW cred. Awesomeness all around.\"",
            "review 2: \"07F with Dale Turner: This class was definitely an easy 3rd. You didn't need to attend class and there was no work until the last 2 weeks of the term...that was kind of annoying to do it all at the end but it wasn't bad. We had to write a ten page paper on Indian mascots (interesting topic). For the final, we had take home with 4, 3 page essays....not too bad though if you didn't do work throughout the term it took a little bit of research. Other than that we had one in class quiz the 3rd week of class. I'd recommend this if you need something easy. It also covered some pretty interesting topics and we watched some good movies and had some interesting guest lecturers.\"",
            "review 3: \"07F with Dale Turner: Turner is amazing, he is funny, cool and totllay no-bullshit. He tells you EXACTLY what you need to know for the midterm and paper, and the final is a take-home that you have 5 days to do. Easy and interesting, so take it for sure.\"",
            "review 4: \"06S with Dale Turner: If you listen in class, the test material is prett easy. The last half of the course is better because you get beyond the review of Indian history and focus on specific issues, usually writing a 2 page paper/week from weeks 4-9. Professor Turner was really helpful and knowledgeable on the subject and was more interested in hearing your ideas in the paper than anything else. Very accepting of others' opinions and wants his students to get good grades. Tells you pretty specifically what you do and don't need to know of lecture material, including what readings are of more importance.\"",
            "review 5: \"06S with Dale Turner: If you're looking for a Non-Western credit that requires not going to class and will inspire you never to take another NAS class again, then this is the one for you. Class was cancelled often and the x-hours he scheduled were cancelled just as freely and nonchalantly. \"Sorry - doesn't look like I'll be back on campus on time - see you guys tomorrow!\" I don't mean to be the dork who complains when class is cancelled, because it was nice to get to sleep late, but it just exemplifies the complete lack of care with which he teaches the course. It was unorganized, completely uninteresting, and his lectures go in circles and are basically impossible to comprehend. He also tells you on the first day of class that he only gives out 4 or 5 A's to students who demonstrate a great enthusiasm for the material in in-class discussions, which we never had because the class was too large, so I'm sure the A's will go to kiss ups who went to his office hours, even though my grades warrant an A. This course is just blatantly disrepectful of those who take it and their time, even down to the obnoxiously easy tests that may as well not have been given. STAY FAR AWAY.\"",
            "review 6: \"06S with Dale Turner: As amusing as the title might sound, the class is rather painful. There are easier ways of getting a good grade. This was supposed to be a survey course that was informative. Yet, it turned out to be an amalgamation of incoherent lectures. When students tried asking a question, there would be a response that was roundabout and not relevant to the original question. Given the readings, the course could have had potential, but utterly failed--it was intellectually unsatisfying. Alternatively, if you just want something that you can safely skip during your senior spring, I guess this is your class (but seriously, there are better classes!).\"",
            "review 7: \"06S with Dale Turner: If the class were capped at under 30 students it could be very enjoyable because of discussion, however with the large group we had, that was not possible. Also, I think partly again because of the large class size, he didn't seem to care. The midterm was a take home, which ended up being a mistake on his part and many classes were cancelled.\"",
            "review 8: \"06S with Dale Turner: It's the best class ever. Super easy, very little work.\"",
            "review 9: \"06S with Dale Turner: This class is great. You don't have to do a whole lot but you learn a lot. The best combination. Definitely take it if you have any interest at all in Indian Country.\"",
            "review 10: \"06S with Dale Turner: If you have space, and need a SOC distrib, take this class. The work was comfortable, the subject matter was very interesting, and it provided a perspective on a culture of American people that are usually overlooked. I learned a lot, and I feel that now I am enlightened enough to carry on a decent conversation about Native American issues.\"",
            "review 11: \"06F with Dale Turner: easy and very boring\"",
            "review 12: \"06F with Dale Turner: Although this class involved the least amount of work for any class, I think in the history of learning, it was difficult to stand out enough to get a grade better than a B+. Some people got As and A-s, but with so little work its hard to ensure you get a good grade. So if you're looking for an easy B+ with zero work, take this class. If you want to go for an A or A- do not.\"",
            "review 13: \"05S with Dale Turner: Dale is a little confusing as a lecturer, but the material is so interesting and he allows great class discussions, expression of opinions, etc. You learn a lot from the students in the class as well. Readings are interesting, you get to watch interesting movies, and generally learn about the issues of native americans today, all stemming from this idea of \"inherent sovereignty\".\"",
            "review 14: \"05S with Dale Turner: Prof. Turner is a very nice and open man who leads what can be sensitive discussions with great comfort. He frequently defused tension by telling humorous stories about his children. A very fun class.\"",
            "review 15: \"05S with Dale Turner: Turner is such an engaging prof. It's easy, though, to get caught up in class discussion and forget to memorize and remember the few things we actually needed to specifically know for the tests.\"",
            "review 16: \"05S with Dale Turner: You learn all about the background of American Indian Policy and about the relationship between the federal government and tribal governments. The material is really interesting and the prof is fun.\"",
            "review 17: \"05S with Dale Turner: You will get as much out of this class as you put into it. You can do very little, and get an OK grade, and not learn that much. Or you can pay attention, do the reading, and think about it. In that case you will learn a ton. Either way you'll be exposed to the native american perspective of current relations between natives and the federal government.\"",
            "review 18: \"05S with Dale Turner: Not the toughest class and definitely a good course for senior spring. Prof. Turner really gives a good overview of Native American studies and you cover interesting topics.\"",
            "review 19: \"01F with Dale Turner: Professor Turner is an interesting, funny lecturer, and he really gets a broad amount of information across in a relatively short amount of time. The beginning of the class is rather heavy with political theory, but after the first few weeks it really moves into focusing just on contemporary Native American issues (don't be fooled though - each of these issues involved a moderate amount of history behind them to read about). This is a great survey course, and points you to the resources available for further study in any particular topic area that interests you. My only problem with the class was that, for very understandable reasons, more often than not the readings explored an issue up until the late 1980s or early 1990s, and rarely focused on exactly where they are today. However, Professor Turner does a great job in explaining where situations stand currently, and lets you know where online you can get the most up-to-date information.\"",
            "review 20: \"01F with Dale Turner: Dale's a really great guy and makes himself readily available outside of class. however, his lectures tend to digress. he holds a Ph. D in philosophy and emphasizes political theory more than real-world, concrete issues. this can be good or bad, depending on what you prefer to discuss. the way the course is structured is the first three weeks are spent discussing tribal sovereignty. at the end of those three weeks, we were supposed to have an exam but instead, a paper was due. then, for the remaining 7 weeks, you have a weekly topic with a 2 page paper due at the end of each week. it sounded easy at first but after awhile, the papers weren't too much fun. dale's not too big into exams so if you are a person who prefers writing papers, he usually provides that option.\""
        ],
        "N Bruce Duthu": [
            "review 1: \"22F with N Bruce Duthu: TAKE THIS CLASS!!!! I am a '23 and this was honestly one of my favorite classes I have ever taken. You will learn so much!!! The class is also very easy. You don't need to do the readings and the midterm and exam are all easy. The papers were fun to write. Bruce is so nice and genuinely cared about all of us. A layup and interesting—what more can you ask for?!\"",
            "review 2: \"22F with N Bruce Duthu: An amazing professor that I would highly recommend taking at least one class with over the course of your Dartmouth career. An incredibly caring professor who is very engaging and brings in so many interesting guest speakers. If you want to pursue the law field take a class with this man. This was an amazing class and I highly recommend it to anyone interested in the policy field or Native history being taught from a native perspective instead of whitewashed.\"",
            "review 3: \"21F with N Bruce Duthu: This was BY FAR my favourite class this term. 90+ people in the room yet prof Duthu made it feel like a small community – he is unbelievably kind and helpful. You don't get super close with classmates unless you sit next to them everyday (there are no group projects), but you will easily get any support you need. 2 papers (1 short, 1 long), a midterm and a final. All assessments are writing based...but prof Duthu is a reasonable grader and recognises the effort you put into the class (and the class is so interesting so it would be hard NOT to want to pay attention). Highly HIGHLY recommend this class.\"",
            "review 4: \"21F with N Bruce Duthu: Duthu is easily one of the best professors at Dartmouth. He is such a passionate and interesting lecturer, and he is personally invested in the success of his students. TAKE HIS CLASS! It isn't the biggest layup of layups, but it is easy and fascinating. You can choose which readings you want to do and still do well in the class, and you definitely don't need to read the textbook (it's very dense). This is definitely a minimal work maximum payoff type class.\"",
            "review 5: \"21F with N Bruce Duthu: Best class so far at Dartmouth. He really cares about his students and wants you to learn and to do well! Class readings are not necessary but very interested. Final paper is fun to write, I enjoyed going to class! TAKE THIS CLASS!\"",
            "review 6: \"21F with N Bruce Duthu: Positives: Easy class. Easy grading. Slow pace. Overall relatively easy A for the most. Half of the 90 students class were native peoples. Other half - athletes. Midterm and final exams are open book and if you attend class all can come from your notes. Do class readings is NOT necessary. I don't know how many of us did those readings. Final paper is 10 pages and you can write on whatever you want as long as it related to native peoples somehow. Negatives: Folks, this professor is woke. He loves BLM and CRT. Controversial though. Doesn't always support liberals, democrats, Israel. I don't care much about political part of his lectures.\"",
            "review 7: \"21F with N Bruce Duthu: I LOVE PROF DUTHU! Kindest professor I've met at Dartmouth. Learn so much, such amazing lectures. Term is almost over and have done very well in the class without doing any of the readings (but had some prior knowledge from taking Prof Duthu's Federal Indian Law class-- which I also HIGHLY recommend- fed indian law is one of the best classes I have taken at Dartmouth and I am a senior now).\"",
            "review 8: \"18F with N Bruce Duthu: I would 100% recommend this class. Duthu is a really nice guy and is incredibly knowledgable and passionate about Indian issues today. He is always available outside of class. I would 100% recommend going to office hours and GO. TO. CLASS. Although the classes are 2 hours, he gives a 10 minute break in the middle. He is very clear with expectations (and will explain grades concretely whenever students ask). He has a fairly quick turnaround with papers too. I am not an NAS major/minor, so I just took this class for fun, and it was so so worth it.\"",
            "review 9: \"18F with N Bruce Duthu: Duthu is a really good professor and his lectures cover the majority of the readings for the most part. There were only a few assignments throughout the term on top of the midterm and final exams, and Duthu is really good on helping with essays.\""
        ],
        "N. Bruce": [
            "review 1: \"09F with N. Bruce: I have never worked so little and learned so much. As long as you show up to lectures - which are amazing, by the way - you'll do fine. There are a few guest lecturers, which are boring, but Duthu's lectures make it worth going to class. He combines stories, humor, and intelligence in his classes. Take this class.\"",
            "review 2: \"08F with N. Bruce: Professor Duthu makes this course worth taking. He is a very passionate and engaging speaker and is knowledgable on the subject. Duthu has very high expectations of his students and their work, but he also cares a lot about their success and will put aside the time to meet with anyone who wants that. As for course assessments, there was a midterm (open book), a final paper, and a final exam (open book). Class participation - coming to class and writing your name on a piece of paper to say you were there - also counts in your grade. The readings were interesting and were necessary if you really wanted to put your all into the course. Otherwise, going to class and paying attention to what was said in lecture is the most important way to succeed in Nas 25. I took this course because I needed the distrib, but it ended up being my favorite course of the term. I would recommend this class to anyone, especially if they want to learn about the state of Indian affairs in the U.S. today.\""
        ],
        "Angela Parker": [
            "review 1: \"13F with Angela Parker: Course: The class was well paced for the first half of term, but felt like it moved slower and began to get redundant the second half. It was a fine survey course to get basic info about certain issues though. The homework and readings were very interesting. Professor: It was mostly lectures which got a little dull and repetitive. Grading was fair/easy. Workload: The workload was fairly easy. If needed you could get away with not doing homework, but most of the readings were fairly interesting anyways.\""
        ],
        "Gordon Henry": []
    },
    "NAS022": {
        "Vera Palmer": [
            "review 1: \"11W with Vera Palmer: I took this soph winter. It's painfully obvious that most of the class didn't do any of the reading. Palmer is super nice and really cares about the students and the material but it can be boring. Basically it's a really inspired prof with really uninspired students.\"",
            "review 2: \"11W with Vera Palmer: While this class is good for getting an easy A, the class is so boring and awful that the grade is not worth it. Palmer simply summarizes the readings in class, so if you've already done the reading, you get nothing out of her lectures. She also has no concept of time: she always arrives late to class, and though she plans to talk about an entire book in class, she only gets through the first two chapters. I took this class to learn more about Native Americans, but the only thing I got out of this class was reading books that I probably never would have otherwise. And while she is an easy grader, there are two big papers for this class, and she uses 1.5 spacing instead of double spacing, which is harder than you'd expect. So, in summary, this class was a huge waste of time, especially if you didn't need to take it.\"",
            "review 3: \"09W with Vera Palmer: Professor Palmer is a very warm and engaging person. She is truly interested in her subject and seems knowledgeable. Sadly, this particular class was composed of people seemingly unwilling to do ANY work, which forced the prof to go to an all-lecture format. In addition, despite her efforts there was a great wall of silence dividing Native American students from others. This was disappointing, because I had hoped to learn a great deal from my fellow students, as well as from the readings and the prof. The readings varied from excruciatingly dull to engaging, and also from autobiographical to 'pseudo' as well as spanning several centuries and styles. There was too much reading for the time and the number of books required entailed considerable expense. In terms of assignments, I never knew how I was doing grade wise as nothing was ever returned. I would have valued the feedback because the assignments were interesting and I did put work into them. There were weekly response papers to the readings and a longer midterm and final paper. This is probably a good introduction to Native American Studies for someone with no previous experience. With a better class, the professor's skills might be better highlighted as well.\""
        ],
        "Dennis M.": [
            "review 1: \"07S with Dennis M.: Take this class if you need an easy A. While there is a lot of reading and responses, Runnels is a fairly easy grader and totally open to help you.\"",
            "review 2: \"07F with Dennis M.: The autobiographies we read were very interesting and the highlight of the class. Professor Runnels is a nice guy but his lectures were more like rambling rants on the war in Iraq or drawn-out stories from his past, seldom relating at all to the course material. The assignments were easy and just required you being open about your feelings and reactions to the reading. Overall it's an easy third class but actual class time was boring and made me not give the class a good review.\""
        ]
    },
    "NAS019": {
        "Nicholas Reo": []
    },
    "NAS018": {
        "Nicholas Reo": []
    },
    "NAS015": {
        "Colin Calloway": [
            "review 1: \"07S with Colin Calloway: Calloway has an accent, which is fun to listen to. But, he does not always stay consistent with the information he gives the class from lecture to lecture.\"",
            "review 2: \"04S with Colin Calloway: Professor Calloway provides a great viewpoint on Native American History and Current Native American Policy but also encourages you to challenge his ideas. He was very helpful and approached me first after a much-less-than-perfect midterm score and we worked out a plan that would help me better learn the material and complete better assignments.\"",
            "review 3: \"04S with Colin Calloway: Prof Calloway is a fantastic professor. I would highly recomend this course to anyone who is remotely interested in native american studies, or just to fill the phr distrib. He gives great lectures, and the readings (he wrote the textbook) are interesting too. Definitely one of the best classes I have taken at dartmouth. Unfortunately he is not teaching this year, but hopefully he will be teaching more nas classes soon.\""
        ],
        "John P.": [
            "review 1: \"06S with John P.: Professor Bowes is one of the best lecturers I have ever had. The class is a breeze and takes very little work outside of class. Exams and papers are both fair assessments of the course material and Professor Bowes is more than willing to help or answer any questions in regards to the course material. Excellent class!\""
        ],
        "Preston Mcbride": [
            "review 1: \"21W with Preston Mcbride: Really good lecturer. Super reasonable amount of work and fairly forgiving about online learning sucking. Super available and helpful for office hours, not very responsive to emails. Pretty prompt at returning essays with really thurough grading and good comments. Took class asynchronously, if you follow the schedule you can do ~200 pages of reading a week and an essay every 3 weeks, but if you procrastinate the readings you will get stuck with 600 pages of reading and a 5 page essay in one weekend, which sucks. The final was two, 5 page essays and was super time consuming.\""
        ],
        "Preston McBride": []
    },
    "NAS014": {
        "Colin Calloway": [
            "review 1: \"21F with Colin Calloway: I never planned to take this class, but because I was blocked out of my other first choices and this was one that worked with my schedule, I kind of fell in to it. I'm glad I did, I think it's a great history class and has definitely changed my view on American-Indian relations. The class was \"advertised\" as a layup, but I don't think it is. While you have two weeks of no work, you then have to read a whole book and write an essay on it in a week. For people like me who aren't strong writers and procrastinate, this was a huge detriment to the class. The midterm and final are term identifications where he gives you ~60 different terms and randomly chooses ten on test day to give to you and you have to write a paragraph or so on them. These took a long time to study for but if you put in the work they aren't too hard. While I'm disappointed that this class wasn't the layup that was promised, the material, and the professor (Calloway is AMAZING) definitely made up for it. P.S. Go to office hours! He loves it, you'll love it, and he is such a wonderful professor to talk with.\"",
            "review 2: \"21F with Colin Calloway: My favorite class this term. Professor Calloway really tries to offer help with information students are unsure about or assistance with essays. GO TO OFFICE HOURS!! The grade was made up of 2/3 essays (you can do all three if you want, but you only have to do two), a midterm, and a final. For the midterm he gives a word bank of about 60-70 terms and he picks 10 (you do not know these until you take the test) that you have to write short essays on. The final is the exact same format, but you also have to write an essay on a topic that you choose (he gives you three options), which he gives you about a hour to complete, so two hours for the final in total. He basically lectured the entire hour, but he also had PowerPoints he used. The textbook for the class is one that he wrote, but you do not necessarily have to do the readings. Just pay attention in class and take good notes and you will be fine. This class is not a layup though.\"",
            "review 3: \"19F with Colin Calloway: Having had no background with Native American studies or Native American history coming into Dartmouth, I found this class to be pretty revealing and eye opening. Highly recommend taking a class in the department if at all possible, and Calloway is among the best profs at Dartmouth. Lectures can be a little dry at times but the reading is riveting. Basic grade components of the class: two essays (out of total of 3), midterm, final. The two essays were fairly short (<5 pages each) and the material was interesting, but Calloway did grade them a little harshly. Midterms involved 10 short answers for memorizing terms and a choice of long answer questions, most of which were easy. Overall, the class was great - among the best I've had at Dartmouth.\"",
            "review 4: \"17F with Colin Calloway: I would not consider this class a layup. The class is graded based off of three papers, a midterm, and a final. The midterm was 10 pieces of vocab chosen from a bank of around 60-70. Same thing with the final, only the final had an essay to it as well. Calloway is a great teacher but there is a ton of reading and he grades the essays a little harshly. If you think learning about Native Americans is interesting, definitely take this class but I would not recommend taking it as a layup\"",
            "review 5: \"13F with Colin Calloway: Course: didn't pay attention much but when i did it was cool Professor: Calloway is the nicest and best professor at Dartmouth. Very good about extensions and what not Workload: you don't need to do any of the readings but the tests can be kind of difficult. 2 papers and 2 tests\"",
            "review 6: \"09F with Colin Calloway: I took this class because I'd heard good things about Calloway and wanted to take an NAS class before I graduated. He's a pretty good lecturer--obviously knows a lot. Tended to move from the extremely general to specific incidents and anecdotes in a way that sometimes felt unnatural, and prone to using dramatic pauses during which I frequently fell asleep, but still one of the better lecturers I've had. An easy class if you do most of the reading, which isn't a lot.\"",
            "review 7: \"09F with Colin Calloway: Calloway is one of the most eloquent lecturers I've had at Dartmouth, and he is one of the top scholars in the entire field. I learned a ton of interesting things about a part of American history I knew little about before, and the reading was pretty light and interesting, with very little other work as well. He is going to be retiring soon, so definitely try to take a class with him before he is gone.\"",
            "review 8: \"09F with Colin Calloway: Sickest prof, interesting material, inspiring lectures. TAKE THIS COURSE!\"",
            "review 9: \"07F with Colin Calloway: Professor Calloway is a terrific prof who seems to know his stuff. It is a 100% lecture class, which took a week or two for me to get used to (freshman fall) but once i warmed up to it the class was great. The readings that he assigns do nothing but retell the lectures that he gives in class. If you go to class and take good notes you are set. There is ZERO homework and a 15 page paper as 30 percent of your grade. The midterm is also worth 30 % and the final is worth the remaining 40 %, but he gives a review sheet with all of the answers on it (terms). Take this class if you want a good grade and to learn something that is surprisingly really interesting. Professor Calloway is extremely understanding but you must GO TO CLASS. He learns the roster in the first week and knows if you are there or not. I hadn't said a word to him for the first three weeks and stayed after to ask him a question and i was amazed because he knew who i was. SUMMARY: Take this class, go to class, put in time on the term paper, and you get an A.\"",
            "review 10: \"05F with Colin Calloway: Overall, this course was a great introductory course. The course work and pace were designed for first and second year students. I would recommend this class to anyone interested in a introduction to American Indian history and/or studies. I would NOT recommend this class to an upperclass NAS or history Major. It is designed to convey basic premises that are easily digested by underclassmen. It does not offer the more indepth discussions that a junior or senior major requires of the subject matter.\""
        ],
        "Warren G.": [
            "review 1: \"04F with Warren G.: The course was a simple overview of Native American history. It was very easy to understand, just have to be in class to take notes (maybe 2 pages a day). Professor O'Brien was a very understanding person and was very upfront about grading papers and exams and what he expected. He did not have a problem with everyone doing well in the class, which was awesome and something you find very little.\"",
            "review 2: \"04F with Warren G.: I thought that this class was very intersting and the prof was amazing, we explained things throughly and he always answered a students question. He was the best professor i have had yet!\""
        ]
    },
    "NAS011": {
        "Madeleine Mcleester": [
            "review 1: \"21F with Madeleine Mcleester: Great class. Professor McLeester is fantastic. She is incredibly passionate about her work and always comes to class with great energy. The workload is also manageable; outside of the final and midterm, the only required assignments are 5 weekly reports (~1-1.5 pages). Some of the readings are on the longer side but are often very interesting. I highly recommend this class.\"",
            "review 2: \"21F with Madeleine Mcleester: Super good course. Professor McLeester is fun and really understandings, and her lectures are pretty short. Readings can get kind of long, but you only have to do a max of one article assignment (reading response basically) a week, and overall the material is really cool. Would definitely recommend especially if you're interested in archaeology.\""
        ],
        "Deborah Nichols": [],
        "Madeleine McLeester": [],
        "Nathaniel Kitchel": []
    },
    "NAS010": {
        "Bernard Perley": [],
        "Sergei Kan": []
    },
    "NAS008": {
        "Vera Palmer": [
            "review 1: \"21F with Vera Palmer: Class: While this class has some interesting topics, I was a little disappointed by the material. First of all, I thought that most of the readings would actually be from the perspectives of Native Americans, but the first half of the class the professor assigns readings by old white philosophers. There is also a lot of philosophical topics in this class, something which caught me off guard considering it's not sublisted as a philosophy class. However, despite this, I enjoyed the second half of the class more, since the prof actually shared videos and readings which were made/written by Indigenous people. Professor: Palmer is overall a nice person, but I think she needs to be a bit more organized. Going into class, she told us that it was not going to be lecture based and that a majority of the time would be around holding discussions. So far there have been zero discussions. Also, if you take this class please sit in the front, because she talks so quiet that if you sit in the middle or back row it is incredibly hard to hear most of what she is saying. Workload: This term we have only had a midterm paper and a couple of pop quizzes. There is supposed to be a final and a final paper but we have been given no directions yet.\"",
            "review 2: \"21F with Vera Palmer: This class was interesting but not as much as a layup as it may seem. Echoing the other reviewers, there were a lot of dense philosophy readings at the beginning of the term, but Professor Palmer did spend some time in class breaking them down and explaining them to some extent. There was not as much discussion as she promised; although there were a lot of times when she would ask questions about the reading, these weren't really times when we could openly discuss them. Furthermore, a lot of times she would just go on lecturing and not give anyone a chance to add input. The class was highly disorganized, with readings sometimes posted the night before a class. Not only that, but readings were often 100-200 pages for a class. The final exam was tedious and expected you to remember random facts, which is not what I got out of the course. The final essay was completely different than what she told us it would be and she gave out the prompt much later than promised, but it was still pretty open-ended. I did like the two essays because you did have some freedom to write about what you wanted to. Overall, I am glad that I did take this class. I enjoyed most of the readings, especially those in the second half of the course, and do feel like my worldview has expanded. I would recommend this class to prospective NAS majors and anyone else who may be interested in how we view people, but I would not recommend it as a layup.\"",
            "review 3: \"21F with Vera Palmer: This class is less of a layup than it seems. Palmer has a philosophy background so you just end up reading a ton of dense philosophy papers from Hegel, Locke, Foucault and others that don't really directly relate to the content of the class. Assignments include a ton of readings per day, random reading checks, a midterm paper, final paper and an in person final exam that reminds you of those super unnecessarily detail-oriented high school English tests about quotes, who said what, matching, vocab definitions and more. Prof is nice if you take the class meet her outside of the classroom you'll like her more but in class she talks every day without any discussion at all which is super dry and boring. Honestly, not the worst class but definitely not what the rest of the reviews made it seem to be.\"",
            "review 4: \"19S with Vera Palmer: This class was kind of a mess, but it was not anyone's faults (I mean this, Vera could not have prevented this). It could be a lot of work. It seemed like it would be, but like I said this class was a mess so we never really got assigned anything.\"",
            "review 5: \"19S with Vera Palmer: Great Class. Highly recommend, especially if your planning on an nas major/minor. Workload manageable, with readings every class and, on occasion, a quiz. Palmer is one of the nicest professors at Dartmouth and will help you if you reach out. Interesting course material as well.\"",
            "review 6: \"19F with Vera Palmer: An overall really interesting class. Professor Palmer insists on class participation, but the same few people would answer questions every time. 1 midterm paper, an in-class final, and 1 final paper along with a pop quiz. We never got any assignments back from Professor Palmer and she was sometimes unclear about deadlines/assignments in general. Perhaps not the most organized class but worth taking and an easy class if you do the readings and participate a bit.\"",
            "review 7: \"18F with Vera Palmer: I cannot say enough how much I really enjoyed this course. Professor Palmer is lovely and really cares about her course. If you take the time to get to know her and really absorb the material, you will definitely get a lot out of the class (and likely do well in terms of grading too). This course focuses on comparing and contrasting the philosophies of Indigenous communities and traditional western philosophers. Highly recommend the course and making the effort to form a relationship with Professor Palmer.\"",
            "review 8: \"17F with Vera Palmer: Palmer is the most enthusiastic lecturer and super into the topic. I went in with no prior knowledge and found it interesting/did well. Kinda a lot of reading but if you go to class and participate you don't really have to do it all. Assignments were relatively short essays - if you write well and show interest in the topic you'll do fine\"",
            "review 9: \"15F with Vera Palmer: Very chill, Palmer is the best and we wrote 2 papers (midterm and final) and had a final exam. Other than that we had 1 quiz and a few 1 page responses. Warning there is a lot of philosophy but other than that great class!\"",
            "review 10: \"13S with Vera Palmer: Course: I have to admit I took this class because of two main reasons: I had heard it was a relatively easy class and I had promised myself I would take a NAS class before graduating, since this is Dartmouth after all. I was pleasantly surprised. The lectures were engaging and even spiritually inspiring at times (props to Professor Palmer) and the readings were a diverse mix of French/German philosophy and Native literature. I never felt a single class was boring or useless. Professor: Vera Palmer is a star. She really is. Although she does use a tad too many vocabulary words that may sound pretentious at times, she is a woman of real soul. Every time I stayed after to chat with her a bit, she was willing to listen to what I had to say with unfeigned interest (at least she made it seem so). She is one prof I will keep in contact with for the rest of my time at Dartmouth (and hopefully beyond). She sang the part of Madame Butterfly in a theatre production once. 'Nuff said. Workload: The workload is only three essays (the midterm and final ones included in these three) and then readings for every class. The readings are sometimes ginormous, but most of them need only practiced skimming to be able to participate in class. I would recommend however, really reading deeply into Foucault and Hegel. They will come back to haunt you in the final if you don't.\"",
            "review 11: \"08F with Vera Palmer: This class was very interesting. There was a lot of reading but it was discussed well in class. The exams were pretty laid back. Vera is very helpful and nice.\"",
            "review 12: \"08F with Vera Palmer: The professor is great and the material is very interesting. The lectures are really good too.\"",
            "review 13: \"07W with Vera Palmer: The class wasn't what I was expecting at first-- we were reading Locke, Hobbes, Foucault, etc. I didn't like it for the first weeks, but then everything started to come together. It ended up being the best class of my freshman year.\"",
            "review 14: \"07F with Vera Palmer: Some parts of the course are very interesting and thought provoking, and others are pretty boring. While day to day class was pretty slow, I took this course because I wanted to take a least one Native American course and not have to work very hard and both were accomplished. I would suggest taking this class if you need a third class or want a NAS class. And Professor Palmer is very nice and understanding. If you show her you're working hard for her, you will get a good grade.\"",
            "review 15: \"07F with Vera Palmer: I thought this was a good overview course. I think Palmer was a bit overwhelmed with the number of people that enrolled but overall she gave good lectures. The class wasn't difficult but generally wasn't boring either. Take if you're interested in NAS and want a general overview of the subject.\"",
            "review 16: \"07F with Vera Palmer: This was the best class that I've ever taken. I've taken a lot of interesting courses before, but this one was better than them all. It really opens your eyes to new perspectives and helps you to be more open-minded. You learn a lot about the perspectives of Native Americans in this class, but what you learn in this class can be applied to people of all racial groups. Professor Palmer is a great lecturer and it's always enjoyable to go to class. You can tell she is very passionate about the class and really wants you to learn and understand the material. There is a lot of reading, but the reading is very interesting. In all, it's an awesome class and everyone should take it.\""
        ]
    },
    "NAS007": {
        "Dennis M.": [
            "review 1: \"06F with Dennis M.: runnels is a great guy, and is pretty lenient with deadlines. material and classes got a little repetitive, but a pretty good seminar overall.\"",
            "review 2: \"05F with Dennis M.: Prof. Runnels tends to ramble a lot, and I spent most of class time zoning out. There is very rarely anything discussed in class that you'll later regret you missed -- the only graded projects are papers, and you can focus on one of the dozens of specific aspects discussed in class. On the other hand, class can be interesting as an overview of Native cultures. This is a very anthropological class, and some of the texts deal almost exclusively with the traditions and customs of each tribe. You pretty much have free rein to take the papers where you want to go with them, and there isn't much of a way to screw that up. There is reading every night, and Prof. Runnels always has us turn in a 1-page \"response paper\" to the reading. This can get tedious, especially late at night, and it might turn some people off.\"",
            "review 3: \"05F with Dennis M.: The prof is very nice, with some fascinating stories to tell. He requires a one page response to each reading, which can get tedious.\"",
            "review 4: \"04F with Dennis M.: This course was very interesting, but it was a little slow sometimes. My major complaint I had with the course is that there was a LOT of reading. I know that the best way to improve your writing is to write everyday, but the 1-2 page responses we had to write every night got very tedious after a while. The autobiographies we read were very interesting however, and it was a nice opportunity to read books I otherwise would not have read. Runnels is a very interesting and approachable guy, and was very helpful concerning the final research paper.\"",
            "review 5: \"04F with Dennis M.: The Course: Based on Native American Autobiographies, the course goes far beyond the topic to encompass Native American history and governmental relations. A great intro to Native American Studies, either for a major or for general knowledge. The readings are mostly interesting, and the papers are relatively easy. Lots of writing for this course, but classes themselves are pretty low key. Lots of movies. The Prof.: Professor Runnels is a softspoken Salish Indian with a lot to teach. It was great to take this course with him. Watching documentaries and having your teacher recognize the people in them as neighbors and friends is an amazing experience. Professor Runnels teaches Spanish and Literature at Dartmouth, but if you want to see him in his element, take a NAS class with him. Pretty easy grader and a really nice guy.\"",
            "review 6: \"04F with Dennis M.: Prof. Runnels is an interesting dude. From the content of his lectures, where he often veered off into other topics, that became apparent. He has an incredible wealth of knowledge on so many different aspects of Native American history or current sociopolitical conditions, and even his own life story is quite compelling. However, he talked about these things probably as often as he did about the assigned readings, and once he starts talking, you don't really get a chance to respond to anything. As a disclaimer, Runnels was undergoing chemo while he taught, which is pretty ballsy, and explained a good deal of his scatter-brained and tangential rambling. However, there is still a massive amount of reading and writing in this class, one that was pretty difficult to keep up with. And while I probably will take another NAS class, it probably won't be anything literature related.\"",
            "review 7: \"04F with Dennis M.: The class basically consisted of reading a book a week, writing a B.S. 1-2pg response about the reading for that day, and discussing the book in class. There were very few lectures & longer papers were assigned every few weeks. The assigned reading was not difficult and rather interesting. Overall, not a huge time commitment, but the papers required a lot of effort to get an A.\"",
            "review 8: \"04F with Dennis M.: Professor: great guy, who was unfortunately undergoing chemotherapy at the time, which rather wiped him out. He had many interesting stories, but they seldom applied to the material. I did not improve my writing at all. We had responses on the reading due almost every class, which were not graded, but still a nuisance to do.\"",
            "review 9: \"04F with Dennis M.: Prof Runnels is a great professor with a vast knowledge of Native American customs and culture. If you have an interest in the mateiral this would be a great seminar for you. Unfortunately, a lot of the readings got to be dry and repetitive by the end of the term. The papers were not difficult but more feedback on writing would have been helpful throughout the term.\"",
            "review 10: \"04F with Dennis M.: I took this course for my freshman seminar and from what I gathered from my friends, I had more writing by far than any of them. The six autobiographies we read in class were interesting and easy reads, but having a 1-2 page response due each class meeting was tedious and I found myself writing about the same topics over and over. Runnels is a nice man with a genuine interest in the subject material, but I can't connect all I learned about Native Americans/their struggle with any viable major. This is one of those liberal arts-type classes... but as a seminar, that was just fine for me. No exams, just a final paper that you have (almost) complete freedom of topic. Would recommend... but not if you can't stomach a rather quaint course.\"",
            "review 11: \"04F with Dennis M.: The homework and reading for the class was generally very time consuming and quite boring, but the grading was pretty easy.\"",
            "review 12: \"02F with Dennis M.: Professor Runnels is an amazing guy that has a lot of interesting life experiences to share. However, I don't feel that his seminar was effective. Class meetings seemed disorganized and lacked direction. I don't think I learned as much about Native American Identity as I could have. I also feel that I didn't improve my writing as much as I could have. If you want a fairly easy, laid-back seminar or if you are very interested in Native American culture, you might like this. However, I think there are much better freshman seminars than this one offered at Dartmouth!\"",
            "review 13: \"02F with Dennis M.: I chose this course in haste, and regret doing so. Whereas most of my friends were discovering fields in which they had interest, and concepts which they'd never heard before, I was reading dull autobiographies. Yes - the books are dull, and the papers seem generated on a whim - they are contrived and VERY uninteresting, except for the final 15 pager, which is an open topic. Overall, the class is dead easy, which is bad - especially for a seminar. Professor Runnels is an nice, interesting man with a colored past, but that doesn't necessarily make him a great teacher. He spends a lot of class time talking about his past and Indians, and leaves little to discussion. Often, he is incoherent, and seems unprepared for class. Somehow, there was something grossly out of proportion in that this class on Indian Identity and spirituality and lifestyle was confined to a certain hour and plastic grey, classroom thrice a week in a very Western school. Things did not flow well, and so felt superficial. I feel that it was half-assed, and not by anybody's fault really; it just ended up that way. The pace was such that it would've taken a year for the material to settle, and I felt sorry for Runnels a lot, because I knew that that's the way he'd rather have it, too. If you are deeply interested in NAS, or cultural anthropology, go for it. If you are not, read some books on Indians, talk to some, or go work on or near a reservation. Your understanding of the course's title - Indian Identity will be much deeper. You only get one seminar, and I know that I could've learned a lot more last term than I did.\"",
            "review 14: \"02F with Dennis M.: This originally was not on my list of seminar choices, but through a strange set of circumstances I ended up in it. I don't regret it either, for it was a very enlightening class and gave me a lot of knowledge of what Native Americans have gone through and where they stand today. This is a subject largely ignored and this class shed some much needed light on it for me. Professor Runnels is very knowledgable, and he tends to talk a lot, even if it is off subject, which I really liked since he has plenty of good info to share. He can be a pretty hard grader, but don't let that deter you because he is a good professor and will teach you a lot if you are interested. I would recommend this class.\"",
            "review 15: \"01F with Dennis M.: When I took this class, there were only five of us, and so it was a very personal experience. Unfortunately, with so few people we couldn't really have any extensive debates on the material from the readings, which was very interesting, and so much of the class consisted of Professor Runnels talking about his own knowledge of the topics at hand as well as his own experience, which was all right with me since I thought what he had to say was always very interesting (if more than occasionally rather tangential to what we had been talking about) and inspired interest in Native American studies. All-in-all, an excellent class for a general overview of Native American Studies, since through the autobiographies you get to see history, culture, the forces of assimilation, religion, and politics on a broad scale that just begs for further studies.\"",
            "review 16: \"01F with Dennis M.: the course wasn't exactly like its description, but it was still really interesting. i learned so much about the various aspects of native american culture and history. you don't have to like history to enjoy this class. i would recommend this class to anyone who wants to learn more about the native americans and, obviously, to anyone who likes reading autobiographies. professor runnels identifies himself as a nez perce indian, knows the language, and clearly knows the history and culture of many native american tribes. he's very interesting to listen to, but the only bad thing is that he's like a freight-train when he gets to talking--once he gets going, you can't really get a word in edgewise. my class only had 5 people in it... so if you're shy about being on the spot or having to express your opinion, you might think twice about taking this class. i found it to be really interesting. the only bad thing is that no matter how hard i work on my papers, i only got Bs. that's not a bad grade, it just seemed like an astronomical amount of work only got me a B+ instead of a B. professor runnels has very high standards.\""
        ],
        "Mishuana R.": [
            "review 1: \"09S with Mishuana R.: Professor Goeman didn't to set a higher standard for students. The frequency at which students skipped class, didnâ€™t have papers finished, and didnâ€™t participate in class discussion was absurd. This made the whole quality of the class slide. Discussions (if you can call them that) were terrible. Professor Goeman seemed to have no idea of where to lead the class in discussions- instead she just asked us vaguely what we thought of the reading. There was also no direction to the course. Looking back, I feel like I only learned an assortment of facts about Native American culture.\""
        ]
    }
}