{
    "PORT007.01": {
        "Carlos Cortez Minchillo": [
            "review 1: \"23W with Carlos Cortez Minchillo: The absolute goat. He is so kind. That being said, this class is sometimes pretty boring and honestly I feel like we learned everything there is to learn by week 6/7. However, this class is still a great experience. Would recommend\"",
            "review 2: \"23W with Carlos Cortez Minchillo: CARLOS IS THE BEST EVER. He is truly the kindest professor I have met at Dartmouth and makes caring about his students his number 1 priority. He does a great job of trying to make all the course materials engaging (ranging from movies, to short documentaries, fictional and non-fictional reading). Also he grades like a god and gives almost everyone 100s if you do the work. TAKE THIS CLASS IF YOU CAN! layup of layups\"",
            "review 3: \"22W with Carlos Cortez Minchillo: This is the best and most interesting class I have taken so far at Dartmouth. I came into it honestly not knowing what to expect since this was the first time it was offered, but I leave the class now honestly with a passion for the topics covered, and a new perspective on racial dynamics and how we can be a more understanding society. Workload was low and as long as you put meaningful effort into your papers, Prof. Minchillo is incredibly kind as a grader. I would take this class again in a heartbeat!\"",
            "review 4: \"22W with Carlos Cortez Minchillo: Great class! I didn't have much experience with the topics going into the class but I can say that I learned quite a bit. Prof. Minchillo is incredibly friendly, he encouraged us to try new strategies on our essays and was kind with grading. He even cooked us food for our last class. Definitely would recommend this class!\"",
            "review 5: \"22W with Carlos Cortez Minchillo: Took this because I didn't get the one I wanted and I heard that it's a layup. Indeed it is. Also Prof. Minchillo just made this SUCH a wonderful experience and I'm so glad I took it. Workload is okay: it gets tougher towards a writing deadline but can be pretty chill.\""
        ]
    },
    "PORT061.03": {
        "Rodolfo Franconi": [
            "review 1: \"21F with Rodolfo Franconi: Oh Rodolfo... those of us familiar with him have a love hate relationship with this man. He is honestly sweet and compassionate especially when you are struggling. But he also loves the sound of his own voice and can go on boring tangents, and does not make good use of class time. In this class I would have loved to actually get a lot of speaking practice in and actually share my analyses of the stories, since we did read them and had to write discussion posts on them, but the majority of the time he talks the whole class, explains the story to us (even going line by line and focusing on irrelevant details or teaching us vocab) and never even gets to the second story at all. He does ask us \"what are your thoughts\" or will have us read our discussion comments and then talk about them, but usually not in depth enough to add any value or create conversations. Anyway, it's still probably a decent class when it's not at 7:30am (registrar issue that seemed mostly his fault but idk). Even though the discussion posts start getting annoying when he asks for 2 paragraphs and 2 sources and 2 questions, at least the 2 essays are basically just a longer version of that so it does prepare you. So workload is kind of tedious but also manageable especially come finals season. I won't lie I think most of us used google translate to read the stories though because it's kind of a lot to try to comprehend it all in portuguese...at least at my level.\""
        ]
    },
    "PORT062.03": {
        "Rodolfo Franconi": []
    },
    "PORT063.08": {
        "Rodolfo Franconi": []
    },
    "PORT011": {
        "Carlos Cortez Minchillo": [
            "review 1: \"21X with Carlos Cortez Minchillo: Carlos is the GOAT. Literally so sweet and willing to help out his students, regardless of language level or background, and keeps the course at a productive yet non stressful pace. Class was chill and the daily assignments weren’t at all that difficult. A lil annoying at times, but still. There is no reason why you shouldn’t get an A. This man is amazing. 10/10 recommend this as a summer layup that you still learn a lot from. Port department is underrated ASF\"",
            "review 2: \"20X with Carlos Cortez Minchillo: Carlos is just the sweetest. He's really encouraging and understanding. Obviously if you take this class you should be prepared for a quick pace which is manageable as long as you have the recommended experience (i.e. other romance languages). If not you may struggle.\""
        ],
        "Rodolfo Franconi": []
    },
    "PORT062.01": {
        "Rodolfo Franconi": []
    },
    "PORT008": {
        "Carlos Cortez Minchillo": []
    },
    "PORT002": {
        "Carlos Cortez Minchillo": [],
        "Mauricio Sellmann Soares de Oliveira": [],
        "Rodolfo Franconi": []
    },
    "PORT060.03": {
        "Rodolfo Franconi": []
    },
    "PORT061.02": {
        "Rodolfo Franconi": []
    },
    "PORT091": {
        "Isabel Lozano-Renieblas": []
    },
    "PORT090": {
        "Silvia Spitta": []
    },
    "PORT083": {
        "Carlos Cortez Minchillo": [],
        "Rodolfo Franconi": [],
        "Silvia Spitta": []
    },
    "PORT063.03": {
        "Carlos Cortez Minchillo": []
    },
    "PORT035.01": {
        "Carlos Cortez Minchillo": []
    },
    "PORT020": {
        "Carlos Cortez Minchillo": [],
        "Mauricio Sellmann Soares de Oliveira": [],
        "Rodolfo Franconi": []
    },
    "PORT012": {
        "Piers Armstrong": [
            "review 1: \"04F with Piers Armstrong: AMAZING. Be in Brazil, chill on the beach, and read really interesting stuff... i wouldn't miss it for the world. i wish i could do it all over again. piers is an amazing professor; best professor to travel with.\"",
            "review 2: \"04F with Piers Armstrong: piers' class started out hard, possibly because we didnt have as much experience with the language. we had to have a meeting with him and the program director in brazil to try to diminish the work load, though. we found that we were spending a lot of time doing work (papers, long readings) instead of learning and living with brazillians. after we told him how we felt, things lightened up a bit. be sure to be open with him and tell him what you want to read. for example, modern brazillian literature is excellent and superior to the older stuff.\"",
            "review 3: \"04F with Piers Armstrong: The LSA in Salvador, Brazil is without a doubt one of the coolest study abroad programs at Dartmouth. Instead of freezing in Hanover last term, I was a minutes walk away from absolutely amazing beaches and Brazilians in absolutely amazing swimwear. The program itself is also really well done. The classes are for the most part very interesting and applicable to you daily life living with your Brazilian host family, and you get to travel all around Bahia on the weekends. The local professors and program director are solid people and great teachers. Despite what others may have said about Prof. Armstrong, he’s a brilliant guy, a better-than-average teacher and cares tremendously about his students. He’s Australian-born but has lived in Salvador for like 10 years, speaks immaculate Portuguese and is completely fluent in 4 other languages. He knows Salvador inside out and if you take the time to get to know him, is actually a really cool guy (as his ear-piercing might suggest). Last summer, when our program was cancelled due to a perceived shortage in numbers, he and Prof. Franconi battled for weeks with the administration to get the program reinstated. Once in Brazil, he also was very flexible and open to adjusting the course-load when we finally got around to voicing a few concerns. His Brazilian literature course was better than any English literature course I have taken in my life.\""
        ],
        "Carlos Cortez Minchillo": []
    },
    "PORT010": {
        "Carlos Cortez Minchillo": []
    },
    "PORT009": {
        "Carlos Cortez Minchillo": []
    },
    "PORT003": {
        "Rodolfo Franconi": [
            "review 1: \"20F with Rodolfo Franconi: Took this online, and Rodolfo had lots of trouble with technology so that probably detracted a bit, but it was not the most engaging class...he loves the sound of his own voice first of all so most classes are just him talking, explaining the material to us/going on some lengthy tangent (happens a lot). I don't even really remember what the class was about honestly (it's been a year tbf), except for some of the movies we watched and the homework exercises which were the most educational part. I do remember it kind of felt like a lot of work, but I guess it's pretty standard for an intro language class and could have been worse. (Always a few grammar exercises, sometimes questions about movies and sometimes small essays.) I think there's general agreement among Port students that Carlos is a better, more engaging and more compassionate professor... I do love Rodolfo too and he's also fairly compassionate one-on-one but they're not wrong. However, if you're interested in these classes then you probably already know you don't have much choice between professors since all the courses are offered by 1 prof only once a year!\""
        ],
        "Carlos Cortez Minchillo": []
    },
    "PORT001": {
        "Carlos Cortez": [
            "review 1: \"20W with Carlos Cortez Minchillo: Loved this class and the people in it. If you are thinking of taking a language that isn't Spanish this is the best route to take. Fair warning there is a lit of busy work but it's manageable. He also uses x-hours every week and there is also drill 3x a week.\"",
            "review 2: \"14W with Carlos Cortez: Course: Fast paced, but keep up and you can do well Professor: my best prof at dartmouth Workload: workload is time consuming but not difficult,\""
        ],
        "Carlos Cortez Minchillo": [
            "review 1: \"20W with Carlos Cortez Minchillo: Loved this class and the people in it. If you are thinking of taking a language that isn't Spanish this is the best route to take. Fair warning there is a lit of busy work but it's manageable. He also uses x-hours every week and there is also drill 3x a week.\""
        ],
        "Rodolfo Franconi": [
            "review 1: \"19W with Rodolfo Franconi: Course was paced well and very manageable. There was a large amount of work, but you are able to talk to Rodolfo about it. I would recommend taking it. In the next winter, you are able to go to Brazil if you continue through Portuguese 3.\""
        ],
        "Mauricio Sellmann Soares de Oliveira": []
    }
}