{
    "QSS030.22": {
        "Laura Chapot": [
            "review 1: \"23S with Laura Chapot: I really enjoyed this class. Laura is so understanding, and the course is a good mix of coding which is mostly given to you + discussion. Would recommend.\"",
            "review 2: \"22S with Laura Chapot: This was honestly a really weird class with barely any work. We would have readings, but then in the beginning of class, someone would basically explain them to us so you didn't really need to do them. Then she'd give us hardcopies of more readings and we'd spend 20 minutes just reading them in silence, followed by discussing them in groups and then rushing a class-wide discussion. There were some days where only 2 people showed up. There was a midterm project of building your own text corpus and final project about analyzing it, but if you have any CS knowledge beyond CS 1, it's pretty easy. Super layup.\""
        ]
    },
    "QSS030.21": {
        "Jacqueline Wernimont": [
            "review 1: \"23F with Jacqueline Wernimont: Take this class if you're looking for a chill QSS 30 offering! You learn a lot of cool stuff, and it virtually a guaranteed A assuming you do all the work. The readings teach you a lot about how your data is used, and you'll come out of the class a more mindful internet consumer.\"",
            "review 2: \"23F with Jacqueline Wernimont: Super interesting class. Expect to have your mind blown at least once a week. The readings were basically optional but definitely worth doing if you want to get the most out of the class. Wernimont is super nice and accommodating and really cares about student mental health. Definitely recommend if you're looking for a chill class that is still really interesting.\"",
            "review 3: \"22W with Jacqueline Wernimont: This is a great class. Professor Wernimont is obviously very passionate about the discussions and is very receptive to student ideas and needs in the class. The class is seminar-style with discussions about that day's readings with a few medium-sized assignments throughout the term. Workload is not bad at all.\"",
            "review 4: \"22W with Jacqueline Wernimont: I agree that prof. Wernimont was super receptive to us and very passionate in the subject. The basic structure was readings for each class (that usually weren't too heavy, and pretty interesting), that we then discussed seminar-style during the class, so if you're looking for a lecture-style class definitely don't go with this one. There were two \"journal\" assignments (basically turning in your notes/responses on the readings for completion credit), a few other assignments during the term, coming up with some discussion questions for the class on a chosen day, and a 2000-2500 word final paper (with a presentation to the class). It's also a really interesting class to take because it focuses a lot on the ethical ramifications of the way that we use data/technology in our daily lives, so it's useful to balance out the more practical, less ethics-focused classes that are more computing-based.\""
        ]
    },
    "QSS030.19": {
        "Jacqueline Wernimont": [
            "review 1: \"22W with Jacqueline Wernimont: Very chill class with a chill prof! Not many readings and reading journal was pretty flexible. One \"midterm\" that was really just defining terms that we had talked about from the readings and discussed heavily. Even if you didn't understand the readings, the discussion in class would help clear up things. Final project had a lot of freedom. Daily data journal was insightful.\""
        ]
    },
    "QSS030.20": {
        "Jason Barabas": []
    },
    "QSS030.18": {
        "Elsa Voytas": []
    },
    "QSS030.17": {
        "Kristin Smith": [
            "review 1: \"23S with Kristin Smith: Highly recommend this class if you're into the topics and need a 30 class for QSS! The readings are engaging + straightforward to get through and led to a lot of interesting classroom discussion. However, I agree with the other comment in the way that I wish we talked about privilege more, especially since the class was mostly wealthy, white women. Nonetheless, Prof Smith is a super kind professor who knows her stuff and is very accommodating with office hours. She incorporates a lot of fun activities into the class time as well (Rauner, Hood Museum, games, baked us cookies, etc). Small group discussion was a focal point of this class, so you'll likely end up making a lot of friends since a lot of the discourse revolves around our personal experiences. The workload picked up around the last few weeks of class because we had a group project and 2 papers added in but all were manageable. The majority of your grade comes from 2/4 papers + super simple group project+ a final paper. Overall, highly recommend taking this class with Prof Smith!\"",
            "review 2: \"21F with Kristin Smith: This class was extremely boring and not engaging and I literally wanted to fall asleep at several points in the term. Professor Smith has an attendance requirement - you're not allowed to miss more than 3 classes and if you do she drops your grade. You had to post a discussion question based on the readings once a week and you needed to do 2/5 possible reflection papers + the final research paper at the end. Class was basically her going over the readings and talking about them but she is truly super boring and mostly just pointing at slides and reading. And she always forgot to post the slides on Canvas unless someone told her. Class discussions were also not really discussions because she just called on people and they never responded to what other people were saying. It was just like group talk time. Some people also just said things that were terrible and she let it slide because she didn't want to make the classroom environment \"hostile.\" Not a hard class, but super unpleasant to be in.\""
        ]
    },
    "QSS030.16": {
        "James Dobson": [
            "review 1: \"22F with James Dobson: Really solid class. If you haven't taken CS1, I highly recommend taking that before venturing into this course. The material is fascinating, and you don't have to be turned on by books to think so. Two 'major assignments' dictate your grade, but at the end of the day he's not really a stickler for giving people bad grades at the end of the term, which is hopefully evidenced by the A median.\""
        ]
    },
    "QSS030.15": {
        "Gregory Sharp": []
    },
    "QSS020": {
        "Rebecca Johnson": [
            "review 1: \"22W with Rebecca Johnson: Like the 21S reviewer before me, I agree that they are definitely still trying to completely decide on what they want this course to cover, and stuff definitely got changed throughout the term. The basic work requirements this term (and they may change this) were 5 psets, with the lowest grade dropped, semi-optional Datacamp practices for completion grade (or just weighting your problem sets more if you didn't want to do these), and a final group project (paper and presentation). The course at the moment is almost exclusively taught in python, though they were debating switching to R to better align with the other QSS classes for future terms. There was a huge range of experience found in the class, so that got a little bit overwhelming at times-- there were people like me who had only taken CS1 and GOVT10, but also people who were CS majors with *far* more coding experience. However, (especially after the other problem sets were shortened and simplified after the first one), I did find that it was doable without any other computing background (so long as you do not skip the datacamp modules.) The class is somewhat top-down in concept approaches, however (which is part of the reason why it is possible for someone without much coding experience to do well)-- for example, we learned about some machine learning methods we could use on the data, but we didn't really go over the actual way that the methods work on the data in much detail. This class is therefore very practical, as I feel much more confident using the command line, github, and python, but there is a general sense that I don't really know *how* everything works, just that I know what I need to do to get it to work on the data at hand. I'm minoring in QSS so I had to take it, and if you want a crash-course in coding with data and using the tools (github, latex, etc) that everyone else seems to already know how to use, take this class, but if that doesn't apply to you, maybe wait on taking this one until they have a slightly more consistent schedule.\"",
            "review 2: \"22W with Rebecca Johnson: This class is definitely a lot of work, but it's also very rewarding. I picked up a lot of practical skills that I'm putting to use in my other classes. The grading structure was primarily 5 problem sets and a larger scale group project. In addition, a small percentage of the grade was participation and DataCamp modules (self-guided lectures graded on completion). Professor Johnson was incredibly understanding of student issues, and she works really hard to ensure that everyone has a fair chance to earn a good grade. Despite the A median, I would say this class is not a layup. I thought I gained a lot from this course, and I would definitely recommend it to anyone with an interest in data science.\"",
            "review 3: \"21S with Rebecca Johnson: This class will benefit from changes going forward and I think that Johnson will change the class for future terms. Would not recommend taking it in its current iteration, but since it's a required course, I think she and the department will respond to student feedback and keep updating it. I thought that Johnson was not a great lecturer. However, she is an extremely accomplished scholar (even though she just got her phd!) and her research is actually fascinating. She was very responsive and helpful over Slack at all hours and is generally a very kind person.\""
        ],
        "Jaren Haber": [
            "review 1: \"23W with Jaren Haber: This was a really rewarding but ultimately strange class. The QSS department has still clearly not decided exactly what should go in QSS20 (or that it obviously should be more than one class) and adding to that a relatively new professor made it a bit all over the place. That being said, it's definitely worth the time. The skills you learn in the class are extremely important for internships and getting ahead in further classes, like Git, SQL, beginning AI/ML, and advanced Python usage. Professor Haber was quite engaged with us and constantly looked for ways to improve both his teaching and assignments. Also, the TAs are a godsend - make sure you ask them for help often. I think next year (23/24) it is being taught by another new professor but a different one this time. Either way, I hope the department decides exactly what this class should be and helps it stay consistent but in the meantime just expect weird teaching styles/less concrete course methods until one professor has this class for awhile.\"",
            "review 2: \"22F with Jaren Haber: NGL, this course is still kind of a shit show. 5 psets, lowest grade dropped and the things they took points off for were never quite clear; one big final project (again, expectations weren't clearly defined, rubric was maybe 4 sentences total and despite going above and beyond my team was given about an 80%). Class lectures are hard to follow because we all end up working at our own pace, so I think this class would have been better either exclusively flipped or just lectures (and not working through practice problems in class individually). There would be about two weeks of no homework and then everything due all over one weekend. Get a head start on the datacamp modules (additional practice homework) – he grades on completion but they take 4-5 hours each. Overall, I'd recommend this course for the content which is all super helpful and required by many internships, but the teaching was not extraordinary, especially since this was his first term ever at Dartmouth.\""
        ],
        "Herbert Chang": [
            "review 1: \"23F with Herbert Chang: Chang was a really nice guy and obviously new to teaching, but he made it work. He was totally willing to shift around the schedule and due dates if we needed some extra time and was really helpful with final projects. The class was mostly centered around python and pandas but we took a few detours into git and latex. Four psets, some datacamp, and a final project so not too heavy on work if you start early. Great class for picking up some skills for industry data science.\""
        ]
    },
    "QSS030.14": {
        "Ahra Wu": []
    },
    "QSS054": {
        "Jason Houle": [
            "review 1: \"23F with Jason Houle: I think this class is super manageable. All of the problem sets are done in a group, as is the final project. Houle is a super passionate professor and really wants to make sure you learn. Personally I wasn't super invested in the Stata component of the class and it was easy to divide the work amongst the group so that I didn't really have to do that. Definitely need to keep on top of things -- the homework assignments take a while and our group suffered from bad time management. I think an A- is super achievable but not sure about an A. And at this point MATH50 might be easier.\"",
            "review 2: \"23F with Jason Houle: A somewhat interesting class where you get to learn about more complex types of statistical analyses you can conduct in social sciences. The class is STATA heavy, but you don't need experience with it (from SOCY 10, etc) as Professor Houle will start with the basics. Most classes are structured around STATA coding and learning how to interpret new statistical tests from the code. Everything in the class is group work based, including the 4 homework sets and final group project. Professor Houle is definitely a harsh grader (don't let his friendliness mislead you) but if you work hard and have good time management, an A is achievable. The median grade for this course was an A- for 23F.\"",
            "review 3: \"21F with Jason Houle: Definitely take this over any other intermediate stats if you're a QSS major. Basically all of the course is groupwork so as long as you get a hardworking group (like I did) you'll likely get an A. Took this when it was the first in person term though and I don't know how Prof Houle's going to change the grading in time. Only offered in the Fall so if it lines up for you then definitely take it if you need a class like this\""
        ]
    },
    "QSS030.13": {
        "Jason Houle": []
    },
    "QSS030.09": {
        "Carly Bobak": [],
        "Ramesh Yapalparvi": []
    },
    "QSS030.12": {
        "Joseph Dexter": []
    },
    "QSS083": {
        "Robert Cooper": []
    },
    "QSS082": {
        "Ahra Wu": [],
        "Michael Herron": [],
        "Peter DeWan": [],
        "Robert Cooper": []
    },
    "QSS081": {
        "Ahra Wu": [],
        "Jeremy Ferwerda": [],
        "Michael Herron": [],
        "Robert Cooper": []
    },
    "QSS030.11": {
        "Blake Miller": []
    },
    "QSS030.08": {
        "Daniel Flynn": []
    },
    "QSS030.07": {
        "Seth Frey": []
    },
    "QSS088": {
        "Elsa Voytas": [],
        "Jason Houle": [],
        "Michael Herron": [],
        "Sean Westwood": [],
        "Yusaku Horiuchi": []
    },
    "QSS080": {
        "Jason Houle": [],
        "Michael Herron": [],
        "Sean Westwood": [],
        "Yusaku Horiuchi": []
    },
    "QSS045": {
        "Joel Levine": []
    },
    "QSS041": {
        "Antonio Sirianni": [
            "review 1: \"21F with Antonio Sirianni: Overall an ok class. Would highly recommend that you have either R experience or some CS background before taking this class. The material had the potential to be interesting but was taught in a pretty dry way. We didn't spend a lot of time actually understanding the algorithms behind different kinds of analyses. The problem sets were mostly just copying the code given, but there are some situations where it's basically impossible to figure out what to do if you don't know R (Sirianni doesn't teach it at all). The professor is nice and pretty understanding about extensions and whatnot, but he doesn't inspire enthusiasm or interest in the subject. The readings are unofficially optional since we never used them and the midterm was relatively easy. There's a final project where you collect your own data and apply everything you've learned to perform whatever analyses you want, which was about the only exciting part of the class. In general, this class is not a lot of work but it's also not very fun.\"",
            "review 2: \"21F with Antonio Sirianni: The content of the class is very interesting and not difficult at all. I would recommend having minimal coding experience since Sirianni gives you the code for all of the problem sets, and all you have to do is run the code with a couple changes that you add yourself. If you do the problem sets and meet with him to go over them for 10 minutes, it is impossible not to get an A.\"",
            "review 3: \"20S with Antonio Sirianni: Pretty cool class to run social network visualizations without having to do the nitty gritty math or needing to know anything about matrices. A lot of the weekly psets were broken and needed updated code, but I think this was his first time teaching the class, so I'll cut the guy some slack. Sirianni was generally nice and understanding.\""
        ],
        "Peter Dewan": [
            "review 1: \"24W with Peter Dewan: Supperrrr interesting material in this class; also super manageable workload-- a few reading responses, 2 psets (in R), 2 in class midterms (open note), and one final group project. Would deffff recommend, especially with DeWan, he's a very engaging lecturer.\"",
            "review 2: \"23S with Peter Dewan: Easily my favorite class at Dartmouth so far. Content is super interesting and DeWan does a pretty good job lecturing and teaching coding concepts. You didn't have to do all of the readings but there are some reading reflections that you have to write in terms of assignments. Two open note midterms that were very fair and one final project in which you analyze a social network of your choosing. Definitely a plus to know R going into the class but not necessary. Definitely take this class if you are a QSS major or if you have any interest in social network analysis.\"",
            "review 3: \"22F with Peter Dewan: Not sure why but I took this course my freshman fall with no R experience, but DeWan made it a really enjoyable class and I definitely learned a lot. I had to put in a lot of extra effort to learn R, but if you have experience with it coming in, this class should be relatively easy for you. It is largely a graph theory course with some real world applications. The final project was super interesting to work on and the midterms was relatively easy even if you haven't read the assigned readings.\""
        ],
        "Ann K.": [
            "review 1: \"11F with Ann K.: This was not a course on the analysis of social networks: it was an \"Introduction to Computational Linguistics\". There were Computer Science, Linguistics, and Math majors in the class, and Professor Irvine did a great job making the material accessible to everyone. For each of the assignments, there was some writing code (in Python) and some more in-depth response questions. A very balanced course: if Irvine returns after she gets her Ph.D, definitely take it!\""
        ],
        "Joel Levine": [],
        "Jun Zhao": [],
        "Peter DeWan": []
    },
    "QSS036": {
        "Scott Pauls": [
            "review 1: \"09F with Scott Pauls: The material for this class had the potential to be incredibly fascinating. Any hope of enjoying the class though was thoroughly squashed by Professor Pauls. Pauls is an arrogant, unhelpful, insipid, self-absorbed man who is, in his own words, a \"subjective grader.\" The median on the midterm was in the low 50s. If the average person in the class was failing at the halfway point of the term, the prof clearly is not doing a good job of teaching the material. Scratch that, he didn't even do a decent job of teaching the material. There is no textbook for this course so you can't even teach yourself what you don't learn in class. And since Pauls is an incompetent teacher I didn't learn a thing all term. summary: terrible prof, impossible class. DON'T TAKE IT.\""
        ],
        "Daryl Deford": [],
        "Warren Lord": []
    },
    "QSS030.06": {
        "David Cottrell": []
    },
    "QSS030.05": {
        "Emily Merchant": []
    },
    "QSS030.04": {
        "Feng Fu": [
            "review 1: \"24S with Feng Fu: Went to class twice. Probably getting an A (potentially with a >100% grade in the class). Take this class.\"",
            "review 2: \"23S with Feng Fu: I will note that this class has become slightly harder than in previous iterations. Instead of the final project being some joke 800 word essay, now it's a full-fledged 12-page single spaced math research paper, with presentation and poster board components. But you get to work in a group of up to 6 people and the topic can be on pretty much anything, so its not that bad (just make sure you get a good group.) And, more importantly, since it's still Feng Fu teaching, this course is still mostly a layup. Everything else is mostly the same as in previous iterations. The only other assignment besides the final project are four problem sets, of which the first is literally just expository writing and the other three Fu will straight up give you the answers if you ask him (and make sure to ask Fu instead of the TAs, as the TAs won't give you the answers.) Don't bother showing up to class, pretty much nothing you do in class is relevant to your final project or the problem sets. (Just make sure to get a friend who will actually show up to class to write down your name if Fu asks for attendance; sometimes Fu does send an attendance sheet around.) If Fu likes you (he likes everyone, so it's not hard) it will be pretty easy to get a citation as well. But make sure to take this class sooner rather than later. The class getting harder this term indicates that the Mathematics department is aware of this course's status as a \"layup,\" and no doubt the department will be trying to correct for that---maybe even as soon as the next time this course is offered.\"",
            "review 3: \"23S with Feng Fu: The material in the class is genuinely interesting, and it's really up to you how much/what you want to get out of it. Feng Fu is very accommodating with extensions as well. Although there was a lot of latitude with the final project, it does give you experience with the general process of writing and presenting research. Friendship!\"",
            "review 4: \"23S with Feng Fu: FENG FU IS A LEGEND! Even though most people don’t go to class, the assignments can be done with other people and the first assignment has 10 extra bonus points. To put that in perspective, I think there were 60 points total over all assignments and 100 points total at the end of the term, so 10 bonus points (20/10) for the first assignment is insane. The final projects, proposals, and presentations can be BS’d and you’ll probably still get 100%. To be completely honest, I did not learn a lot in this class because I did not go to class a lot. If you go to every class and actually study, you might be able to learn the material, but most people take this class just for a layup. Otherwise, take like QSS 18 or another game theory class to learn game theory.\"",
            "review 5: \"23S with Feng Fu: This class is one of Dartmouth's best. First, Feng is one of the nicest and kindest professors I've encountered at Dartmouth. He makes sure to try and learn everyone's name and always takes photographs of the class when lots of people show up. Attendance was low since the material in class is pretty unrelated to the homework/final project but I just went during the 10A and used it as a work period since he was so nice and I wanted to show up for him! There are four problem sets that you can get the answers for pretty easily from Feng or the TAs. The final project was definitely a grind since it was 12 pages single spaced, but the intelligence level of my group was super low and we still got an A. The TAs basically do all of the math component of the project for you and you just have to fill in the conceptual stuff. Overall an amazing class, a textbook layup. Would recommend taking it as soon as possible though since I feel like the math department is bound to figure out how easy it is at some point and likely increase the difficulty.\"",
            "review 6: \"23S with Feng Fu: Feng Fu is extremely cool. One of the nicest profs I've ever met at Dartmouth. However, he's not the best lecturer. I know most people take this course because of the low workload but I walked away from it feeling pretty bad about myself for not learning much throughout the course. Your grade is essentially determined by how good your group is for the class project (a new addition to the course). If you work with people who are semi-hardworking, you'll be absolutely fine. I think something that's important to mention is that the math and qss departments likely know about the course's reputation. Like I said earlier, the group project was a new component added to the course which replaced what was previously an 800 word research paper. The 24S version may also end up being a layup but I wouldn't be surprised if the course ended getting a revamp at some point.\"",
            "review 7: \"23S with Feng Fu: Thanks Prof. Fu for being so cool and enthusiastic. Stakes are low in this class (easy PSETs where he gives you a 20/10 on the first one as long as you do a short, easy extra credit assignment, one final group project) so you are able to just learn for fun. This is class is what you make of it!\"",
            "review 8: \"23S with Feng Fu: Feng Fu is a legend. This is a pretty easy class and you get out of it what you put in. You don't really have to attend the lectures if you don't want to, but if you are genuinely interested in the material you should go to class. Fu is not the greatest lecturer, but he is a great guy who is very nice. 4 psets and a final project. Psets were challenging at times but just go to office hours and Fu will help you. Asked for help twice and he just gave me the answers. Final project can basically be about anything but definitely choose a good group. Definitely take this class.\"",
            "review 9: \"21S with Feng Fu: Easy workload and very supportive/understanding professor. Hard to understand all the material but PSets were manageable. Would take if you are a QSS/math student.\"",
            "review 10: \"21S with Feng Fu: Feng Fu is a legend. Take this layup before the sharks find it. Arguably easier than African Drumming. 5 problem sets that take like an hour tops. One time I asked for an extension and he granted it and included the solution manual and said to check my answers before turning it in. Cite awarded\"",
            "review 11: \"20S with Feng Fu: Feng Fu is a legend. He would spend about 10 minutes every day talking about how our class could solve coronavirus, when it was right at the beginning of the outbreak. This class is crazy easy if you're at all STEM/QSS inclined, but I know some idiots who took the class who had a hard time. I probably spent 30 mins on each problem set, 4 hours on the final project, and I got a citation. Feng Fu is super funny, but he's not a good lecturer. Good thing I didn’t actually have to understand the material. Just taught myself from the book.\"",
            "review 12: \"16F with Feng Fu: Except for the final project, by far the easiest class of my Dartmouth career. The two problem sets we had to do didn't take more than a half hour each. Definitely a layup if you are STEM inclined.\""
        ],
        "Olivia Chu": [
            "review 1: \"22S with Olivia Chu: Super interesting class with a very caring and understanding professor. This was Professor Chu's first time teaching and she definitely listened to feedback from the class about the difficulty of the material and problem sets. The 50% final project had a lot of assistance leading up to it such as project check-ins and Professor Chu added office hours for the harder problem sets. Highly reccomend!\""
        ]
    },
    "QSS030.03": {
        "Brendan Nyhan": [],
        "Charles Crabtree": [],
        "Mia Costa": []
    },
    "QSS030.02": {
        "Allen Riddell": [],
        "Sean Westwood": []
    },
    "QSS030.01": {
        "Michael Herron, Philip Hanlon": [
            "review 1: \"22W with Michael Herron, Philip Hanlon: Fun class. Having a background in math made the more mathy parts of the class easier to handle. Problems sets are usually implementing statistical tests or analyses we learn in class in R. Final project at the end was fun if you have time to go in-depth and get really into it. Used about half of our X-hours which was rough for a 9L. And every Wednesday we had to prepare to present a couple papers and he calls on people randomly so you need to be ready every week which was a little rough. If you're interested in Sports you'll like this class. And if you have any background in statistics it's not that intense.\"",
            "review 2: \"19F with Michael Herron, Philip Hanlon: Weird class. A lot of math, no assessments to measure mastery of the math, and a brutal grading scheme for participation (15% of the grade). You learn a lot but it is possible to feel like you have mastered the material and still end up with the median grade. Herron is great and Hanlon is ok (although he has a ton of availability in office hours) but I would recommend only taking this course if you're genuinely interested in the material. There are definitely better QSS methods courses out there but you do learn about some good skills and contemporary areas of sports research in the class.\""
        ],
        "Michael Herron": [],
        "Philip Hanlon": []
    },
    "QSS018": {
        "Michael Herron": [
            "review 1: \"23W with Michael Herron: This class is so interesting! Professor Herron is a great professor and definitely cares about his students. He does do lectures in a very structured way, but if you don't understand a lecture the textbook is super helpful and not too hard to read. It does take a bit to think logically (and thankfully I did have some experience with logic and probability) but otherwise a great course. If you have to take it definitely choose it. The p-sets do take a bit of time and thinking, but it helps to have a group of people you will talk about the p-set with.\"",
            "review 2: \"23W with Michael Herron: Herron is the man. He's such a nice guy who wants you to succeed if you put effort into the class by meeting with him in office hours or asking questions in class. The lectures were fascinating and were taught at a methodical pace, Professor Herron broke down the concepts to its simplest form for the most part. It was fascinating and teaches you a knew way to think, it is a language of sorts\"",
            "review 3: \"23F with Michael Herron: Super interesting class. Definitely hard, but challenging in a way that is worth it. All of the grades are essentially banked on the midterm and final so make sure that you are understanding everything as you move forward. Herron is super intense in that things move fast and he expects a lot but also definitely cares for his students. One of my favorite classes I've taken so far at Dartmouth. I recommend if you like logic and mathematical reasoning\"",
            "review 4: \"23F with Michael Herron: super interesting class but Herron moves a mile a minute. I agree with everything the review for 23W that starts with \"This class is so interesting...\". He really wants everyone to do well. The worst part is that if this type of thinking is new to you, or it isn't intuitive, then you will feel lost. Also, the final and midterm are worth 45% and 40% respectively so yeah :/\"",
            "review 5: \"23F with Michael Herron: I loved this class. I had no background in QSS coming into it (took it as GOVT), and while it was difficult, it was incredibly worthwhile. The problem sets were not easy, but if you find people to work with it shouldn't take too long. I thought the midterm and final were fair--only one problem was surprising, and Herron took that into account when he curved the exam. Herron was very passionate about the material--you get the sense he wants everyone to do well, and he's very consistent with office hours (he'll even add some on the weekend if people ask). Overall, this class is WORTH IT. Could not recommend more.\"",
            "review 6: \"23F with Michael Herron: Great professor. Herron is extremely understanding. Not a layup. Your grade consists 40% of a midterm 45% a final and 15% homeworks. You don't have a ton of busy work in this class which is nice. Median was B+/A-\"",
            "review 7: \"20W with Michael Herron: Not a layup at all, but the coolest class I have taken at Dartmouth. Herron is a little bit too smart so sometimes it is hard to catch up to what he is trying to get across, but such an incredible class and beyond interesting. Work was manageable if you stay on top of it and have people to study with.\"",
            "review 8: \"20W with Michael Herron: Cool class. Not a layup. Problem set every week totaling to 25% of grade, one midterm worth 35%, and final worth 40%. But, as Herron said multiple times, he doesn't care about the grades, he cares about the knowledge. Herron is a super cool guy and really wants everyone to succeed. He always answered questions outside of class and re-explained things during class when people didn't understand. He does talk EXTREMELY quickly tho. Recommend taking this class with a friend because you won't want to do the psets alone. Starts to become a lot of algebra, a little bit of derivatives, but overall you feel like you learned a lot and you see the world a completely different way at the end of the term. won a tournament at the end of the term outside of class because i knew what strategies were dominated and which ones weren't. that was lit.\"",
            "review 9: \"19W with Michael Herron: A challenging but eye-opening class that every student, whether quantitatively focused or not, should take at some point during his or her Dartmouth career. The coursework is fascinating and grounded in real-world application despite all of the theory we learn in class. At no point was the work overwhelming, though understanding the concepts and completing the problem sets often took a good deal of focused effort. Take this class!\"",
            "review 10: \"19W with Michael Herron: Greatest class at Dartmouth. Not easy, not a layup. Changes the way you look at the world/problems and transactions in general. So fucking cool. Herron is intense but he's a great lecturer. I had a blast in this class. Follow @dartmouthgametheory on instagram for memes about this class.\"",
            "review 11: \"18F with Michael Herron: Shit was dopeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee\""
        ]
    },
    "QSS017": {
        "Robert Cooper": [
            "review 1: \"23W with Robert Cooper: Cooper is a terrible prof. Didn't teach us anything, is a very boring lecturer, and tries to make the occasional joke that never hits. Attendance in the class quickly dwindled through the term and I did not go to class after the first few weeks. Honestly was a waste of time to have gone to class in the first place since he doesn't teach us anything. Apparently we are graded on participation in class and on slack but I have no idea how that is factored into our grade. Weekly psets were challenging but very doable. Last three weeks of the term get a bit hectic since we have a weekly pset and a weekly project but still very doable. Final exam was a 48 hour coding exam in which we were given visualizations and the data associated with them and had to recreate the visualizations. Exam was very tough but still doable. Overall, I think the assignments we were given were fair. I definitely learned a lot from this class and it solidified my interest in the qss major, but again, most of my learning was done by myself and by doing the weekly psets.\"",
            "review 2: \"23W with Robert Cooper: After the first 2 lectures I didn't show up to a single class because Cooper posts Youtube videos that just explain his lecture notes and demonstration programs the same way as in class, except you can control it to your own pace. Definitely a class you will need to put extra effort into learning yourself, but the homeworks and take home final all have a reasonable amount of time to work on. Not the hardest class and a good intro to R if you have no experience.\"",
            "review 3: \"23W with Robert Cooper: Objectively bad class. Not taught whatsoever, you teach yourself everything. While I would say I have learned a lot, there was no guidance or teaching, and it got extremely stressful at times as I scrambled looking things up on Google or asking the Slack channel to no avail. Cooper literally puts \"Google is your friend\" in the directions for every assignment and I honestly have no idea how a (good) teacher could possibly ever do that. I seriously think there's a much better way of going about teaching the material than throwing us into the deep end without explaining anything but the bare basics and expecting us to figure out something very complicated on our own. Take only if you're a QSS major, but brace yourself. Definitely find other people in the class to work with, as well.\"",
            "review 4: \"23F with Robert Cooper: Contrary to popular opinion, I thought Cooper was a great professor. His lectures are definitely boring but he always left a lot of time to work on the problem sets/projects at the end of class. He is also super chill with deadlines. I asked way too many questions over email and in class and he was always helpful. I thought this was the most satisfying class I've taken in the QSS major sequence so far and you walk away with a lot of capabilities in R. Fun creative/artistic component too and you get to make your projects about literally anything you want.\"",
            "review 5: \"22S with Robert Cooper: Unlike the previous reviewers, I actually enjoyed this class a lot. I think Cooper's teaching was pretty incompatible with covid remote learning. However, in person this class was pretty solid. You still have to do a lot of googling especially for the projects (3 during the last 4 weeks or so), but Cooper held actual lectures and taught the important material (no datacamp) so you could do the weekly p-sets pretty much only with the class material. Cooper also always made a helper R script which was super helpful. I do think that it would be very helpful to have some coding experience coming into this class (CS1 level). The class was pretty small with only about 8 people showing up to lectures so there was ample time to work on problems individually with Cooper. He was always super helpful and tried his best to figure out a solution and make you understand what the problem was. If there were 20-30 kids in the class like in the other two sections, that might be a little more difficult. Lastly, while the Horuchi sections had two midterms and a final, all of which were timed and pretty difficult as I have heard, we only had one 3-day take home final (which was definitely difficult but I prefer it a lot over a timed coding exam).\"",
            "review 6: \"22F with Robert Cooper: This class is primarily self taught, but the professor is moderately funny. My best advice is to spend A LOT OF TIME working through these yourself. Try and get a handle on the projects at the beginning of the weeks, so you have ample time to work through issues you may encounter. What I will say, is though I taught myself 90% of the material, the professor is pretty understanding if things come up and you communicate with him ahead of time. Be timely with your communications, but be prepared for this to be your primary workload class for a term. That all being said, it is the most employable class I have taken at Dartmouth and I actually felt like I left knowing how to visualize data in R (but what you reap from the course will be directly determined by how much you put into it, as with anything). If you have little to no experience with programming, definitely take this as your hardest class of a term.\"",
            "review 7: \"22F with Robert Cooper: Class is cool, Cooper definitely knows DV in and out. Weekly p-sets can be vague and strangely written at times but it doesn't really matter because they're graded pretty easy. 3 projects to end the term and then a 2 day final which is tough but doable. Would probably recommend some previous CS experience. Did not know what grades I got on pretty much anything the second half of the term which was not ideal. Solid class.\"",
            "review 8: \"21F with Robert Cooper: The class structure mainly consisted of videos that were posted before the lectures that were about 10-20 minutes long. The 2 hour lectures mainly covered what the video covered so I didn't really get much out of it. Grading is very slow for this class; at the end of the term, only up to week 6 homework was graded which was done by the TA. Cooper absolutely does no grading at all; we never got grades back for our labs or projects or for the final exam. This was a bit stressful at times since you absolutely have no idea what grade you have in the class. As for the teaching, I would highly recommend to have some type of coding experience- I cannot stress this enough. Even though this is an intro to coding class, Cooper breezes through lots of concepts, including ones that were needed on the weekly homework. What is strange is that Cooper expected you to Google if you didn't know what something meant, which I ended up doing an excessive amount. Overall, I thought the class had a lot of potential but the structure was highly disorganized; Cooper is an excessive talker and often times goes WAY OVERBOARD than he needs to. Take it if you have to but wouldn't recommend if you want to learn about R- just look off videos online.\"",
            "review 9: \"20S with Robert Cooper: Class is cool, lots of interesting material. Cooper is so unengaged it almost sad. The only teaching material in the course were DataCamp lectures and a few videos he made on extremely basic concepts. Maybe he is better in person.\"",
            "review 10: \"20S with Robert Cooper: I kinda liked Cooper. He is a chill guy. Yeah he didn't hold online class and expected us to borderline teach ourselves, but if you went to his office hours that he held twice a week he would help you go through your code and show you how he did his for reference. Very few people were in the office hours and he did it in a group style where you could hear other people's questions so even if you did not have a specific question you could hear what other people were working on. I also sent him some questions about assignments and he usually got back to me in some sort of timely fashion. I thought R was a cool language and you can make some really interesting graphics if you put in the time in. I guess I never knew what my grade was in the class but it was P/F so I think Cooper did not really care to be so on top of grading. If you have to take the class its not the worst, but I recommend finding a buddy to take it with for some extra support and go to office hours!\"",
            "review 11: \"20S with Robert Cooper: This class was so bad that it made me reconsider the whole QSS major. It made me pretty disappointed in the department and with the school as a whole because I know that there has been a lot of bad feedback for the professor but that doesn't seem to have done anything. I heard bad things about Cooper going into the class, but I figured I could take it as a 4th class with the online situation, and it wouldn't matter that much. No actual teaching took place. Everything came from a subscription to DataCamp, which I did initially but eventually gave up on by the end of the term. He said that he would make YouTube videos to supplement the DataCamp material, but over the course of the term, he made *maybe* two hours of videos, and even those would happen ages after he said they would. Nothing I submitted was graded until after the midterm and there was no info given on what would be considered a pass in the class. He never responded to a number of emails I sent, and the link to office hours was never posted on the canvas. To top it off, he released the final late 🙃. With that said, I've heard the class is really good with Horiuchi.\"",
            "review 12: \"20S with Robert Cooper: DO NOT take this class. As far as I know, Cooper is the only prof, and he was horrendous. He literally did not do any work the entire term. The material was entirely taught through lectures on DataCamp. All Cooper did was host a few office hours a week. In the class, each week of lectures was accompanied by an assignment. Cooper is so incompetent that several times he asked us to do problems that we did not learn how to do in the week's lectures. Each time, I would scour Stack Overflow for solutions, and then come the next week I would realize that the problem he had asked of us the week before was covered in the following week's lecture. So he's so terrible that he can't even keep a syllabus that's in sync with the material being taught. He also ignored several emails throughout the term asking basic questions such as \"when will you grade my assignments?\" and \"why are you giving problems that we haven't learned how to solve?\" I never actually got a single grade during the term. I honestly have no clue of the quality of my work because I got no feedback other than that I passed the class. As far as he office hours go, I only went once and Cooper was quite unhelpful and kept on repeating something I already knew while not addressing my actual question. I'll say it again, DO NOT take this class.\"",
            "review 13: \"20F with Robert Cooper: I actually loved taking this class with Robert Cooper. He is easy to get to know if you show up to the optional class times and is always willing to work with you and answer your questions. Some of this class feels very repetitive, but it's super useful and a great class in the QSS department. I think he finally found his stride for remote learning. The only issue I have with Cooper is he doesn't grade anything so it's super hard to tell how you are doing in his class.\"",
            "review 14: \"20F with Robert Cooper: This was such a great class! However, none of the previous reviews are false- Cooper is unengaged and most of the class is self-taught, but, he is such a great prof and willing to help and teach if you put in the work to reach out. At least virtually, he had office hours multiple times a week and would stay on for over an hour past the time limit if you had more questions. It was a hard class in that you are teaching yourself R basically on your own, but Cooper is such a great guy if you take the time to go to office hours and try your best on the assignments. There is an assignment a week, pretty time consuming, a group project, and a big final exam. Lots of work, but great and rewarding class, one everyone should take the time to take.\"",
            "review 15: \"20F with Robert Cooper: Different from other classes since you're picking up a \"hard\" skill, so wouldn't go into this expecting proper classroom-style lectures and discussions. Lots of googling for problems, since Cooper can be pretty unavailable or confusing, especially on some strangely worded problems. A great skill to learn, but poor delivery and logistics. Also nothing is graded.\"",
            "review 16: \"20F with Robert Cooper: DO NOT TAKE THIS CLASS. I read the review below and thought \"hey, how bad could it be?\" He does not grade ANYTHING all term, hosts a few office hours, and gives you a lab and an assignment during reading period that he expects you to complete. The assignments were not reflective of any of the material taught in class. I found myself using Google more than his lectures/resources. What a horrible class. Take it with someone else, just not with Cooper.\""
        ],
        "Yusaku Horiuchi": [
            "review 1: \"24S with Yusaku Horiuchi: Super useful to know R but you do all of the learning on your own. Virtually no point in going to class but he randomly checks attendance to make sure you can sit there, even though you basically do the work on your own. I am also, like, philosophically opposed to on-paper coding exams and Horiuchi employs those. With all that being said he is genuinely the sweetest person ever and is incredibly useful if you meet with him out of class. He wants people to do well. Overall I have mixed feelings and I think that he's probably not the best educator in the world per se but if you're willing to fight the B+ median it's worth it to learn R.\"",
            "review 2: \"23S with Yusaku Horiuchi: As much as I think this course is extremely useful for just about any field, I'm not without my qualms regarding *how* the course is taught. It's a flipped classroom, so basically we had to teach ourselves the entire material. The homework wasn't even prerecorded lectures, it was just chapters from a free online textbook, which was pretty dry. In class, we would just work on precepts. There were three exams (including the final) that were 20% each, three projects that were 10% each, 7% participation (which was based on ed discussion participation), and 3% for a contest where we submitted one of our projects and got to score each other's data visualizations. Also since the class is cross-listed with gov there's an enforced B+ median which imo is stupid - if we're paying thousands of dollars to take this course, just to have to teach it to ourselves, I feel like the least they can do is give us an A in return lol. We haven't gotten grades back but I'm not expecting to have done super well - but that being said, I feel this is the most I've learnt in a Dartmouth course (even if I did have to teach it to myself). Ultimately, I view this class as sort of a necessary evil, and even if it might hurt your gpa I think it's good to take, especially if you're an econ/gov/cs major, or really any field that might encounter data. I would also recommend having some coding experience before taking the course!\"",
            "review 3: \"23S with Yusaku Horiuchi: This course is the best course I've taken in my first year at Dartmouth. It teaches you so much about data wrangling and visualization, specifically making professional graphs and figures which are skills that are so applicable to basically any job you can think of. The course is very hard and you get what you put into it. The flipped classroom style is not horrible if you can learn based on an answer key and the prof explaining his answers. Horiuchi is super knowledgeable and an amazing prof and person. Go get lunch with him! He wants to get to know his students and see them succeed. He meets with you over Zoom or in person during office hours and is super active on ED Discussion to help answer any questions you may have. CLASS STRUCTURE: Flipped - meaning you do precepts (a lesson with problems) in class with the guidance of the prof, but the prof does not teach. He will gradually show the answers in class and explain the solution. You can follow along and review all homework and class work outside of class. The first midterm was very different from the second midterm and Final. I think I can safely say that everyone liked the format of the second midterm and final WAY MORE than the first midterm because essentially you just data wrangle and make 2 figures. The projects were great in testing what we knew, preparing for the exams, and making a product we were proud of. The DV contest is also a great way to practice good visualizations. Overall, the class had great methods of evaluation. I have learned so much that I know I will use in the future. I love QSS even more because of it, and I know this class will be insanely useful in the future. I recommend EVERYONE, even non-QSS majors take this class, especially with Horiuchi.\"",
            "review 4: \"23S with Yusaku Horiuchi: Professor Horiuchi is very nice and understanding, and he is really helpful with answering questions. The material is also very interesting. Those are the only two good things I can say about this class. There is very little actual instruction since it's a flipped classroom model, but in my opinion there's so much going on that there should at least be some lecture component. The actual class period was used to complete a precept, with homework being assigned reading about the material. I would say that I would have to redo the precepts (which take at least an hour to complete) at least twice outside of class before I really understood what was going on, so that combined with the assigned reading added up to a lot of time spent on this course. I personally did not enjoy it and it caused me a lot of unnecessary stress, but I don't regret taking it because the material was genuinely useful. If you're a GOVT major who needs a TAS/TLA credit, I would recommend this class just because you get credit for both. And if you end up needing to take it and coding is not your strong suit, I recommend being super proactive in the first half of the course, making a huge effort to understand the smaller concepts (the material only gets harder), going to office hours/signing up for peer tutoring, etc. It will make the second half of the class, which has most of the projects and exams, so much easier.\"",
            "review 5: \"22S with Yusaku Horiuchi: Honestly, it’s a stretch to call this a course. The professor made it clear day 1 that this was a flipped course, but I wouldn’t call it that: there were no lectures at all. In my previous experience, a flipped course here at Dartmouth means prerecorded lectures and work/questions in class; this was simply reading the textbook – an expectation of all courses – and working on optional assignments in class where you could occasionally ask the professor a question I could have more quickly found the answer to online (a much more realistic expectation of programmers, in my opinion, and far more realistic than having 2 hours to analyze so much inconsistent bad data like our exams are structured). The professor put a lot of effort into writing the assignments, yes, but I feel his effort would have been much better used by explaining what code is important for us to use rather than asking students to read on their own and figure out homework as independently as possible. Overall, I loved the content I learned, but I would tell everyone I know to avoid this course at all costs. It’s not worth the money it costs to attend this institution, and I’m rather disappointed in my return.\"",
            "review 6: \"22S with Yusaku Horiuchi: I have mixed feelings about this course. I learned so much and genuinely enjoyed the course material. Professor Horiuchi was incredibly passionate about the material and always willing to meet with you for questions or advice. But the way the course was designed -- flipped classroom and back-to-back labs and exams -- was horrific. I would not recommend this course if you have no coding experience. My peers who had only a little coding experience (gov 10 or another 10-level course) really really struggled (not an exaggeration). I would not take this course if you haven't taken at least COSC 1. I personally have a lot of coding experience and I still found this course difficult. All of that said, I really recommend this course. It teaches a lot of valuable skills important for data visualization. And there were a lot of complaints about the assessment system so I think Hourichi might reconsider the exams and labs.\"",
            "review 7: \"22F with Yusaku Horiuchi: Such a difficult yet rewarding class. Like most other people, I was not a fan of the flipped classroom format. You read chapters from the online textbook before each class and then are expected to know how to apply the new concepts in class. I was so lost in pretty much every single class -- you definitely need to spend a lot of extra time reviewing classwork. The three projects/labs really helped me understand the concepts but they were very time-consuming. I ended the class with an A with some Python background (CS1 and using Pandas at an internship) and a LOT of time and effort. Prof Horiuchi is so nice though (although he doesn't explain concepts very well); he moved deadlines back multiple times to help lighten the workload.\"",
            "review 8: \"22F with Yusaku Horiuchi: This is a HARD class, but that doesn't mean you can't do well. Horiuchi teaches QSS17 as a flipped classroom, so you do textbook readings (which weren't that helpful imo) and then come to class to do \"precepts\" which are just coding exercises that go over the main concepts of the class. The class moves very fast, you pretty much do something new every class and you have to practice a lot on your own time (redo the precepts over and over again!) to get the hang of coding. The class is divvied by attendance, 2 midterms, 1 final, and 3 labs. For labs, you are graded in comparison to your peers, so basically your grade is determined by how many functions you use and if you use more than most of your peers you do better. You can also get extra credit for the last lab. The first midterm was tough but he changed the format of his exams for the second midterm and final, and I felt like they were much more reasonable. Horiuchi is always accessible during office hours if you do have questions. This class is tough but also extremely useful.\"",
            "review 9: \"21S with Yusaku Horiuchi: Take this course with Yusaku Horiuchi!!! Yes, this course is flipped, and that's clear from day one. So if you take this course and then you complain about how \"we just did problems in class\" you literally fucked yourself in the ass son. But, I disagree with what others said; the prof definitely matters. Horiuchi put A TON of effort into creating detailed problem sets (\"precepts\") for us to work on, so thankfully we weren't just watching Datacamp lectures like I originally feared. The problem sets were also incredibly socially relevant--Horiuchi incorporated recent data on issues like COVID, hate crimes, mass shootings and income inequality. He's also incredibly nice. The man answered seemingly every single piazza question within 15 minutes (he could've done it in 5, but he wanted to give us a chance). He also dumbed down our final A LOT to reduce our workload. Another review almost make it sound like he didn't do much at all, when it's the exact opposite--he probably put in more effort than 90% of all my profs at Dartmouth. You just need to invest time and effort to take advantage of the good resources he offers. And yes, as others have said, this course isn't easy. Even with my previous coding experience, the learning curve in the beginning weeks was pretty big. If you take this class without previous coding experience, I'd say bust your ass all of weeks 1-4 to catch up. There was also a particularly hellish period of 6 days where 50% of our entire grade was decided (Lab project, midterm 2, final). Grade-wise, this class isn't the most forgiving; the class median is curved to a B+. Again, this was clear from day one, so to all the people who kept bitching about their grades, you literally fucked yourself in the ass son. So, definitely don't take this class if you can't remotely handle 1. a flipped course structure, and 2. a likely B+. But regardless, I highly, highly recommend taking this course with Horiuchi. It was exhausting at times, but I learned so many incredibly useful skills.\"",
            "review 10: \"21S with Yusaku Horiuchi: Seconding the review that says this is not a layup. Coming from someone with a CS background, I'm very glad I had an understanding of coding principles before this class. The material covered is really interesting, and you learn a ton of useful skills, but the amount of concepts to learn can get overwhelming at times. Horiuchi is...okay. He's absolutely a very nice person, but our class sessions consisted of sitting in a breakout room in near-silence, working on the exercises. He would pop in from time to time to see if we had any questions, but wouldn't stay for very long. This class is very much self-driven, so if you can hold yourself accountable for keeping up with and reviewing the material, you'll be fine. Tests were fair, but often a time-crunch, and he can be picky on grading. Would recommend this course mostly for the content, not for the prof.\"",
            "review 11: \"21S with Yusaku Horiuchi: I feel like I learned so much in this class and that I could confidently use R in a job or research project. However, this is not a layup or a class for someone with no coding experience. The learning is self-driven, since Horiuchi does not lecture, instead he assigns textbook readings and practice exercises that you complete during class. Horiuchi's tests are difficult -- he warned us that he has given a midterm with a 40 median before. There were two midterms, a final at the start of week 9, and three diy data visualization projects. Horiuchi is nice and approachable, but you have to actively seek help if you think you are falling behind on some of the units or projects. Overall, I am really happy to have learned how to use R, but this class can be stressful.\"",
            "review 12: \"19X with Yusaku Horiuchi: This class teaches the coding language R. I don't recommend it to people who have zero coding experience, as many of your classmates will have former experiences in R from research and other classes. A student who has coded in R for several years will be evaluated equally as a student who is learning R for the first time. The class carries a flipped structure, meaning you will watch the teaching videos as homework (Horiuchi does not directly teach, rather a textbook lecturer unaffiliated with the college teaches you in these pre-recorded videos), and then you spend the entire class doing problem sets. I took this class because Horiuchi does an excellent job marketing it, claiming that it doesn't matter whether you have former coding experience or not. Having taken this class now, I disagree with that statement. This can be a very stressful class for those not yet comfortable with learning how to code. It made my sophomore summer miserable, and I felt helpless when I couldn't figure things out.\""
        ]
    },
    "QSS015": {
        "Joel Levine": [
            "review 1: \"08S with Joel Levine: Whether you need this for your QDS, major, or just intellectual curiosity, Levine is the man. He is a very bright and has a lot to say about data analysis and statistics. Finally a class that develops creative thought instead of structuring a rigid way of thinking about a certain topic.\"",
            "review 2: \"07S with Joel Levine: This is one class where you will put off doing the work as much as you can. The material isn't hard, but it isn't fun. Prof. Levine doesn't do a great job of explaining what's going on. He's a pretty nice guy, though. Even when I did a crap job, I usually got the gentleman's B+.\"",
            "review 3: \"07S with Joel Levine: Joel's grading seemed extremely arbitrary and it was kind of a pain having to hand in homework every day, but there were no exams which was nice.\"",
            "review 4: \"07F with Joel Levine: Prof. Levine is a nice guy, but he seems to lead the course in a very confused direction. He may assign us stuff and practically forget about it later on. Although it turned out that we were supposed to turn in papers for the course, we didn't get word from him after his due date had passed! Interesting material, though.\"",
            "review 5: \"07F with Joel Levine: This class is structured differently from others. An assignment is due at the beginning of nearly every class. There are no midterms, and instead of a final exam you write a final paper. Here's the catch: if you don't show up to class, you don't learn the lesson. If you don't learn the lesson, you don't understand the assignment. If you don't understand the assignment, the homework that is otherwise pretty straightforward becomes mildly hellish. To summarize: show up and it's a fair, easy, and even fun course. The prof is one of the nicest guys here. he will read every word you write for him and give you constructive feedback. It's nice to know that your work will actually be read and appreciated by someone. I'd say the final paper is actually the most interesting part of the course. You are given the option of either applying the tools you've learned to a data set (it IS intro to data analysis) or you can try to learn a new statistical technique on your own. I'd definitely opt for learning a new technique. It is amazingly gratifying when you all the sudden understand this technique you'd never even heard of before. I had never really had an independent learning experience like this before and now just wish I had more time to establish a more in-depth understanding of my topic. Your technique kind of becomes your 'baby', so to speak. Take it! Enjoy! But KEEP UP!!\"",
            "review 6: \"07F with Joel Levine: The material and assignments are pretty straightforward in theory, and attending class really clears things up (if you miss something, the PDF/textbook was helpful for most of the course). Sometimes though, it feels like the professor obfuscates otherwise easy to understand methods. But if you have the main concept down, that should be fine - also TA was really helpful in clearing things up further after class / checking over papers. Assignments due every class, but no exam is really nice.\"",
            "review 7: \"06S with Joel Levine: Do not take this class for a QDS. It is a waste of time and you don't learn anything. Not nec. an easy A either.\"",
            "review 8: \"06S with Joel Levine: this class was really random the hwk is basically your entire grade but the prof doesn't explain concepts well in class. the class was divided between people who already knew the stuff and people who had no idea what was going on. hwk took forever to do for those of us who were clueless. the hwk is graded \"fine\", \"good\", \"ok\" and \"poor/weak\" and those correspond roughly to A, B, C, D levine is really spacy but really nice. don't take this class unless you absolutely have too. you don't learn much about stats at all.\"",
            "review 9: \"06S with Joel Levine: i'd recommend it for a QDS\"",
            "review 10: \"06S with Joel Levine: DONT TAKE THIS CLASS! YOU DON'T LEARN ANYTHING AND THE PROF IS AWFUL. HE SHOULD NOT BE IN THIS COLLEGE!!!\"",
            "review 11: \"05F with Joel Levine: This is not a class that eeryone wil like. It's fun and shows what kind of mistakes are made in data analysis. Levine is a quirky and insane Professor who likes to pull all-nighters over the kind of stuff he teaches in his class, that's why the class is so engaging.\"",
            "review 12: \"05F with Joel Levine: Quite a lot of work. But Prof. Levine is really nice and helpful. Definitely visit him during office hours and chat with him. Prof. Welsch seems to have a totally different teaching style. I would recommend taking it with Prof. Levine.\"",
            "review 13: \"05F with Joel Levine: Don't expect a throughly outlined syllabus and a concrete assignment for homework. This class is very much a go with the flow kind of thing which is perfect if you need to take statistics but aren't that comfortable with math.\""
        ],
        "Peter Dewan": [
            "review 1: \"22F with Peter Dewan: The past reviews were probably because that was his first year teaching at Dartmouth so the 9-10 week system was a \"culture\" shock. This year was much better. He gave like 14 assignments which took me personally around 1-2 hours each but sometimes they could be finished in more or less time. I recommend finishing them as fast as possible. His Office Hours were from 10-11:30 which isn't that much time but as long as you go to him with a semi-finished assignment, he'll help you out to get a 5/5. He was pretty good at answering emails as long as you send them before 5:00pm. He does love to talk about his life especially in Tanzania which is interesting. The first exam wasn't so bad but the final was way harder than I thought. There were more technical questions like when to use a \"t-test\" or \"two sample tests.\" I recommend doing lots of practice problems with those to really digest how they work. The final project was quite a lot of work so definitely get started early. All in all, the class wasn't bad at all and definitely manageable. I recommend taking the class.\"",
            "review 2: \"22F with Peter Dewan: Prof. Dewan was actually a great prof. this term. It seems like he saw these previous bad reviews and completely changed his teaching style. He taught a good mix of coding and stats, was consistently available for office hours, and his lectures were very interesting and informative. I would highly recommend this class as it is a great gateway into QSS, and I think I'm going to major in QSS after taking this class.\"",
            "review 3: \"22F with Peter Dewan: Pete Dewan is an interesting character. You probably won't learn much from his lectures, but you will learn lots about his life. This man has a lot of stories to tell, and serves for an entertaining morning class. Professor Dewan was mostly around, except for a few occasions when we wasn't responsive/available to meet. He's really chill about attendance and doesn't care if you don't show up. That said, the structure of the class was mildly disappointing: the stats portion is heavy while the coding section is lacking. The first half of the course maintained a more even balance but the second half was mostly stats with little new coding which was slightly disappointed. The workload isn't awful for the majority of the term: every week there were two short p-sets which are pretty easy to do well on and some textbook readings. The midterm and final were difficult, but not impossible. The end of term is heavy with the accompanying of a large project and paper. Probably an easier class than most other 10's, so a good option if you don't want to go too in depth for your stats requirement. Don't take this class if you are looking to learn much about data visualization or computing methods, but if you want to learn about an interesting and undeniably smart guy as well as some lackluster statistics, go for it.\"",
            "review 4: \"22F with Peter Dewan: Pete DeWan is an engaging lecturer and interesting guy if he’s talking about literally anything other than statistics. Not really sure why he’s teaching this course, but I still enjoyed it. He wasn’t great at explaining things, I think because he is too smart to be teaching an intro class. If you take this class, I encourage you took look past DeWan’s social awkwardness and talk to him, you’ll hear some great stories. Our class was also really small which was nice and helped us get to know him. The weekly assignments were at times hard to complete based on what we did in class but he marked them super easily. We also didn’t learn much R which is sort of the point of the class, and the final didn’t have any coding. It’s probably easier than most of the other 10s so I would recommend it.\"",
            "review 5: \"21F with Peter Dewan: Please never take a class with this Professor. This is supposed to be an intro level course that requires no coding experience. Professor Dewan taught at as if you were learning a 4th coding language. Also the pace the course moved at was insane. During the first eight weeks we barely learned anything, so, during the last two weeks Professor Dewan crammed 70 percent of the course load in. You learn very little in class as well, he is not a good lecturer at all. Our final exam was probably was the worst structured exam I have ever seen. He added a question he blatantly said in class he would not add and it was a giant scram for the whole class to finish the exam. Take any other stat course or just make sure Professor Dewan is not your teacher.\"",
            "review 6: \"21F with Peter Dewan: I had high hopes coming into the class since I had done statistics in high school and was interested to learn more. I was thoroughly disappointed as my term became a struggle to stay alive rather than actually get anything out of it. The course is meant to involve intro level coding but Professor Dewan assumed we all had prior experience, then he scrapped coding altogether and made us do the entire course by hand which for most of the equations we were doing was simply criminal. There was no course structure and he taught us majority of the material in the couple weeks before our final exam. The final exam itself was a nightmare. It was 3 hours long and consisted of us having to write almost an entire small book within that time frame and I say that without sarcasm. Please do not take his class.\"",
            "review 7: \"21F with Peter Dewan: This class is below average, but not too difficult. The only work you really had to do were 5 5 question problem sets, a final project, an open note midterm and final. It was virtually no work when we did not have one of these things. He was not a very good lecturer though, so sometimes the problem sets were very confusing as we did not learn the proper coding in order to do the problem set. The final and midterm were medium difficulty, but you could get away with not knowing what you were doing as we get a 9x11 note sheet. I did not take much away from this, I did not learn the coding skills I was hoping, DeWan is a very boring and poor lecturer, and the material is not too interesting, but it is not too difficult or time-consuming of a class.\"",
            "review 8: \"21F with Peter Dewan: Not a great lecturer. You won't learn how to code or use R which makes the class pretty easy. This will hurt you if you want to take any upper-level QSS courses which kinda sucks. If you read the textbook you'll do fine on midterm and final. Classwork is really light and almost minimal.\""
        ],
        "Robert L.": [
            "review 1: \"05S with Robert L.: The small class size was good in that it fostered a very personal environment between the professor and the students in the class. The workload and material are both very manageable, and the subject itself is interesting. Professor Welsch can be described as direct, sometimes to the point of unintentionally offending people. However, I don't think that his distinct style affected the actual class. He is very responsive outside of class, and seems to genuinely want his students to succeed in the material. Overall, a good class to take.\"",
            "review 2: \"05S with Robert L.: Great class for people needing an introduction to data analysis/non-math people. It was simple to understand and Welsch is a great guy who's available out of class; he generally cares about his students. I thought that it would be a pain getting up to get to class by 8:45, but it didn't end up being a problem at all. I highly recommend this class for people looking for a qds or interested in statistical analysis.\"",
            "review 3: \"04F with Robert L.: This was an extremely intimate, small class which allows you more one on one time with the professor and the TA. Homeworks were every class but they take less than half an hour to complete.\"",
            "review 4: \"04F with Robert L.: The subject is easy and the homework is doable, however, Welsch assigns tedious amounts of it that take about 4 hours a night to do. The up side is he is easy to meet with outside of class and eager about the subject.\"",
            "review 5: \"04F with Robert L.: I personally thought this class was pretty interesting. It satisfied my Statistics requirement for government and I learned how to apply mathematics to everyday life. The professor was helpful, the material was pretty easy, and your final grade is primarily based on an independent project of your choice.\""
        ],
        "Michael Herron": [
            "review 1: \"19F with Michael Herron: Michael Herron is a character. The man is a literal genius. Class time consists of the class trying to absorb as much information as possible, but most of the learning (at least for me) came from the textbook. The class is not difficult if you do the work. I've never taken a statistics class before, but I still did fine. He'll let you do the homework in groups of four, but if you do them by yourself you won't even have to study for the tests. The tests are difficult, but if you do the homework by yourself, read the textbook, and get a goodnights sleep before it, it won't be too hard to get an A.\"",
            "review 2: \"19F with Michael Herron: Prof Herron is extremely attentive, diligent, and an engaged professor. The lectures were sometimes a little hard for me to follow because there weren't any slides and none of the lectures were recorded; they followed a train of thought that led up to a main idea that we had to learn and remember, but without knowing much background info, I just ended up being confused for most of class. Doing well requires you to do both the homework and additional studying on your own because the midterm and final tests things that you don't do in the problem sets.\"",
            "review 3: \"19F with Michael Herron: Herron is a genius and I loved the way he explained the concepts in class. The class and exams were more \"math proof\" focused than I thought it would be, so you have to study hard for the exams (proving stuff). Great class if you want a more difficult intro to stats course in terms of how deep you go, but if you're looking for a layup stats class this isn't it.\"",
            "review 4: \"18F with Michael Herron: The class is taught in R and RStudio which is a valuable skill and probably the main reason you should take this class considering how widespread the program is used for data analysis across fields. Herron's a great prof, but his handwriting is illegible on his answer keys for practice tests. Thankfully, for notes in class, he's usually drawing shapes and symbols or writing numbers so it's fine. I think most of the class had taken statistics before in high school, or at least it felt that way, but it's definitely a class that's doable without that background knowledge with some work. Not really a layup, but also not really difficult as a class. Nonetheless, I learned a lot and highly recommend it\""
        ],
        "Peter DeWan": [],
        "Siu Tak James Lo": []
    }
}