{
    "RUSS038.20": {
        "Ainsley Morse": [
            "review 1: \"22F with Ainsley Morse: Couple of short papers, discussion leading, weekly short responses, and final paper. Lots of reading but not necessary. Grading is basically for completion so everyone has an A. Prof. Morse was great and really understanding and one of the best profs I’ve had.\""
        ]
    },
    "RUSS071.01": {
        "Victoria Somoff": []
    },
    "RUSS050.03": {
        "Stuart Finkel": [
            "review 1: \"22S with Stuart Finkel: Solid class, Finkel is very knowledgeable about the history. The 2 tests were very fair. Just make sure you take notes during class and participate a good amount\""
        ]
    },
    "RUSS038.19": {
        "Lynn Patyk": [
            "review 1: \"22S with Lynn Patyk: Professor Patyk drove the class primarily through open discussion and some background information. The majority of the time is spent in open discussion of the assigned reading. The workload is completely manageable; readings were never overwhelming, and written assignments never took up too much time. I would suggest reading some of Chekhov's material before enrolling so you know whether you will like the class, it is a lot easier to engage with discussions if you enjoyed the reading.\""
        ]
    },
    "RUSS038.18": {
        "Jasmina Savic": [
            "review 1: \"22S with Jasmina Savic: I really enjoyed this class. Professor Savic is super passionate and energetic, and the topics discussed were really interesting. Her expectations were very clear and the workload was very manageable. The major assignments consisted of two discussion posts, two essays, and a final project — for which we could choose any subject related to Taboo Russia. I highly recommend this class.\""
        ]
    },
    "RUSS038.17": {
        "Jasmina Savic": [
            "review 1: \"22W with Jasmina Savic: Great class, amazing prof! Would recommend any class taught by Jasmina. Not much work but really interesting content\"",
            "review 2: \"22W with Jasmina Savic: Amazing professor. Very interesting class discussions and not a ridiculous workload. Definitely try to take a class with Savic in your time at Dartmouth!\"",
            "review 3: \"22W with Jasmina Savic: Jasmina is a great professor! She teaches well and coming to her class was always a lot of fun! Definitely recommended as a layup!\"",
            "review 4: \"22F with Jasmina Savic: Literally so easy. Definition of a layup. Just be able to answer the questions that she gives on the class hw and you’ll be fine. Salvic is also so so nice and made us Russian treats one class!\""
        ]
    },
    "RUSS033": {
        "Ainsley Morse": [
            "review 1: \"22X with Ainsley Morse: The course was great. The prof is wonderful, certainly knowledgable about the material and a pretty engaging lecturer. The workload is higher than expected, but by Week 3/4 it's fairly obvious that mostly everyone skims the readings/movies (or maybe it felt quite high to me because the other reviews made me expect a batshit easy layup). Overall, a solid sophomore summer layupy class, but there's a good amount of work before each class. (~2-3 hours maybe)\"",
            "review 2: \"22X with Ainsley Morse: I enjoyed the course, but the workload was not light. The readings took a few hours per class, and we wrote a 2-3 sentence discussion post and a 250-word paper every week. The project, class presentation, and discussion leading were all relatively easy, with little time investment. AM gave feedback on the short papers and commented on the discussion thread. There was no way to track your standing in the class. The first grade we received was the final grade. AM is a solid professor, and the classes are engaging. Some early lectures focusing on historical context may drag a bit, but overall I enjoyed coming to class.\"",
            "review 3: \"22X with Ainsley Morse: Would highly recommend, just as one of the reviews below say, this is a perfect sophomore summer class and perfect lit distrib layup. I’d say keep in mind that it is technically a literature class so there are a hefty/significant amount of readings, movies, poetry, etc. assigned each day of the class, but most people in the class skim/just read one or two of the readings. The assignments structure, from the daily reading response to the weekly one page “Position Paper” allow you to get away with skimming. I came in with no knowledge really of Russia/Russian, but Morse was an energetic and good professor and kept me engaged and I would love to take a class with her again. She does love the movies so if you can watch them, they’ll always be a big discussion topic in class, but if you don’t speak up that is all right as well, the Russian studies students carried the discussion in our class and that was fine. It was a little hard to judge how well you’re doing in the class as Morse doesn’t give out grades until the very end, but everyone does well if you submit things so that’s not a big concern. She does keep track and have a sense of who is showing up to class and who isn’t and it is something that matters to her.\"",
            "review 4: \"21X with Ainsley Morse: Morse is an awesome and very knowledgable professor. The lectures are pretty awesome to sit through and the readings are pretty dope. Even if you come in not caring you'll find yourself reading at least some of the material. 2 very brief reading reflections per week. 3 brief and creatively stimulating short papers (like 1 page). 1 final project where you interview students in Moscow (honestly not bad at all those guys were really fun to talk to). Final exam which is aight nothing too bad about the reading and some of the stuff discussed in class. This may be the perfect summer class. Morse didn't like the mask mandate so we had class outside for the remainder of the term. Seriously, dude, take this class, it's lit.\"",
            "review 5: \"21X with Ainsley Morse: This was so much fun. Take this class for sophomore summer!! The readings are fun and interesting, the projects are not a ton of work and genuinely fun to do, and the prof is super good at lecturing. The perfect summer class!\""
        ]
    },
    "RUSS038.16": {
        "Sean Griffin": []
    },
    "RUSS038.15": {
        "Sergei Kan": []
    },
    "RUSS015": {
        "Stuart Finkel": [
            "review 1: \"23W with Stuart Finkel: Finkel is super based. His class is very interesting and he is a very knowledgable prof. Highly recommend this class.\""
        ]
    },
    "RUSS038.14": {
        "Christopher MacEvitt": [],
        "Sean Griffin": []
    },
    "RUSS007.02": {
        "Stuart Finkel": [
            "review 1: \"21W with Stuart Finkel: I was not super interested in the subject material before taking this class, but Finkel does a decent job making things interesting. If you do some of the readings and meet with him about your papers before writing them its not difficult to get a good grade. He is impressively knowledgeable about the topics and is a really nice guy, so I only have good things to say about this class. Probably not a layup but not super hard.\""
        ]
    },
    "RUSS038.12": {
        "Mikhail Gronas": [],
        "Peter Tse": []
    },
    "RUSS007.06": {
        "Ainsley Morse": []
    },
    "RUSS050.02": {
        "Stuart Finkel": []
    },
    "RUSS037": {
        "Victoria Juharyan": []
    },
    "RUSS050.01": {
        "Stuart Finkel": [
            "review 1: \"22W with Stuart Finkel: Easy grading. Chill professor. Mandatory attendance. Workload is relatively low for a history course. Not a lot of work but you might have to do the readings to do well on the online tests.\"",
            "review 2: \"20S with Stuart Finkel: I took this class online, and I think the class is effective--time was not an issue. Lots of good readings and videos to give a good understanding of Russian culture.\"",
            "review 3: \"19S with Stuart Finkel: This class was a let down in the end. It was more of a survey class and not that engaging. I think Finkel was new at the time and was not used to squeezing everything into a 10 week term. We spent only a few classes on the relationship between Putin and the West today too, so it felt like a lot of build up for nothing to really happen. I would not recommend taking it — just take Russian 10 and you will get the same material but with a better presentation/more engaging classroom environment.\""
        ]
    },
    "RUSS011.04": {
        "Steve Swayne": []
    },
    "RUSS038.10": {
        "Lynn Patyk": []
    },
    "RUSS038.06": {
        "Sean Griffin": [
            "review 1: \"20X with Sean Griffin: The course is a pretty good amount of work. At least 1 movie (usually 2) per week and readings as well as a slack post about the material. He cancelled the midterm project which was nice and graded the final paper very leniently.\"",
            "review 2: \"18F with Sean Griffin: I took this class 18F when Griffin taught it for the first time. The original syllabus was intense but he ended up moving around projects and readings. It was a chill class in the end, I feel like i learned a lot about Russia because he made it an enjoyable learning environment and selected interesting topics for discussion. We had a paper due in the middle of the term but if you went to a guest speaker presentation you got to bump your grade up on that by half a letter. He gave us plenty of time to complete our final paper and was always willing to give guidance. Still one of my favorite classes I've ever taken and would highly recommend taking a class with Griffin.\""
        ]
    },
    "RUSS038.09": {
        "Victoria Somoff": []
    },
    "RUSS007.01": {
        "Lynn Patyk": []
    },
    "RUSS017": {
        "Victoria Somoff": [
            "review 1: \"21S with Victoria Somoff: Awesome class. Lots of fun reading. Awesome professor. Definitely a lay up. 150 word assignments for homework 2x a week and a final and group project. Fairly easy class.\"",
            "review 2: \"21S with Victoria Somoff: Excellent class and a great way to fulfill your literature requirement. Professor Somoff is extremely kind and attentive, and created an overall very fun learning environment. The workload is pretty light, so I'd recommend taking Russian Fairy Tales in a term with a more difficult courseload.\""
        ]
    },
    "RUSS038.08": {
        "Yuliya Komska": []
    },
    "RUSS007.05": {
        "John Kopper": []
    },
    "RUSS087": {
        "John Kopper": [],
        "Mikhail Gronas": [],
        "Victoria Somoff": []
    },
    "RUSS086": {
        "Victoria Somoff": []
    },
    "RUSS085": {
        "John Kopper": [],
        "Lynn Patyk": [],
        "Mikhail Gronas": [],
        "Victoria Somoff": []
    },
    "RUSS071": {
        "Lev L.": [
            "review 1: \"07W with Lev L.: Professor Loseff isn't out to get you -- he makes this class and its broad aims relatively accessible, so long as you put in a pretty good amount of effort on the reading and following along in the subject matter. There were students of varying language skill levels, so it was tough to accommodate them all -- some probably were bored, some stressed out and uncomprehending. But overall, Prof. Loseff gives a good rundown of key themes from great Russian literature. The reading concentrated on poetry, which made translations easier (nothing longer than a couple pages, really). The papers were sometimes tough, being in Russian and all, but you have a chance to go over them with the professor before you present them (read them aloud in class), so they end up going ok usually. Some people think Loseff goes through things a bit slow, but it's very helpful to ensure comprehension, and it's obvious he knows what he's talking about, so he will get his point across. Plus, it's just fun to hear him recite the poetry sometimes, too. Also, Misha Gronas stepped in for a few class, and it was a good change of pace. In general, I feel I learned a good deal about Russian literature in its native language, and feel more in touch with the traditional Russian canon.\"",
            "review 2: \"06W with Lev L.: Theoretically, this is a great course. The readings are extremely interesting. Professor Loseff is really knowledgeable--ask him a question and he has an answer. The problem is that hte answer to this question will take 20 minutes to explain. Thus, lectures are interesting, but can become tedious and sometimes boring. In this way, the lectures don't really reflect the knowledge of the prof. We read amazing poetry, but spent little time analyzing it, and more time just talking about the poets' lives--Okay, but after a while, kinda boring. If you have a chance to take a class with Loseff, you should. But I think it may be better with another prof.\"",
            "review 3: \"05W with Lev L.: the class was really good, but there wasn't actually as much discussion of the readings, which sometimes made the time spent on translations seem futile... prof. loseff is incredibly knowledgable regarding pushkin and russian lit, but is not a particularly engaging lecturer. if you are will to pay attention and listen for substance not lecturing-pizzazz, you'll especially gleen a lot from the course.\""
        ],
        "Victoria Somoff": [
            "review 1: \"19W with Victoria Somoff: Good class for culminating experience for Russian majors. Not easy, but fairly interesting seminar. As long as you put an effort you will get the grade you want.\""
        ],
        "Ainsley Morse": [],
        "Deborah Garretson": [],
        "Mikhail Gronas": []
    },
    "RUSS048": {
        "Deborah Garretson": []
    },
    "RUSS042": {
        "Alfia Rakova": [
            "review 1: \"11F with Alfia Rakova: Course: Class was well-structured and tied together a lot of different aspects of previous Russian language classes. Professor: Prof Rakova is the best ever. Workload: Don't get behind on work because it builds up fast, but if you keep up then it's fine.\"",
            "review 2: \"07F with Alfia Rakova: Professor Rakova is a blessing to the department! She's a really great teacher, her style is effective, and she's interesting to talk to. She expects a lot, but isn't a tough grader. Take any class with her and I'm sure it'll be great!\"",
            "review 3: \"07F with Alfia Rakova: One of my favorite classes at Dartmouth. Rakova is a great prof and the class was super interesting. Lots of attention paid to speaking and writing. My Russian improved a lot.\"",
            "review 4: \"07F with Alfia Rakova: This course was so much more than a grammar course. We watched and discussed three very interesting russian movies. The class was a lot of work, but it was also exciting because you could feel yourself making progress with russian. Prof Rakova is fantastic; she has clearly put a lot of effort into organizing this class, and she made the classes fun and interesting.\""
        ],
        "Jamilya Nazyrova": [
            "review 1: \"06S with Jamilya Nazyrova: Nice, low-key class; touches up your Russian without taking up all of your time. Perfect for senior spring.\"",
            "review 2: \"05W with Jamilya Nazyrova: russ 42 was pretty laid back. we had no quizzes or exams, just papers (4 total) and homework. classtime was usually devoted to grammar and review of readig assignments. mila is very helpful and goes out of her way to make sure you understand. this was probably the best russian class i've had at dartmouth.\""
        ]
    },
    "RUSS041": {
        "Ainsley Morse": [],
        "Alfia Rakova": [],
        "Valentina Apresyan": []
    },
    "RUSS038.05": {
        "Victoria Somoff": []
    },
    "RUSS038": {
        "Victoria Somoff": [
            "review 1: \"08F with Victoria Somoff: Professor Somoff is great. She's incredibly nice and smart.\"",
            "review 2: \"08F with Victoria Somoff: This was an awesome class - there were about 15 of us so it was largely discussion based, and we read about a play each week with brief homework assignments (graded solely for participation) each class. In terms of major evaluations - we had two 5-7 page essays analyzing film productions of the plays we were studying, and for our final project we put on a play as a class. All in all, there wasn't a huge time commitment, it was a really nice change from other classes, and putting together a play as a final project was a great contrast to finals & essays. Professor Somoff is also wonderful - very nice and very enthusiastic.\""
        ]
    },
    "RUSS036": {
        "Lev L.": [
            "review 1: \"08X with Lev L.: That's right. Professor Loseff is leaving, but if you are thinking of taking this class in the future, it requires you to read War and Peace, Anna Karenina, Death of Ivan Illych, and The Kreutzer Sonata. A LOT of reading, but A LOT of knowledge and culture. Great course for the summer term, but you must prepare to read, or get an easy prof such as Loseff, which I doubt. He was like one in a million.\"",
            "review 2: \"07X with Lev L.: This is a very elementary lit course and thus is probably great for non-lit majors. One easy midterm (for the essay portion you had the option of writing an essay or a short story), 10-minute presentation and 3,000-3,500 word final paper. Lectures are boring but discussion does get very interesting, and the prof is a sweetheart.\"",
            "review 3: \"07X with Lev L.: War and Peace and some of the short stories are great the best part of the class is Professor Loseff. He wrote the definitive biography of Brodsky, is a friend of Solzynitzin, etc. Could not find a guy who is better connected to the Russian literary scene.\"",
            "review 4: \"07X with Lev L.: Don't get me wrong, Prof Loseff is a great guy--sweet, funny and charming. However, his lectures were often BORING and rarely got deeply into the books that we were reading. English isnt his best language, so he would often stumble over his words, but he is clearly an intelligent man. However, he would spend half of a lecture (it was a 2a) taking about some vague topic like why War and Peace is an epic, and then we would watch a movie for the second half of the class. Towrads the end of the term, students would present presentation we worked on. This class medians at A, and thats what most students got without having read ANYTHING. There is one midterm, a paper and a presentation, and he grades easily on all three. If you want an easy sophomore summer class, take this, but it will be a waste of your time.\"",
            "review 5: \"06X with Lev L.: This was the perfect sophomore summer class. The only books we ready were War and Peace and Anna Karenina and the pace was moderate- usually around 150 pages for the next class. The grade was based on a midterm (10 IDs from a list of about 30 that he gave before, and a general essay), 20 min oral report, and a 15 page final paper. Everything was graded pretty easily so all you needed to do was come to class, read the books, and do a bit of research. Prof. Loseff was actually very funny and obviously knew the texts well and loves them. Sometimes I wished we focused a little more in depth on some sections of the books but no real complaints. Definitely take this class!!!!\"",
            "review 6: \"06X with Lev L.: As a slow reader, this class did consume a fair amount of sophomore summer. You read War and Peace in 4-5 weeks and Anna Karenina in 2-3, which is a fast pace. But the books are amazing and I have no regrets. Loseff gives interesting background information and weaves in several film versions of the books. He knows the material very well, is approachable, and a good lecturer. The only gap in the class is discussion. The reading is so enormous that it's hard to digest enough for discussion, but Loseff still could encourage it more. Do not take this class unless you are seriously interested in Tolstoy. If you are, take it, savour it, and don't be afraid to interupt Loseff and start a discussion.\"",
            "review 7: \"06X with Lev L.: Prof. Loseff is by far the best professor I've ever had. If you can take a class with him, do it, even if it's about Tolstoy.\""
        ],
        "John Kopper": [
            "review 1: \"18F with John Kopper: One of the best courses I've taken so far. You read War and Peace along with several of Tolstoy's stories and novellas and it amounts to a lot of reading, but you are pretty much guaranteed to enjoy it. Two 1500-word essays, one 3000-word final essay, with some pop quizzes throughout that are easy if you did the reading. Prof. Kopper is a bit out there, but extremely intelligent and makes class interesting every day. His grading is pretty easy, just do the reading and put an ounce of effort into the essays and you'll be fine.\"",
            "review 2: \"02X with John Kopper: I had rather disliked Tolstoy before, but heard that Prof Kopper was exceptional~ the combination of the enthusiastic instructor and melodramtic writer-genius made for a fascinating course\""
        ],
        "Lynn Patyk": [
            "review 1: \"22W with Lynn Patyk: This class had wonderful readings, but honestly you can read them on your own and you'll get the exact same thing. The class was pretty useless, boring and not well instructed.\""
        ],
        "Richard R.": [
            "review 1: \"01F with Richard R.: I learned a phenomenal amount in this class: I never would have thought it possible to learn so much about Tolstoy in ten weeks. The reading is fantastic, and Professor Sheldon, while unenthusiastic at times, is probably the nicest professor at this school. His attitude gives the class a truly positive feeling that made me enjoy going to it, and he is incredibly knowledgable. I highly recommend this class (P.S.: it works great for the out-of-department requirement for the English major!).\""
        ],
        "Victoria Juharyan": [
            "review 1: \"19F with Victoria Juharyan: I loved this course. Professor Juharyan is such a sweet person and you can tell how knowledgeable she is about the material and how passionate she is about it. There was very little submitted work for the course. We had 5 discussion prompts that we had to submit throughout the term about the reading and a final 10-12 page paper. There was, however, plenty of reading. This course definitely earns its LIT distrib denotation. We read War and Peace over the course of five weeksand during the other weeks we read Tolstoy's short stories and novellas. It was also very interesting, you do get very philosophical in this course.\""
        ],
        "Mikhail Gronas": []
    },
    "RUSS035": {
        "John Kopper": [
            "review 1: \"09W with John Kopper: This was a good course and Professor Kopper really knows his stuff. There's a lot of reading involved, but if you like Dostoevsky and you like books then you won't mind. It's not too much. The prof did kind of assume that we were all American (when contrasting American history and literature and psychology with Russian), which I found a bit annoying because as an international student I don't actually know much at all about American stuff. However, it wasn't a big deal-- just a couple of the classes at the beginning of the term. I learnt a lot in this course. It was a bit intimidating sometimes because the prof is so knowledgeable and seems to expect a lot, so there were some awkward pauses during discussion. Still, I'm glad I took this course. If you like Dostoevsky, then go ahead.\"",
            "review 2: \"07W with John Kopper: This class was my favorite I have taken so far. The pace of the class is quick and at times it's difficult to keep up with the reading, but the novels and short stories are awesome and you'll want to read everything that is assigned. Professor Kopper has a great sense of humor and his lectures are very interesting. If you like film, you'll enjoy watching the three films he includes in the course. In addition to learning a lot about Russian, Russian literature and Dostoevsky, I think that my writing improved as a result of taking this class. There is no final for the class, and you do most of the work before the last two weeks of the term, which is really nice.\"",
            "review 3: \"07W with John Kopper: This is an awesome class for anyone who might like Dostoevsky. The readings are the best. The prof is a perfect dostoevsky prof, kind of eccentric, helpful in explaining the material, and also very responsive to students in class discussion. in fact most of the class was just class discussion. the amount of reading was fine, and the papers were reasonable and even interesting. highly recommended.\"",
            "review 4: \"07W with John Kopper: Kopper is brilliant. Dostoevsky is amazing. This was one of the most entertaining and interesting classes I have taken at Dartmouth. The readings are COMPLETELY NECESSARY but the only ones I really kept up with all term. I wish the class wasn't mostly filled with people who felt that they were above class discussion.\"",
            "review 5: \"07W with John Kopper: The readings are fabulous, the prof is quirky and chill. The structure of the class is pretty laid back--lots of discussion, some reading quizzes, a couple papers. If you're looking for intense background on Dostoevsky and Russian lit, you might be a little disappointed because it's almost entirely discussion-based. The two main papers are due in the first half of term, which was a) nice because the end of term was veeery relaxed, b) stressful because he didn't give us the questions very far in advance. Also, you get to write a parody of Dostoevsky, which is REALLY FUN. Take the class for its chilled out atmosphere, good books, and good discussion. You'll also find it even more relaxed if you start doing the reading before term starts so you're not scrambling to get it done in time.\"",
            "review 6: \"07W with John Kopper: but its good reading. i'd rather read 200 pages on crime and punishment than 40 of academic gibberish. kopper is a cool guy, class discussions are good, no tests just short quizzes, papers graded very reasonably\"",
            "review 7: \"07W with John Kopper: John Kopper was a wonderful professor, and while the reading couldn't be anything but heavy, the load was bearable.\"",
            "review 8: \"07F with John Kopper: You read 3 huge tomes and 2 shorter ones. Incredibly difficult to all fit in and be prepared for class. he gives pop quizzes once a week. Not difficult, he just expects you to do the readings, and if youre behind youre in really big trouble. Stay on top of the material. Apart from the massive amounts of readings youre going to be doing each week, he also likes to add to the pile by giving you critiques on Dostoevsky to read. But he is a nice teacher, approachable. the lessons are based on discussion of the weeks readings. 2 10 page papers, a book review on a critique and no final or midterm.\"",
            "review 9: \"07F with John Kopper: Books = great. 2 10 page papers, parody, and book review = not a heavy work load (plus all papers are done by Thanksgiving). Class = not inspiring. I didn't feel like I learned anything from attending.\"",
            "review 10: \"07F with John Kopper: Dostoevsky is hands down an author that everyone should read in college. \"Crime and Punishment\" became one of my favorite books as the term went on, and I'm still chewing on some of the themes in each of the works we read for class. Professor Kopper is fascinating in his wealth of knowledge about Dostoevsky. The class is a scattered mix of lecture and discussion, but somehow it kind of pulls together nicely. I left intrigued by his questions, and the class developed a great camaraderie. My only complaint is that the second half of the course's title is \"The Problem of Evil.\" That seems a little misleading, as we didn't get into any great questions of theodicy in a class that deals with a devoutly Christian author. But if you want to learn about Dostoevsky, look no further than this course.\"",
            "review 11: \"07F with John Kopper: okay...i believe that i did 35% of the reading in this entire class though the class was interesting. i just didnt have time to do the reading. i listened carefully in class which hleped for the papers but without during the reading sometimes, i didnt do so well on the pop quizzes, which werent really pop because he gave them out the 2nd day after beginning a new book and every thursday thereafter...easy grader i will admit sometimes i felt the grading was really arbitrary prime example- i didnt read more than 100 pages of crime and punisment and did a 10pager in one day--got an awesome grade..same for my IDIOT paper however, the very last paper that i had written toook me a freakin week and what did i get?..im ashamed to even answer however kopper is a nice guy and easy to approach, you'll have fun in the class except for those awkward silences that seemed to cloud every class oh and its a 2A--HELL\"",
            "review 12: \"07F with John Kopper: Since the course is on Dostoevsky, all the novels you read are by him, and therefore ridiculously long and dense. The amount of reading assigned every class was a lot, but tolerable. I would definitely suggest getting a head start on some of the books before the term even started, though, just to make your life easier. There's no final, and the 2 10-page papers Kopper assigns have a lot of freedom, and he's not that hard of a grader. He's a great prof, really engaging, and he let the class dictate how the discussion moved. Overall, definitely worth it--a really interesting course, and even though the readings are tough, you'll be proud to say you read Crime and Punishment, The Idiot, and The Brothers Karamazov all in one term.\"",
            "review 13: \"04F with John Kopper: This class was truly pitiful. Kopper tries to take a theoretical approach to Dostoevsky's work, thus focusing on insignificant details and their ramifications. If you want a professor that knows how to teach, then this class isn’t for you. The class is taught like a seminar, which is a huge pedagogical dilemma, because none of the students ever have anything worthwhile to say, even though they all think they do. Kopper loves to call on people for ideas, but nothing concrete is ever established. Nobody in the class ever seemed to say anything worthwhile/informative, including Kopper himself, who did not give one effective lecture. Because Kopper is inept the class was forced to watch terrible adaptations of Dostoevsky's work on several occasions. These adaptations would have been acceptable had they pertained to the discussion or the lectures, but it seemed as though Kopper needed to fill class time and he could think of no better way. The assignments are absolutely absurd and because of the 10 week term students are forced to read 250 pages/class. Dostoevsky is a good read on occasion, but his prose is jejune (to say the least), and for this reason reading his major works back to back to back is like pulling teeth.\"",
            "review 14: \"04F with John Kopper: Kopper is pretty funny - he likes to crack rye jokes in the middle of lecture and is consistently attentive to students' opinions. If you do the reading (which there is alot of, Crime and Punishment, Underground, Idiot, Brothers K) you'll be totally fine. Excellent class.\"",
            "review 15: \"04F with John Kopper: its a pretty interesting class if you like literature. the papers are excessively long for lit papers but the reading is very interesting and kopper's very well read on the subject and provides some very interesting insights. its not a class you can fall behind in, its hard to catch up again if you do. its a lot of reading\"",
            "review 16: \"04F with John Kopper: The course, subject, lectures, essays, etc. were all very well executed. The only problem is that it was v. hard to keep up with the reading.\"",
            "review 17: \"04F with John Kopper: The books we read were incredible, but the reading was very fasted paced and the papers came right on top of each other. professor kopper is interesting and distinct and inspired interest in the subject, but while some lectures were helpful and insightful, he too often lapsed into class discussion that consisted of the same 6 people talking while the rest of the class watched on in boardom. two ten page papers, a five page book review and tons of reading. conclucion: unless you're a russian or lit major, just read the books on your own.\"",
            "review 18: \"04F with John Kopper: This is without a doubt the best class I have ever taken at Dartmouth. Prof Kopper gives fantastic lectures, and also knows how to lead really good, informative class discussions, where everyone has his say, yet no one takes over. I got so much out of this class--I would take it again in a minute. Yes, there is a lot of reading, and you are quizzed on it constantly, but the quizzes encourage you to read Dostoevsky very carefully and get more out of it. Kopper grades fairly--if you put in effort, you will do fine. And he's just an awesome guy. Take any class you can get with him.\"",
            "review 19: \"04F with John Kopper: I took this course to read some Dostoevsky, and boy did I ever. The reading gets pretty intense as work in other classes picks up. It's fun though, and reading quizzes and really interesting lectures and class discussions force you to keep up with it. People told me that this class was intended for people who had already read the novels, but that is not the case. The papers were fun to write and were graded strictly but fairly. As far as the problem of evil goes, it was not a focus of the course. Prof. Kopper knows and inspires interest in the material, and looks for feedback from the students. Regardless of your major, take advantage of being at a liberal arts college and take this course!\"",
            "review 20: \"04F with John Kopper: Professor Kopper is good, the class is interesting, and I think Dostoevsky is a really fascinating author despite his reputation to be rather dry. The only problem I had was the bookish-ness of the professor and participatory section of the class. As a literate but unread engineering major, I was frustrated when the class started talking about which famous (but not to me) authors are most \"experimental\" or whether Dostoevsky's character was like King Lear or not. It seemed like I could get pretty good grades and participate somewhat with my knowledge and english skills, but I couldn't quite reach the level that he often holds class discussions or makes comments on your essays. But all in all, a good class, I enjoyed it, and the not quite cutting it should have been expected cause I'm not an english major and have no desire to be. Take it especially if you like to read and be artsy and literary, otherwise it's still a good class just be ready for people to go over your head sometimes.\"",
            "review 21: \"04F with John Kopper: This class is worth taking just for the readings: 3 of Dostoevsky's best novels and very little non-fiction. Occassionally, the class discussions get a little tedious because Prof Kopper lets the discussions remain very open, and sometimes I wished that he would lecture more. Kopper also brings in several films of the books he teaches, which are good supplements to the discussion. Overall, he is a great prof, has a terrific sense of humor, and brings in Russian baked goods at the end of the course.\"",
            "review 22: \"04F with John Kopper: Kopper's the man and so is Dostoevsky. Expect to do a lot of reading in a pretty short time but enjoy it.\"",
            "review 23: \"04F with John Kopper: I'd take it again in a minute\"",
            "review 24: \"04F with John Kopper: This class made me think a great deal. The novels inspired both intellectual and emotional reactions. The professors is an experienced literature professor and a true professional. Not only did he take a very interesting professional approach to the class and raised very interesting issues in class, he also introduced us to literary theory and criticism. This was quite the unique experience because Russian literature classes at Dartmouth generally steer clear of liteary theory which is a great loss in my opinion. The papers were tough but rewarding in the end. If you showed that you were thinking, you were rewarded! The reading is so wonderful that this was my first class at D where I read everything! Kopper gives these quizzes on the reading which tend to be annoying but they force you to keep up with the reading. Great class!\"",
            "review 25: \"02W with John Kopper: In this course you read Doestoevsky's great works. His books are long, so it takes a while to do the reading, but he's the most insightful writer I've ever read plus his long books are basically just murder mysteries. Professor Kopper is very intelligent, thoughtful and completely entertaining. He has a tendency to show bad movies during class, but he has an even stronger tendency to feed his students cookies and russian baked goods. I recommend this course to anyone who enjoys reading.\""
        ],
        "Mikhail Gronas": [
            "review 1: \"05F with Mikhail Gronas: If you're not a Slavophile, don't even bother with this.\"",
            "review 2: \"05F with Mikhail Gronas: I came into this class having read a Dostoevsky novel or two, knowing nothing about Russian history, and not really caring about the subject either. Somehow, Misha managed to make 19th Century Russian history incredibly interesting, managed to reconcile his brilliance with our naive observations about the books, and also taught us a ridiculous amount about the material. The class had little to do with \"the problem of evil,\" and more to do with just devouring Dostoevsky's major works and having group discussions about each one. The reading's a little heavy at times, but never too painful and never frustrating or boring. A lot of people (namely, me) didn't even read some of the books, and did fine in the class. In the end, this class probably would have been a lot worse if it weren't for Misha being such a great teacher, and I'd honestly encourage you to take any of his classes.\"",
            "review 3: \"05F with Mikhail Gronas: The class really helped my understanding of Dostoevsky and above all was extremely interesting. The class was almost exclusively discussion of D's works. The prof was very knowledgable, though generally focused on the student's ideas rather than expressing his own. There is a lot of reading, but the actual graded assignments werent too difficult.\"",
            "review 4: \"05F with Mikhail Gronas: Wow. Dostoevsky is an unbelievable writer. He is one of the best writers ever anywhere in history. He is really evanhanded too, he doesn't preach but rather explores how people interact in the most extreme and fascinating circumstances. If you like world literature, this course is a must. It is alot of reading certainly but it is worth it. And there is only one long paper.\"",
            "review 5: \"05F with Mikhail Gronas: One of the most fascinating classes I have taken at Dartmouth. Gronas is an amazing prof and the books you read are great. I would especially recommend this class for anyone interested in philosophy or literature\"",
            "review 6: \"05F with Mikhail Gronas: Professor Gronas is aweseome; he has a good sense of humor (he does lots of understatements). He really knows his stuff, and by 2 weeks in, has gotten the class to think like Dostoevsky. Not everybody will like the readings, and there is a lot of reading because of the nature of the class. And by the time you get haflway thru THE IDIOT, most people in the class were kinda sick of Dostoevsky--however, The Brothers Karamazov gets people interested again.\"",
            "review 7: \"03F with Mikhail Gronas: This is one of those classes where the prof would make it enjoyable or miserable. I wouldn't say it was miserable but the class was dull and the discussions were poorly led. Dost. can be great to read with people who are interested and a leader that can guide discussion but discussions often resorted to plot summary. Wouldn't recommend the course.\"",
            "review 8: \"03F with Mikhail Gronas: Even if you go into this class with very little background (or interest) in Russian , you'll leave the class with a full appreciation for the intellectual, literary, and cultural aspects of late 19th century Russia. The scope of this course extends far beyond Dostoevsky's texts; be prepared to discuss everything from religion to economics to contemporary intellectual and political movements.\"",
            "review 9: \"03F with Mikhail Gronas: This course was a really interesting lit class to take. We read most of Dostoevsky's literature and read additional works/biographical material for the presentation and final paper. It's not a lot of work if you read the books over the summer. I definitely learned a lot from this course, particularly about philosophy, Orthodox Christianity, and Russian culture. Prof. Gronas is a good prof, although some of the lectures seemed disorganized. The discussions in class we probably the best part about the class, and made coming to class worthwhile. I would recommend this, especially for non-majors.\""
        ],
        "Lev L.": [
            "review 1: \"02F with Lev L.: An interesting class with a great prof. If you are inerested in literature or philosophy or even russian culture this is a class you should take.\"",
            "review 2: \"02F with Lev L.: Dostoevsky wasn't known for his brevity, so be prepared to read a LOT -- in fact, order some of your books to read over break before the class starts. You'll struggle to find time during the term, but the readings are friggin' awesome. There should be more classes on novels you can't put down. Loseff left for a conference for two weeks, so the Idiot got shafted, but his lectures when he was here were amazing. This course may make you reevaluate your life; or, if you're already a grounded cynic, you will at least read some great books and learn something.\"",
            "review 3: \"02F with Lev L.: An incredibly thought provoking class. It's quite hard to stay on top of the readings, but they're really engaging. Dostoevsky's works force you to think about massive, all important topics, and Prof. Loseff does an excellent job of providing the historical and literary backdrop for your contemplation.\""
        ],
        "Lynn Patyk": [
            "review 1: \"22F with Lynn Patyk: Professor Patyk is an amazing prof and honeslty animates the lectures so much. The class is a lot of discussion and the grading is spread out in a way that you can be fairly assessed on everything, presentation, test-taking, essays, so its overall such a great course\""
        ]
    },
    "RUSS032": {
        "Victoria Somoff": [
            "review 1: \"22W with Victoria Somoff: Sweetest prof, chill course, flexible research project that was not too challenging. This course was especially interesting to take during 22W because Somoff is Ukranian and Russia's invasion of Ukraine made us think of the Russian literature we were reading in an entirely different light. 100% recommend, Somoff is the best! Trying to take another class with her in the future.\"",
            "review 2: \"12S with Victoria Somoff: Course: The course was very interesting, read a wide variety of 20th Century Russian lit, ranging from the end of the 19th century to basically the Brezhnev Stagnation period (with Erofeev's Moscow To The End Of The Line). Final paper also allowed for expanded research in interests, not just limited to lit, but also to music and movies. Professor: Professor Somoff is pretty cool and was pretty interesting most of the time, although sometimes her lectures kinda dragged on, and given that it was a 10A, it just made me more tired at times. But definitely a good prof. Workload: The workload was easily manageable.\"",
            "review 3: \"09W with Victoria Somoff: This course wound up being way more work than I needed. We had fairly long readings and substantial writing assignments for each class, along with a presentation, 8-10 page paper, and exam during the final week of the term. That said, it was still a solid course - many of the works we read were pretty good, and the in-class discussions were often interesting. Somoff is good discussion leader, and I liked her once I got used to her accent. It seems she's a pretty easy grader too, so maybe I put in more work than I needed to.\"",
            "review 4: \"09W with Victoria Somoff: This was an amazing class. The readings were diverse and interesting, Somoff is brilliant and super-nice, and your mind will be expanded. A background with Russian history/culture helps but is by no means necessary to learn things and appreciate the class. I learned a lot about Russian history & literature that I didn't expect to, but am glad I did. There is a lot of work required to keep up, especially annoying blackboard discussion posts, but the class discussions and topics you cover are totally worth it. Somoff is chill but intellectually stimulating, an excellent prof. If you have any appreciation of Russian history & literature, even if you can't speak the language, this will be a great class for you!\""
        ],
        "Mikhail Gronas": [
            "review 1: \"06W with Mikhail Gronas: I had no idea what to expect with this course, and was completely intimidated to discover that the majority of other students in the class were seniors. Regardless, this ended up being my favorite class so far (of the 6 I've taken). The readings were really interesting, especially in the historical context of Russia, but more importantly, Prof. Gronas is an amazing professor. He doesn't mark too hard, and he makes the material really interesting and relevant. Whether you need a literature credit, or you're just looking to take a really fun and interesting course, take this.\"",
            "review 2: \"06W with Mikhail Gronas: lots of interesting reading\"",
            "review 3: \"06W with Mikhail Gronas: I loved this class. I readings were great and Misha is a nice prof. There's a fair bit of reading and you get quizzed periodically, so you have to keep up, but the texts are so great it's not a problem.\""
        ],
        "Sara L.": [
            "review 1: \"07W with Sara L.: Sara is genuinely a wonderful person. Our class was really small and she took an interest in everyone in it and remembered things about us. She even blitzed us personal, friendly blitzes during the term, not about anything specific but just to put it out there that she wanted to get to know us. She is really young (D'98) and has such passion for the subject that it is contagious. As for the class itself, I really liked it but it is heavy in reading. The books ranged from very realistic to mystical so there was something for everyone and I really was able to see how it fit into the historical context. The blackboard discussion board was used extensively for response paragraphs for every book (still not sure how this was graded) and for feedback. The majority of the grade is based on a 7 page midterm paper, a 10-12 page final essay, and a creative project (anything from a song, drawing, music, powerpoint, etc.). The grading was fair and relatively easy. I'd definitely recommend this course, or any course with Sara for that matter!\"",
            "review 2: \"07W with Sara L.: The best part of the course was the reading list. It's a pretty hefty load, but it's good stuff so goes down pretty well. It's varied, so some books will strike you more than others, but overall, the reading kept everything interesting. If you don't do much of the reading, you won't get nearly as much out of the course, though you might be able to squeak by ok. The papers / assignments were pretty loose, so good freedom to explore what interests you. The professor is new, but very enthusiastic and approachable. Also, very knowledgeable about the subject.\""
        ],
        "Ainsley Morse": [],
        "Lynn Patyk": []
    },
    "RUSS031": {
        "Lev L.": [
            "review 1: \"05S with Lev L.: So after the midterm you can pretty much ignore the syllabus and work on your termpaper/presentation, and you should, since i have to write my termpaper for thursday and haven't started yet (today is tuesday). The reality is that i'm only writing this to procrastinate, and i'm really unhappy about that realization. loseff is sort of a bore to listen to, his monotone kills me although its extraordinary how much he knows. At times he can be really interesting, but for the most part he puts me to sleep.\"",
            "review 2: \"05S with Lev L.: Lectures were overall really boring. The readings were excellent...you get to read Anna Karenina, Crime and Punishment, some of Chekov's works, some of Gogol's works, etc. There is a lot of reading and there is one 15 page paper, a 30 minute oral presentation, and a midterm. Definitely do-able...and required for the major, minor, LSA.\"",
            "review 3: \"05S with Lev L.: great reading material, Loseff is awesome but he concentrated more on the historical aspect of the literature than the course description (and he himself on the first day of class) said he would. Overall you learn a lot about wonderful books. he speaks softly, though, with a thick russian accent, so drink coffee before attending class.\""
        ],
        "Victoria Somoff": [
            "review 1: \"21W with Victoria Somoff: Wonderful class. The professor is the best I have met at Dartmouth. She is so sweet, so kind, so smart, so loving, just the best person ever. Assignments were fun. Workload was a breeze. And you actually want to do the readings! Discussions were great and so enjoyable! Take any class with Professor Somoff!!!!!!!!!!!!!\"",
            "review 2: \"21W with Victoria Somoff: Great class. Professor Somoff is a wonderful person. The discussions were thoughtful and engaging, the readings were interesting, the workload wasn't too bad, and the overall class was very relaxed. It was almost like a book club, of sorts. Kinda just went to class, did the readings, and hung out. 10/10.\"",
            "review 3: \"21F with Victoria Somoff: Somoff is an amazing professor, so sweet and understanding and also makes discussions about the works quite interesting. This class is a layup grade-wise, but there are actually quite a lot of readings you have to do multiple times a week but they arent very dense.\""
        ],
        "John W.": [
            "review 1: \"07S with John W.: Professor is unclear about the coursework expectations, which will change over the course of the term. Professor doesn't understand that you can make students do work, but can't make them be enthusiastic about doing it. The discussion board was not a good idea.\"",
            "review 2: \"07S with John W.: Narins returned papers weeks after we turned them in with vague grades. A discussion board is a requirement of the class. Participation is 15% of the grade and sometimes it's difficult to talk to him if you have a different opinion because he's very confident that he is right.\""
        ],
        "John Kopper": [
            "review 1: \"09S with John Kopper: A good class, because the readings are interesting, movies are included to supplement the readings (or just take a break!), and the professor teaches well.\""
        ],
        "Mikhail Gronas": [
            "review 1: \"03S with Mikhail Gronas: If you dont know any Russians, it might be hard for you to understand Gronas' accent at first, but tis nto a big deal. the class was fun, had a relaxed atmosphere and wasnt too hard. the hardest part was keeping up with the readings. if you have a chance, try to read things ahead fo time, because especially around and after midterm, things get busy and you tend to end up neglecting readings. sure, you can BS yoru way throguh classes without reaidng, but the quizzes are based on plotline, and its hard to particiapte and really understand the class discussions if you havent doenm all the reaidngs (i knwo form experience) there a few quizzes and one big research project that he lets you choose the topic for. I'm a studio art major so he let me do a project about illustrations for Crime and Punishment and part of my paper was to do my own illustrations. it was also interesting because you get to learn about the famous Russian authors and who they knew etc.\""
        ],
        "Victoria V.": [
            "review 1: \"06S with Victoria V.: This was definitely one of my favorite courses at Dartmouth. I knew very little about the subject before taking the class but I left wanting to become a minor in Russian studies. The reading assignments were just at the right pace- it was a good amount of reading per class but nothing too bad. The class is very discussion oriented though so it was important to keep up but it wasn't hard because the books were so fascinating. Prof. Sevastianova is great- she is so funny and knows so much about Russian lit. She really cares about what the students think of the works. The grade was based on two short \"reaction\" papers, one 10 page research paper, attendance + participation, and a final take home exam. Everything was graded pretty fairly and it was spaced out just enough. I really loved this course and recommend it to everyone! It'll definitely spark your interest in Russia and Russian lit!\""
        ]
    },
    "RUSS029": {
        "Alfia Rakova": [
            "review 1: \"11S with Alfia Rakova: Course: It was interesting, thought-provoking, and we learned a lot of Russian. Professor: I have never had a professor better than Rakova. She could lecture about dust bunnies and make it fun. Her style of teaching, her way of relating to her students, how she motivates you to really do your best--she is just fantastic. Workload: Not too much, not too little.\"",
            "review 2: \"08S with Alfia Rakova: Russian intermediate level 3, pretty much the last definite language class in the department. Prof. Rakova is the best thing about the class. It's her first year teaching here and she's just great. She livens the class up, talks to everyone, and makes sure everybody participates. She teaches things that are actually useful. Everything she taught in the class is actual relevant Russian, not some encyclopedia style language that isn't used by natives. She also remembers to add common phrases and idioms you wouldn't pick up on your own. She's always available for office hours and is very friendly. In my opinion, she should just become head of the department because she's clearly the best prof there.\""
        ],
        "Jasmina Savic": [],
        "Valentina Apresyan": [],
        "Victoria Somoff": []
    },
    "RUSS028": {
        "Jamilya Nazyrova": [
            "review 1: \"06W with Jamilya Nazyrova: really learned a lot\"",
            "review 2: \"05W with Jamilya Nazyrova: nobody reads these things for language courses because either you have to take the class or you don't... ...but Mila is awesome. The class is fun. And the work isn't too bad. And the Russian dept. grading curve is very nice indeed.\"",
            "review 3: \"05W with Jamilya Nazyrova: Russian 28 is definitely better than 27. We only used one textbook, adding focus and clearity to what we studied. The focus was more on speach and practice, even though the class was all about grammar. Journals, oral presentations, and more class discussions replaced written tests - a definite improvement. Mila also did an awesome job mixing multi-media into the class (including some quality kino songs and multfilm clips). We also read cheburashka (not exactly tosltoy, but still fun). If you did 27 and are wondering if 28 is worth it - it is!\""
        ],
        "Alfia Rakova": [
            "review 1: \"11W with Alfia Rakova: Course: I recommend it. It took me about until this class to really be able to have conversations about real things in Russian, so this class was neat because our class discussions got pretty lively. Professor: Rakova is always pretty patient and encouraging, but she will also push you to do better if she thinks you can. I highly recommend taking any class Rakova is teaching. Workload: The workload in Russ 28 was better than in 27 in terms of being able to stay on top of assignments.\""
        ],
        "Valentina Apresyan": []
    },
    "RUSS027": {
        "Alfia Rakova": [
            "review 1: \"22F with Alfia Rakova: This was my most time intensive class this term, but if you put in the time you will get an A. Professor Rakova is always available to help you out and she wants to see you succeed.\"",
            "review 2: \"22F with Alfia Rakova: Best prof on this campus. A lot of work but easy to get an A if you put in the time. Homework for every class period and uses the x-hour every week.\"",
            "review 3: \"10F with Alfia Rakova: Course: It was a good course--a variety of stories and readings that were pretty interesting, fun projects and discussions Professor: Rakova is THE BEST PROFESSOR EVER. If you ever have a chance to take a class with her, do it. It will probably be one of your top 5 best life choices. Workload: It was a lot of work, but all of it was valuable and worth doing.\"",
            "review 4: \"09F with Alfia Rakova: This class is intended mainly as a review course, introducing only a few new points in grammar and mainly new vocabulary. However if you went on the LSA+ to St. Petersburg it really becomes an exercise in review. Still worth taking though because it keeps you ready for the rest of the series in intermediate Russian.\"",
            "review 5: \"08F with Alfia Rakova: First of all, Prof. Rakova is simply the best prof. I've ever had. She cares so much about you, pushes you to learn, and is very understanding. She explains the material so well, and makes it lots of fun so that it stays with you. Russian 27, 28, and 29 are great because the classes are smaller so it feels more like a seminar and you get to know your fellow students so well. They are really important for getting your Russian up to a level where it will actually be useful to you - the first year of Russian is a good base, but you can't yet actually do much. After second year, you can start to look at jobs in Russia. Anyway - amazing class, so much fun, and absolutely essential if you want to make use of your first-year Russian skills.\"",
            "review 6: \"08F with Alfia Rakova: It would be an awful waste If you managed to get through all the cases and grammar and pain of the first year of Russian only to not take the next year. Think of the 27-29 series of Russian as a reward. Instead of just reviewing technicalities for days on end and showing up frostbitten in Winter for the 745 drill to recite case heavy jingles - you actually get to experience real Russian stories, poetry, essays, and films. Professor Rakova is great and deals with each student according to their strengths and weaknesses in the language - so even if you didn't go to Saint Pete's - you'll be just fine. She will make sure that you're learning a lot and not getting left behind in any area. She's the real deal, don't miss it because you're lazy.\""
        ],
        "Jamilya Nazyrova": [
            "review 1: \"04F with Jamilya Nazyrova: Prof. Nazyrova was rather disorganized and jumped from subject to subject. Since there was no real order to the class, it was sometimes hard to follow what was going on. I didn't feel like I learned that much. On the other hand, it wasn't too hard and someone really into Russian might get more out of it.\"",
            "review 2: \"04F with Jamilya Nazyrova: I learned a fair amount of grammar in 27, but because Mila skipped around a lot, I don't remember it as effectively as I should. Class activities weren't too bad, but Mila had some trouble understanding and answering quesstions. The biggest let down are the new actors in the Live From Moscow Stage 2 DVD, though. So, the class has a few problems, like the fact that its at 8:45 and the exam was impossible, but Russian is an awesome language and you know you want more, so take it...\"",
            "review 3: \"04F with Jamilya Nazyrova: I love Russian. I really do. But this class was awful. We skipped around between two textbooks, focusing on the inferior one, instead of the interesting one. Mila is kind and responsive, but she doesn't have a high enough grasp of the English language to answer our difficult grammar questions. I am continuing in the language because I enjoy Russian and want to learn it, but this class was one of the most disorganized, and dissappointing terms of my study of Russian.\""
        ],
        "Deborah Garretson": [
            "review 1: \"07F with Deborah Garretson: Even if you go on the LSA, you should probably take the class. There isn't a lot of new information, but it's good to keep having to practice your Russian.\"",
            "review 2: \"02F with Deborah Garretson: Garretson concentrates a disproportionate amount of time on the minutae of the most absurdly useless topics of grammar and historical linguistics. Almost everyone I knew in the class (5-6 other people) said that they were dissapointed both by the slow pace and by the lack of progress they made with the language during this course. It may be useful if you have never been to Russia, but if you take this course right after the LSA you will regret it.\""
        ],
        "Valentina Apresyan": []
    },
    "RUSS023": {
        "Jennifer R.": [
            "review 1: \"03X with Jennifer R.: So... Russian 22 and 23 are the courses taught by Russian profs at the Smolny The way that russians teach is very different from at dartmouth. your grade is mostly based on class participation and how you do throughout the term. In most of my classes we enver even had a final project or test. In conversation we had reading exercises and then had to talk about them and how things are the smae and different in America. In grammar we learned how to tell time, different action verbs, and prepositions. Thuis was the onyl class where we actually had written tests, and i think there were only two or maybe three. IF A PROF EVER TELLS YOU NOT TO STUDY FOR A TEST, DO NOT BELIEVE HER!! In phonetics we would learn songs and poems and such and practice pronouncing difficult vowels and devoicing and everying like that. it was very useful and fun if you liek to sing In literature, we read short stories in the original russian text with english translations to help if we got stuck. this class was paced MUCH too fast and was very time consuming and tedious, but beneficial if you wanted to spend that mich tiem studying when you were ina city where you are constantly studying even when just buying some fruit. overall, it is very hard to tell how well you are doing in classes because the grades are mostly subjective. Dont expect to get an easy A on this LSA... its was a VERY dificult term, not only because of the classes, but just because you are living in a 2nd world country and it is very taxking for most students. if you want an A in these classes, be prepared to spend many hours a week studying for each of your 4 classes taught in Russian only\""
        ],
        "Deborah Garretson": [],
        "John Kopper": [],
        "Mikhail Gronas": []
    },
    "RUSS022": {
        "Jennifer R.": [
            "review 1: \"03X with Jennifer R.: So... Russian 22 and 23 are the courses taught by Russian profs at the Smolny The way that russians teach is very different from at dartmouth. your grade is mostly based on class participation and how you do throughout the term. In most of my classes we enver even had a final project or test. In conversation we had reading exercises and then had to talk about them and how things are the smae and different in America. In grammar we learned how to tell time, different action verbs, and prepositions. Thuis was the onyl class where we actually had written tests, and i think there were only two or maybe three. IF A PROF EVER TELLS YOU NOT TO STUDY FOR A TEST, DO NOT BELIEVE HER!! In phonetics we would learn songs and poems and such and practice pronouncing difficult vowels and devoicing and everying like that. it was very useful and fun if you liek to sing In literature, we read short stories in the original russian text with english translations to help if we got stuck. this class was paced MUCH too fast and was very time consuming and tedious, but beneficial if you wanted to spend that mich tiem studying when you were ina city where you are constantly studying even when just buying some fruit. overall, it is very hard to tell how well you are doing in classes because the grades are mostly subjective. Dont expect to get an easy A on this LSA... its was a VERY dificult term, not only because of the classes, but just because you are living in a 2nd world country and it is very taxking for most students. if you want an A in these classes, be prepared to spend many hours a week studying for each of your 4 classes taught in Russian only\""
        ],
        "Deborah Garretson": [],
        "John Kopper": [],
        "Mikhail Gronas": []
    },
    "RUSS021": {
        "Deborah Garretson": [
            "review 1: \"04X with Deborah Garretson: the st. petersburg lsa+ is a great experience for russian majors and non-majors. it's a great city, and the classes taught by petersburg profs are very interesting, learning-intensive, and beneficial, both language-wise and culturally. class taught by garretson was a bit slow-paced, and sometimes vague. she's always available for questions, however, and is extremely knowledgeable. definitely worthwhile.\""
        ],
        "Jennifer R.": [
            "review 1: \"03X with Jennifer R.: Okay... so this course was the one taught by Prof. Tishler. It included readings and weekly class discussions, plus all our excursions it was interesting in that we learne da bit of russian history and had a chance to all get together once a week to talk about our experiences. also, we kept journals that we turned in every week that served to get us thinking about our experiences and stuff in the city. the class was okay... the only one taught in english. it was definately easier than the ones in russian. but sometimes doing the translations of poems and stuff seemed not to pertain much to the rest of the class... it was kindof scattered because you never knew exactly what we were going to cover in any week's lesson.\""
        ],
        "John Kopper": [],
        "Mikhail Gronas": []
    },
    "RUSS019": {
        "Deborah Garretson": [],
        "Mikhail Gronas": []
    },
    "RUSS018": {
        "Victoria Somoff": []
    },
    "RUSS014": {
        "Mikhail Gronas": [
            "review 1: \"23W with Mikhail Gronas: This has to be one of the most boring classes I've taken at this school. Professor Gronas is clearly an intellectual, but his classes are so poorly structured. While this class is definitely a layup, he does not record or grade anything on Canvas so you're just hoping it will be an A in the end. There were a few good films, but most were boring and people stayed on their computers for the whole 2A. The grade was 35% final 10-12 page paper on literally anything, 20% final group project, 20% for two in-class film \"analyses\" and 25% participation. If all you care about is the ART distrib and an A, take it, but there are definitely more interesting ART distribs out there.\""
        ],
        "Jasmina Savic": [],
        "Lynn Patyk": [],
        "Sean Griffin": []
    },
    "RUSS013": {
        "Mikhail Gronas": [
            "review 1: \"22F with Mikhail Gronas: Co-taught with Pavel Lion. Amount of work seemed to be much less than previous years; 6 weekly Canvas assignments (~1-2 hours each), midterm, folklore collection project, and final.\"",
            "review 2: \"21F with Mikhail Gronas: Co-taught with Prof. Apresyan. The work itself is not that hard and the TAs grade super easy, but the midterm and final definitely require serious studying as the material is pretty niche. You don't have to do any readings and the weekly homework assignments take anywhere from 5-30 minutes in total. A layup most of the time, but takes a lot of effort before the midterm, final, and due date of term project.\"",
            "review 3: \"21F with Mikhail Gronas: This course was co-taught by professor Apreysan. Would highly reccommend this class. Material is not conceptually difficult at all, albeit sometimes can be not the most engaging. Class consists of nightly homework assignments, discussion section assignments, two writing projects, a midterm, and a final. Nightly homeworks take about 10-15 minutes per assignment and require minimal effort. Discussion assignments are assigned about once a week, and can sometimes be more involved, but still not too bad. The two writing assignments are an imitation piece and a final \"folklore collection\" group project. Both are a bit more time consuming, but extremely reasonable (I think they both took me about 3-5 hours total). They are also graded extremely leniently, with 95% and 99% mean scores, respectively. The midterm and final aren't too bad, but they definitely require a bit of studying. Overall, I would say that this class is a layup, even though it can be a bit of a grind before the exams and writing projects.\"",
            "review 4: \"20F with Mikhail Gronas: This class was co-taught with Professor Apresyan. The class has small nightly assignment that take less than 20 minutes. There is one large cumulative project folklore project, but it is relatively low commitment. There are no large essays besides a fairy tale variation, in which you write your own fairytale based on a specific structure. Basically everyone gets 100. The midterm is extremely easy as well. There are tons of readings that you don't have to do any, as long as you attend class and take vague notes, you will get an A. Discussion sections are easy as well. They are great profs who really care about you, even if you don't care about the class at all. Total layup, not Arabian Nights level, but it's up there.\"",
            "review 5: \"18F with Mikhail Gronas: Not a layup, pretty much a lot of work. Mostly not interesting. Exam format is good and easy (MC + fill in gaps + essay on final) but you have to study quite a lot (compared to other layups). Lots of memorization of things you will never read or need in your life again. Attendance graded, and grades mostly depend on TAs (not all are as cool). Has a midterm fairy tale (3-4h of work), a midterm, a final, and a collection project (about 10 one-pagers + interviews).\"",
            "review 6: \"15S with Mikhail Gronas: This class is everything you dream about when you plan on taking a layup. It is a LIT distributive and I didn't write more than a 4-page paper, which was a fairytale-- seriously, I'm not kidding, we had to write a fairytale. Other than that there is an easy and overall, enjoyable video project at the end of the term. Most people I knew had close to a 100% average in this class. One qualifier is that the \"gateway initiative\" has been paying a lot more attention to this class, and of course MDF is looking to target/do away with layups, so just be cautious. Cannot imagine it becoming hard enough to lose its lay-up worthy status. Enjoy!\"",
            "review 7: \"09S with Mikhail Gronas: interesting, and somewhat uninteresting. I think there is too much theoretical material and not enough actual stories, though there are a good number of stories that we read in class.\"",
            "review 8: \"09S with Mikhail Gronas: The only work you have to do is about 10 min of easy homework before the xhour taught by the TA's. The xhour is the only thing you have to attend too.\"",
            "review 9: \"04F with Mikhail Gronas: Fair\"",
            "review 10: \"04F with Mikhail Gronas: good class if you go. i only did readings for the discussions sometimes, never for class. you just have to study a few hours before the exams and you are fine as long as you attend class and lecture. proff s is really nice and the class is like one taught in middle school. very basic, great 4th class or breeze class.\"",
            "review 11: \"04F with Mikhail Gronas: I really enjoy this class; it was a nice change from my usual class schedule. We have all had a least one class were the prof will assign so much reading for each class that it is next to impossible to finish, but this is not one of them. Sevastianova gave worthwhile lectures, but Gronas just mumbles while giving his lectures.\"",
            "review 12: \"04F with Mikhail Gronas: A very agreeable course all-around. With a modicum of effort, this class is a breeze. The material is interesting, though the lectures drag towards the end of the term. The discussion sections are very easy to do well in if you've read the (small) readings.\"",
            "review 13: \"04F with Mikhail Gronas: Vampires is no longer a total gut class: Professor Sevastianova takes attendance in class (you are given 3 lecture absences and 1 discussion absence), and there are 5 pop quizzes over the course of the term intended to make sure students are doing their reading. However, the quizzes are only 5% of the grade total (1% each), and if you even skim the readings you can do fine on them. There is no need to read anything in detail, because the attendance requirement means that everything you will ever be tested on you hear in class. If you participate in your discussion section, Professor Sevastianova implied that would have a good impact on your grade (i.e. those who didn't do especially well on quizzes or midterms could still do well in the class if they participated in discussions).\"",
            "review 14: \"04F with Mikhail Gronas: Whatever your reasons for taking this course, be forewarned that Russian 13 has become much harder over the years and you have to stay atop the readings to do well. The course has an unusual time format of two 65-minute lectures on Mondays and Wednesdays, and a mandatory 50-minute discussion section every Thursday or Friday. When you are assigned a discussion day, you must go to that assigned section; you are not allowed to flip-flop between Thursday and Friday sessions. You should pray that the class has a high enrollment because that will mean discussion sections will not be all fielded by Dr. Sevastianova, who is by far the harshest of the discussion section graders. I was fortunate enough to have a masters’ student who thought that anything we said was extraordinarily profound. Discussion counts for a significant portion of your grade and you are allotted only one absence without it affecting your course assessment. You are entitled to three free misses in lecture without it hurting your grade. The professors make no distinction between excused and unexcused absences, so use your freebies wisely. Attendance in lecture is helpful because the notes you do take will complement the outlines posted on blackboard. I’ve been told that you don’t even need to take notes. Well, it can’t hurt to listen to the professors. Regarding the midterm and the final (each of which have 25 multiple choice questions and a choice of one of two essays), you really have to strike a chord with the professors to do well. My midterm essay got a 50/50, but I’ve read essays that were honestly better than mine and those people got lower grades. Consider it an erratic grading policy, if you will; but that is my only small objection to an otherwise wonderful class. The reader is, unfortunately, a little pricey and you should probably just borrow one from someone else who has already taken the course. The professors so far haven’t changed the reader’s contents since Spring 2004, but that could obviously change. There are five unannounced quizzes based on the readings. Be VERY careful when reading over the syllabus because the assignment listed alongside a date is due THE NEXT LECTURE. Lots of people got tripped up by this and entered a quiz having read for what was essentially the next lecture, so they got trussed up. Then again, the quizzes only constitute 5% of your grade. Sevastianova is (barely) the better of the two lecturers, with Gronas’ only drawback being that he has a slight accent. But before you hop in, consider the class averages of the course’s graded components for Fall 2004: Quiz 1: 3.15/5 (Weight, 1%) Quiz 2: 2.79/5 (1%) Quiz 3: 2.79/5 (1%) Quiz 4: 2.69/5 (1%) Quiz 5: 3.88/5 (1%) Lecture Attendance Grade: 21.24/22 (15%) Discussion Grade: 91.27/100 (25%) Midterm Examination Grade: 82.18/100 (25%) Final Examination Grade: 85.87/100 (30%) You do the math. The “average RUSS 13 Fall 2004 student” only got about an 86.67 on the course. I really don’t care about grades and only wanted to put the INT aside. So choose wisely.\"",
            "review 15: \"04F with Mikhail Gronas: The powerpoint slides were pretty useless and disorganized. The lectures were extremely dull and they were completely indecipherable when Gronas lectured. The grading on exams is arbitrary, (specifically on the essay section) Most of all thought, the material is a waste of time. I thought it might be fun to learn about vampires and witches but really, it's just boring.\"",
            "review 16: \"04F with Mikhail Gronas: Lecture slides consist of mostly incomprehensible sentence fragments so go to class and pay attention (your participation grade depends on it anyway). But professor Gronas can't speak english or lecture well so if he's teaching class that day you're screwed. Class is not as easy as it supposedly use to be but still not bad at all.\"",
            "review 17: \"04F with Mikhail Gronas: This was a very good and interesting course, but the TA\"S and Professor Sevastianova were the best parts of the course. They were all very helpful and very interested in the course. Professor Gronas was actually very bad. The students could not understand anything that he was saying during lecture, and although he knew this, he continued to lecture. During his lectures the majority of the students would either be asleep or get up and leave because they could not understand. Yet, Prof Sevastianova made up for this deficiency and was very helpful.\"",
            "review 18: \"04F with Mikhail Gronas: This class wasn't really that hard, and didn't take up too much time. It's a good class to take if you plan on taking 2 other hard classes and don't want to NRO.\"",
            "review 19: \"04F with Mikhail Gronas: It was an interesting class, but mostly because i'm a history major. The profs. were ok, they weren't terrific but they didn't totally suck either. My T.A. was really nice. If you need to take a course to boost your grade take this one because it's incredibly easy, the workload is easy and very small.\"",
            "review 20: \"04F with Mikhail Gronas: Very easy class....there are weekly readings which there is no need to do (unless there's a quiz) There are 5 quizzes throughout the term which equal 5% of your grade...and come on thats nothing. the midterm and final are very straight forward and there's no reason not to get a b+ or higher on them. happy hunting...\"",
            "review 21: \"04F with Mikhail Gronas: pretty easy course. it's not the work that's tough, it's getting yourself to read work that often times seems ridiculous. fairy tales are fun to read.\"",
            "review 22: \"04F with Mikhail Gronas: Sevastianova is a decent prof, but the class material is boring. Gronas speaks very poor English so his lectures turned into nap time. It's very easy with just a midterm, final, and no papers. Gut class.\"",
            "review 23: \"04F with Mikhail Gronas: Don't listen to those who say that this class got hard, it's hella easy. Sevastianova is very friendly and a pretty nice grader, and the material can be ignored until the night before the exams. Participation is 40% of the grade, so you can still do well even if you bomb the exams. No easier LIT out there.\"",
            "review 24: \"04F with Mikhail Gronas: This class is nonsense. No one really takes it seriously and its easy to get a good grade. The lectures are pretty boring actually but dicussion sections (I had Gronas) were really fun. Im glad I took this class, but this is definitely a class to take with friends or people you know.\"",
            "review 25: \"04F with Mikhail Gronas: This is one of the fabled 'guts' but the class has apparently gotten harder compared to a few years ago. Attendance at lecture and discussion sections is now mandatory so if you are good at getting to class, then you will already have 45% of the grade, which is quite good. There is one midterm and a final. The essay questions on exams require full knowledge of the readings and there are sometimes a lot of readings. There were also five quizzes given on random days and they are fully based on the readings assigned for that day. All in all it's a decent class but very little of it pertains to the interesting stuff like vampires etc. The course deals mainly with russian peasant life, which is a bit boring at times but it's quite possible to get an A.\"",
            "review 26: \"04F with Mikhail Gronas: I liked this class. Easy, not much work, slow-paced: it is a good gut-class, and is a good way to get the INT/EU distrib. Lectures bored me often, but if you stomach them, your grade is guaranteed for 25%. Lectures from Gronas are hard to understand; it's the room -- he's very uncomfortable in it. The discussion groups led by TAs are good.\"",
            "review 27: \"04F with Mikhail Gronas: Would have been fine except that profs are so eager to prove that the class is difficult that the subjective portion of tests (the essays, which were the terrible questions also) are graded entirely towards producing lower grades in the class.\"",
            "review 28: \"04F with Mikhail Gronas: this class does not require an abundance of work but they definitely put an emphasis on attendance. Interesting class dealing with folktales.\"",
            "review 29: \"04F with Mikhail Gronas: What you see is what you get. Easy course but very interesting at the same time. Readings are not intense and many times are simply fairy tales which go by quickly. Attendance is mandatory but simple to get friends to sign you in if you're lazy, and all lecture material is posted on blackboard. Five reading-check quizzes count for only 1% each of your grade, but on days they are administered they count for attendance. If you take it as an easy third course, pay attention; you may enjoy it.\"",
            "review 30: \"04F with Mikhail Gronas: The class was simple as long as you did the readings and reviewed your notes before the test. Some of the lectures and readings were a little dry at times but most of it was pretty interesting and easy to follow.\"",
            "review 31: \"04F with Mikhail Gronas: splendid\"",
            "review 32: \"04F with Mikhail Gronas: I took the course while taking 3 other courses. So if you are looking for a 4th course, this one is great, and it fulfills 2 distribs. Although the class is not very useful, it's fun and interesting.\"",
            "review 33: \"04F with Mikhail Gronas: Prof. Sevastinanova is a great lecturer but strict on attendance in class and discussion sections. Prof. Gronas is very intelligent and knows the material very well, but is hard to understand during lecture.\"",
            "review 34: \"04F with Mikhail Gronas: Zero knowledge of Russian required! Great class with fantastic stories. Good profs and TAs.\""
        ],
        "Victoria V.": [
            "review 1: \"06S with Victoria V.: This was an interesting class, but there are so many notes. Sometimes it seemed like to much. And there's a lot to study for the test. Homework gradin seemed nitty picky, but test grades were great\"",
            "review 2: \"06S with Victoria V.: Easy and interesting, a good 4th class or a perfect way to fulfill LIT or INT and W. Need to go to lectures b/c the powerpoints do not contain all of the info that you need, but the readings can be ignored if need be, altho should be reviewed before the test. Class was only twice a week with a really easy discussion section on the 3rd day. And the material was very fun and interesting.\"",
            "review 3: \"06S with Victoria V.: The prof is an amazing lecturer and the TA's are extreamly helpful. DONT miss discussion and make sure to do well on the assignments. It isn't to time consuming and very interesting.\"",
            "review 4: \"06S with Victoria V.: this course is obviously pretty easy but gets difficult if you're busy with other classes and don't do any of the readings and dose off in class then it gets kinda hard\"",
            "review 5: \"06S with Victoria V.: And you have a layman's education on analysis of folk stories and criticism of literature. A great class, and not terribly difficult.\"",
            "review 6: \"06S with Victoria V.: Definitely some tricky questions on the exam.. it's not a cake walk. You can get by without doing most of the reading. Reading is pretty much a joke - the whole class is silly. You really learn nothing important and it feels like middle school when you had to memorize tons of random facts about things like the Greek gods. It's not overly stressful, but not a definite A either.\"",
            "review 7: \"05S with Victoria V.: This class is really fun, laid back, and not too much work. Definitly reccomend it to anyone who is interested in off-kilter things and like a professor who is really nice and super into what she is teaching, therefor makin it really fun to be there.\"",
            "review 8: \"05S with Victoria V.: It was an interesting course which made it easy. I enjoyed the class.\"",
            "review 9: \"05S with Victoria V.: This course is easy if you read and study at least a little bit for the exams. You DO have to put effort in because alot of the material applies to this class alone and is new to many students but you can ace the class with minimal effort.\"",
            "review 10: \"05S with Victoria V.: by how interesting the course was. I took the course just to get the INT credit, and I was expecting some boring reading course with lots of readings and papers. Instead, I was pleasantly surprised at what the course had to offer. Having taken some Russian here at Dartmouth and going on the LSA, I learned a little about Russian culture and civilization. This course seemed to put it all into perspective. That aside, this course had 2 assignments which weren't very hard as long as you paid attention in class. The readings were interesting, and they weren't that bad, as long as you didn't get too far behind. It's a good course to take if you need an INT or just need another interesting course to take to round out your courseload.\"",
            "review 11: \"05S with Victoria V.: I thought that this class was actually kind of fun and easy. You don't have to do all of the readings and take many notes in class. The lectures are effective and the readings are easy. There are two written assignments which were very simple. Take this class if you want to boost your gpa.\"",
            "review 12: \"05S with Victoria V.: Do not take this course if only Prof. Sevastianova is teaching. When it is co-taught it is a much easier course with Professor Gronas teaching as well (so i hear). The TAs did not grade evenly, so your grades depended on which TA you got - not cool. Also, the teacher's tests emphasized the not-so important aspects of the course instead of the major things - again not cool. Take this class if its co-taught, but not any other way.\"",
            "review 13: \"05S with Victoria V.: take this class for an easy distrib filler\"",
            "review 14: \"05S with Victoria V.: I shopped through several INT distributive classes to come up with this as the only one that wouldn't put me to sleep or kill me. All in all it worked out pretty well too. Not a class I would have taken for fun, and not a class I would take again (or another one like it), but a fun and extremely painless distrib killer.\"",
            "review 15: \"05S with Victoria V.: If you want an easy course for your lit. distrib, this is a good class to take. Lectures are pretty boring, but you only have 2 per week. The other day is a discussion section that you have to go to, but its not too intensive. The readings for the class aren't that difficult, and you don't have to do all of them as long as you know enough to get by in your discussion sections. The 2 papers are short and easy, and the tests aren't too bad either.\"",
            "review 16: \"05S with Victoria V.: If you like literature and need an easy course, then this is for you. The readings are not bad, although some a little dry--but those you don't really need to read anyway. You really only need to go to your discussion sections, which replace class once a week--can sleep in when you want to. Although I recommend going to class, because the lectures are good and effective. If you aren't interested in folklore, Russia, or literature, though, this class would probably be pretty boring.\"",
            "review 17: \"05S with Victoria V.: This class was possibly the easiest class I have taken since 8th grade. However, although it was really easy, not everyone gets an A since some people really slack off. The homework assignments are usually about 10 pages of reading and/or consist of fairy tales you have to read which are sometimes actually entertaining enough to read as breaks from real classes. The discussion sections were also actually sometimes fun, these occurred once a week (instead of class) and usually ended 5-15 mins early. These didnt really require preparation. The midterm and essay were really not that bad at all but the essay portion of the test seemed to be really subjective and was sometimes hard to understand why someone got all 50 pts while another got like 40 pts. I think it's really important to go to all the classes for this class in order to get an A since she usually says a lot more things in class than she puts on her slides. If you go to all the classes and do the readings (which really is the least amount of work in all the courses I have taken so far), I could pretty much guarantee you will get an A-/A.\"",
            "review 18: \"05S with Victoria V.: I needed this class for distribs, but although I'm a Chem major, I really want to take another class with Prof. Sevastianova! She made lectures really interesting and funny, always ending class on a high note. She had Powerpoint lecture slides on Blackboard before class so it was easy to take notes. The material was interesting, although I'm not sure how useful it is... I do know I was reading a completely unrelated book that had \"vodianoi\" in it and thought \"oh, the water spirit!\" It's a fairly easy class; do the readings (which towards the end are more fun since they're just fairy/magic tales) and lectures will make a lot more sense. There are a couple of 1-page papers, midterm, and a final, each of which has multiple choice (easy) and an essay (easy if you've read the texts). Great course - highly recommended!\"",
            "review 19: \"05S with Victoria V.: material is different and fun to learn about and study, two easy written assignments and two tests that aren't so bad. just make sure you go to class and do some of the reading. good way to get your INT out of the way.\"",
            "review 20: \"05S with Victoria V.: This is one of those easy, large-enrollment courses that you've probably heard about. The material is kind of cool and really really easy to understand. The major setback is that the Professor seems to be of the belief that you should not be allowed to get a good grade if you don't attend lectures. This is really stupid, because for any Dartmouth student, the difficulty of the content in this course will bring you back to your elementary school days. The Professor puts lecture slides on Blackboard which are purposefully unhelpful. The readings do not cover a lot of what she goes over in class. There is no reason why she couldn't make her published slides more comprehensive or put on reserve whatever resources she uses to come up with lectures. The material is easy enough to understand through independent study (ie- if you like to sleep through classes), but the Professor makes it specifically difficult to do so. In order to study for the assignments or exams, I had to google a lot of the topics. This was successful, but quite annoying.\"",
            "review 21: \"05S with Victoria V.: Take it if you need a good 4th course\"",
            "review 22: \"05S with Victoria V.: it was good- an easy I distrib and the prof is fun.\"",
            "review 23: \"05S with Victoria V.: This course was fun and interesting at the beginning but then it starts to drag on a bit. I mean, there are only so many russian fairy tales you can read and still have an appreciation for!\"",
            "review 24: \"05S with Victoria V.: Easy course if you do the readings. The prof. is great and the material is interesting. However, the course is about all of Russian folklore and peasantry culture, not just \"vampires, witches, and firebirds.\"\"",
            "review 25: \"05F with Victoria V.: Great class for senior year! Prof. Sevastianova is a good lecturer and actually makes the class fun. We had 2 essays and 2 exams. Discussion is equal to free points, which is nice. What's better than a class that lets you learn about fairy tales and the like? Take this if you can.\"",
            "review 26: \"05F with Victoria V.: Definitely take this course. Prof. Sevastianova is an effective lecturer and the material is very interesting. Russian magic tales! This class is not hard and the tests were not hard, but I got a lot out of it all the same!\"",
            "review 27: \"05F with Victoria V.: This is definitely one of the school's easy classes. It seemed like roughly half the football team was in the class, (not that that's a bad thing.) Anyway, the class IS a large lecture, and the format is powerpoints every day. The discussion sections were nice, though, and the TAs were great. The readings are easy and even mildly entertaining. If you take decent notes I assume you will do well on the midterm and final, I did OK without taking notes at all and just getting the powerpoints off Blackboard. Basically, if you put 1/2 the amount of effort into this class that you put into a normal class, you should get an A/A-. Although frankly, it's so easy that you might find yourself blowing it off completely. Do that at your own risk... It would suck to take this class (like I did) to boost your GPA only to find yourself unable to take it seriously.\"",
            "review 28: \"05F with Victoria V.: If you want to get an easy A then you are in the right class. Other than this-no. The class is deadly boring, but if you are looking for an A then you can get it. DO NOT read the course material. Pay attention during lecture and particular attn during discussion sections. The exams are easy, and fill the essay pages as full as possible.\"",
            "review 29: \"05F with Victoria V.: This class was on the most part really easy. My favorite part of the class were the readings because they were hysterical. What other class assigns hilarious fairy tales as the bulk of its readings? At the end of this stress-free class, you walk away with an understanding of how weird Russians really are.\"",
            "review 30: \"05F with Victoria V.: I was actually surprised how interesting this course was. Although many believe it is an easy course, i took it because I had a great interest in russian culture. I would definitely recommend this class!\""
        ],
        "Victoria Somoff": [
            "review 1: \"19F with Victoria Somoff: I took this during my freshman fall and it was a ton of fun. You don't have to put in a lot of effort, but the readings and content are all genuinely interesting, so it's honestly more fun if you do pay attention in class. There are some small canvas assignments and a few projects, none of which are very time consuming. Prof Somoff is clearly super passionate about the subject and she's a great professor. Would definitely recommend this class to anyone needing a distrib or just wanting a fun class in a totally random but actually interesting topic.\"",
            "review 2: \"08S with Victoria Somoff: I took this class as a third class and to fulfill my last distrib, and actually found that I really enjoyed it. The workload was light - a midterm, final, brief write-your-own-fairy-tale and group project - and the material was lots of fun. There's a weekly discussion section, but the TAs really help to focus you on the important points to take away from lecture. Great class, for the distrib or just for a third class!\"",
            "review 3: \"08S with Victoria Somoff: I personally think Russian 13 is a waste of tuition, but if you need an easy A and are willing to do the work its a good choice. Its a really easy class, but you'll feel like you're in high school. If you can find one, take a more interesting class that is still fairly easy. Professor Somoff is pretty nice, but she can be hard to understand sometimes. Other than that, the class isn't too bad.\"",
            "review 4: \"08S with Victoria Somoff: This class was fun, interesting, and gave a little relief to a heavy class load. The material covered in class was exactly what was on the exams, the questions for the exams were based strictly on the study guide she sent out to everyone the week before. Somoff is a great professor..if the TAs grade too harshly, she'll give you A LOT of points back. Discussion sections are easy points, so do the work and do it good. There is a cool website project that we did in groups that pertains to any type of folklore students can come up with that was really fun to do. Great 3rd class, great prof.\"",
            "review 5: \"08S with Victoria Somoff: i have no idea what the other reviewers are talking about. this class is not an easy A. its true, you dont really need to do a lot of the readings. but to be totally honest it doesn't really matter what you do because at the end of the day the TAs will screw you over, without question. they grade all your homework assignments and all your exams. i think the only thing professor somoff grades is your folklore collection project, which is supposed to be the \"big project\". but you know what? that project makes up like 15 percent of your grade TOPS. if you take this class and dont ace the exams (which, by the way, is impossible because the questions are totally subjective and allow the TAs to rip you apart for no good reason) then you will not receive a good grade. i dont mean to be negative, i just want future takers to understand what they are getting into. heres an example, after the first exam, like 50 or more kids came into somoff's office to talk to her about the awful grades they had re ceived on the exam. and for the second exam, she did nothing to change the behavior of the TAs. taking this class is the one regret i have.. IN LIFE. dont waste your college experience and kill your gpa by reading russian fairytales. oh and if you take it, do NOT buy the morphology book. and just share the other two with someone else. i mean, why does the reader need to be 60 bucks?\"",
            "review 6: \"08S with Victoria Somoff: Nicest prof ever. take the class\"",
            "review 7: \"08S with Victoria Somoff: you've heard about this class....take it.\"",
            "review 8: \"08F with Victoria Somoff: Take this course if you need an easy third class and dont mind sitting through the boring lectures. The material is easy and at times it is a little more work than anticipated, but nothing crazy. The discussion sections help a lot with the material and the TAs basically tell you what you need to study for. Overall, pretty much a gut.\"",
            "review 9: \"08F with Victoria Somoff: The class is incredibly easy. There is very little work and the professor basically tells you what she will ask you on the exams during class. Somoff tries to make the material interesting but it really isn't that engaging and you'll find yourself drifting. As a tip make sure you go to class because she does do attendance every class. I was dissapointed by the title of the class. Huge misnomer. We spend literally 2 days in total on vampires, witches, and firebirds. We didn't even talk about the last one. The class is just about folklore in general. If you have a heavy term then you can take this as your third class or as your fourth.\"",
            "review 10: \"08F with Victoria Somoff: prof somoff is really nice and gives interesting lectures. the class was big, but people still participated frequently. I would recommend this class as an easy 3rd class, or just a great class to take for fun and for some diversity in subject material. we read fairy tales and epic poems which were all fun and easy to follow. take this class\"",
            "review 11: \"08F with Victoria Somoff: This is the easy distrib filling GPA boosting class you were looking for. First of all the people taking this class are all taking it as their easy class and so no one really works for it and the standards are really low. More than half of the class (including me) were guys pledging fraternities or in season athletes - not really the most hard working people at Dartmouth. The class is well-organized and Somoff is a decent lecturer. There is a midterm and a final. A 2-3 page story and a folklore collection project. I worked 3-4 hours on my story and 2-3 hours on my project and got great grades on them so they are really easy. As for the exam they can be a little tricky. To do well on them make sure you cover every single thing on the exam review sheet. (She basically gives out what she is going to ask about on the exam review sheet). There is class participation too but that is just fulfilled by going to class. Oh and there are weekly \"writing\" assignments where you have to write responses to 2-3 questions. You get full points for trying so those are easy too and take like 30 minutes to do. So as long as you don't completely slack off this is the easy class that you always wanted. Go to class, take notes and review before the exam and you are set. PS - if you are really concerned about getting an \"A\" and not an \"A-\", just work a little bit harder. As I said the standards aren't really high and its not too hard to get an A.\"",
            "review 12: \"08F with Victoria Somoff: It's Russian 13, so pretty much everyone who takes the class is expecting it to be a joke, and for the most part it is. I took this class during pledge term, and it required little time commitment which was perfect. Very few people take this class seriously. Most people are in there just for the easy \"A\". The \"A\" isn't that easy though. It's pretty easy to get an \"A-\", but you need a 95 or higher to get an \"A\" which is kind of tough. There's basically no work and everyone gets an \"A\" on participation and the projects as long as you just show up with your work done. The midterm and final are pretty easy too, but some of the questions can be tricky, and a few points off can lower you to an \"A-\". This was a good class to take if you don't want to put a lot of time into the class. The material is really not interesting, but that's what you sacrifice for the easier class.\"",
            "review 13: \"07F with Victoria Somoff: The course was extremely interesting. The Professor provided a variety of ways to engage in the material.\"",
            "review 14: \"07F with Victoria Somoff: This class was moderately paced and included a perfectly fair amount of homework. The readings were sometimes lengthy, but Professor Somoff always wrote down the key terms and concepts on blackboard so there was never any confusion. V. Somoff is passionate about the material covered in class is open to creativity in projects and assignments. Overall, the class covers interesting topics and is not too time-consuming.\"",
            "review 15: \"07F with Victoria Somoff: Very easy course, but loads of fun, and you learn a surprising amount just by attending lectures and reading the homework. Even though it's easy to slack off, don't because you're expected to participate in class, and that can sometimes be uncomfortable. If you're looking for an interesting but easy lit. course - this is it.\"",
            "review 16: \"07F with Victoria Somoff: Good prof. do well on the exams and you will get an A\"",
            "review 17: \"07F with Victoria Somoff: Somoff is a lot of fun - made most lectures not too boring. The collection project was easy, as was the entire class. Take it for distribs, but don't be a jerk and do the bare minimum - Somoff puts a lot into the class, give it a good shot.\"",
            "review 18: \"07F with Victoria Somoff: This class rocked. It was easy but still interesting, and Prof. Somoff was great. Even the required reading was interesting. I liked how the beginning of the class focused on folklore in general and not just Slavic culture, so everyone could relate to the subject. I definitely recommend this class.\"",
            "review 19: \"07F with Victoria Somoff: The readings were often lengthy and a bit dry, but the concepts and historical background covered were interesting. Professor Somoff is a gem! She is always receptive and willing to schedule hours to speak with students. I don't recommend this course if you dislike writing and reading.\"",
            "review 20: \"07F with Victoria Somoff: Lots of very interesting readings from all over. You were tested more on concepts than on facts, making most memorization unnecessary. The prof is accessible, as are the TAs. The folklore collection was a lot of fun if sometimes slow-moving. This should also be made as an anthropology course!\"",
            "review 21: \"07F with Victoria Somoff: As the one class I was most looking forward to this term, I was not disappointed. Prof Somoff is a very effective lecturer; she makes the information from the readings and expands on them rather than just repeating exactly what the readings say. The concepts were definitely more important than memorizing facts, which was nice; the midterm and final were mostly short answer questions, nothing too hard. If you go to class and pay attention and do all the assignments for discussion sections you should do great. I felt that this course could actually use some more in-depth information; perhaps allow for a research project instead of one of the two provided, or even in addition to the two projects. Still, it's an awesome course that I definitely recommend to anyone who thinks it sounds even remotely interesting.\"",
            "review 22: \"07F with Victoria Somoff: This is such an easy class. The lectures are pretty boring, and Somoff tries to create lectures off of a small amount of information. I would take the class if you need an easy third class, but otherwise don't take it. It's pretty boring and the reading is boring as well. The projects were easy, though, as were the midterm and final. Easy way to fulfill the lit/int distrib.\"",
            "review 23: \"07F with Victoria Somoff: There are literally 2 assignments. All of them were easy. 1 midterm: she gives you a study sheet of what you need to know so you really don't even had to do any work until a week before the exam 1 fairy tale: I think everyone got at least 95% on them. 1 group folklore project: besides the difficulty in having to coordinate a big group of people, it's fairly easy and I literally did 3 hours of work on this \"final\" assignment. It is impossible not to do well. 40% of the grade was participation which basically means come to class and talk in discussion. Somoff is a very ineffective lecturer. Her accent take a while to get used to and her lectures are uninspiring. On the upside, she is very lenient in grade and is genuinely excited if you have anything to say or contribute to the subject. Discussion sections are really important and basically where we get a lot of what we need for the midterm.\"",
            "review 24: \"07F with Victoria Somoff: This class was really interesting. Prof. Somoff is a good lecturer and definitely inspired interest in the topic. Homework and tests were also fairly easy. I would definitely recommend this class!\"",
            "review 25: \"07F with Victoria Somoff: The readings were oftentimes interesting and enjoyable, and professor Somoff was always very helpful when I needed her to clarify any of the course material. I would definitely recommend this class to anyone looking for an easy, yet interesting class.\"",
            "review 26: \"07F with Victoria Somoff: This was hands-down the easiest class I could have ever taken. Readings were dry but you could skim and listen to her in lecture. She tells you EVERYTHING that you need to know. There are weekly disc. assmts - easy, 2-3 points, which you basically have to just turn in to get credit; a midterm; folklore website and final. Before the midterm and final, she posts a list of readings and a checklist of things that will be on the exam. this is a good list to go over with the TAs who will tell you the rest. The website is a group project and I think the median was 99/100. Very easy. She checks it frequently during the term and is nice about telling you what she wants, which isn't much anyways. Prof. S is a good lecturer esp considering this is her first class as a prof. She is intelligent enough to take an interest in your work, lecture effectively, be organized with her thoughts and ideas but is a very lenient grader. The median is an A. So there. I also learnt a bit of Slavic history and culture which is an added plus.\""
        ],
        "Lev L.": [
            "review 1: \"02F with Lev L.: Don't really have to go to class at all, the lectures are posted online. But the tests are more difficult than expected.\"",
            "review 2: \"02F with Lev L.: You have nothing to lose taking this class. Although it's annoying that the description of \"Vampires, Witches, and Firebirds\" may sound exciting, Loseff manages to make the topics quite dull. He didn't seem to care that people weren't taking the class too seriously, but the other professor, Tishler, seemed to take issue with it and made threats about class attendance and whatnot. The good part is that the assignments are so easy that it makes no difference. So take this class, and print up the lecture slides every week, and you'll do fine whether you go to class or not. This was perhaps the easiest class I've had, in high school or here.\"",
            "review 3: \"02F with Lev L.: it's a fun class if you'd like to learn about a whole different culture and want to know why witches were first depicted as men and then a women. prof. loseff is russian himself and speaks english with a really heavy accent, so it's hard to even understand him. most of the course is taught by the TA. it's def. not a gut course anymore, class itself is a tease, but the studying required for the exams is amazing. if you're looking for an easy class in which you have to do no work and that has the easiest exams ever, don't take this one. the exams are easy, but only after extensive studying.\"",
            "review 4: \"02F with Lev L.: Unless you want to sit in a lecture hall for an hour with 300 other students and be bored out of your mind, don't take this class. It was difficult enough to try to understand what Prof Loseff (with his thick Russian accent). But then again, if you want an easy class where you don't need to even go to class at all and still get an A, then take it.\"",
            "review 5: \"02F with Lev L.: An easy class but seems like the profs are wising up so watch out for harder exams/more work/needing to go to class next fall... As for this term, lectures were pretty interesting if u enjoy learning about a different culture. Prof. Loseff has a very heavy Russian accent so it was difficult understanding him.. Tischler's a better lecturer but is looking to change the class into a non-gut (like less info on slides so students actually come to class). Readings (except those in the reader) were EXTREMELY easy and quick... they're just fairy tales, like the course description says. Class attendance was pretty much uneccessary.. everything you needed to know for the exam was on the lecture slides. Exams include extensive amount of material but it's very straightforward and easy if u study enough the night before (either u know the answer or u don't). Great grade if you do the work, good grade if u barely do any work.\"",
            "review 6: \"02F with Lev L.: The class isn't too tough. The problem is that much of the lectures and the reading is not that exciting, unless you're really into Russian slavic folk tales. It's really hard to understand the professor's lectures because he has a strong Russian accent, but eventually you start to get used to it. All the powerpoint slides for the presentations are available online, so lots of students didn't bother to come to class all term.\"",
            "review 7: \"01F with Lev L.: A real gut. no work, but madddd boring. tests are easy, the lectures aren't that great. unless you drink red bull before class you will probably fall asleep. you actually don't have to go to class at all. i know people who haven't gone to a single class who are pulling solid A's right now.\"",
            "review 8: \"01F with Lev L.: I think that this course was extremely interesting. I especially enjoyed writing our own fairytales. I am happy that I took this course because it was interesting and fun. I had a fairly good time, I recommend it to all.\"",
            "review 9: \"01F with Lev L.: The material that you read in this class is great. Russian fairytales, analysis of these tales, Stoker's Dracula-- good stuff. Because of the large size of the class it is easy to catch up on the reading if you do fall behind. The lectures were decent. Having them backed up by powerpoint that was posted on the web was a brilliant idea. (It meant that a lot of people skipped, though.) The class was team-taught by Professor Loseff and Prof. Jennifer Tishler. Tishler's lectures were a lot more cohesive and were easier to understand. Loseff has a thick accent ( therefore a bit difficult to understand) and his lectures can be tangential (though he is a very sweet man and a great prof- just not in such a large class. I had him for a smaller class before). This class is usually taught by Lenore Grenoble (who is probably the best prof I've had at Dartmouth) so needless to say I was disappointed at the switch. Regardless though, the material is fun and I would reccomend the class regardless of who is teaching it. It's a great way to take care of an INT distrib.\"",
            "review 10: \"01F with Lev L.: Picture this: you finished all your classes, and you and your friend in Russian 13 decide that to celebrate, you're going to watch Dracula. You mosey on down to Videostop but something strange has happened. Bella Lugosi's Dracula, Bram Stoker's Dracula, Interview With the Vampire, Shadow of the Vampire, even Dracula 2000 are all missing. Why? Because out of this enormous class, no one did the (interesting, fun, not a drag) reading assignment, Dracula by Bram Stoker. Sadly, they'll do just as well on the exam as those of us who took the time to read the book. And there's the problem with this class: it's a gut class. It's that third class you take with 2 demanding classes. It's interesting material (the midterm is to write your own fairy tale), but poorly executed by the Professor Loseff. Professor Loseff tends to go off on tangents in his lectures, then speeds through the end, where most of his important points are. The course was co-taught with Professor Tishler, which was a blessing as she made the class bearable. Her lectures were clear and conscice, not to mention interesting. As for the readings, several of them were quite good (the book of Russian Fairy Tales, Dracula) but others were terribly boring (Perkowski's The Darkling, for one). This review ripped this course apart and I apologize for that. It really is a good and interesting course - just with some major structural flaws. Should you take it? Yes - if you need a third class to go along with your two upper level super-hard courses, or if you're interested in a fascinating subject.\"",
            "review 11: \"01F with Lev L.: I really wish I studied for this course. It was so easy it was funny. The lectures were pretty interesting; and we got to watch movies a lot, which was cool. Leseff is the worst lecturer because you can't understand a thing he says, but he's really helpful outside of class, in case you want to go to an office hour for review. Take this course if you want to boost your GPA.\"",
            "review 12: \"01F with Lev L.: I actually took this class out of interest in the subject material, and under the impression that it would be a smaller class. Needless to say, I was a little surprised when it turned out to be a 260 person lecture. This class was EXTREMELY easy, both in terms of the workload and the difficulty of the tests, and also had a huge curve due to the size. Essentially, I don't think it was possible for someone to get less than a C in the class, and that would be without any effort whatsoever. Loseff was not an effective lecturer at all, and he got sidetracked way too often. His thick Russian accent was hard to understand at first, but after a few classes I got used to that. He had a TA, though, who taught about half the lectures, so it didn't really matter. Overall, if you're looking for an extremely easy gut class that definitely doesn't require, or even warrent, attendance the majority of the time, and has little to no work, but doesn't necessarily inspire interest in the subject, this is the class for you!\"",
            "review 13: \"01F with Lev L.: Professor Loseff is a much better prof in a small seminar atmosphere. Big lectures are not his style.\""
        ],
        "Jennifer R.": [
            "review 1: \"03F with Jennifer R.: This class was ridiculous, way too much reading, none of it was interesting or helpful in any way.\"",
            "review 2: \"03F with Jennifer R.: This class would make a good fourth class. Its not too diffcutl but it does require a small amount of effort. U need to be able to have your readings done for the friday discussion groups and class attendance does count toward your grade. So you need to be committed to coming to class so you can sign in. But lots of people came and just slept through the class. It was whatever. The final was very simple. 40 multiple choice that took all of twenty mins. The take home part was due weeks before so as a fourth class you would only need to study just a bit for the final. And the bonus is the readings aren't half bad.\"",
            "review 3: \"03F with Jennifer R.: despite what prof. tishler says on the first day of class, this IS a gut class, and NOBODY takes this class seriously. with good reason, too. i mean, come on -- this is dartmouth...we should NOT be having classes on \"vampires, witches, and firebirds.\" what the hell is a \"firebird\" anyway??? this class is a JOKE. take this class if you need to boost your GPA (like me), but otehrwise, this class is completely useless. this is the easiest class i've taken since middle school. i completely owned this class for the first half of the term -- and then i got cocky, and stopped doing any work at all, and my grade ended up slipping to a B+. but if you're not a complete bum like i am, there is no reason why you should not get an A in this class. to get an A in this class, you need to do the following: go to class (for some ass reason, she decided to start taking attendance in a lecture class just to make people actually start going -- didnt work for me), go to discussion groups (you dont need to be awake during discussion, just be there), do the readings (this is not nearly as tough as it seems -- remember when you were 7 and your mom made you read hansel and gretel, snow white, and all that other crap?? yeah, same thing...just to out, get trashed, and come home and read some fairy tales...quite pleasants, actually), and review the slides before the exams. you do not need to put in any extra effort other than that. half the people fall asleep during lectures, so dont be one of those suckers who frantically scribbles down notes. just go to lecture, sign in the attendance sheet, and get the hell out of there before she sees you. remember, this IS A GUT CLASS -- even though prof. tishler is trying ot make it a real class -- it IS STILL A GUT CLASS. have fun with it! peace!\"",
            "review 4: \"03F with Jennifer R.: I took this class because i needed the distrib and i thought it sounded pretty interesting. When i heard that it was supposed to be really easy, that was just icing on the cake. Its amazing, however, how a co-taught class can be ruined by one terrible professor. Tishler's lectures were more boring than anything ive ever done, including staring blankly at a wall. She simply read off a piece of paper like it was a speech, and if she lost her place she would get rattled and take about 30 seconds to regain composure. She made the emphasis of the course memorizing random facts from the readings instead of understanding the material. Also, she doesnt understand how to grade papers. I'm not saying all this because of a bad grade; i did fine in the class. It was just boring, full of obscure facts, and taught by a terrible prof.\"",
            "review 5: \"03F with Jennifer R.: I'll be honest, I took this class because it was one of the more well-known \"guts\" at Dartmouth. Apparently the profs had also become aware of their course's notoreity/fame, and made the course a lot tougher when I took it. The tests are very nitpicky, and the grading on essays was harsher than I've seen in any other lit class. The discussion part of the class, which wasn't useful to say the least, was supposed to bolster our grades, but they were also graded with surprising harshness. The material's not that engaging, unless you're really into fairytales. I felt kind of silly, trying to cram minutae from a bunch of fairy tales before the exams. My search for the easy third class continues...\"",
            "review 6: \"03F with Jennifer R.: The grading was extremely unfair and was frequently completely arbitrary. I have never posted a review before, but this class was so terrible it warrants one. Do not expect any help or cultivation of learning.\"",
            "review 7: \"03F with Jennifer R.: attendence sign up sheets and inane discussion sections wrecked this gut that has fun material, but mediocre lectures. For a class that one might need as a break from major classes or lab classes this class was too stringent. As an actually complex class that draws you in and makes you want to do well, it totally failed.\"",
            "review 8: \"03F with Jennifer R.: interesting course, more reading than i was expecting, discussions were helpful\"",
            "review 9: \"03F with Jennifer R.: The exams, quizzes and papers were easy as long as you read the material. The readings were boring in general- there were a few interesting parts of the class. The profs were helpful during OH. Attendence is part of the grade, but its easy to sleep through class and get the powerpoints online to study for exams.\"",
            "review 10: \"03F with Jennifer R.: this class was tougher for this term than it ever had been before (i think they were cracking down after some big cheating scandal). it was boring. i would not recommend this class\""
        ],
        "Sara L.": [
            "review 1: \"07S with Sara L.: Pankenier is a newbie, so she's very enthusiastic but occasionally a little awkward. In lecture it sometimes felt like high school (or middle school), but one-on-one I found her very interesting and quite helpful. Give her a few years to get her bearings and I think she'll be great. The class is almost embarrassingly easy, but folklore's pretty fun so you may as well do the readings anyway. It's a nice break if you're looking for an easy but fun third class.\"",
            "review 2: \"07S with Sara L.: This class is a joke. If you need a lit or a comp distib definetly take it. The only 2 real assignments we had were 2, 2-page papers and a presentation (where reading a story you knew was enough to get you an a). The readings are perfectly enjoyable, and are mostly fairytales, though about 20% or so of them were more boring and about analysis and such. The prof is VERY VERY nice. She couldn't be more excited to be teaching this class. She also give a lot of extra credit opportunities, which is nice My only word of warning is that you shouldnt take your A in this class for granted... a lot of people slacked off and stopped coming to class or doing the readings altogether.\"",
            "review 3: \"07S with Sara L.: Prof. Pankenier is D '98 so she's new and very enthusiastic about the class. She's adorable - showing us youtube clips, pictures, movies - I felt like I was back in JHS. Very interesting class and not too mcuh work at all. You can do well on exams just by coming to class (she does have attendance sheets everyday...with a daily question s'times from the reading) and paying attention to whatever she says. The readings are interesting so if you have the time, you can do them. Would deifnitely recommend it if you're looking for something laid back and interesting with very little work.\"",
            "review 4: \"07S with Sara L.: This is not as much of a GUT course as everyone makes it out to be. It's fairly easy to get a good grade, but participation (attendence) is crucial and there's a lot of busy work, which can be annoying.\"",
            "review 5: \"07S with Sara L.: This course is amazing to fulfill a LIT distrib if you need it. The readings are not difficult, not long, and not even necessary to complete. And the material is actually pretty interesting and fun. Professor Pankenier is very nice, leads good lectures, and is extremely enthusiastic.\"",
            "review 6: \"07S with Sara L.: By far the easiest Lit distrib on campus. The professor has made the course a bit harder than it was in past years.\""
        ],
        "John W.": [
            "review 1: \"06F with John W.: Most people take this for the distrib. With Narins a supposedly easy class becomes painful.\"",
            "review 2: \"06F with John W.: Narins is a terrible prof. His lectures were unorganized and impossible to follow. We didn't get a syllabus until WEEK 7 and that was only after 7 weeks of complaining and hearing \"you will have it tomorrow.\" Before we got the syllabus he would blitz out the assignments, but usually not until about 9 pm the night before class. He changed the format of the midterm less than 12 hours before the test. We did not get our mid terms back until the end of week 9. When I went to his office to pick mine up, it wasn't graded yet. He glanced over it in less than 5 minutes and gave a vague grade. He didn't grade it according to the points he had written per question. A few people never got their grades because he lost their tests. He is full of excuses, some of which may be true, but overall he failed as a professor. DO NOT TAKE THIS COURSE WITH NARINS.\"",
            "review 3: \"06F with John W.: Prof Narins went off on tangents during lectures and it was hard to tell if you needed to write it down or not. He would also talk about multiple subjects, and sometimes it was hard to know which one he was describing. The TA's literally saved the class. They ran effective review sessions and were available for help. Blackboard and the rest of the readings should have been organized better, too. All in all, if you studied exactly what was on the review sheets Prof Narins made, then you did well. Some of the lack of organization was not the Professor's fault, since he had no idea initially how to use Blackboard, or something. So hopefully next time he teaches the course it will be a lot better organized.\"",
            "review 4: \"06F with John W.: Narins kept changing his mind about what the exams would be like, what the assignments would be, and how he counted participation, which was kind of frustrating. We also spent a really long time on schools of folklore, and the lectures for that part of the course were pretty boring. On the other hand, the folktales were fun to read, and it was still an easy INT.\"",
            "review 5: \"06F with John W.: this class was interesting, professor was chill, but was not a true player.\"",
            "review 6: \"06F with John W.: This is the easiest class I have ever taken in my life.\""
        ],
        "Lynn Patyk": [
            "review 1: \"19S with Lynn Patyk: Amazing class, Prof. Patyk is an engaging lecturer and a very fair grader! I highly recommend this if you need a chill INT distrib. This class gets a bad rep because, for a lot of people, a non-zero amount of work does not count as a layup. The workload is very fair though and incredibly easy to just buzz through. You can totally get by without doing the readings as long as you come to class (she sporadically takes attendance), and the slides are super detailed. The tests are not too bad and the writing assignments are super easy, but you do have to do a final group project. Luckily, it's not that much work if you have a decent group and an interesting subject. Overall, I highly recommend this class for the distrib or just for interest in slavic folklore!\"",
            "review 2: \"19S with Lynn Patyk: Prof Patyk is absolutely amazing. She is an incredible lecturer and really cares about her students. There is a lot of material and this class is in no way a zero-work layup. I did pretty poorly on my midterm (as did a lot of people). But there are several other assignments that boosted my grade, and that along with lots of studying for the final got me an A. Take this class because it is genuinely interesting, but definitely don't slack off or stop paying attention because you can and will get behind.\""
        ],
        "Valentina Apresyan": []
    },
    "RUSS011.03": {
        "Mikhail Gronas": []
    },
    "RUSS011": {
        "Jennifer R.": [
            "review 1: \"02S with Jennifer R.: For those interested in Russian history, this course is a must. While it requires at least a rudimentary understanding of Russian and Soviet history, it is not exceedingly difficult. Readings are varied and interesting, as are class lectures. A small, dynamic class that teaches you something about Russian culture that many larger classes can't. Also, Prof. Tishler is extremely approachable and teaches the material very well. Tests and papers are fairly graded.\""
        ],
        "Stuart Finkel": [
            "review 1: \"14S with Stuart Finkel: Course: The least intellectually engaging course I took at Dartmouth. Just read a book on 20th century Russian history rather than wasting one credit on this one. No insights, can't get any plainer. Professor: The prof is not a horrible lecturer but not superb either. He repeats a lot of stuff from the previous class and thus gets behind schedule all the time. He was nice about deadlines and such and was generally accessible. But definitely not the smartest prof I had at Dartmouth. Workload: Pretty manageable. The in-class discussion about readings is pretty much reiterating what was said in the lecture or just summarizing certain aspects of the reading and sharing casual thoughts, so you can get away with not doing any of your readings if you are good at bs. Paper topics were not that hard either. Workload was pretty evenly distributed throughout the term too.\""
        ]
    },
    "RUSS010": {
        "Lynn Patyk": [
            "review 1: \"20W with Lynn Patyk: I wouldn't call this a layup - we had a lot of reading for every class, and you had to do them and study quite a lot to do well in the written, in-class midterm and final (which were graded pretty harshly); but overall it was a really interesting class and prof Patyk was a great lecturer\"",
            "review 2: \"19W with Lynn Patyk: Seemed harder at first than it ended up being. Weekly Friday quizzes but we only ended up having 4. Take home midterm graded easily and final exam wasn't too hard if you studied. Mix of history book readings and cultural sources, but don't have to read all the cultural sources to get an A. Overall pretty interesting class and Patyk is very nice.\"",
            "review 3: \"19W with Lynn Patyk: This class was weird. There was a ton of reading/movie watching every week, and everybody was grumbling about it actually being a real class. In the end, it ended up having an A median. It definitely was a sizable amount of work though- maybe even more so than non-layups i have taken here... the prof was super sweet though.\"",
            "review 4: \"19W with Lynn Patyk: This class is an underrated layup. It gets you a CI and TMV pretty painlessly. That being said, I mean layup in the sense that you can get an A really easily as long as you do the work. Weekly Friday quizzes on the readings which were fine and don't count for that much, midterm and final were super easy and she was a nice grader. Also you actually learn something in the class versus classes like Jews 11 which seem pointless. Professor Patyk is really kind and overall it was worth taking.\"",
            "review 5: \"19W with Lynn Patyk: I took this class with Patyk but Griffin is teaching it this fall. I thought the class was fine, you just have to stay on top of the readings and go to class. I took a class with Griffin previously and he's an incredible professor. If you're looking for another class to take this fall, definitely go for this one. Could not say better things about him.\""
        ],
        "Sean Griffin": [
            "review 1: \"20F with Sean Griffin: This class as amazing with Prof Griffin, and the work load was not bad. we had one synchronous discussion a week where we would discuss a reading and a movie, and then a short discussion post each week. The midterm and final are a couple multiple choice, two short answer questions, and a short essay (~1000 words). Prof G is a very engaging in class and fair grader, you can tell he is super passionate about his research and he makes class very interesting (coming from someone who knew nothing about Russia and took this class to get out of some distribs). I would recommend taking any class with Griffin, he is one of the best professors I've had at dartmouth.\"",
            "review 2: \"20F with Sean Griffin: Griffin is the best prof ever, take any class he offers. He knows a lot and is currently writing a book. I took this class with zero knowledge of Russian history. The workload was fair and I ended up learning a lot. Prof. Griffin really makes this class non-stressful while teaching you the most he can in 10 weeks.\"",
            "review 3: \"20F with Sean Griffin: This class was really chill. Prof. G. made sure we wouldn't be stressed out during this pandemic, which was really kind of him. He is very accommodating and explains things well. We watched 1 movie and had 1 reading per week, and then had a small discussion section and some slack posts. My only complaint it that he had a very american (i.e. kinda anti-russia) take on Russia's history, which is different to other profs in the department.\"",
            "review 4: \"20F with Sean Griffin: Great professor. Engaging, funny and knowledgable. One of the best professors I've had at Dartmouth. We had 1 synchronous class every week (with 1 movie and assigned reading). Midterms and finals were open book. Participation is a big part of the grade (in-class and on slack) but Professor G removes the intimidation factor from speaking up in class (coming from someone that stresses a lot about this kind of stuff). This course is a great introduction to Russian history and culture (and it gets rid of a ton of distribs). I'm a little perplexed by the comment that mentioned that the professor has a very American and anti-Russian view. I would respectfully disagree. I didn't get this impression at all and I'm an international student.\""
        ],
        "Mikhail Gronas": [
            "review 1: \"14W with Mikhail Gronas: Course: I took this class because I needed the two distribs (CI/TMV), but was pleasantly surprised at how comprehensive it was. We looked at Russian culture and civilization through multiple media - film, literature, music. There were a lot of interesting learning opportunities, too: we skyped with the Voina, visited a local Orthodox priest/iconographer, and heard a concert by a relatively famous Russian singer. Many people take it because it's supposed to be a gut class, but it's actually really rewarding. You learn a lot AND it's a fascinating course!! Professor: Professors Chapman and Gronas co-taught the course. Both were great, though the 2A could be a drag sometimes. I went to Chapman's office hours a few times and found him to be very interested in his students and willing to discuss things covered peripherally in class at a greater depth. Overall, the professors care a lot and are willing to discuss things outside of class. Workload: I was expecting a lay-up; it was actually a solid amount of work in terms of the assigned readings, though certainly doable. Two multiple choice exams, several pop quizzes, group debates, and a final exam.\"",
            "review 2: \"11W with Mikhail Gronas: Course: I liked the class overall; it was a good overview of a very broad topic. We got to read bits and pieces of various Russian authors, and our textbook went over all of Russian history--not a huge amount of detail, but good for getting a sense of who the Russians are and why their culture is the way it is. Professor: Gronas is a little scatter-brained, but I think we got a good sense of Russian culture through his teaching style. He is brilliant, but sometimes hard to follow. Workload: Workload was fine; some of the projects seemed a less than relevant to Russian culture (we had to create an \"-ism\" and have a piece of visual art, music, literature, etc. for our movement.)\""
        ],
        "Valentina Apresyan": [
            "review 1: \"12W with Valentina Apresyan: Course: It was interesting, educational, and, perhaps pertinent for many, easy. Professor: Professor Apresyan was a visiting prof, and was easy-going and chill, though her accent required a slight learning curve. Workload: Easy. Really easy.\""
        ],
        "Ainsley Morse": []
    },
    "RUSS007": {
        "Lev L.": [
            "review 1: \"07F with Lev L.: Professor Loseff was born in Russia, so he has a lot of information to share. However, it is not always pertinent to the class, and as he talks very slowly, it can be very difficult to stay focused, especially when you realize that since there are no tests, nothing he's saying matters all that much. He grades the papers fairly easy, and a final is only due every two weeks, so the work isn't that bad as long as you keep up with the readings. The final project has a lot of flexibility, and it's a great change to hear the students talking instead of him.\"",
            "review 2: \"07F with Lev L.: Loseff is an interesting guy, growing up in the USSR, and when he occasionally talked about his personal experiences in class it was very interesting. Unfortunately, many of the lectures about the readings, authors, and ideas were quite dry, and the thick accent and slow monotone of the prof can make it a struggle to pay attention. The readings are all quite interesting, mostly classics of literature. The papers and oral are graded relatively easily, and there are no quizzes or exams of any sort.\"",
            "review 3: \"07F with Lev L.: I took this course because I wanted a snooze. I sure got it. But Loseff is a cool guy, and I felt bad not doing the readings class after class. The TA was really harsh on drafts, which made the papers--unexpectedly--a real pain. Still, this class was an A for anyone who wanted one.\"",
            "review 4: \"06F with Lev L.: Prof Loseff is really knowledgeable, although a little dry at times. If you're interested in literature and willing to listen for his first-hand knowledge of Russia/Russian literature, then you should enjoy this class. Disappointing as a seminar though, because there wasn't much discussion, only presentations in the last two weeks by everyone in the class. If you pick a cool topic for your presentation (20 min) then you should have a much better time with this class.\"",
            "review 5: \"06F with Lev L.: Professor Loseff is great! If you pay attention he is very funny and has a lot of interesting experiences to share. This class is a pretty random subject, so just go into it without any expectation or judgment and you will learn a lot about some great literature. It is an easily graded class, so it is perfect for freshman fall when you have other stuff to worry about. Loseff is an understanding, kind person, and if you are worried by the other reviews that say \"little discussion\" just know that if you start a discussion in class he won't mind. Don't be afraid to interrupt him with questions or comments! He takes it all in stride. Great reading, quirky prof, good seminar!\"",
            "review 6: \"06F with Lev L.: This class was offered as a freshman seminar and was supposed to be about discussing the readings and writing papers. There was discussion in a total of three classes-two when the TA taught because Professor Loseff was gone, and the last class. Professor Loseff is very nice and willing to work with students and answer any questions, but instead of allowing discussion, he talked at us from the front of the class. We sat in two rows, which does not encourage discussion, and practically fell asleep. The TA was really helpful though, and gave good comments on rough drafts. I really liked that we wrote a rough draft first and then turned in the final paper.\"",
            "review 7: \"06F with Lev L.: The class, as a whole, was uninteresting and uninspiring. The reading, as a whole, was excellently chosen, and I enjoyed that very much. However, lectures were boring and off-topic, much more one-sided than the discussion format I expected from a freshman seminar.\"",
            "review 8: \"06F with Lev L.: This class was painstakingly dry during discussion (more aptly described as a 110 minute monologue by Professor Loseff). However it had its benefits. If you could keep up with the reading assignments (which I couldn't), I feel they would be rewarding. I chose the course because of the stacked reading list. The professor's syllabus breaks up the assignments well, having first draft deadlines for all papers. The only coursework is 1 1000 word paper, 2 1500 word papers, 1 20 minute oral presentation, and a 2000 word term paper (there is also a participation grade). If you are a semi-strong writer you are practically guaranteed an A on every paper. I would recommend taking this seminar if you could use an easy class to ease you into Dartmouth and at the same time have your writing read by a TA and a professor.\"",
            "review 9: \"06F with Lev L.: Professor Loseff's idea of a discussion is an incredibly boring, barely related lecture. The first discussion we had in this 16 person freshmen seminar was on the last day. He speaks in a very thick Russian accent and makes very distracting noises that make him sound constipated; he is difficult to understand. Sometimes I wonder if his English is good enough to understand our essays since every blitz I ever recieved from him was full of typos. This class was a complete and utter waste of my time.\"",
            "review 10: \"05W with Lev L.: While Loseff has the tendency to make this class more of a lecture class and sometimes rambles off for extended periods of time, it is still interesting. The readings were good.\"",
            "review 11: \"05F with Lev L.: I found this seminar's subject matter, readings, and discussions very interesting. Professor Loseff is brilliant, but he has a tendency to speak /at/ the class. Fortunately, my classmates were really involved, and we usually managed to convert lectures into sort of lecture/discussions. This course isn't particularly difficult, but if you take it, you should contribute your ideas during class and even occasionally interrupt lectures if you want the full experience.\"",
            "review 12: \"05F with Lev L.: Slow moving in class, but interesting and enjoyable. I didn't feel that I really learned that much, but there were a few really good, interesting lectures and the reading was fun. Professor Loseff is laid back and a good speaker, even though kind of slow.\"",
            "review 13: \"05F with Lev L.: I was hoping for a very exciting, engaging freshman seminar, but this was not the case. The readings were somewhat interesting, but the professor's lectures (usually for about half the class period) were boring at times. He tended to ramble, and struck me as slightly senile. We were each required to give an oral presentation that was somewhat related/inspired by one of the readings in class. Then we would have a class discussion on their presentation. Such affairs took up almost half of the class period (it was a 2A) and of course there were 15 of us to present. So near the middle/end of the term, we were barely discussing the works we had read, and just listening to people's projects and discussing them. I would have preferred to just discuss the readings. You can get away with not reading, and the only grades are participation/you papers/your oral project, so you also don't even need to pay attention in class, although I wouldn't recommend this, it would detract from the experience. The only way this felt almost worthwhile was because the class was very small and I tried to be very engaged in the discussion/lectures. So overalll, I would put this as a backup choice, because there isn't a ton of work involved and you do get a chance for discussion, but I would recommend having different first or second choices, that perhaps might be a little more interesting.\"",
            "review 14: \"03W with Lev L.: The books we read were very interesting, but Lev rarely discussed actual aspects of the reading. In fact the seminar is more or less a lecture, which given Lev's thick Russian accent and monotone voice makes it very boring. Lev, however, is an extremely easy grader which makes up for the boring lectures.\"",
            "review 15: \"03F with Lev L.: This class made me want to kill something. It was mind-numbingly boring. And you end up eating massive amounts of food just to stay awake.\"",
            "review 16: \"03F with Lev L.: Professor Loseff has a reputation for giving somewhat monotone, languid lectures, but I found his teaching methods relaxed and refreshing. He is extremely open to student comments and input during classes and encourages discussion of students' ideas. He is a very kind, caring prof. Readily available for outside of class meetings about papers, projects, etc. Professor Loseff has a subtle yet impish sense of humor and this, combined with his interesting background experiences, makes for amusing anecdotes. In terms of the course material, I found it to be very interesting although not particularly challenging. Many students got away with not reading. The papers are frequent, but fairly graded and drafts can be re-written. Much of the reading is from authors not of Russian background, but it all is tied together and makes sense in the end. One can get much out of this course if one puts in the effort and extra interst.\"",
            "review 17: \"01F with Lev L.: While I found the course intersting and Prof Loseff is incredibly knowledgable, he spent far too much of his time lecturing. This was supposed to be a seminar and for all practical purposes could have had 300 kids in a lecture hall on probably 75% of the days. The entire workload consisted of 4 papers totaling 5000 words in sum and a 15 minute oral report. It was a fairly simple course and all of the selected texts were enjoyable to read (but not necessary reads for success).\"",
            "review 18: \"01F with Lev L.: This course was extremely disappointing. The topic looked interesting on the syllabus, it had an great reading list, and the kids in the class were great. What ruined it was Professor Loseff. While obviously a very intelligent man, Loseff is an extremely boring Lecturer. He brings typed lectures to class, which he reads from in a slow, thick, Russian accent. Furthermore, his lectures are almost completely irrelevant to the novel we should be discussing. when we read The Metamorphosis by Franz Kafka, he spent an hour talking about the city of Prague because Kafka was from Prague. Class discusssion made up only 15% of the class at best, some periods would go by without a single student speaking. While the work load was relatively easy and Loseff was an easy grader, I would not recommend this seminar.\"",
            "review 19: \"01F with Lev L.: Good readings but some of the lectures were boring.\""
        ],
        "Deborah Garretson": [
            "review 1: \"09F with Deborah Garretson: Wow. I look at the world a completely different way now. Thank you Professor Garretson.\"",
            "review 2: \"09F with Deborah Garretson: This seminar is really interesting at times and really boring at others. Garretson really knows her stuff when it comes to the Russians, and she's got some great stories to tell. Unfortunately, you don't talk about the Russians until the very end of the course, making the first weeks disjointed and frustrating. All in all, mixed feelings on this course. Not too painful for a freshman seminar.\""
        ],
        "Lynn Patyk": []
    },
    "RUSS003": {
        "Deborah Garretson": [
            "review 1: \"09S with Deborah Garretson: The class, like many language classes at Dartmouth, is very effective in getting you to learn Russian. And like all language classes, exactly how much Russian you get out of it depends on how much Russian you work to get out of it.\"",
            "review 2: \"08S with Deborah Garretson: There was a lot of material to cover, but Prof. Garretson got us through all of it. Sometimes her explanations were a little confusing (such as when to apply different rules of grammar, some phonetics), but overall her teaching was effective. Even though it was a 9L I still looked forward to this class!\"",
            "review 3: \"05S with Deborah Garretson: if you're considering taking this course, you know what you're getting into. Garretson focuses hardcore on pronunciation, which is nice, but rumor has it russians don't actually speak like that. I guess the idea is that we'll automatically dim it down, so she teaches an exaggerated version of it. Sometimes her hearing is a little off, which can be frustrating, but she's nice enough, so i guess it balances out.\"",
            "review 4: \"05S with Deborah Garretson: good\"",
            "review 5: \"05S with Deborah Garretson: Professor Garretson is a real spunky lady who will usually wake your brain up at 8:45 in the morning. You really do a lot of verb drills and phoenetics work in class, which I think helped a lot. Sometimes I think she'd zip through the grammar too quickly and move right into the exercises, and sometimes left things a little confusing. Test or quiz every week, like R1 and R2, but these are harder and longer. She spends time going over the big mistakes people tended to make on them and the homeworks though, which helps, but I didn't like how she makes us do all of the video exercises outside of class. I definately would've understood them a ton more and gotten a lot more out of them had they been during class! Not like you guys would have any other options for R3 if Prof. Garretson was slated to teach it, so not sure if this review helps any. Overall, I liked her, but there were definately aspects of the class I disliked.\"",
            "review 6: \"05S with Deborah Garretson: Everything is graded subjectively and at times its hard to communicate your ideas w/professor Garretson. But, it is a good end to the sequence of first year Russian. You leave Russian three with a huge improvement in your language skills.\"",
            "review 7: \"05S with Deborah Garretson: The material was tough but the Professor made it worth it. Garretson is amazing and helps you through everything.\"",
            "review 8: \"03S with Deborah Garretson: in this class you basically already know how the routine works since youve had the same book for two terms already. the challenge here is to keep up the pace. since it is spring and you ahve already been taking russian for two terms, it is very easy to get burned out. one good motivationt o keep going is if you are going on the LSA+ Garretson is a great professor thoguh. the class really prepares yout o go abroad. I thoguht i would get to russia no know ing how to say anythign, but when yorue put ina situation where you have to speak, you end up knwoing a lot more than you thoguht you did try hard, so you homework, study in groups, practice speaking outside of drill, and youll do fine in this course the russian dept. is really nice to first year russian students. i think it is very heard to get below a B in this class. most peopel got A-s i think\""
        ],
        "Alfia Rakova": [
            "review 1: \"22S with Alfia Rakova: The class was similar to RUSS 2 in terms of difficulty and time investment. Professor Rakova is great at getting the class to succeed. The class is more focused on grammatical concepts than vocabulary building, and the tests reflect that. There may be some confusing concepts that bleed between introductory and intermediate Russian, in these cases just understand what is required for that exam. I found myself putting in a decent amount of time studying, but there was rarely a point where I felt overwhelmed.\""
        ],
        "Jamilya Nazyrova": [
            "review 1: \"07S with Jamilya Nazyrova: Russian is a fun language and the department is really small so you get to know faculty and other students well-- definitely good for the LSA if you go. Mila is great.\""
        ],
        "Lynn Patyk": []
    },
    "RUSS002": {
        "Mikhail Gronas": [
            "review 1: \"05W with Mikhail Gronas: Everyone loves Gronas, but it would be better if he would quit smoking.\"",
            "review 2: \"05W with Mikhail Gronas: good\"",
            "review 3: \"05W with Mikhail Gronas: If you're going to take Russian, you want to take it with Misha -- Professor Gronas. He's funny, and class is always interesting and peppy, which is important since it's likely to be a 9L. Homework is a pain, but it's necessary, and it doesn't really take that much time if you do it on time. The tests and quizzes aren't that difficult and if you put in just a little bit of study time you should do okay. You're expected to participate in class, but Misha's version of the Socratic method is far less painful than you might find in the Econ department. That said, it's not an easy subject, even if you're pretty good at languages. You have to go to class and drill and do your work if you want to actually learn Russian and learn it well. If you can, I'd recommend NROing it, but not slacking off, because then it would just be a waste of time. If you like languages, you can enjoy tackling Russian, and you might as well do it at Dartmouth where there are great professors like Misha.\"",
            "review 4: \"03W with Mikhail Gronas: once youve taken Russian 1, you basically knwo what russian 2 will be like just stick with it and try to keep up with all the readings and studying. if you dont put in the time this term, russian 3 will be ten times harder\""
        ],
        "Victoria Somoff": [
            "review 1: \"09W with Victoria Somoff: The professor was good and taught everything well. If there was a question on something she explained it till everyone did understand. She was easygoing and understanding of the mistakes that were made, which is essential in a beginning language course.\"",
            "review 2: \"08W with Victoria Somoff: Professor Somoff is extremely nice-go to her office hours, she would love to help you. She's a native russian speaker, so she certainly knows her stuff, although she does have a pretty thick russian accent (but if you're taking russian, it shouldn't be too hard to understand!) The only complaint that I had was that she wasn't (I believe) the one writing the exams, so she didn't always emphasize the things in class that we were tested on. But you can always ask her questions during the exam so that usually clears things up.\"",
            "review 3: \"08W with Victoria Somoff: Russian is a great language and it is taught very effectively! Although Prof Somoff is a native speaker and seemed rather inexperienced teaching intro classes, she was always responsive to our questions in class and tried really hard.\"",
            "review 4: \"08W with Victoria Somoff: Professor Somoff is a native speaker who's specialty isn't teaching Russian language, but Russian literature. Never the less, she was very helpful in learning the material and explaining concepts. Sometimes she speaks very quickly and with a native voice - this is very different from Professor Garretson (and Professor Rakova, I assume). But she's always good with answering questions and giving examples. You'll learn a lot of new verbs that aren't in the book.\""
        ],
        "Alfia Rakova": [
            "review 1: \"22W with Alfia Rakova: Alfia Rakova is the most lovely teacher in the world. She makes everyone learn despite how much effort you put in. I highly recommend her in any class.\"",
            "review 2: \"22W with Alfia Rakova: Great course that allows you to get out what you put in. Professor Rakova makes it clear that self study and repetition is key to mastering the material. I found this course to be one of the larger time commitments of the quarter. The review material for each exam makes it clear what is expected of you, and doing them almost guarantees a decent grade. I learned a lot in this course, most of the material became second nature by the final.\"",
            "review 3: \"08W with Alfia Rakova: This is much more interesting and fun than Russ. 1, although that was a great course too. Rakova is incredibly nice, and although the class did seem to move pretty fast, no one got left behind and I don't think I would have slowed it down if I was able to.\""
        ],
        "Jamilya Nazyrova": [
            "review 1: \"06W with Jamilya Nazyrova: Mila is really nice, though sometimes not so great at explaining things. The class overall was fun though, and not too hard although a bit heavy on the grammar. I wish we had done more conversation work.\"",
            "review 2: \"06W with Jamilya Nazyrova: Since both Russian 1 sections were combined this term, the class was less engaging than Russian 1.\""
        ],
        "John Kopper": [
            "review 1: \"09W with John Kopper: Kopper's a non-native speaker, and it shows in his lack of enthusiasm for the language. After loving my previous teacher, it really sucks to have him almost ruin Russian for me.\"",
            "review 2: \"09W with John Kopper: Professor Kopper is not a native Russian speaker. Therefore, he brings a linguist's perspective to the study of the language. This is very helpful because he often explains Russian grammatical concepts differently and oftentimes more clearly than the native speakers.\""
        ],
        "Tatiana Filimonova": [
            "review 1: \"23W with Tatiana Filimonova: FILIMONOVA IS SO NICE AND AMAZING!!!! She cares so much about her students and about the class. Taking Russian is one of the best decisions I've made here. She really, really wants her students to do well. Workload is not bad at all, couple pages of written homework a night. About three unit tests per term plus one final and a couple quizzes. Filimonova is so awesome and sweet, as is most of the rest of the Russian department :) <3\"",
            "review 2: \"23W with Tatiana Filimonova: This class was always the highlight of my day. Filimonova is an incredibly kind person who is passionate about both her subject and her students. Each day was always extremely fun and interactive. She engages all students during lessons and wants everyone to succeed. Russian may seem like a daunting language, but the instruction and department at Dartmouth totally changed my perception. The workload is always very manageable and consists of a few sheets a night; as long as you stay on top of the material, you're guaranteed to succeed. I highly recommend this class and taking Russian at Dartmouth.\""
        ],
        "Ainsley Morse": [],
        "Valentina Apresyan": []
    },
    "RUSS001": {
        "Deborah Garretson": [
            "review 1: \"09F with Deborah Garretson: Course: It's pretty grammar-intensive, but a good class all the same. Professor: Garretson is nice sometimes, but she'll also have a couple people that she consistently picks on. If she likes you it's fine, but if she doesn't it's tough. She knows her stuff, but isn't necessarily the best teacher Workload: Workload was decent, and steady throughout the term\"",
            "review 2: \"07F with Deborah Garretson: This is a great introductory language course. It takes work, but probably nothing compared to Chinese. Professor Garretson is very nice, and very enthusiastic about intonation and pronunciation. It's amazing how much you learn in such a short time--we were translating paragraphs into Russian after three weeks. Russian is a great language and this was a very good course.\"",
            "review 3: \"07F with Deborah Garretson: You should take Russian, it's really fun and an A for anyone who wants it. At the same time, maybe don't take it with Garretson. She's partially deaf and so can't really hold a properly interactive class.\"",
            "review 4: \"05F with Deborah Garretson: Russian I with Professor Garretson was very fun. The class eats up a lot of time, but isn't too hard.\"",
            "review 5: \"05F with Deborah Garretson: Garretson is really nice and although the course moves quickly, its not difficult to stay on top of the work. there is homework every day and the class meets four times a week with drill. don't be afraid to try russian, its really fun!\"",
            "review 6: \"03F with Deborah Garretson: Though learning Russian may seem like a daunting task, Garretson breaks the material down really well. She is a very nice lady and the course does not prove to be very difficult. The exams are graded fairly leniently and drill can actually be fun.\"",
            "review 7: \"03F with Deborah Garretson: Russian is a fascinating, wonderful language. I urge you to take it--no questions about it. Russian takes a lot of time, energy, and work, but it's worth it. Prof Garretson is a wonderful and brilliant prof, she was very kind but also very tough and motivating. She wants us all to succeed and does her best to help us do so. It was nice to be in a small group environment during my transition from high school to college. Definitely take Russian if you are considering it.\"",
            "review 8: \"02F with Deborah Garretson: If you have never taken a foreign language before ( and i mean REALLY learned it, not just took some silly thing in HS and learned a few vocab words per week)you can expect to have to work REALLY hard in this class It really takes motivation and time to do well in this class, simply because Russian is such a difficult lanuage. But it IS possible. If you reallty want to do well, there are al the rescources here to do well. The TAs are great, the profs are great, you can get a tutor, and the lanuage rescource center is great for studying. But dont take this class if you dont have 2 hours per day MINIMAL to set asside outside of class for russian... Drill alone takes up an hour and watching the video takes up about an half hour... and dont expect to do the homework well and learn anythign from it if you don't have atleast an hour to do that. Class meets 4-5 days a week and drill is 4 days a week... thats like 9 hours a week jsut for class time. It's tought, but really worth it if you want to know Russian.\""
        ],
        "Mikhail Gronas": [
            "review 1: \"20F with Mikhail Gronas: Professor Gronas is amazing! He is very funny and kind, and uses different approaches to make every student learn :) He is also very accommodating, such a wholesome man! He deserves the entire world.\"",
            "review 2: \"08F with Mikhail Gronas: Though Misha appears somewhat like the \"little bear\" his name translates to, he's as nice and inviting as any professor or teacher I've had. In class he's energetic and willing to answer any questions you'll throw his way. I highly recommend any class taught by him strictly for the reward of being able to have him as a teacher. Course work and tests aren't hard as long as you're willing to study a decent amount.\"",
            "review 3: \"08F with Mikhail Gronas: Gronas is enormous amounts of fun and very energetic. A great introduction to the language and you learn a lot!\"",
            "review 4: \"04F with Mikhail Gronas: Misha is a great professor, and he really helps you learn the material well. Russian is not an easy language, but this is a pretty typical Dartmouth language class. There's a lot of work, and the tests and quizzes aren't easy, but if you're willing to spend even just a little bit of time outside of class, then Russian is definitely interesting enough to spend the time and effort on. It's not just for freshmen either. I'm a senior, and I definitely don't need to take Russian. I NROed it, but I didn't need to -- there's a lot of work, but it's not hard to get a good grade.\"",
            "review 5: \"04F with Mikhail Gronas: This class was awesome, so is Misha. Who would have thought I'd enjoy Russian?\"",
            "review 6: \"04F with Mikhail Gronas: i liked it\"",
            "review 7: \"03F with Mikhail Gronas: Russian 1 was a lot of fun, particularly because Misha made it so great!\"",
            "review 8: \"02F with Mikhail Gronas: The class was good. It was well paced, and so I didn't have too many problems learning the materials. The homework and drill sessions helped with practicing the language. The only thing that was annoying was that the professor was sometimes disorganized. He would jump around topics, and we wouldn't know what to expect on quizzes or tests. For the oral portions of the tests, he would take too long with each student, so there were test days that we would stay an hour after the class had ended (even though we showed up 45 minutes early to allow for extra time). Professor Garretson was really cool, though. The people who had her really liked her, and the few times that she taught our class she seemed really organized.\""
        ],
        "Jamilya Nazyrova": [
            "review 1: \"05F with Jamilya Nazyrova: Russian is a tough language, but it seems like the course is made pretty easy to compensate. Mila and my drill instructor (Abby DeBellis) are both extremely nice people and care a lot about getting the class to understand the often puzzling material. However, Mila's comprehension of questions in English (which is all of them) is sometimes shaky. Class with x-periods every week and four days of drill are time consuming, but homework is straightforward, and tests are graded leniently. Only take this class if you are actually interested in learning the language; obviously, spanish/french is easier for most people to fulfill the language requirement, but I'm having a really good experience in first year russian.\"",
            "review 2: \"04F with Jamilya Nazyrova: This course was interesting and the prof. made it an excellent course. The language is hard so it takes a little more work than another language. The different alphabet makes it harder. The course takes a little extra work but it isn't that bad, it is easy to get a good grade in the course. It is really hard to get lower than a B.\"",
            "review 3: \"04F with Jamilya Nazyrova: even though it's hard at first, and the grammar can be tricky, this has been an incredibly interesting class and I learned so much of the language.\"",
            "review 4: \"04F with Jamilya Nazyrova: As far as language classes go, Russian 1 was awesome! The class is fast paced but the prof is very effective at teaching the material. The more effort one puts in the class, the better one will learn the language.\"",
            "review 5: \"04F with Jamilya Nazyrova: Russian 1 is such a great course! I learned so much in this class it's unbelievable. Mila is so nice and so approachable, and she comes up with all these fun activities in class that both help you grasp the language better and enjoy learning it. I took this class as a fourth class, with three other major requirements actually, and it was one of the best academic decisions I ever made at Dartmouth. It's really manageable as long as you can take 20-30 minutes every other night to do the homework and a quick review. Yay!\"",
            "review 6: \"04F with Jamilya Nazyrova: Instruction was based mostly on the CD-ROM audio and video materials you are required to buy. Drills make up a large part of the learning process, but overall the class has a very relaxed, no-pressure atmosphere. The profs are excellent in cultivating the class's desire to learn the language.\""
        ],
        "Alfia Rakova": [
            "review 1: \"22F with Alfia Rakova: Rakova is a fantastic professor whose passion for teaching is clear. I was very hesitant to take Russian, knowing that it's more difficult than the \"standard\" languages, but the course is truly geared for complete beginners with no prior experience. I really enjoyed going to class — Rakova made learning fun and accessible, and often shared interest anecdotes from her life. As long as you do the homework and put in effort, you will do well. I highly recommend Russian 1 for anyone looking to try something different, as it's definitely not as menacing as one might expect it to be.\"",
            "review 2: \"08F with Alfia Rakova: Professor Rakova made the classes interesting. She is funny. The course is intense though. We move very quickly through the material. Overall, it's a good course with an excellent professor for a fascinating language. Take Russian\"",
            "review 3: \"08F with Alfia Rakova: Great professor, interesting class, gives a great start to the language\"",
            "review 4: \"08F with Alfia Rakova: definitely take this class with rakova! russian is a challenging language, but she always makes class fun and is very easy-going. note: the pop-quiz style dictations are not included in your grade! she told us about a month into the term that they were just for us to gauge our own progress\"",
            "review 5: \"07F with Alfia Rakova: While I hated morning drills, this class was so interesting! Professor Rakova is interesting and animated! I'm usually really bad at learning languages, but she made it easy!\"",
            "review 6: \"07F with Alfia Rakova: There are parts of Russian that are difficult, but Prof. Rakova always makes sure you understand the material, and she is a very engaging professor. She tells great stories, but stays on topic and makes sure to go over the material. She is demanding, but very sympathetic if you have problems outside or inside of class.\""
        ],
        "Valentina Apresyan": [
            "review 1: \"21F with Valentina Apresyan: This was my favorite course this term! If you have the chance and/or the desire to take RUSS 1, do it with Prof. Valentina Apresyan! She is wonderful, super enthusiastic and genuinely cares about your acquisition of this quite difficult language. You definitely need to put in the work when it comes to the worksheets and be engaged in class to do well, but this course by no means dominates your time.\"",
            "review 2: \"21F with Valentina Apresyan: This professor was absolutely amazing. She cared if you were learning and tried her best to ensure everyone was on the same page. The class does move very fast, way faster than most introductory language courses. It takes a lot of work, but if you do your homework and put in the effort, you'll get an A.\""
        ],
        "Ainsley Morse": [
            "review 1: \"21F with Ainsley Morse: Professor Morse was an outstanding professor for this class. The course picks up the pace a couple weeks in and some weeks are intense. The grading policy is great and affords plenty of opportunity to learn from mistakes and improve. You definitely need to put effort into the homework, class discussions, and drill if you want to feel confident in the language.\""
        ],
        "Sara L.": [
            "review 1: \"06F with Sara L.: The class isn't difficult; learning Cyrillic is daunting at first but the pace is fairly slow. Professor Pankenier is great; very accomodating, helpful, enthusiastic. I took the class on a whim and am glad I did.\""
        ]
    }
}