{
    "SPEE020.01": {
        "Darlene Drummond": [
            "review 1: \"23S with Darlene Drummond: Dont take with drummond wack lectures barely anything from readings or lectures were actually used in our speeches. prof a bit condescending and grades harshly. should have been a great class but prof ruined it take with another prof if u can\"",
            "review 2: \"23F with Darlene Drummond: Do not take this class with professor Drummond. Yes it’s the not the hardest A, but definitely not a layup.\""
        ],
        "Joshua Compton": [
            "review 1: \"18W with Joshua Compton: TAKE THIS CLASS. I can honestly say this class made a real impact on my life; the way I perceive public speaking and the way I perceive my own public speaking capabilities. It's not a difficult class either!\""
        ]
    },
    "SPEE020.02": {
        "Svetlana Grushina": [
            "review 1: \"23W with Svetlana Grushina: Not sure what these people were talking about because this class and prof sucked. I learned literally absolutely nothing. There were only like four speeches the entire class and it ended in a \"Social Impact Project\" where we did like consulting for a nonprofit's social media strategy. It made no sense and took up so much time and I learned nothing about public speaking from it. To top it all off the nonprofit didn't even show up to our big final presentation rendering the entire thing basically pointless. Also, all the course material is based around meaningless concepts like \"presence\" and \"identification\" and she will use these buzzwords constantly without ever really explaining what they mean or how we're supposed to apply them to our speeches. I guess it was a layup but that was about the only good thing. Do not take this class with her, take it with Compton.\"",
            "review 2: \"23W with Svetlana Grushina: Took this class as a layup and yes, it is a layup, but no, it's not enjoyable. It was so underwhelming I dreaded going to class. My public speaking did improve but it's definitely not because of what's taught in class. The professor puts some effort into being nice but it is often through awkward personal stories that took up 45 minutes of class time. Class materials are extremely dry. Grading is also extremely biased. If you want a layup and have the mentality to deal with all this mess, sure. Otherwise, RUN.\"",
            "review 3: \"23W with Svetlana Grushina: Undoubtedly the worst class I have taken in my entire time at Dartmouth. I took this class because I knew it was an easy class and about a topic that I was inexperienced in. The class proceeded to be a firehose of useless readings from a textbook that sounds like it was written for middle schoolers, even more useless rantings from the professor as she rambled about the sign she saw on the side of the road for an entire hour, and incredibly uncomfortable details about the professor's personal life peppered with strange critical comments about the members of the class. The final project is a \"social impact project\" that resulted in us spending tens of hours on an project that did not have anything to do with the class, served as a massive waste of time, and was skipped by even the organization we were supposed to present in front of. Complete joke of a class; even if you're looking for a layup, pay your tuition dollars a tiny amount of respect and choose a better layup.\"",
            "review 4: \"23W with Svetlana Grushina: If you want a layup where you get a little bit of public speaking experience, I'd recommend this class. Overall it was very boring but Svetlana is an easy grader and you can do other work during class. If you want to learn something, don't take this class.\"",
            "review 5: \"23F with Svetlana Grushina: This was an amazing class! I learned strategies to make my speaking more persuasive, and I improved my comfort with public speaking. We also got constructive feedback from everyone in the class after each speech, so I got a lot of input on how to improve as a speaker. Prof Grushina is very kind, and I felt like there was a nice sense of community since I learned so much about everyone by the end of the term after hearing all their speeches tailored to their interests. Great people and a great learning opportunity.\"",
            "review 6: \"23F with Svetlana Grushina: Basically what everyone else has said. The class is without a doubt a layup, half the points are just completion grades for written reflections and the other half are speeches graded pretty easily. However, it is super boring and you’ll dread going to class. The first half of the course is a combination of pointless lectures, half of which are just the prof’s personal stories, and utterly irrelevant readings from books about argumentative and linguistic theory that seem to have been written in a language other than English and a textbook which, as someone else commented, sounds like it’s for middle schoolers. The second half is mainly speeches. We gave like 6 speeches in total and you can usually just write out your notes an hour before class and you’ll be fine. When you’re not giving a speech you’re listening to someone else’s, which can get extremely boring as you’re also filling out the same feedback form each time. TLDR: big layup but unbearably boring. Take it if you want an easy A, but there’s really no point besides the art distrib\"",
            "review 7: \"23F with Svetlana Grushina: GREAT class. I cannot speak highly enough of Prof. Grushina. She is so caring, flexible, and intelligent. I think everyone should take this class before they graduate. If you buy in to the class, you will learn a lot and become a much better public speaker. It's a layup in the sense that if you put in the time, you will get an A. But if you plan to write your speech an hour before class it will not be fun for you. You'll get out of it what you put in. All in all I'd highly recommend -- it was my favorite 10A ever taken at Dartmouth.\"",
            "review 8: \"21W with Svetlana Grushina: Super nice and understanding prof! First half of the class is more reading based while latter half is basically all speeches (about one per week). If you do the work, this class is a layup. Honestly a great class that teaches you about a variety of rhetorical devices you will use in speeches about personalized topics. Take it!\"",
            "review 9: \"21S with Svetlana Grushina: Public Speaking with Grushina is definitely the way to go. I tried Drummond and dropped it after she bombed me on the first speech with really no helpful feedback. Then, I took Grushina this term and she eased us into how to give speeches and definitely seemed like a far easier grader. I couldn’t help but appreciate also the community she built in this course with how she really tried to connect to students. I would definitely take this class if you’re looking for a Layup/interesting subject you’ll never really get an opportunity to learn how to do in your normal major. Assessment wise, just put in effort and I’m sure you’ll get an A. She recognizes kids who try and those who don’t.\"",
            "review 10: \"21F with Svetlana Grushina: Great class, highly recommend trying to take this class at some point in your Dartmouth career. There was a huge waitlist so have a backup in mind when you sign up for it. I felt much more comfortable with public speaking by the end of the term. Really felt like I got to know my classmates and Professor Grushina is one of the nicest profs I've had at Dartmouth too. Little bit of busywork involved but this class is very chill and worth it.\""
        ],
        "Josh Compton": [
            "review 1: \"22S with Josh Compton: Awesome class. Low workload, you do a speech a week on average (sometimes two, but this usually means one is a rough draft) and it's pretty much up to you how you prepare for it. This plus reflections on your speeches makes the course extremely manageable... but it's a great use of your time. Prof. Compton encourages a dialogic style, which means you speak like you'd talk rather than trying to sound overly academic or professional. Some speeches still involve research, but I was super pleasantly surprised by my desire for a casual tone being encouraged and requested by the professor instead of something I had to fight for. I also only had to memorize One speech the entire term, the rest you can have notes. Low pressure, high reward – I emerged a more thoughtful and confident public speaker and everyone in the class was very supportive of each other.\""
        ]
    },
    "SPEE040": {
        "Joshua Compton": [
            "review 1: \"24W with Joshua Compton: Awesome class! Super interesting theory, really friendly professor, and you make close friends throughout the term.\"",
            "review 2: \"24W with Joshua Compton: Compton is goated. Best Prof I have had at Dartmouth. Class was super fun, interesting, and my public speaking greatly improved. Definitely going to take another course with Compton soon.\"",
            "review 3: \"20W with Joshua Compton: layup class, but there is a ten page paper at the end. only part of the class that wasn't really a layup. prof is a really nice guy and is always willing to help you out, and just wants you to enjoy the class. he'll talk about anything you want to, really. you get close with your classmates and have a good time. many one-two min speeches and then two longer speeches, 6-8 and 7-9 minutes, all over inoculation theory. it's a cool theory, but it does start to get boring after a bit. recommend\"",
            "review 4: \"20W with Joshua Compton: Really great prof and class. The readings were a bit dry but at least skim over the methods used in the research and the final results. Overall a very fun class and a really good layup. As long as you put in a little bit of effort you'll get an A-. Prof. Compton said he only teaches this class every couple of years so I'd take the chance if it comes up again.\""
        ]
    },
    "SPEE037": {
        "Darlene Drummond": [
            "review 1: \"23W with Darlene Drummond: DO NOT TAKE THIS CLASS. It will be the most miserable experience you can imagine. I hated every second of the class. Many people dropped throughout the term despite the course being \"easy\" because it's brain numbingly stupid. The professor is pretty engaging but the material she covers is absolutely useless and laughable. The class is very poor in quality and the department clearly doesn't care about it. One of the units is telecommunication - you will be watching youtube videos from early 2000s and how revolutionary it was to treat patients through video calls. Please I beg you do not take this class. Literally take any other class. This class is more frustrating than easy. The exams are weirdly hard, multiple choice questions that has nothing to do with class material.\"",
            "review 2: \"23W with Darlene Drummond: WORST CLASS EVER! DO NOT TAKE IT OF YOU WANNA HAVE A SANE TERM. THE PROF WAS MAKING THE MIDTERMS HARD (TESTING ON MATERIAL NOT COVERED IN CLASS AND MAKING US READ WHOLE CASE SCENARIOS THAT ARE SO IRRELEVANT) FOR NO REASON. JUST DON'T TAKE THE CLASS IF YOU LOVE YOURSELF AND WANT TO LOVE DARTMOUTH FOR THE REST OF UR LIFE.\"",
            "review 3: \"21W with Darlene Drummond: Worst course and professor I've had so far at Dartmouth. I could write pages about the problems I had but I'll keep it brief. Professor Drummond prerecorded lectures for the entire term on a shitty laptop mic so ~50% of each lecture was incomprehensible. Not that it would have mattered if we could hear her though, because her lectures were read directly from a script and she didn't indicate she actually understood the topics she was teaching at all. The quizzes, midterm, and final were all multiple choice with extremely stupid questions. Instead of relevant vocab questions, she asks about topics that appear only on one line in the textbook and were, at best, tangentially related to anything we were hoping to learn. Lastly, her big essay requires you to write about a real experience you've had in the health field. Not only does this require you to have had or witnessed a health emergency, but also to write about it. It's incredibly inappropriate and so obviously out of bounds to ask students to recall exact conversations to the word they had years before the course and also to analyze them for a professor they have no prior relationship with. Extremely disappointed because communication and the health field are both topics I am interested in but will likely never take more courses at Dartmouth in the future if this is indicative of their quality. Please don't take this class. Please.\"",
            "review 4: \"19F with Darlene Drummond: Classes are largely discussion-based, but there's no participation component of the grade. MC tests were weirdly difficult -- Drummond looks for obscure things that were maybe mentioned in class conversations once. The other projects are straightforward and graded easier. Readings were interesting but redundant, sometimes topics just seemed irrelevant. Not the most practical course, a lot of it seems like common sense but learned some terminology to frame what we already know.\"",
            "review 5: \"19F with Darlene Drummond: This class was a good class. I took it as a freshman in the fall, and I learned a lot of actually applicable information to be an adult in the real world, like being your own health advocate. I think this is great for all premed students who want a realistic glimpse into the medical system. The work was super manageable because you didn't have to read the readings super closely. I mostly just jotted down vocab and definitions towards the end. The midterm and final exams are multiple choice, select all that apply, and some fill in the blank and it was a \"takehome\" on Canvas. Kind of hard compared to the rest of the class, but I still ended with an A because if you go to her to review the two papers you write, she'll help you do what you need to earn the A. Also, Drummond is just super interesting and funny. Would recommend!\"",
            "review 6: \"16F with Darlene Drummond: A wonderful prof and great class. There was a lot of reading, but it was all very intuitive and sometimes repetitive. Overall, so glad I took this course!\""
        ]
    },
    "SPEE036": {
        "Svetlana Grushina": []
    },
    "SPEE034": {
        "Joshua Compton": [
            "review 1: \"22F with Joshua Compton: This class was honestly amazing. A great class to take alongside a heavy courseload, since there is a moderate level of work. Professor Compton is extremely understanding of different circumstances, and is one of my favorite professors at Dartmouth, I would certainly recommend taking this class, or even another Speech class with him.\""
        ]
    },
    "SPEE031": {
        "Adedoyin Ogunfeyimi": [
            "review 1: \"21W with Adedoyin Ogunfeyimi: I like this class because the workload is manageable, meaning you can actually learn a thing or two (at least compared to courses I've taken in the Gov department). Readings were a maximum 20 (usually 10-15) pages per week, and I was surprised when I found myself doing them and learning from them. 'Doyin is super-chill and will reward you well for putting effort into the projects (3 essays, 3 1.5-page reading reaction-papers, and two or three graded presentations sprinkled throughout the term). Overall highly recommend!\""
        ],
        "Ogunfeyimi Adedoyin": []
    },
    "SPEE030": {
        "Joshua Compton": [
            "review 1: \"24S with Joshua Compton: This is an AWESOME class! The small speech classes at Dartmouth always create such a nice community by the end of the term. Professor Compton is very passionate and friendly, he is an amazing prof. The speeches were fun to write, give, and listen to. You also learn a lot about how to write better speeches and how to view public speaking. Definitely recommend.\"",
            "review 2: \"19S with Joshua Compton: Fantastic class. Compton is so welcoming and nice, and he really makes you a better speaker and writer. Give one or two speeches a week, each being one or two minutes long. Give two big keynote speeches also, 6-7 min and 7-8 min long. Also write a paragraph self-reflection over each speech, and most of the grade comes from those self-reflections, so if you spend a bit of time writing those well, your grade can be boosted pretty quickly. Also gave a speech using a teleprompter that we had never seen before but was written by someone else in the class for us to give, which was super cool. Also had two former presidential speechwriters visit and talk to us for about two hours. Super amazing class, not a lot of work at all, a layup but you learn a lot and have a great time doing it. Highly recommend.\"",
            "review 3: \"17S with Joshua Compton: This is the best class I've taken at Dartmouth. It is so engaging and interactive. I got so close to my classmates and not only made me a better speechwriter and speaker, but also a better listener. Could not recommend more!\""
        ]
    },
    "SPEE027": {
        "Darlene Drummond": [
            "review 1: \"21S with Darlene Drummond: The prof seems to be really bad at respectful communication even though she teaches communication. I have never seen a professor who doesn't address students' names in the email, and expect a \"model answer\" even though it's more of a personal opinion class. The exam format is also a total bs, you do 15 MCQ questions on the trivial text details every week that seem to be pulled out from control-F by the professor in 5 min. Also, if you are good at connecting ideas and writing essays, it's not valued in this class as well. The prof only looks for specific answers she has in mind and looks for areas to deduct points, not areas to give you credits. Not sure whether online formate has made this class more difficult, but this is def the worst class I've taken at Dartmouth. Huge regrets not dropping it in week7.\""
        ]
    },
    "SPEE026": {
        "Svetlana Grushina": [
            "review 1: \"20W with Svetlana Grushina: Decent class- get to talk a lot about media concepts that are relevant to today's world. Class is almost entirely discussion-based. Lots of readings but not many do them legitimately. Lots of short papers (2-page single-space) and other assignments but are graded relatively easily. Would recommend this class if you are interested in the subject matter!\"",
            "review 2: \"20W with Svetlana Grushina: This is a really broad overview of the field of media studies--super interesting readings if you are interested in them, but also very easy to gloss over/skim as they aren't discussed at length in class. Time in class wasn't particularly well structured, but if you are looking for a fairly easy, interesting class, this is a good one.\""
        ]
    },
    "SPEE025": {
        "Jim A.": [
            "review 1: \"05W with Jim A.: This class was great, so useful for ANYONE. Kuypers is a great prof, he really helps you learn while at the same time being very supportive and sensitive to the fact that public speaking makes some people very nervous. You'll learn so much about speaking and how to improve yourself. Also, the way the class is structured, each person does a series of 4 speeches on the same topic, each time addressing a different angle or part of the arguement. This way you really get to learn a lot about your own topic, and about the topics of the other people in the class, which was really valueable in itself. Bottom line: great class. take it if you can. It's not hard, you learn a lot, it's fun.\"",
            "review 2: \"05W with Jim A.: This class is a great concept, lots of Dartmouth students should take a speech class before graduation. However, I must warn you that the Professor is not a great lecturer, and the material in the book can be kind of dry. On the bright side it is a lot of fun to give speeches on something you care about, you learn a lot about the interesting topics that your fellow classmates, and everyone improved over the course of the term.\"",
            "review 3: \"02W with Jim A.: This is a decent class but don't go into it with great expectations. The midterm is difficult and it is mostly random crap from the book that you read for class. There were sections that I wrote down exactly what he said in class and got half credit and a couple of sections that I completely made up and got full credit. Go figure. The speaking part of the class is really disconnected from the theory that you read in the textbook (which is about 300 pages long, soft cover, and cost about 60 bucks). All in all, I guess Kuypers is a fair grader on the speaches and there is good comaraderie among the students, kind of a \"we're all in this together\" thing. Take the class if you think you might like it but don't expect too much out of the class or the prof.\"",
            "review 4: \"02W with Jim A.: Kuypers is a nice guy, with an unintimidating approach to speech. He guides discussion well, and doesn't allow any personal insults or inappropriatness etc. The class often gets out early, and the 2A seems short once people start giving speeches. Its interesting and you get to know the people in your class really well. The written test is a bit tough, you REALLY need to study the book - which is boring. But overall this is a GREAT class. Don't be scared! and it's such a useful tool to have . . . .\""
        ],
        "Joshua Compton": [
            "review 1: \"23S with Joshua Compton: This has been my favorite class I have taken at this school. Compton is amazing and is energetic, down-to-earth, and provides amazing feedback. Starting Week 2, the way how the class operates it that every class you give either a 1 or 2 minute speech, and there are two longer 5 minute speech assignments. You learn to apply speech theory to your arguments to make them more persuasive and, and I can honestly say that my public speaking drastically improved over this course. Not a standard layup in that you have to put effort into prepping for speeches and speech reflections, but also not a challenging course at all. I shouldn't have to tell you twice to take this course -- 10/10!\"",
            "review 2: \"23S with Joshua Compton: A quality, quality class. One of the best I have taken over my time at Dartmouth. Nice to learn not only “surface-level” techniques to speech (good cadence, eye contact, air support, etc) but the underlying theories behind what persuades people. Not only do you become a better speaker, but the class is very much designed for you to retain the knowledge long after Dartmouth in a way few if any other classes at Dartmouth are. The feedback is great, very detailed from Compton and nice to have a range of advice as students also give advice to each other after each speech. As the other 23S review noted, you speak a lot. It seems daunting at first, but you get into it the rhythm of it pretty quickly, and become much less nervous. Your great is mostly (80 or 85%, I forget) speaking + self-evaluations in writing for each speech, with other short writing assignments (a 3-pg double-spaced essay at the end of term and a couple Canvas posts) making up the rest of your grade. This class is not difficult, but it is not layup in that it requires you to put a good amount of time into crafting, practicing, and evaluating your speeches. If you “wing” your speech from the podium, unless you are a phenomenal speaker, it will show. For grading, you receive a “snapshot grade” with you feedback from Compton. It is given to you at the end of class. This is not your final grade, as your evaluation is also considered and usually helps improve your grade (so put a fair amount of time and energy into this). For the snapshot grades, you won’t get below a B+ unless your speech is pretty rough. A- is an ok/good speech and A is a good/great speech. Grading generally gets easier as the term goes on and you get better, which is nice. With the evaluations and writing assignments (usually graded generously) factored in, you should be able to get an A- fairly easily and an A with ~2-4 hours of work on average put in outside of class for each session. Again, this isn’t difficult or strenuous work (pretty fun, actually), but you do need to put some time in to earn the A. Overall, a very fun class with a great professor that I would highly recommend taking. One of my favorite at Dartmouth. This class is only offered every couple years, so if Speech 25 isn’t offered during a particular term, anything with Compton is well-worth taking.\"",
            "review 3: \"22S with Joshua Compton: I highly recommend taking this class with Professor Compton! You will become a lot more comfortable w/ public speaking because you will be writing and giving a lot of speeches. This class is not a layup in the sense that you are doing a lot of writing and speaking. But, the grading is pretty reasonable. After each speech, you have a written reflection where you apply speech theory to reflect on your speech. I found the reflections to be a helpful exercise, and they can boost your grade. It's a great class environment--everyone is supporting you and giving you constructive feedback. You will learn how to apply theory to public speaking, so you'll understand why certain persuasive public speaking techniques work, rather than just memorizing tips and tricks. Professor Compton brings great energy to the class.\"",
            "review 4: \"09W with Joshua Compton: Professor Compton is an amazing lecturer -- the lectures are more like structured conversations, because he's so tuned into the class. The class is small and you have a lot of discussion projects so you bond quite a bit. Lots of speeches and reading, which can be time intensive but rewarding.\""
        ]
    },
    "SPEE020.03": {
        "Darlene Drummond": [
            "review 1: \"23S with Darlene Drummond: great prof but super boring class. bit of a harsh grader so id recommend taking with any other prof. also drummond has a rule where 2 absences substracts 5 points from your overall final grade regardless of reason so you could be more sick than Johnny Test and still get punished. also she stares at you a little long during lectures\""
        ],
        "Svetlana Grushina": []
    },
    "SPEE020": {
        "Joshua Compton": [
            "review 1: \"22F with Joshua Compton: This class is amazing. Take it with Compton, he is the BEST. Such a nice guy. You will come out of this class a much better public speaker, and this is a massive layup. Speech 20 rocks.\"",
            "review 2: \"19F with Joshua Compton: Surprised there haven't been any reviews of this class recently. I hardly need to tell you to take this class. Everyone knows it's great, and all I'm here to tell you is: yes, this class is tremendous. Take it\"",
            "review 3: \"13S with Joshua Compton: Course: This course is pretty straightforward- practice public speaking every class period and get evaluated by an expert who is passionate about the subject. I recommend taking it- it can only help you improve an important skill. Professor: Really couldn't ask Prof. Compton to do any more than he does. He evaluates every speech you make- not a single day wasted in his class. One of the best, most proactive profs I've had @ Dartmouth. A really nice guy as well. Workload: More work than I initially thought actually- blogging and preparing speeches seemed to add up (\"busy work\"). Grading is not bad though so as long as you put effort in its not a huge burden.\""
        ],
        "Claudia Anguiano": [
            "review 1: \"12F with Claudia Anguiano: Course: I definitely recommend taking a public speaking course. You'll need it no matter what you do. There are numerous speeches paced out throughout the course that definitely help you improve as a speaker simply because you keep giving speeches. All the assignments are manageable, and if you do your work, you'll get an easy A/A-. That being said, avoid Anguiano if you can. Professor: Take this course with Compton instead!! Anguiano is a poor speaker and often seemed nervous and unsure of herself. She had little to no part in improving my public speaking, so if you're looking for a professor who really knows this stuff, go for someone else. Workload: The work is very manageable, and it's easy to do well if you prepare for your speeches. There are ~6 speeches, including a group project and final impromptu speech.\""
        ],
        "Svetlana Grushina": [
            "review 1: \"23F with Svetlana Grushina: Easiest class I've taken at Dartmouth but I learned a lot. We got really close as a class and Prof. Grushina is so kind! Highly recommend it if you need a fun layup.\""
        ]
    }
}