{
    "WGSS066.18": {
        "Maria Vallarta": [
            "review 1: \"22F with Maria Vallarta: This was such a fun and engaging class. Prof Vallarta is amazing and they care a lot about their students and the material. The final project was a creative piece and it was very fun to do. I would def recommend taking this class.\""
        ]
    },
    "WGSS012": {
        "Mingwei Huang": [
            "review 1: \"22F with Mingwei Huang: I learned so much in this class. Mingwei does a great job at unpacking complicated readings and walking you through them. The content is hard to grasp but as long as you do the readings and engage in meaningful discussion you will get an A.\""
        ]
    },
    "WGSS001": {
        "Misty De Berry": [
            "review 1: \"22F with Misty De Berry: Misty is absolutely the best. I recommend taking any class with her. The most wonderful woman in the entire world, her presence feels like a warm hug. If you're into gender/race/political theory TAKE THIS CLASS. Would highly recommend. The classroom environment is just really really awesome.\"",
            "review 2: \"22F with Misty De Berry: Take any class with Misty. Literally the GOAT. Peace circles and breath work. Readings every class, largely not needed to be successful but super interesting. I felt as though it was a layup.\"",
            "review 3: \"22F with Misty De Berry: Totally worth it. Such a good class and the readings were really interesting as well. I have heard a lot of good things about Misty as well even before taking the class and it held true. Just make sure you participate in discussion and get things done then you'll be fine\""
        ],
        "Esther Rosario": [
            "review 1: \"23X with Esther Rosario: Prof. Rosario is lovely, and this class was wonderful. Class was mostly lively discussion, with frequent connections to our own lives.\"",
            "review 2: \"23X with Esther Rosario: Boring and basic. Esther wanted people to get interested in the philosophy but the class was full of surface-level thinkers who only ever talked about hardships they saw in their own lives, making that constitute the entirety of our discussions. No complex thought involved, extremely easy class.\""
        ],
        "Mingwei Huang": [
            "review 1: \"23W with Mingwei Huang: Definitely a layup. Mingwei was super sweet and understanding about everything and cared a lot about the students. Some of the readings and class discussions were super interesting, some felt very removed from reality and confusing. Format was: 1-2 readings before every class, class discussion and some board work each class, midterm project and final project. All very manageable and usually just skimmed the readings to know what we were talking about and to be able to contribute something. Not an easy A (more like an easy A-) because your entire grade is dependent on the midterm and final projects but easy in the sense that the workload is very low.\""
        ],
        "Sarah Chant": [
            "review 1: \"23F with Sarah Chant: Goated Professor, Goated class. Two reflections in which you can easily score perfectly, one event-writeup, and one final paper. Ridiculously easy course load. Professor is the funniest and very quirky, super cool person. Prob my fav class at Dartmouth no cap on god.\""
        ]
    },
    "WGSS067.02": {
        "Veronika Fuechtner": []
    },
    "WGSS066.19": {
        "Joseph Aguado": []
    },
    "WGSS066.17": {
        "Emilia Sawada": []
    },
    "WGSS066.16": {
        "Carolyn Choi": [
            "review 1: \"22S with Carolyn Choi: Professor Choi was great, and taught about so many interesting concepts around the world. I will admit, at first I did not really know what I was getting myself into, but I quickly learned: it's about feminism around the world and how women show agency in different ways, and how to be effective allies to women around the world. There were weekly discussion posts, readings, a midterm-making midterm, a paper, student presentation, and public facing project. It seems like a lot, but it wasn't too much to handle. Would call it a layup if you didn't do the readings, or just skimmed the readings, but if you did that, you'd probably have a hard time with assignments.\"",
            "review 2: \"22S with Carolyn Choi: This class was transnational feminist sociology which was not clear to me until the course started. This ended up being the class I have felt I learned the most from here at Dartmouth - it shifted some of my world perspectives and made me feel much more knowledgeable about topics like reproductive labor, global care chains, migrant labor, migrant sex workers, and family dynamics across the world. The workload involved some dense readings, but they were all discussed thoroughly in class and made sense by the end. The final project and paper were both super open-ended which allowed for creativity and made it accessible to however you learned and worked best. Would recommend for sure.\""
        ]
    },
    "WGSS066.14": {
        "Claudia Olivetti": []
    },
    "WGSS066.13": {
        "Irmela von der Luehe": []
    },
    "WGSS066.12": {
        "Misty De Berry": []
    },
    "WGSS066.11": {
        "Kimberly Brown": [
            "review 1: \"23F with Kimberly Brown: This class is incredible. It felt more like a family than a class. Professor Brown is extremely chill and immensely knowledgeable about the subject and makes that clear through the guided, but mainly student led discussion. This class was a 6B. The breakdown is as follows: 20% attendance and participation, 20% response papers (1 page and 5 in total), 20% 10 minute presentation on a text that week, 25% 15 page research paper at the end of the term, and a 15% generosity and grace exception. The last one was great because she would transfer 15% of your grade to wherever you needed in order to bring it up. I would 100% recommend that you take this class when she teaches it again in the 2024-25 school year!\""
        ]
    },
    "WGSS007.20": {
        "Tyler Monson": []
    },
    "WGSS003": {
        "Mingwei Huang, Jorge Cuellar": [
            "review 1: \"22S with Mingwei Huang, Jorge Cuellar: Very interesting class. One of my favorites at Dartmouth so far. Quite disorganized at times but very experimenting and daring.\""
        ],
        "Jorge Cuellar": [],
        "Mingwei Huang": []
    },
    "WGSS066.15": {
        "Laura Edmondson": []
    },
    "WGSS066.09": {
        "Abigail Neely": []
    },
    "WGSS066.08": {
        "Kimberly Brown": [
            "review 1: \"22W with Kimberly Brown: Cool class. Not like any other I'd taken at Dartmouth. Prof Brown is great and cares a lot about her students.\""
        ]
    },
    "WGSS066.07": {
        "Kimberly Brown": [
            "review 1: \"23F with Kimberly Brown: Prof Brown is the best! She's super chill but deeply knowledgeable about the subject. She went out of her way to buy us food sometimes and to bring us to talks for class. Take this class! The layout is as follows: 20% attendance and participation, 20% response papers (1 page long, 4 in total), 20% 10 minute presentation, 15% midterm paper (5pgs), and a 25% final paper (7pgs). There's also a 15% generosity and grace exception where she would move 15% to wherever you needed it most to bring your grade up. So hard to not do well in this class when the conversations are incredible and the expectations are so clear.\"",
            "review 2: \"23F with Kimberly Brown: One of the best professors I've ever had at Dartmouth. I won't go over the structure of the class because the review above mine already did so. This was such an amazing class. The class was pretty small and that made discussions feel like regular conversations. If you complete the readings you will genuinely enjoy the class and be able to contribute to the fun discussions. Like all Literature classes, some of the readings were lengthy so I would recommend planning early on in the term how you will tackle those when the term gets busy.\"",
            "review 3: \"22S with Kimberly Brown: One of the best classes I have ever taken. Professor Brown is amazing. I took this class for my WGSS major and she made every piece and reading so thought-provoking. The books in this class are actually fun to read!\""
        ]
    },
    "WGSS066.06": {
        "Najwa Mayer": [
            "review 1: \"21X with Najwa Mayer: Najwa is an amazing person. Truly a gem. With that said, I would not take this class unless you are 1) looking for a layup or 2) truly interested in ethnic and cultural studies. You are getting a survey of film and ethnic studies, and these fields require a very particular set of interests to stay really engaged with.\"",
            "review 2: \"21X with Najwa Mayer: Najwa is a brilliant and very approachable professor. She genuinely cared about the students and the workload for the course was very manageable. The course covers a lot of topics, all of which are pretty niche. Because of this, some weeks I felt like I connected with the readings while others I felt I had nothing to bring to the discussion. She also gave back extremely thorough feedback which I found to be very helpful for my writing/reading. Overall very glad I took this class.\"",
            "review 3: \"21X with Najwa Mayer: Definitely a layup. I put the least amount of work into this class compared to my other two and got an A in this one but not the others. Material is engaging, her lectures could get a bit dull if you're not interested in the super-niche topics. But paying attention to readings and lectures certainly not required to do well in the class. Participating was also pretty easy and the assignments weren't hard\"",
            "review 4: \"21S with Najwa Mayer: Prof. Mayer is the sweetest and nicest. Super knowledgeable, very caring lady. Class material is cool if you're interested in media, Asian American studies, or even just race generally. We only had I think 4 assignments the whole term that were very manageable. Najwa is also very accommodating w extensions, and really knows her stuff and will challenge you while allowing you to have your opinion. 10/10 recommend\""
        ]
    },
    "WGSS066.04": {
        "Misty De Berry": []
    },
    "WGSS056.11": {
        "Mary Desjardins": []
    },
    "WGSS007.12": {
        "Annabel Martin": [
            "review 1: \"21S with Annabel Martin: This class was a highlight of the term. The workload was light but I learnt so much and Prof Martín is so wonderful. She is lenient, talks about whatever you want to discuss and continuously praises your work. \\i would only say, be prepared to talk in class, she doesn't let anyone sit through class without contributing to discussion. Great class, would recommend!\""
        ]
    },
    "WGSS048.09": {
        "Carolyn Dever": []
    },
    "WGSS066.03": {
        "Eng-Beng Lim": [],
        "Tyler Monson": []
    },
    "WGSS066.02": {
        "Jacqueline Wernimont": []
    },
    "WGSS040.06": {
        "Anna Storti": [
            "review 1: \"20F with Anna Storti: Great class, great professor, super understanding about taking classes in a pandemic. She tells us at the beginning that if we do all of the work, we'll get an A. The readings and videos are pretty cool but you can get away with not doing them if you can make stuff up in class discussions. We have weekly blogs and 2 essays. Overall super easy to manage with other classes and you learn a lot, especially if you engage with the texts/movies!\"",
            "review 2: \"20F with Anna Storti: Fascinating course content and engaging discussions, reflective assignments that make this class really special. Professor Storti does an amazing job of helping you connect with the materials and is overall an exceptionally understanding prof. Don't miss the opportunity to take the class or any other with Prof. Storti. My utmost recommendation would be to engage, learn, and absorb--learn something new and let the course influence your understanding of the world as it is meant to--the grade is secondary and will come with it.\""
        ]
    },
    "WGSS024.02": {
        "Andrew Simon": []
    },
    "WGSS051.10": {
        "Summer Lee": []
    },
    "WGSS020.03": {
        "Eng-Beng Lim": [],
        "Hao Tam": []
    },
    "WGSS007.19": {
        "Ivy Schweitzer": [
            "review 1: \"20S with Ivy Schweitzer: I took this class with very little poetry experience and it was amazing! Schweitzer is a really chill prof and is also really good at giving helpful feedback. She cares about both her students and poetry and genuinely wants her students to become better writers. Class was almost all discussion based, but Schweitzer still managed to keep it interesting. Every class we had a reading response (about 1 paragraph) and we had three papers (each around 5 pages) along with a final partner project. The professor also pushed back over half of our deadlines if we told her that we had a lot of work in our other classes or just wanted more time! In the beginning of the term, she's a harsher grader on the reading responses, but by the middle to end, basically everyone gets full credit. Schweitzer is also really open to meeting with students to go over their papers. She can be a little picky about how you analyze poetry, so definitely either meet with her or email your paper to her and ask for feedback before the final draft. Overall, a great class that I would highly recommend to anyone! It should be an easy A-/A class if you run your papers by her once before the final and participate every once in a while.\""
        ]
    },
    "WGSS007.18": {
        "Reiko Ohnuma": []
    },
    "WGSS066.01": {
        "Annabel Martin": []
    },
    "WGSS040.05": {
        "Kelly Chung": [],
        "Misty De Berry": [],
        "Tyler Monson": []
    },
    "WGSS041.06": {
        "Mingwei Huang": [
            "review 1: \"22F with Mingwei Huang: Such a hard class. Don't take unless you have the time and background in feminist studies. You have to do the reading for every class (lots of reading), some of it super hard, and you have to do complicated thinking and writing for response papers. THIS IS NOT A LAYUP. Really great class, but again very demanding—you get as much as you put into this class. Professor Huang is an amazing prof and demands the best from you.\"",
            "review 2: \"22F with Mingwei Huang: so wonderful!! disagree w the person below in that I was able to get along quite easily often while just skimming the readings, but I also do have some background in related fields so not sure if that's the reason for that difference. Mingwei is lovely and this class was really enriching. Three response papers and a final project/manifesto--in her syllabus she says you'll do well if you complete things in good faith and that's true.\"",
            "review 3: \"19F with Mingwei Huang: This class was my favourite class I took this quarter - went into it thinking I would hate it (I'm a premed, super into stem and will probably be a Bio major), but the course material and the professor might have convinced me to become a WGSS minor. The class itself is a fair amount of work. You have 1-2 readings between each class, 3 synthesis papers, and a big final project. I didn't think anything was too hard, but to be able to actively participate in class and to do well on the essays, you have to at least skim the readings. Would HIGHLY recommend this for anyone who's interested or who wants a more writing focused class for their term.\"",
            "review 4: \"19F with Mingwei Huang: Took this class and loved it. Mingwei is an amazing prof and person, and she was very flexible with assignments and work. You definitely have to do the readings, but there were only a few per class. No midterms or final, only a couple response papers and one final project. 10/10\"",
            "review 5: \"19F with Mingwei Huang: ABSOLUTELY AMAZING!!!! I honestly think everyone at Dartmouth should take this class, regardless of major. Each week covered a different transnational issue that went way beyond your typical, white-washed, Western feminism. Also, Mingwei is incredible– super intelligent, down to earth, and accommodating. Skip WGSS 10 for this class if looking for an enjoyable yet manageable course in the department!\""
        ]
    },
    "WGSS037.06": {
        "Aparna Parikh": []
    },
    "WGSS065.08": {
        "Matthew Richardson": []
    },
    "WGSS061.06": {
        "Ann Bumpus": []
    },
    "WGSS056.03": {
        "Annabel Martin": [
            "review 1: \"22W with Annabel Martin: this woman is a QUEEN. she is the only reason i finished my spanish minor istg. cannot recommend enough\"",
            "review 2: \"19S with Annabel Martin: Incredible class. The material is fascinating and doing the work (watching Almodovar movies and reading literature on them) doesn't even feel like work if you're into this kind of stuff. Would highly encourage anyone to take it if Prof. Martin offers it!\""
        ]
    },
    "WGSS052.06": {
        "Nathalie Batraville": []
    },
    "WGSS007.17": {
        "Eman Morsi": [
            "review 1: \"19S with Eman Morsi: prof morsi is a really cool and chill prof. she was a journalist and knows what she's talking about. this class was about bias and journalistic methods and forms. she conducted classroom discussions really well and it was a great class. i highly recommend taking any of her classes bc she's great.\""
        ]
    },
    "WGSS057.01": {
        "Jacqueline Wernimont": []
    },
    "WGSS056.12": {
        "Matthew Richardson": [],
        "Mattie Richardson": []
    },
    "WGSS052.05": {
        "Faith Beasley": []
    },
    "WGSS036.06": {
        "Emily Raymundo": [],
        "Eng-Beng Lim": []
    },
    "WGSS053.07": {
        "Sabrina Billings": []
    },
    "WGSS053.05": {
        "Melissa Zeiger": []
    },
    "WGSS044.07": {
        "Reiko Ohnuma": []
    },
    "WGSS030.06": {
        "Susan Overton": [
            "review 1: \"20W with Susan Overton: Overall a pretty easy class, interesting topics and really insightful. There's about 40-50 pages of readings a week, sometimes more or less. 2 online take-home quizzes, a final paper that's around 6-8 pages, and a final solutions group project. Participation counts for 20% of your grade so I'd recommend doing the readings so you can speak up in class everyday. Prof Overton can be a bit dry sometimes but overall a nice course and a nice prof.\"",
            "review 2: \"19W with Susan Overton: Overall an easy class, but you can learn a lot. Professor Overton is really kind and understanding, plus she takes criticism from her students pretty easily (of course, be polite.) If you go to class and do the work, which is not much, you will get a pretty good grade.\""
        ]
    },
    "WGSS024.01": {
        "Eman Morsi": [
            "review 1: \"22W with Eman Morsi: I really learned a lot in this course. Professor Morsi has a great understanding of the material that's covered and promotes interesting discussion. However, there was a lot of readings and they were pretty dense at times, and sometimes it was hard to understand the main points we were supposed to take away from them. That being said, there weren't that many assignments - we had to do a weekly 250 word reaction to the readings at the beginning of the week and a 400 word reflection at the end of the week that were basically graded for completion. Towards the end of the term, there was a feminist narrative assignment that was 1500 words but it was creative and we could write about whatever we wanted, and I really enjoyed that assignment. There was a feminist analogical reasoning assignment where we had to answer 4 free-response questions to ideas we've covered in the readings, and that was probably was the hardest assignment, but if you paid attention in class and took notes from class discussion and the readings it was manageable. Lastly, we had a final take home exam with 2 free response questions that were more broad and easier to answer. I HIGHLY recommend taking notes while you do the readings (including the page numbers) because you will need to reference quotes in assignments later on. I would recommend this course because Morsi is such a sweet professor and you will learn a TON in this course.\""
        ]
    },
    "WGSS021.03": {
        "Margaretha Kramer": []
    },
    "WGSS020.02": {
        "Giavanna Munafo": [
            "review 1: \"18F with Giavanna Munafo: Munafo is a wonderful professor. She is so kind, sweet, relatable, funny, understanding, and knowledgeable. This was my favorite class. We have great exercises, discussions, reading isn't too bad, and the course material is extremely interesting. She grades pretty well and gives you chances to improve your work. She's an amazing prof and I highly recommend this class 10/10\""
        ]
    },
    "WGSS067.05": {
        "Shatema Threadcraft": []
    },
    "WGSS040.03": {
        "Shatema Threadcraft": []
    },
    "WGSS062.02": {
        "Veronika Fuechtner": []
    },
    "WGSS042.06": {
        "Brianne Gallagher": []
    },
    "WGSS007.16": {
        "Kristin O'Rourke": []
    },
    "WGSS007.01": {
        "Douglas Moody": []
    },
    "WGSS041.05": {
        "Brianne Gallagher": []
    },
    "WGSS030.04": {
        "Bethany Moreton": []
    },
    "WGSS007.04": {
        "Alexis Jetter": [
            "review 1: \"23W with Alexis Jetter: THIS CLASS WAS AMAZING !!! I had this class, this term and it was amazing! Professor Jetter is one of the best teachers I've had so far here! The environment that she made legit made it 10x better. If you could you should 100% take the class!! The workload is super manageable and the essays are very interesting.\"",
            "review 2: \"23W with Alexis Jetter: Alexis is a character. Very supportive, very understanding of extensions, and manageable workload. One thing that annoyed me for a FYS was that she has MANY required events outside of class that while are super super interesting, kind of a lot to attend. Uses x-hours a lot. 3 papers, all very manageable but the final paper is a Profile where you have to interview someone you don't know and go to their house.... little uncomfortable and weird. Overall learned a ton in this class and really enjoyed it though\"",
            "review 3: \"19W with Alexis Jetter: Hands down best class I've taken at Dartmouth. Alexis Jetter is an amazing person if you get to know her: very kind, funny, lenient if you need help/an extension on a paper, and has such a cool perspective. You'll have to keep up with current events, which I thought was cool because it's easy to get stuck in the Hanover bubble and not know what's going on in the outside world. It also introduces you to being a journalist, as you'll have to profile a stranger. The readings, viewings, and guest speakers were also incredibly fascinating, and made for really cool discussions. We spend a significant portion of the class discussing our personal experiences and how they relate to the readings. It opened my eyes to history and journalism in lots of different issues in ways that I never thought about (LGBT, North Korea, abortion, etc). This is also a great seminar because the paper's aren't academic. There's a 500 word narrative, another 1,500 word narrative, and the 2,500 word profile. You'll also have to write a discussion post for every class and make two powerpoints (very easy). Not hard but not a layup. Seriously a must-take.\"",
            "review 4: \"19W with Alexis Jetter: I love Professor Jetter - she is literally the sweetest person ever. She is very accommodating and makes herself very accessible for time outside of class. Reading isn't too heavy so its nice. It is so much more of a journalism class than a gender studies class - we just read female journalists' work. The 500 and 1500 word essays were easy, but also very different from a normal essay we'd write. The 2500 word profile is a little tougher because we have to do a \"live-in\" profile on someone who is not a student or professor at the college. This means taking out time to go off-campus and interview (unless you find someone in Hanover) and putting a lot of detail. While it is a little time-consuming, writing the profile is very interesting and forces us out of the Hanover bubble. There is also a required radio commentary but that's only 4 minutes and isn't too bad. Good class to take, especially if you are STEM and need the SOC distributives.\"",
            "review 5: \"19W with Alexis Jetter: Professor Jetter is a very nice woman. She is accommodating, intelligent, informed, and sweet. She genuinely wants her students to do well and to be aware of what's going on in the world. We'd sometimes get carried away in our class discussions and talk about Trump until there were only twenty minutes left to cover the previous night's readings. The course is also a bit irritating at times because of the variable nature of the syllabus (oftentimes students would show up to class, unaware that the readings on the syllabus had changed a day or two before without notification of any sort), and the readings journals for each class can be a hassle after a while. The material is fascinating, though, and encourages one to think about issues worldwide that are often swept under the rug in Western media journalism. The essays are unorthodox: they are not academic in nature, and they call for creativity, experimentation in form and style, and a more conversational tone (which is great news if you hate writing stiff, extensive research papers and grossly long annotated bibliographies, which it seems a lot of the other seminars require). If you're unsure about which seminar you should take—if you want one that's relatively easy grade-wise but also a legitimate learning experience—then take this class, no doubt. You will learn a lot, and you'll leave the class much more informed about the world (if you weren't already). And that's invaluable.\"",
            "review 6: \"19W with Alexis Jetter: BEST CLASS, BEST PROFESSOR. Alexis is so wise and supportive. The only class where I wanted to do extra work and got to know the professor by heart. She created an intimate and comfortable space for students to be vulnerable about their own experiences. I would always recommend this class who cares about the world we're living in. TAKE THIS CLASS IT IS GONNA CHANGE YOUR LIFE.\""
        ]
    },
    "WGSS042.05": {
        "Chelsey Kivland": []
    },
    "WGSS065.04": {
        "Gabriele Dietze": [
            "review 1: \"22X with Gabriele Dietze: I was in this class for one day. I immediately emailed another prof to get into a different class. For a course that's supposed to be about queer culture, there was an abundance of transphobic language and attitudes in just the syllabus read-through. The syllabus also looked like there was going to be a ton of readings/movies for every class meeting. Between tons of work and transphobia in a WGSS course, I'd say to go for your other options.\""
        ]
    },
    "WGSS067.01": {
        "Veronika Fuechtner": []
    },
    "WGSS037.04": {
        "Darius Scott": [],
        "Treva Ellison": []
    },
    "WGSS062.03": {
        "Renee Bergland": []
    },
    "WGSS040.04": {
        "Treva Ellison": []
    },
    "WGSS049.06": {
        "Eman Morsi": []
    },
    "WGSS030.05": {
        "Francine A'ness": [],
        "Francine A'Ness": []
    },
    "WGSS032.03": {
        "Jennifer Sargent": [
            "review 1: \"20S with Jennifer Sargent: This class could have been so great if it were in person. The readings were really interesting if you like politics/law. We got to get into the weeds of some constitutional law theories, but also were able to look at the stories of the people whose cases we were learning about. However, the work consisted of reading about 100pg/week and posting a few times on Canvas. We never met over Zoom, and I didn't receive a single piece of feedback from Sargent except to get my \"credit\" at the end of the term. Transitioning to online in the Spring was hard - but it seemed like she was putting in <5 hrs of work on our class per week which felt really ridiculous.\""
        ]
    },
    "WGSS059.07": {
        "Elias Krell": []
    },
    "WGSS007.15": {
        "Jennifer Sargent": [
            "review 1: \"21S with Jennifer Sargent: This class was absolutely incredible. Sarge cares so deeply about the well-being, growth, and success of her students, making sure that the workload (case readings, discussions, and two weekly response posts) was manageable. She made everything so fun and engaging, especially through her stories about personal experiences working in law. This seminar was a layup that was intellectually stimulating at the same time - would obviously recommend if you are at all interested in the subject.\""
        ]
    },
    "WGSS007.14": {
        "Treva Ellison": []
    },
    "WGSS052.04": {
        "Patricia Stuelke": []
    },
    "WGSS051.09": {
        "Patricia Stuelke": [
            "review 1: \"24S with Patricia Stuelke: Not a layup. Harsh grader, especially when considering it was cross listed with wgss and engl. Median most likely B. Made good books uninteresting, and removed the best ones from the syllabus.\""
        ]
    },
    "WGSS007.11": {
        "Faith Beasley": []
    },
    "WGSS056.01": {
        "Mary Desjardins": []
    },
    "WGSS058.05": {
        "Kristin O'Rourke": []
    },
    "WGSS048.08": {
        "Carolyn Dever": [
            "review 1: \"21F with Carolyn Dever: This class is one of the best I've taken at Dartmouth. If you are interested in queer literature or the deeper meanings of Victorian literature, definitely go for it. Engaged discussions, well-structured, and is conducive to one's own interests--encourages you to be curious. Prof. Dever is kind, pushes you to your best, and is always there if you need help. Highly recommend.\""
        ]
    },
    "WGSS026.03": {
        "Bethany Moreton": [
            "review 1: \"22F with Bethany Moreton: I noticed that this class did not have any reviews so I thought I would leave one! This was an amazing class. Readings were sometimes a lot, but very very interesting and you didn't always have to read them all. There were two things due each week: a 'roadmap' for the readings due on Monday, and a discussion post due on Wednesday before class. The two large assignments were an 8-10 page paper that pushes a discussion post / set of readings further, and a roadmap for a class on sexuality if we were teaching about the present era 20 years from now. Super interesting class, I loved the Professor Moreton and all the discussions.\""
        ]
    },
    "WGSS021.01": {
        "Roberta Stewart": []
    },
    "WGSS018.01": {
        "Tyler Monson": [
            "review 1: \"21F with Tyler Monson: Tyler is a super nice guy and the class is a massive layup. We only meet once a week, but there's only about 50 pages of reading per week that you can absolutely lightly skim a few pages of and be prepared for class. Class itself is small group discussion, large group discussion, and lecture usually, though a few days we did watch movies. Grades are based off of 3 1 page reflections on readings that you can do whenever is best for you during the term, 1 outside engagement paper (3-5 pages on any book/movie/song/album of your choice), and 1 final remix project where you take a class reading and reimagine it however you want (people made art, did poetry, wrote short stories, made movies, presented photographs, etc). I learned quite a bit about queer theory despite not really doing the readings, and if you want an easy class as a 3rd/4th, would definitely recommend this one, though the time of the class (6b) did suck.\""
        ],
        "Eng-Beng Lim": []
    },
    "WGSS067.04": {
        "Annabel Martin": []
    },
    "WGSS007.13": {
        "Julia Rabig": []
    },
    "WGSS007.08": {
        "Renee Bergland": [
            "review 1: \"16S with Renee Bergland: Very easy seminar. You definitely don't have to do the readings (although many of them are quite interesting). During Week 4 the only homework we had assigned to us was to watch Season 2, Episode 1 of the TV show \"Sherlock.\" Prof. Bergland is very nice and empathetic to students and almost always willing to give an extension. She gets distracted a lot in class and will go off for 20 min on some random story she has. Only writing we had to do was five 500-word essays (which are only worth 10% of your grade and another 10% is about the improvement of your essays throughout the term), a \"footsteps\" research project (750 word summary of critical debates, a 1,000 word personal narrative of your research, and a 1,000 word annotated bibliography), and a final essay that is based off of your footsteps research (1,750 words total). I did almost no work for this class but enjoyed the discussions and the easy projects.\""
        ]
    },
    "WGSS033.05": {
        "Kristin Smith": [
            "review 1: \"21F with Kristin Smith: This class was extremely boring and not engaging and I literally wanted to fall asleep at several points in the term. Professor Smith has an attendance requirement - you're not allowed to miss more than 3 classes and if you do she drops your grade. You had to post a discussion question based on the readings once a week and you needed to do 2/5 possible reflection papers + the final research paper at the end. Class was basically her going over the readings and talking about them but she is truly super boring and mostly just pointing at slides and reading. And she always forgot to post the slides on Canvas unless someone told her. Class discussions were also not really discussions because she just called on people and they never responded to what other people were saying. It was just like group talk time. Some people also just said things that were terrible and she let it slide because she didn't want to make the classroom environment \"hostile.\" Not a hard class, but super unpleasant to be in.\""
        ],
        "Katherine Lin": []
    },
    "WGSS007.05": {
        "Klaus Milich": []
    },
    "WGSS099": {
        "Dennis Washburn": [],
        "Laura Edmondson": [],
        "Susan Ackerman": []
    },
    "WGSS098": {
        "Dennis Washburn": [],
        "Graziella Parati": [],
        "Ivy Schweitzer": [],
        "Laura Edmondson": [],
        "Susan Ackerman": []
    },
    "WGSS096": {
        "Adam Hantel": [],
        "Angela Hernandez": [],
        "Eng-Beng Lim": []
    },
    "WGSS085": {
        "Dennis Washburn": [],
        "Graziella Parati": [],
        "Ivy Schweitzer": [],
        "Laura Edmondson": [],
        "Susan Ackerman": [],
        "Tyler Monson": []
    },
    "WGSS080": {
        "Annabel Martin": [
            "review 1: \"07F with Annabel Martin: Martin is a wonderful prof- incredibly passionate about the class. And the readings and films are excellent\"",
            "review 2: \"07F with Annabel Martin: This class is very interesting. Professor Martin chooses all of the readings and films with thought and care, and with the intention that they will change how her students see the world. The class isn't too hard - the assignments are doable, and almost everyone is done with a partner.\""
        ],
        "Eng-beng Lim": [
            "review 1: \"23W with Eng-beng Lim: We met once a week and had a discussion post due the day before class. There is a TON of reading (I'm talking books that have over 1000 pages!) but overall you don't really have to do most of it to be able to answer the prompts. Class is a mix of lecture and discussion. You'll have one \"oral presentation,\" which is 5 minutes and on a reading/set of readings for a week. There is one annotated bibliography as a midterm, 1-2 pages single spaced, and a final portfolio, 3-6 pages single spaced. Overall, the class workload is pretty fine, but Prof Lim is relatively unclear about guidelines/deadlines unless you push him. In class, he kind of comes off as very strict about deadlines, but if you talk to him in office hours he is quite nice and helpful. And, though he is strict, he told us that as long as people submit their work, they will get an A. Pretty layup-y overall.\"",
            "review 2: \"22S with Eng-beng Lim: The course itself was great, I liked it a lot. However, the topics change a lot, so that portion will vary. I really enjoyed Professor Lim as the lecturer for this course. He speaks so well, and his ideas are incredibly complex. I'm hopeful to take another course with him in the future.\""
        ],
        "Ivy Schweitzer": [
            "review 1: \"08F with Ivy Schweitzer: This class was very interesting. I learned a lot. Professor Schweitzer is very flexible and available.\"",
            "review 2: \"02F with Ivy Schweitzer: Schweitzer was an incredible prof: supportive and funny, while keeping the level of discussion high. The students were very engaged with the subject matter and supportive of each other's work, and Schweitzer even had us over for lunch for the last day of classes. The environment was both challenging and collaborative. Hands down, one of my best classes at Dartmouth.\""
        ],
        "Susan Brison": [
            "review 1: \"04F with Susan Brison: I didn't think Legal Theory would interest me that much, but it did. I took a lower level class with Professor Brison also, and in both I found her to be a professor who both listens to suggestions and cares about her students, in addition to inspiring passion and interest in her field. I think it was a very effective class and a great topic for a Culminating.\"",
            "review 2: \"04F with Susan Brison: This course is mandatory for majors, and optional for minors--few other people take it. The prof chooses the topic (ours was feminist legal theory and methodology, but this didn't really mean much--we read a few legal briefs, but Brison, being a phil prof and not a law prof, didn't explain all that much having to do with actual legal theory), so if you can, find out what the topic is ahead of time from anne brooks (the dept admin asst) and choose a subject/prof with whom you want to take a seminar. So really, unless Brison teaches this specific topic again, my review'll be pretty useless, so here's some general info instead. Of course, you don't really have control of who's in your class, and since this is a smaller discussion course, that can be a huge factor in how well the course goes. So if the majors/minors your year are obnoxious--I'm sorry. The problem with including minors in this course is that if you're a major, you'll quickly realize that minors lack a lot of the background that majors have, which hampers discussion. But again, you don't have control over who takes the course, so it's pretty much luck of the draw.\""
        ],
        "Barbara Will": [
            "review 1: \"01F with Barbara Will: The class itself was perhaps my best at Dartmouth - 3 students, great professor, great discussions - but since not as many people will take Women's Studies 80 as will have Professor Will, I'll focus on her. She's an excellent, amazing professor. She's brilliant: extremely intelligent and with sharp insights into the most difficult readings and subject matters. But more than that, she is excellent at engaging you, the student, and helping you, personally to understand, react to, and learn from the material. The course helped me to grow and mature intellectually in a huge way, and her teaching style made me think, \"This is what education should be!\" If you have a chance to take a course from her, definitely do yourself the favor of doing so - it'll be a treat! A!!!!!\""
        ],
        "Eng-Beng Lim": [],
        "Jacqueline Wernimont": [],
        "Mingwei Huang": [],
        "Renee Bergland": []
    },
    "WGSS066.05": {
        "Angela Hernandez": [],
        "Ivy Schweitzer": [],
        "Reena Goldthree": []
    },
    "WGSS065.07": {
        "Eng-beng Lim": [
            "review 1: \"19F with Eng-beng Lim: This course had some of the most fascinating readings I've ever read. We met at the 6B timeslot, so we had tons of readings for each class and most of them were really good and interesting. Professor Lim is super nice and a very approachable teacher. He's also super passionate and knows a lot about the subjects we studied. His only major fault is that he can be very disorganized, but all the rest made up for it. The course had 4 major assignments: leading a discussion on a given week, a final project, a midterm paper and a final paper, both 5-6 pages each. Overall, a very doable course and Professor Lim was a super fair grader. If you're interested in WGSS and queer theory, this class will be one of the most interesting ones you take at Dartmouth.\""
        ],
        "Eng-Beng Lim": []
    },
    "WGSS065.06": {
        "Misty De Berry": [
            "review 1: \"22F with Misty De Berry: One of the easiest and best classes I've ever taken at Dartmouth. Prof. De Berry cares so much about her students - we kicked every class off with a short meditation and a check in with every student. Readings are easy but you don't need to do them - class is a mix of discussion and lecture. There are two group assignments - one short midterm presentation and one short final on a manifesto (2-3 pages each max). She also starts off with discussion posts due once a week but will likely suspend them near the end of the term. I learned a lot about queer studies and performance and truly love the professor!!!\"",
            "review 2: \"21F with Misty De Berry: Dr. De Berry's class was the #1 course I have taken at Dartmouth. Captivating readings and class discussions, engaging assignments which are meant to spark your interest and curiosity, and the most understanding and caring prof on the campus. If you have any interest in queer of color issues, performance studies, or radical queer thought, don't miss your chance to take this class, especially with Dr. De Berry. Highly, highly recommend.\""
        ],
        "Eng-beng Lim": [
            "review 1: \"23S with Eng-beng Lim: Prof Lim's expectations as a professor are very unclear. He doesn't return any grades back the entire semester so there is a chance you will be very shocked when your grade comes out. I for one thought I did everything to Prof Lim's expectation, only to end the term with an A-, with no clue why. Very disappointed in that.\""
        ],
        "Eng-Beng Lim": [],
        "Matthew Richardson": [],
        "Mattie Richardson": []
    },
    "WGSS059.04": {
        "Irma Mayorga": [],
        "Kellen Hoxworth": [],
        "Laura Edmondson": [],
        "Shamell Bell": []
    },
    "WGSS056.04": {
        "Alexis Jetter": [
            "review 1: \"23W with Alexis Jetter: Professor Jetter was extremely kind and well-intentioned but extremely disorganized. She loves to talk and has a lot of great insight about current events that she's more than happy to share, but at the expense of students' discussion time. She also assigned a LOT of nightly reading that was incredibly interesting but excessive. Sometimes we would have to watch an hour and a half documentary and read five to eight lengthy articles about the same issue. I am now much more aware of current global events than I was when I first joined the class, but I also spent HOURS every night rushing to write my readings journals while watching and reading the nightly material. We had three major papers throughout the course of the term. The first was around 700 words, the next 1500, and the final 3000. This aspect of the course load was manageable because the pieces were assigned at the beginning of term and Professor Jetter was always available for one-on-one discussion with students about their papers and objectives. This class had its pros and cons. If you enjoy reading the news (or know you need to start doing so), this is a fantastic current events rundown, but don't take this class if disorganization drives you crazy or if you don't have a few hours a night to spare on documentaries and lengthy articles.\""
        ]
    },
    "WGSS053.02": {
        "Israel Reyes": []
    },
    "WGSS048.07": {
        "Courtney Quaintance": []
    },
    "WGSS047.03": {
        "Melissa Zeiger": []
    },
    "WGSS046.01": {
        "Esther Rosario": [
            "review 1: \"21F with Esther Rosario: Great prof. Professor Rosario is honestly by far the kindest and most understanding professor I've ever had. I'm not sure how much the class actually answered the questions that are posited in the course description, but it's still a really interesting course that covers a wide breadth of topics with respect to gender. Class is about 75/25 discussion/lecture, with 3 short papers and a final project. Try to keep up with readings if you can. If you miss some, the class is still cool, but it's easy to get behind really fast because Rosario doesn't check if we actually did the readings or not. Great class, definitely more chill than most other ones I've taken.\""
        ],
        "Andreea Aldea": [],
        "Asya Passinsky": [],
        "Susan Brison": []
    },
    "WGSS044.03": {
        "Robert Baum": [
            "review 1: \"22S with Robert Baum: This was a solid class. Professor Baum could be a bit boring, and I fell asleep often in class to be honest, but the material was interesting, and the workload was fair. It consisted of readings, a response paper for every class (only a paragraph each), and a 12 page term paper on a topic of your choosing. Was very chill, and Professor Baum was funny, and definitely interesting. He lived and did research in Senegal, and was a part of a society there; so even though he is a white male, he was very knowledgeable about the topic and did not perpetuate stereotypes or falsehoods about those societies, and actively discouraged us from binary thinkings, which was great.\""
        ]
    },
    "WGSS043.06": {
        "Zahra Ayubi": [
            "review 1: \"23X with Zahra Ayubi: Ayubi was chill, don't let the first day with her scare you. Cool topic, interesting though heavy readings. No papers though and lowkey in-class midterm and takehome final\"",
            "review 2: \"23X with Zahra Ayubi: The material was interesting which was the best part of this class. Most of the class was discussion although she talked a decent bit during discussions. She was interesting to listen to. Pretty heavy reading at times although the amount of reading for any day varied drastically. Notes were required for almost all the readings except you had a couple of skips. The final was one of the most tedious exams I have ever taken although I doubt she actually read them. The course was very disorganized and there were many times she was unaware of what was on the syllabus for the day. Received very little feedback throughout the course. She also did not seem to enjoy teaching very much and she pretty much explicitly said that multiple times.\"",
            "review 3: \"20S with Zahra Ayubi: Prof Ayubi is amazing. She has experience with virtual/online teaching, and taking a virtual class with her was really nice. She is very understanding and also selects really cool readings and videos. I highly recommend any class with her\""
        ],
        "Candace Mixon": []
    },
    "WGSS043.04": {
        "Reiko Ohnuma": []
    },
    "WGSS043.03": {
        "Susan Ackerman": []
    },
    "WGSS043.02": {
        "Christopher Macevitt": [
            "review 1: \"23W with Christopher Macevitt: This class was fairly easy we had two essays (midterm and final) definitely a layup. There was a lot of reading and was a discussion-based class, if you have an interest in this topic, take it. If not, go in with an open mind.\"",
            "review 2: \"23W with Christopher Macevitt: Great professor. There's a lot of readings, but I did very few of them and still got an A. Try to participate in discussions from time to time, choose a final paper topic that interests you- even if it isn't super related to the readings. MacEvitt is a super understanding and nice professor. If you need anything (extensions, help, etc) he's absolutely there for you- just ask.\""
        ],
        "Christopher MacEvitt": []
    },
    "WGSS041.04": {
        "Zahra Ayubi": []
    },
    "WGSS040.02": {
        "Aimee Bahng": [],
        "Reena Goldthree": [],
        "Shamell Bell": []
    },
    "WGSS040.01": {
        "Vera Palmer": []
    },
    "WGSS037.03": {
        "Ben Gerlofs": [],
        "Erin Collins": [],
        "Lalit Batra": [],
        "Treva Ellison": []
    },
    "WGSS036.01": {
        "Sabrina Billings": [
            "review 1: \"21F with Sabrina Billings: The class was super interesting, but Professor Billings is definitely an anthro professor. The readings were pretty heavy and anthro focused, but they were interesting. The workload was also pretty light, and she tries to bring in personal aspects to make the class more interesting. Overall, I definitely recommend taking this class—just reading the abstract, intro, and discussion sections and you'll be set :)\"",
            "review 2: \"21F with Sabrina Billings: Definitely a layup. One 300 word synthesis post each week, and one final presentation + essay. I took this for a distrib and found the readings to be pretty interesting, although towards the end I was just skimming them or reading the abstract since she doesn't check in class if you did them. If you like anthro, this class would be for you. Personally I don't like anthro as a subject that much so I found some of the discussions to be annoying, and prof sometimes gets visibly annoyed when you disagree with anything she says. Overall would recommend though, especially as a distrib.\"",
            "review 3: \"20F with Sabrina Billings: This was an interesting class, but very anthro-heavy. Quite a bit of reading each week, but only during the first part of the week. We met as a class on Mondays and Wednesdays, and Fridays were left for small group discussions. Each week there's a group report due, and this rotates between group members, so you only end up doing about two during the term. There is also a weekly synthesis post (about 200 words) due each week on the readings. There is a presentation and essay, both personal so not too hard. Overall, there is a decent amount of reading, but the submitted work isn't much of a workload.\""
        ]
    },
    "WGSS035.02": {
        "Andreea Aldea": []
    },
    "WGSS034.04": {
        "Janice McCabe": []
    },
    "WGSS034.02": {
        "Ayo Coly": []
    },
    "WGSS033.08": {
        "Emily Walton": []
    },
    "WGSS033.07": {
        "Kathryn Lively": []
    },
    "WGSS033.03": {
        "Rachel Greenblatt": []
    },
    "WGSS033.01": {
        "Deborah King": []
    },
    "WGSS031.04": {
        "Deborah Brooks": [
            "review 1: \"22S with Deborah Brooks: Oh, Deborah. I have mixed feelings about this course. While the content is extremely interesting, and the small group and whole-class discussions, each Wednesday and Friday, respectively, were engaging, Professor Brooks frustrated me throughout the entire term. Even though the weekly readings were manageable, and I was constantly learning and enjoying the new facts about women in politics taught in the course, the professor was so hostile at times, making it hard for me to enjoy the content. If you make a mistake, Professor Brooks is very passive-aggressive and is not flexible. She offers \"grace\" periods for you to turn in late work, but there is so much instruction and arbitrary detail in her course that it's easy to make a mistake. Do NOT take this course if you have difficulty following rigid structures and long(er) weekly assignments. Not to mention if you'll have trouble with an uncompromising professor. Every Wednesday and Friday, you have to fill out a long \"meeting check-out form\" after class discussions which are, at times, hard to remember to do. In addition to this, you have weekly response journals and a couple of mid-term projects in addition to the readings. Response journals will take a long time if you do them well. The class initially seems like a layup but picks up quickly as you go.\""
        ]
    },
    "WGSS031.02": {
        "Michael Bronski": []
    },
    "WGSS031.01": {
        "Lisa Baldez": []
    },
    "WGSS030.01": {
        "Aparna Parikh": []
    },
    "WGSS026.02": {
        "Annelise Orleck": [
            "review 1: \"23X with Annelise Orleck: Absolutely fascinating class, but a ton of reading and a huge final paper. Honestly worth it though if you are interested in it.\"",
            "review 2: \"22X with Annelise Orleck: Really interesting class! Professor Orleck is a wealth of knowledge on women's movements and she leads class discussions so deftly, interjecting with new tidbits of information to deepen our understanding of the material. I really enjoyed learning so much about women's movements because what we learned wasn't covered in high school textbooks; we read some very touching narratives by women revolutionaries. Prof Orleck says she has a reputation for working people hard, but if you put in the effort you will do well. There are 3 hours of reading on average per class plus one discussion post per class and a final paper. Orleck gives you really thorough feedback on your drafts and is very helpful in sharpening your ideas and writing, which I really appreciated. The only down-side of the class was just the volume of the readings/ how most of the class was centered around student-led discussions, which could get circular. Tldr: take this class because it's rewarding, but expect to put in the work!\"",
            "review 3: \"21X with Annelise Orleck: I really enjoyed this class even though it was online/over Zoom. Orleck knows pretty much every and anything about every topic we discussed. I found the class content itself super interesting although the readings were a little long sometimes. It was very much discussion-based, we literally talked the whole class. As for assignments/grades, you had to lead (with 1 or 2 other classmates) two discussions throughout the term and a final research paper, in which you get to choose the topic. If you put in the effort to participate once or twice during each class and meet/talk with her about your paper (just to show her that you care), you should be fine. It helps that the material is interesting too!!\""
        ]
    },
    "WGSS023.02": {
        "Annelise Orleck": []
    },
    "WGSS023.01": {
        "Leslie Butler": []
    },
    "WGSS022.01": {
        "Walter Simons": [
            "review 1: \"20W with Walter Simons: Cross-listed with HIST, I'm not even sure why this is listed as a WGSS course when most of what we studied was the male gender and the rest on females getting marginalized. Mostly lecture-based with a class discussion on Friday, revolving around extensive readings assigned in the beginning of the week. The material was honestly interesting, but it's difficult to get an A without a history background. Not the most minority-friendly class, and the professor really doesn't try to get to know anyone. (2) Midterms are a long essay and two short answers (chosen from four questions), the final is an essay.\""
        ]
    },
    "WGSS021.02": {
        "Margaret Williamson": []
    },
    "WGSS018": {
        "Michael Bronski": [
            "review 1: \"09W with Michael Bronski: Okay, so you've probably stumbled upon this review because you need a CI. You've probably heard that Bronski is a nice guy and an easy grader. Well, I cannot argue with either of these two stereotypes. Bronski is bar none the nicest professor I've met at this college. He is also an easy grader from what I've seen. What the reviews will not tell you is that even a straight guy can enjoy this course. Yes, being one of the few straight males in a WGST has its benefits. Beyond that, the readings are interesting and insightful (if you decide to do them, which is not necessary for success in the class). The in-class discussions are always stimulating. Yes, some people will dominate the class discussion (Foucault anyone?), but fear not jumping in to score points with Bronski. I personally have no idea what I was saying half the time, but I got some laughs (whether out of pity or genuine laughter, I'll never know). Or don't jump in, it doesn't matter if you just want an A. As for the assignments, Bronski is pretty standard on two six page \"midterms\". The first midterm was on pretty much any subject you wanted it to be. I wrote mine on the Gay vote and the 2008 Democratic Primary. He loved it... but I think he loves most papers. The second midterm was comparing an article in a 1953 Boston tabloid known for its hidden appeals to Gays to a previously reviewed material or perhaps a material not covered. Except this paper turned out to be a surprise 4 pages... The class was split into six groups. The people in the group wrote essays on the same topic, but they were individual essays. My group wrote about how the idea of a Gay community in the Boston paper compared with the idea of a Gay community in New York. The two midterms were worth 25% each. The final was worth 50% of the grade. It was 15 pages on any topic you wanted. I chose ENDA and how it split the LGB Vs. T communities. 15 pages is hard to write... haha. But with Bronski, everything is cool. You can also do a final project with Bronski's approval. I think some people made an extensive board game aimed at AIDS education. The median for the class is an A for a reason. But what that A won't tell you is how enjoyable the class was. I email with Bronski on politics every few days. Great guy, great class. Don't be a dummy... take the class!\"",
            "review 2: \"09W with Michael Bronski: I really enjoyed all the reading materials and the movies/films Prof Bronski showed in class. He requires you be there every class or you write an absence paper. There were only 3 papers, otherwise you didn't even have to really read anything because it's all discussion. The only bad thing I can say is the papers are way too open ended for my liking. He said, \"Write your papers about anything relating to the course.\" Plus, the final is 15 pages long. If you like that, then this course is an easy A.\"",
            "review 3: \"06F with Michael Bronski: Bronski is great. the class was pretty fun and not too much work. no tests, just a couple of papers and a final project. class discussions were sometimes less than thrilling, but the material is very interesting. take it.\"",
            "review 4: \"06F with Michael Bronski: Easy. There are a lot of readings, yet one doesn't really need to do much of the readings that are assigned to do well in this class, yet the readings are interesting to do. Most of the class is discussion and watching short movie clips. We also watched several movies. The papers were very easy.\"",
            "review 5: \"06F with Michael Bronski: The course was definitely fun and not too hard.\""
        ],
        "Eng-beng Lim": [
            "review 1: \"23W with Eng-beng Lim: This is for WGSS002, which is the current iteration of the class. Total layup, so easy to get an A in: the workload consists of one 15 minute group presentation, one 20 minute final group presentation, weekly discussion posts of like 300 words, and a final essay of 6-8 pages on literally whatever topic you want. You also need to show up for most of the classes because attendance is part of the grade. Professor Lim himself is incredibly contradictory and confusing when he talks, but if you just let him talk unimpeded you should be fine. Also, professor Lim basically won't talk about class unless you make him, which is rather disappointing in that he fully embraces intersectionality with race, sex, gender, etc., but not class. So if you're a sochie like me, just be sure to actively bring that framework into discussions.\"",
            "review 2: \"23W with Eng-beng Lim: This is for WGSS 2 , Intro to Queer Studies. To say I hated this class would be an understatement. This is the worst class I have taken at Dartmouth by a long shot. My hatred cannot be expressed in a way that is socially appropriate to put on Layup list. I took this class because I wanted to see what Queer Studies was like, I knew it could be not great, but it was far worse than I ever could imagine. Lim is beyond confusing, to the point of being problematic. He did not accomidate a classmate with ADHD's SAS accomidations, and even gave them extra work on top of the extension he denied. He told an indigenous classmate they needed to \"decolonize their mindset.\" The trans section of the class infuriated me, it was like insinuating being trans and drag was the same thing. If you're queer and have a semblance of dignity, or you actually want to learn queer studies and not bs, don't take this class\"",
            "review 3: \"19S with Eng-beng Lim: This class was ridiculous! It was very easy to get an A, but yikes. The prof didn't really organize, and just free-form \"discussed\" things from readings for three hours every class, in over-the-top academic speak. Assignments were strange, including a giant project outside of class (I worked on a fundraiser), which was a good idea, but tons of time. Overall, a weird class. You'll probably learn something, but yikes.\""
        ],
        "Misty De Berry": [
            "review 1: \"21W with Misty De Berry: Misty De Berry is the BEST! She’s so understanding and it feels like she actually cares about every single thing everyone says. The class workload was so manageable, and we only met every other week once a week. This was during Zoom, so I’m not sure if it’s changed since then. The discussions were long but interesting, and the readings were not bad at all and pretty engaging. The final project has a lot of leeway in terms of creativity and artistic choice, so you don’t even need to write a paper if you don’t want to - she talked about students writing songs, poetry, etc.\""
        ],
        "Tyler Monson": [
            "review 1: \"21F with Tyler Monson: Tyler is a very kind, understanding and engaging professor! The readings were really interesting, and he always explained them really well. He also balances discussion with lecture really well, which was something I appreciated a lot. Overall, a fantastic professor and a really fascinating course!\""
        ],
        "Eng-Beng Lim": []
    },
    "WGSS016": {
        "Annabel Martin": [
            "review 1: \"07S with Annabel Martin: Although the class was somewhat disorganized at times, Annabel Martin was awesome to have as a prof. She was so sensitive to us, yet challenged us to produce thoughtful work and really engage with the theories, texts. I would take any other class she taught, just to have her as a prof again. The papers, readings, exams, projects... very doable. It got sort of frustrating when she'd assign and ton of work and then we wouldn't get to it - so we effectively spent lots of time on homework for nothing. But class discussions were really truly interesting and worthwhile.\"",
            "review 2: \"07S with Annabel Martin: I took this class for my CI. Annabel is great--always available outside of class, understanding and responsive, but not particularly organized. Assignments were postponed, cancelled, and altered--mainly because so much work was assigned that she and the TAs (who were fabulous) couldn't grade it all in time. We had to write 2 weekly \"blogs\" on blackboard that were essay-like journal entries in addition to watching movies outside of class and doing multiple readings. There were supposed to be 2 take home midterms that were choose 5 out of 6 essay questions (the second midterm was cancelled though, and all the other grades like the \"blogs\" which were originally supposed to be 1% of our grades each became weighted more heavily, and no revised grading rubric was given so really i have no idea how much everything was worth in the end). We also had to comment on all of our blogs at the end of the course, and comment on our group members' blogs throughout the term. We had a group presentation and web page project during the last week of class as well. Annabel was terrible about keeping presentations to the 25 minute time limit so that every day the first group was allowed to ramble for 45 minutes, leaving the next group 15 minutes to speed talk before class ended. The ideas raised in the class were interesting, but I generally felt like my grades increased when I threw in terms like \"hegemony\" \"the other\" \"the eternal feminine\" \"normative\" and \"social construct\". This class was interesting and not difficult, but overly and unnecessarily time consuming. I'm not sure that the amount of reflection it inspired justified the amount of time spent on it, but it wasn't a bad CI.\"",
            "review 3: \"07S with Annabel Martin: Words cannot explain how much I dislike professor Martin. This class could have been amazing if another professor taught it. Martin gives horrible lectures, confusing you more than helping you through the dense feminist theory. If you do not agree with her ideologies, you will not do well in the class. If you try to give your own view point, she will get defensive and shut you down! She repeatedly said things like, \"You just don't get it\" \"you are completely missing the point\" etc, meanwhile she did not explain why she believes that your point is \"wrong\". The TAs assigned were just as horrible as Martin. There was a significant grade difference (since they all take turns grading your weekly blogs). Martin also assigns two 2-page response blogs a week! It doesn't sound like a lot, but it is. Avoid this woman as a prof.\"",
            "review 4: \"07S with Annabel Martin: Prof. Martin is a nice person. Really. Though sometimes highly idealistic. As a professor, she presents a narrow viewpoint. It's not a good idea to disagree with her esp. in class. But she explains well even if it is her own view of the readings. She made us buy 7 books: anthologies, novels, readers etc. You don't have to read all of it. Just make sure you take notes on what she has to say about it then churn it and put in in. She loves connecting the dots, so if you skim through the readings, pick up quotes from various readings (that pretty much say the same thing) and \"weave it in\" with your own words, you'll be set. There were 2 midterms (though she canceled the last one), a grp project, a theory-in-action paper and weekly blog entries. It helps to go to the TAs for the midterms and the paper. The class is not difficult. Just a lot of \"busy\" work. And a lot of writing.\"",
            "review 5: \"07S with Annabel Martin: The professor is a bit biased - she sticks to her own viewpoints - but the class overall is an excellent introduction to feminism.\"",
            "review 6: \"07S with Annabel Martin: great prof. interesting material\""
        ],
        "Mingwei Huang": [
            "review 1: \"21S with Mingwei Huang: Reading-heavy yet fulfilling. You’re probably here interested in a minor or major, and taking Professor Huang is a delight.\"",
            "review 2: \"21S with Mingwei Huang: Pretty reading heavy but you can get away without doing most of it - Mingwei is the sweetest professor and is very helpful in office hours. The class was entirely discussion posts and reading response papers (short 3-4 pages), it's one of those classes that if you submit everything you'll probably get an A.\"",
            "review 3: \"21S with Mingwei Huang: This class was great and really interesting! Took it as a non-major and it made me wish that I had time to take more WGSS classes. LOVED professor Huang, super smart and kind and chose really fascinating readings.\""
        ],
        "Ivy Schweitzer": [
            "review 1: \"08S with Ivy Schweitzer: I'm a science major, this was my first experience with the WGST dept, and it was great. It explores so many perspectives and theories, and made me think about things differently. I highly recommend this class to anyone and everyone. The workload is manageable, and as always, the more you put into this course, the more you'll get out. Prof. Schweitzer is very responsive in class, and open to feedback from students. She pushed back a deadline once this term because we all felt we needed the extra couple days. She makes discussions interesting by offering diverse analysis of the readings. Great course.\"",
            "review 2: \"08S with Ivy Schweitzer: This class reviewed many feminist theories. Many of the theories are very complex, but the class did a pretty good job of explaining them. There was a lot of discussion and guest speakers.\""
        ],
        "Susan Overton": [
            "review 1: \"20S with Susan Overton: Really whack professor who is insecure about their own knowledge and privilege within the larger feminist movement. Can't use technology and was really mean to a classmate who gave her suggestions/solutions. Not a good prof and frankly has a lot of things she needs to learn about feminism today. Very outdated understanding of feminism today and the class is literally about contemporary issues in feminism. She needs to get a grip and stop being such a grouch... yikes.\"",
            "review 2: \"20S with Susan Overton: Do not take this class with Overton you will regret it. She is an absurd grader, yet her expectations for students does not match her level of teaching. If you ask her for help she will instruct you to help yourself. Save yourself the headache.\""
        ],
        "Brianne Gallagher": [],
        "Emilia Sawada": [],
        "Joseph Aguado": [],
        "Treva Ellison": []
    },
    "WGSS015": {
        "Silvia Spitta": [
            "review 1: \"07W with Silvia Spitta: Prof Spitta provided an excellent look at a less Euro/Ameri-centric history of feminism. The class - like all WGST classes - is led in a seminar style. Two papers, a presentation and a self-graded evaluation were what determined our final grade. The readings were at times long and difficult to plow through, but not always necessary to do. She often ran low on time in classes because discussions would take the class into a frenzy. I was unable to do my presentation because of a combination of snowdays and less than stellar time management of the class. Hopefully my grade won't suffer even though I've addressed the issue with her. The Writing Assistant (or well, both of them) weren't entirely on the same page as Prof Spitta with which direction papers should go in and what was expected of students. Prof Spitta most often demanded more than the TAs suggested. But she's an inspiration for people who want to devote themselves fully to a cause/subject material.\"",
            "review 2: \"07W with Silvia Spitta: Prof. Spitta is a wonderful professor. All the conversations and assignments were interesting and she was sensitive to the differences in views that each student has. Definitely take this course or any other course with Prof. Spitta.\""
        ],
        "Jennifer Sargent": [
            "review 1: \"20W with Jennifer Sargent: This class has almost no assignments beyond reading. Sargent assigns a lot of readings and asks that you take notes on all of them, but never checked for notes or asked us to turn them in. We had one presentation in the beginning of class, which was around 5 minutes, but we were put in groups of 3 & 4 so it was really easy. There was one bigger project, a 15-minute \"podcast\" where we were put in groups of 2 and just talked about a part of feminist history that people don't acknowledge as much. The only hard part about this was getting the audio equipment from Jones and learning how to use it. We turned in a script, but I don't think that was graded. After that, we had a final paper which was around 10 pages and basically the longest course assessment ever. It was supposed to be a \"reflection\" but I started running out of steam after like 5 pages. Each class was pretty much just discussion. Not everyone participated. Sargent is nice and the class was easy but beware of performative wokeness. Sargent is a white woman and seemed to be constantly bragging about how progressive she is (in one class, she spent a half an hour talking about how she used the right pronouns for a trans woman) but it's obvious she still has some unrecognized privilege. Still, this class was alright. Would recommend.\""
        ],
        "Annabel Martin": [],
        "Brianne Gallagher": [],
        "Joseph Aguado": [],
        "Julia Rabig": []
    },
    "WGSS010": {
        "Francine A'Ness": [],
        "Jennifer Fluri": [
            "review 1: \"08F with Jennifer Fluri: I honestly still have no idea what to make of this class. While I found Professor Fluri to be interesting, intelligent, and compassionate outside of class, within class she seemed more interested in pushing a liberal agenda than fostering true discussion. Moreover, I never was quite sure what it was I was supposed to be learning--the readings seemed to disparate to lend themselves to anything cohesive; the only thing I really took away was that a feminist could be anyone--a housewife, a career woman, someone who was pro-choice, someone that was pro-life--that the word meant so many things it basically meant nothing. I might recommend this class with a different professor, as again, I found Fluri to be very pushy (and also quite scattered) in class. However, if you are interested in women's issues, I might recommend you talk to her in office hours--she is very knowledgeable, and seems more relaxed when not in a classroom environment.\"",
            "review 2: \"08F with Jennifer Fluri: It really depends on the people in the class. The class is discussion-based, and the focus is on readings we've done outside of class. There is a TON of reading throughout the beginning of the course. However, it is more time-consuming than difficult. We usually got off the topic during class and ended up discussing something totally irrelevant and often pretty interesting. The projects are a little risky...You are assigned a group with which you work on several time-consuming, but possibly fun, projects. So, just hope that the group dynamic works. To reiterate, the projects, one of which is a movie, take hours and hours and hours. Jennifer Fluri really doesn't do much. Well, she does constantly bring up her research--even if it is irrelevant.\"",
            "review 3: \"07X with Jennifer Fluri: Although the assignments for this class were all fair and straight-forward, some of the grading seemed arbitrary. The readings were all fascinating, with views from different parts of the world and different walks of life. She definitely exposes you to a view other than the typical white wealthy woman of the first wave. However, it was sometimes difficult for Fluri to bring the discussion past a confessional of complaints here at dartmouth as this is an introductory course.\"",
            "review 4: \"07X with Jennifer Fluri: This class was awful. Professor Fluri is an intelligent woman, but incredibly narrow minded and only responded (both in class and in her grading) to ideas that paralleled her own. She was disrespectful to students who voiced original opinions. And, almost more insultingly, her TA (an '06) did nearly half the grading for a class of 14 students and spoke in class ten times as frequently as any of the undergraduates. I would strongly, strongly advise not taking classes with Professor Fluri unless you are willing to go along with her views.\"",
            "review 5: \"07F with Jennifer Fluri: This class was amazing. Everyone should take it before they graduate. I think it really depends on the people that you have in the class because it is very discussion based, so people's opinions and how much they contribute to class affects the feel of everything. Prof Fluri speaks in class, but mostly serves as a facilitator during discussions. In general, she's really nice and really a great person to talk to. The only thing is that there is something major (paper/(group and individual) project) due approx. once a week and usually a daily reading homework assignment due, so there is definitely work to do in this class. But, overall you'll do well as long as you do the work.\"",
            "review 6: \"07F with Jennifer Fluri: the projects were fun. it really depends on the people you end up with though, you pretty much get stuck with them for the rest of the term. the reading summary can be tedious, but generally the workload isn't that much, apart from the 2 papers that you have to write. Professor Fluri is really approachable and helpful, and i like her a lot. But this class is based strongly on discussions, so if you are looking for a lecture class, this is not for you.\"",
            "review 7: \"07F with Jennifer Fluri: I was really excited to take this course because I wanted to learn a lot more about the topic. For the most part, I was disappointed. The weakest part about this class was it's design. The first week involved lots of reading. We moved through the reading so quickly that we didn't really have time to digest it and discuss it. Also, the way discussion was run was frustrating because there were too many people in the class. Professor Fluri responded to each individual comment rather than allowing conversation to flor or guiding it in a certain direction. In result, the quality of class very much depended on the people in the class, which is worth keeping in mind. Next, we had multiple projects going at once, which got really confusing. Professor Fluri mentioned them once, and never brought them up again, even before the due date (so make sure to check the syllabus regularly!). Then we started having presentations every day and having to watch movies every night for class. Because these 3 segments were distinct rather than integrated, the work and class became very boring. The issues covered in this class are really important, but I would recommend trying to take it with a different professor. Professor Fluri is very nice and really interesting to talk to at office hours, but she just seems unsure of how to run a class and I think a different professor could teach the material mroe effectively.\"",
            "review 8: \"07F with Jennifer Fluri: I LOOVED this class, dont listen to what anyone else tells you. Fluri is an awesome teacher who allowed us plenty of discussions and interesting homework, especially the ones that involved watching movies. I loved the group projects that allowed us to sort of take over the class. It's a perfect freshman fall class, i think.\"",
            "review 9: \"07F with Jennifer Fluri: the class was very discussion-based, with no real topics announced beforehand. the class ended up being unorganized, with some focus on the image of women in the media.\"",
            "review 10: \"06F with Jennifer Fluri: Professor Fluri is really, really nice. There was a lot of reading, not always interesting. Discussions could get kind of long, but sometimes they could be really interesting. It was a good class.\"",
            "review 11: \"06F with Jennifer Fluri: So, this class was easy in terms of final grades and project grades. The course readings varied from very tough to easy reads, yet fully comprehending them was not necessary to do well in the class - it was easy to fake and (despite what she claims) she can't tell from our papers if we have done the readings. Our papers are opinion based and supposed to included lots of 'i thinks' which made it all feel very unscientific and not even good writing or accepted in academia. And the projects -- dressing up as female super heroines or keeping daily media journals - makes me feel like i am back in 5th grade (but they were graded easily and there is extra credit). Our class consisted almost entirely of discussions; rarely did we get a lecture or clearly guided path or topic. There were some interesting debates but often i felt that class boarded too much on ranting against popular society and the male gender (almost the whole class was female). I did not learn much and almost nothing useful but thought provoking topics were raised. Professor Fluri was an easy professor and did not have clear lectures or a direction for the class (except to turn against popular culture) but she was one of the nicest and most flexible professors ever -- if we were stressed she would easily give us an extension. She is really very nice and she does care.\"",
            "review 12: \"06F with Jennifer Fluri: I feel like WGST 10 courses vary quite a bit depending on who teaches them. Professor Fluri's approach is very interesting and I feel like she helped me understand the subject in a new way. I recommend that every one take WGST 10, especially from Professor Fluri.\"",
            "review 13: \"06F with Jennifer Fluri: The class was very interesting and Professor Fluri is an excellent professor, she is very helpful and understanding.\""
        ],
        "Phyllis Katz": [
            "review 1: \"05F with Phyllis Katz: There was a lot of reading and writing and watching movies outside of class. The class was a lot of work, but the material was interesting. If you do the work and attend class you'll probably get a good grade. The discussions every day are the best part.\"",
            "review 2: \"05F with Phyllis Katz: Not the best prof in the world, but the material makes up for it. Take the class!\"",
            "review 3: \"05F with Phyllis Katz: Prof. Katz is very flexible and understanding. She directs class discussions with ease and keeps things interesting. I would reccommend her to anyone looking to take WGST 10. She doesn't demand too much from you, yet she still keeps you working at a steady pace. The readings are usually quite interesting and informatve, and I can personally amdit that this class has changed several of the opinions which I had previosly and ignorantly held. It was the highlight of my fall term classes... and I'm glad that I didn't listen to all of the negative reviews which I encountered on SAguide about Katz!!!!! Don't believe it guys!\"",
            "review 4: \"04F with Phyllis Katz: I went into this class expecting to be totally enthralled and inspired by the material. Instead, the heavy workload made the class less stimulating than I had desired; I didn’t have enough time to digest the material and formulate my own questions and opinions. I do feel that I learned about sex, gender and their role in society, but my expectations weren’t met. Professor Katz, is a very nice woman but her ability to direct conversation is lacking. I recommend the class to people but not whole-heartedly.\"",
            "review 5: \"04F with Phyllis Katz: The professor did not provide any lectures and her knowledge of the subject was minimal. She did not provide the class with many thought-provoking questions. The readings overlapped greatly and the assignemts were a lot of busy work.\"",
            "review 6: \"04F with Phyllis Katz: I really liked the reading. Some of it was repetitive, but for the most part, it was interesting and engaging. Professor Katz didn't really inspire the class though. There are journal entries for every reading assignment where, along with analyzing, you are expected to thoroughly summarize the reading. It is really annoying and a waste of time.\"",
            "review 7: \"04F with Phyllis Katz: each class was a discussion. we read a lot of good material and discussed very interesting topics. classwork was easy, but very tedious. i'd recommend it if you are looking for an easy class and don't mind doing things like journals.\"",
            "review 8: \"04F with Phyllis Katz: the class was interesting, but the prof did not inspire. journaling every reading was tedious, but it was nice not to have tests.\"",
            "review 9: \"04F with Phyllis Katz: I came into Dartmouth thinking about majoring in Women and Gender studies, so I took this course as a general overview and to make sure I knew what I was getting myself into. I think this was Prof. Katz's first term to teach the course, and so she was experimenting with different ways to approach the subject matter (she was very avaliable after class and open to suggestions on how to change her teaching style to be more effective). What I will remember most about this course was the sheer mountain of reading required for this course. I have never been so happy as the day I turned the last page on the 575+ page course reader. Two or three articles are requierd for each class, with a journal entry on each (nearly everone had trouble with the journals. Lord help you if you fall behind on them). Though some of the articles were of a more manigable length, just as many were like miniature novels They covered a wide range of perspectives and issues on gender issues, and though interesting, the sheer number of them made it easy to forget most of what we'd learned.\"",
            "review 10: \"04F with Phyllis Katz: I enjoyed this class mostly because it was based in discussion, and it was interesting to hear what others had to say on the touchy issues that we covered. There was a lot of work associated with the course- journal entries galore, projects, the paper, etc. Not having any tests was nice, and I never really felt much pressure. As long as you keep up with the work, it's not a problem at all. Katz was really open to changing around her syllabus and was always looking for our input. As a freshman, I found her somewhat intimidating and critical, and I know others were perturbed at her closed minded opinions. Other than that, she was fine and let our class run itself.\"",
            "review 11: \"04F with Phyllis Katz: The course is awesome, I recommend it to anyone. However, take it with a different prof. Prof Katz didn't really add anything to the course. I learned more from the other students, and Katz often ran discussions by picking on people to speak rather than letting it be more of a flowing dialogue in the classroom. Thus discussions were often stilted and disjointed, something that could have easily been avoided in a seminar-type format.\"",
            "review 12: \"04F with Phyllis Katz: I really enjoyed this class. Although some of the readings and assignments were kind of tedious, many of the readings were truly enlightening and worthwhile. Overall, I feel like I achieved a lot of personal growth, and learnged a lot about myself through this course.\""
        ],
        "Annelise Orleck": [
            "review 1: \"05F with Annelise Orleck: Prof. Orleck is a very good teacher. Unheard of for a WGST class, this class was half female and half male. The conversations were very good and the whole class was engaged. The only bad part is that some of the readings were very boring (but the conversations that followed them were good!).\"",
            "review 2: \"05F with Annelise Orleck: I kind of feel like Prof. Orleck was a lazy professor. The class was all discussion pretty much but she would take control of the discussion whenever she wanted to say something. Our entire grade seems to be a attendance, paper, journal entries, and a self-evaluation. It just seems kind of sparse. I just felt like Professor Orleck didn't really feel like teaching. I understand that maybe discussion was a great way to dialogue about these issues, but it was weird to be always discussing. I don't know, I went into this class with high hopes and feel a little disappointed.\"",
            "review 3: \"05F with Annelise Orleck: i was really pleased with my personal growth as a result of this class. it's changed the way i view the world and the way i interact with people. professor orleck was great and was really responsive to opinions in class, as well as problems i had outside of class. i looked forward to this class every day. the readings weren't too hard and they were mostly all interesting. our class discussions ranged from pretty interesting to very fulfilling. students are encouraged to connect personal experiences with the readings we do, and some great class discussions centered around masculinity, greek life, and if prostitution can ever be a choice. the class is mainly graded on attendance, participation, daily journal entries, and a final 12-15 page paper. the only downside is that you have no idea what your grade in the class is until the very end. this class isn't too much work, and it's very fulfilling. if you can fit it into your schedule and are interested, you should definitely take it.\"",
            "review 4: \"05F with Annelise Orleck: Prof. Orleck is good and facilitates discussions well. The course was OK but does teach a lot about topics that are usually not discussed.\"",
            "review 5: \"05F with Annelise Orleck: This class is very heavy on reading - several articles a night, and you're supposed to write an entry each night in a journal due at the end - I ended up writing all the entries for the week on sunday. No other written work beside the research paper (15 pages) due at the end - topic of choice, can do interviews and such. Most of the reading is very interesting and deals with hot topics - racism, homosexuality, gender, class, environmental issues, etc. Class is discussion-based, with student discussion leaders. The prof. usually just interjects, only 1 or 2 real lectures. A few guest speakers. Definately a good course, and one that opens your mind up to a lot of important issues.\"",
            "review 6: \"05F with Annelise Orleck: This is a terrible course if you are no a man-hater... there is very little work, which is why I took it, but every guy in the class was ostracized and given a poor grade because he didn't buy into things like \"there are 5 genders\" or \"every woman exists somewhere on the lesbian continuum.\" Orleck is awful, though if you have an NRO (luckily I did), you could use it here and not work very much\"",
            "review 7: \"01F with Annelise Orleck: I was highly impressed by both the course and the professor in womens studies 10 this fall. I always looked forward to attending class, and the class discussions (which we had almost everyday) were for the most part very engaging. Basically, i never felt like putting my head down on my desk. I also want to stress that there was no \"man-hating\" going on. Although i'm a woman, the men in the class said the same thing at the end of the term. So, i highly recommend the class. It's not hard or time-consuming, and as long as you come prepared to say something worthwhile you'll do well.\"",
            "review 8: \"01F with Annelise Orleck: if i could design my own educations as i wished, i would make all my classes like wst 10 w/ prof orleck. the format (readings for homework, personal journal responsed, and discussions in class) is extremely effective. we also watched some powerful films. this class was all about EXPOSURE and if you're not too scared, then go for it- you will learn so much about yourself, your peers, and your world in general. and no, it's not all about feminism at all (in fact we probably only directly talked about that for part of one day). really it's about people all around the world. we ask questions like \"what is gender\" and are there sex-differences (inherent or socialized) and what are the implications. we also talk about economic inequality. there is no question that you will grow from this class and this professor.\"",
            "review 9: \"01F with Annelise Orleck: I really enjoyed this course a lot. The majority of the classes were discussion oriented. It was refreshing after a long powerpoint lecture. This class led me to reevaluate the way I look at the world. The subject matter is really interesting. Discussion topics include: poverty and gender, female circumcision, defining masculinity, the greek system, prostitution,the media and how it affects images of women and men, mothers and the making of martyrs,etc. It was a nice blend of international and domestic topics. There are no tests, no reading quizzes -you can get away with not doing the reading assigment for a night. There is a 15-20 page research paper at the end of the course. Professor Orleck makes herself available to help you with your paper. I met with her multiple times during office hours and it was extremely helpful. There is a journal assignment that lasts throughout the term. In the journal you write responses to readings, discussions, and include articles and images that pertain to the reading. The journal is due at the end of the term. Would suggest not waiting till the end to do all the entries like I did. Not so good. Annelise Orleck is an excellent prof. She definitely made the course. Never forced her opinions on anyone in the class. She basically mediated the discussion and redirected the class back to the topic if we digressed. She's very understanding when it comes to extensions and such. I would definitely recommend this class to another student. Contrary to popular belief there are guys who take this course too. There were about 5 out of 27 or so in my class. I was really suprised at the composition of the class. I expected a group of psycho-femmes, but realistically everyone kept the discussions civil and there was no guy-bashing. The only thing I don't like about the class is that you have no idea what grade you are getting since everything is due at the end of the term. Oh, participation counts too. Personally, I think this is a course everyone should take.\"",
            "review 10: \"01F with Annelise Orleck: I really enjoyed this class. I am so grateful that I enrolled in it. I took it on a whim,and I am so happy that I did. There are discussions almost every period, and Professor Orleck encourages candid responses and helps the discussion to flow well. I learned so much abou tso many issues and topics. It wes such an excellent course. I suggest this course and this professor to any and every body.\"",
            "review 11: \"01F with Annelise Orleck: Opened up my mind to issues that everyone should know about. Not too much time outside of class, but you learn a lot and the discussions are a pleasure. If you haven't yet taken a class with professor Orleck, you really should. She knows what she's talking about and really cares about teaching you and getting your thoughts and opinions. Classes and grading is very informal\""
        ],
        "Irene Kacandes": [
            "review 1: \"20F with Irene Kacandes: This class was absolutely incredible and I can't recommend it enough. Prof. Kacandes made everything very accessible and made the workload as light and manageable as possible in the Zoom environment. She facilitated engaging and timely discussions and didn't waste anyone's time with irrelevant topics or busywork. She also genuinely cares about all the students, which made the class so fulfilling and enjoyable. The class structure was readings before class and then discussions during class time. X-hours were only used once or twice. There are 4ish papers/projects, all of which are easily graded. A lot of the projects and classwork revolve around small groups, so if you aren't interested in group work or want more flexibility this probably isn't the class for you. Also- participation is 25% of the final grade and all reading notes are turned in throughout the term, so it's definitely important to stay on top of the work and be in class every session.\"",
            "review 2: \"08W with Irene Kacandes: Great Class but lots of work. Keep up with the work and you'll do fine. Don't fall behind. Take this class.\"",
            "review 3: \"08W with Irene Kacandes: This course is a great introduction to a lot of important issues, but is a bit boring if you take it later on in your college career\"",
            "review 4: \"02W with Irene Kacandes: This course was a really good introduction to the issues and topics that Women's Studies examines. It is a lot of reading, and the required reading notes take a LOT of time....expeically if you get behind. And they are required to be in a pretty specific format. The material, for the most part, is very informative and interesting. I've heard great things about this class. I would recommend that everyone take it, perhaps with a different prof. though. The professor DEFINITELY makes or breaks the course. Professor Kacandes is extremely knowledgable, but sometimes is a bit too controlling over class discussions. I also got the sense that she was already familiar with any of the comments that were made in class.\"",
            "review 5: \"02W with Irene Kacandes: Taking Women's Studies 10 under Professor Kacandes was an awesome experience because it didn't always feel so much like a class but rather a discussion group where we dealth with material as though it were (and sometimes it really way) issues that apply to us. Between the professor and our TA Shilyh Warren, there was always someone to talk to further. It became a very personal learning experience and I changed as a person as well as a student. I recommend you take this class.\"",
            "review 6: \"02W with Irene Kacandes: Did I know what I was getting myself into when I signed up for this class? Heck no! I'd heard from all kinds of people that it was phenomenal and one of the best classes at Dartmouth to take, and they were right! While more than a typical work course, it was worth it. There's a LOT of reading and you really do have to do it all because you have to do reading notes for grades. And DO NOT leave these until the night before one of the due dates or you'll be up the river...they take a while and actually do help with class discussions so keep up with them! Group projects are no sweat and are usually pretty interesting. It's a fun experience also to write a paper with other people...you really get to know them well and you become closer with everyone in the class (about 20 people) through the discussions and class activities. The individual research paper is fun if you do it on something that interests you. Have a good time with it because it'll show in the final product. Kacandes was great, although it seemed she was a bit distant from us at times. She offered wonderful insight and helped discussion along often. We had an awesome TA who made the class even more awesome. It'll seem crazy at the end of the term when you're turning things in left and right, but the end product is worth it. The readings will come in handy during late night discussions with friends at 2 in the morning. The things you talk about in this class ACTUALLY come up in natural conversation and it's amazing to be able to put in all these different ideas and published viewpoints, as well as your own developed viewpoint. I HIGHLY RECOMMEND THIS CLASS! Take it! You won't be sorry. And even if you're the only guy, there's nothing to lose. You won't be put in the corner or have your ideas discounted. I was one of four guys in my class and they valued my input a lot because I was obviously in the minority in the class, able to give a lot of insight that the rest of the class didn't have. This class should be required...that's how strongly I believe in it. Take it! :)\"",
            "review 7: \"02W with Irene Kacandes: Everyone should take this class. This issues are so relevant to anyone's life. This course is NOT just for women!!! There was a ton of reading and a fair amount of work, but it was all manageable, and there was no final paper or exam, which helped a lot. The seminar structure of the class also made it one of my favorites. We had some amazing discussions, and Kacandes didn't lecture very much. When she did, it was very helpful, i.e. it provided history of an issue that wasn't in the reading. This isn't an easy class, but it is worth taking because it addresses issues that you will deal with every day.\"",
            "review 8: \"02W with Irene Kacandes: This class was a good survey of all the problems there is in the world concerning race, class, and gender. I thought this class was going to be mostly about women, but we covered the three topics pretty evenly. The first part of the class was kinda boring, you just learn about the history of feminism and biology. But things soon heated up when we got to race and gender stuff. The class format is small (like 20 something students) and we mostly discuss the readings. In discussion, other people's opinions come out and it was just really intresting to see what other people thought about the subject. Kacandes is a really nice prof. She's really open to new ideas, and likes to make sure that the class is learning. So if you need an SOC distrib, take this one. The homework is really easy too.\"",
            "review 9: \"02W with Irene Kacandes: Women's studies 10 is incredibly interesting and certainly worth taking, regardless of major. The class had great discussions and prof. kacandes inspired interested without much lecturing. There was, however, an exorbitant amout of reading. i mean really ridiculous. Be prepared to invest a lot of time not only in the extensive readings, but also in the required notes that accompany. All in all, worth the time, but sometimes tedious.\""
        ],
        "Tyler Monson": [
            "review 1: \"22F with Tyler Monson: I'm generally optimistic and positive in my reviews, and I quite enjoyed this class. 90% of it is discussion based, with students largely leading the focus. You explore a variety of different issues, from inclusion of trans people in sports to the Israeli-Palestine conflict. However, you don't always receive introductory information for these issues which can make it difficult to participate in class if you're not already familiar with them. When I had Professor Monson, it was his second year teaching, and he wasn't particularly confident in how he conducted the class. Every once in a while he would give a lecture on a particular topic, but I didn't find them to be particularly interesting. Where this class really shone was in its group discussions. You get in what you put out, and as a class we were able to explore some fascinating subject areas. Assignments for this class aren't particularly difficult. You'll have a few readings before each class that will help you contribute to the discussion. They vary widely in length, but none took me upwards of two hours to complete. I did find, however, that the workload picked up substantially with the final project towards the end of the term. Other than that, there are a few small writing assignments that aren't particularly difficult, and Professor Monson is not strict when it comes to grading. I'd consider this class a layup, but if you don't do the readings and choose not to participate in class, then I think you'll find it thoroughly boring.\"",
            "review 2: \"22F with Tyler Monson: Great class with a great professor! I highly recommend. The topics are very engaging and the work is minimal. There are readings every week, but you will be fine if you do not do them. The course had two 1page short essays and a 3page essay at the end. Instead of having a final there was a creature project. You will get out whatever amount of effort you put into the class.\"",
            "review 3: \"22F with Tyler Monson: Highly rec this class with this professor if you are interested in WGSS. I'd consider it a layup-- even though there are lots of readings per week, you'll be fine if you don't do all of them or skim. Make sure you do read somewhat though because otherwise it's hard to participate in class discussions. In terms of assessments, there were 2 short papers, 1 medium-length paper, and a creative final project. Grading is fair. Like others said, you get out what you put in. Monson is a great professor and is incredibly nice and down-to-earth. You can tell he really puts the effort in to get to know you.\"",
            "review 4: \"22F with Tyler Monson: Class is definitely a layup. The topics were very interesting. There were 2-one page reflections of readings, an outside engagement report about something you read, watched, listened to that you relate to class, and a final creative \"remix\" project. Professor Monson was super nice, chill, and seemed to want to form relationships with his students. Would recommend.\"",
            "review 5: \"21F with Tyler Monson: Easily my favorite class this term. Professor Monson allows the class to flow smoothly, guided mostly by our own discussions on the assigned readings– all of which I found to be extremely interesting. The assignments consisted of a couple of papers based on the readings, a paper based on an outside source of our liking (which I loved), and our big final remix project, where we got to translate a reading from class into another medium to highlight what it signified to us. Even as a STEM major, I think this is a class everyone should try out!!\"",
            "review 6: \"21F with Tyler Monson: Definitely take Dr. Monson if you get the chance. Engaging discussions which were organic and led by our interests, nice assignment structure that keeps the course close to what you enjoy, and really good readings. I can especially recommend Dr. Monson to majors who are looking to get the most out of this class.\""
        ],
        "Michael Bronski": [
            "review 1: \"08F with Michael Bronski: Lots of people take this class for the CI, but I can't speak from that perspective. I will say however, that I was worried about the amount of focus on current media at first. It turned out to be a great experience learning to write about news media and films using the analytical tools of W&G Studies. Prof Bronski is really cool, and talking with him is always very interesting and thought-provoking. Our unusually large class did require a TA, probably a first for the WGST department, and he had very high standards, but helped me improve my writing when I felt like I didn't know what he expected from the weekly assignment. Plus, the prof gives the grades in the end, so there's no need to worry that the TA's letter grades won't reflect your effort and progress.\"",
            "review 2: \"08F with Michael Bronski: and an easy A... but that's about it. Prof. Bronski is personally nice, though, and makes an effort to get to know his students, even if his class is not the most stimulating experience.\"",
            "review 3: \"08F with Michael Bronski: Bronski is awesome. He keeps the 2A interesting by encorperating lecture, discussion, and multi-media (movie clips, song clips, random cartoons)...so it's really pretty fun.\"",
            "review 4: \"07W with Michael Bronski: AWESOME prof. Do NOT hesitate to take this course. It was really enjoyable- the readings, the films we watched and the only tedious stuff was turning in reflective responses every week for articles and tv shows we chose to watch. Take it!\"",
            "review 5: \"07W with Michael Bronski: Prof Bronski knows what he is talking about, and manages to make the material really engaging, even for people not so interested in WGST. this class is an easy A if you just complete the work. bronski pulls material from all different areas, including old film clips, cartoons, current news, feminist thought, and even non feminist though. really wide variety of information which makes for a better more general understanding of the topic. Easy and fun, take it.\""
        ],
        "Zahra Ayubi": [
            "review 1: \"22X with Zahra Ayubi: DO NOT TAKE THIS CLASS WITH PROFESSOR AYUBI. She never responds to emails, is incredibly distant, grades completion assignments harshly, and I never met her once since you class was all on zoom even though all other classes this term were in person. This is not a layup with Ayubi. I repeat, do not take this class.\"",
            "review 2: \"22X with Zahra Ayubi: Don't take this class with Zahra Ayubi or any other course with her. She has high expectations for students that don't go both ways. She is incredibly disorganized and class discussions felt very high school. As a WGSS major, this was definitely the worst class I have taken from the WGSS department (because of her).\"",
            "review 3: \"20X with Zahra Ayubi: VERY easy class to take remotely, but terrible if you're actually interested in the material or want to learn anything. There were no synchronous or asynchronous lectures, just 30-60 pages of reading a week that you then wrote a total of one and a half pages of Discussion Posts to by the end of the week, which were just graded for completion. Only major assignments were two 2-page papers due by the end of the term, and a final project (PowerPoint presentation). There was no instruction for these assignments, just \"write a 2-page analysis\" based on some photos from the Hood or Rauner. Professor was MIA, literally never communicated anything to the class, and sometimes took days to answer emails. The only learning you do is by reading other students' responses to the readings. Basically, it's an incredibly easy class that requires maybe 2 hours of work a week, but I was very disappointed with it because I was actually excited to learn.\"",
            "review 4: \"20X with Zahra Ayubi: I liked taking this course remotely. I learned a lot from the readings and Prof Ayubi was always available when I had questions or wanted to talk more. She seems super reasonable and also very experienced in her field. I would take a class with her again in a heartbeat\"",
            "review 5: \"20X with Zahra Ayubi: I wouldn't call this a layup since this content was new for me. We never met synchronously, so I have no idea how Professor Ayubi is. She barely was active in the class at all, so it was like we didn't have a professor. It was more like a self-run class. So since I didn't get any feedback throughout the course, I had no idea how I was doing. At the end, after I calculated my grade following the grade breakdown in the syllabus, I should have gotten an A but instead got an A-. After the term, I appealed my grade, but she never replied to me, so I emailed the department chair, and THEN she only replied after that telling me that the appeal process would entail her looking through all my assignments again, which could result in a lower grade. I agreed, and then never heard back from her again. I reached out to Professor Ayubi again in 20F about how the process of looking over my assignments was going, and she never replied. So basically the professor was totally absent from class, and also completely MIA after. Thank goodness I NRO'ed the class because this was supposed to be a layup class according to past reviews.\""
        ],
        "Francine A'ness": [],
        "Faith Beasley": [
            "review 1: \"07F with Faith Beasley: The class was definately interesting. It opened my eyes to things I'd never considered. The readings were a bit tedious and the papers were just unfair. I don't see how she could have expected us to do well on them considering we barely had time to discuss the material. Overall it's a great class, the papers are kind of riduclous though.\"",
            "review 2: \"07F with Faith Beasley: This class was not at all what I expected. While it was supposed to be discussion based, it always seemed to turn into one student making a comment and then Beasley talking about that comment for nearly the rest of class. I also thought a class in this department would be one open to varying opinions, but that was certainly not true. Beasley would hardly even acknowledge differing opinions in class or in assignments. The material we covered in class was also suspiciously correlated with what Beasley herself considered important - for example, French and Indian feminism, because she is a French professor and her husband is from India. I can honestly say I learned more about Beasley's personal life than I did about sex, gender, or society. Nearly half of our grade in this class was comprised of two essays. The grades for these essays seemed completely arbitrary and based only on how closely your argument matched what Beasley personally believed about the texts. When I tried to visit her during office hours to get feedback on drafts, she would conveniently be unavailable until the afternoon before the due date. Please do not take this course with Beasley. I have heard nothing but great things about WGST10 taught by Fluri. I really wish I had been able to take her class, but I had a scheduling conflict with her section. I completely regret taking this course as it was a waste of my time. The entire thing is a joke but because of the grading, your GPA could take a dive as a result. If you are just looking to fulfill your CI distributive, please look elsewhere and avoid Beasley if at all possible.\"",
            "review 3: \"07F with Faith Beasley: I took this to fulfill my distribs and it was ok. A reading response was due every class and that was a little annoying. Also there were 2 papers about 5 pages each but they weren't graded very fairly. If you want an ok grade just to get a distrib out of the way this is a good choice.\"",
            "review 4: \"07F with Faith Beasley: The Professor was engaging and available outside of class. The course covered a broad range within its category. Very interesting.\""
        ],
        "Virginia E.": [
            "review 1: \"02S with Virginia E.: This course is supposed to be one of those life-changing ones. Everyone I spoke with who had taken it raved about how wonderful it was, how it changed their worldviews. They also cautioned, every single one of them, that it really made a difference who the professor is. And it does. Professor Swain means well. Really, she does. She is a fairly ineffective discussion leader, however, and she wanted the class to be discussion all the time. Frequently the class turned into a \"men do the darndest things\" episode. We had journal assignments for each article-- and she asked so much from each article that I for one resented her and refused to discuss things in class. The journal entries were the biggest pain -- requiring hours of preparation for every class.\"",
            "review 2: \"02S with Virginia E.: I was a little unsure about taking a women's studies class, because people think that women's studies classes are 'fake' or that you have to be a wild liberal feminist to be in such a class. However, neither of these ideas turned out to be true. There were women AND men in my class, and in past classes, the numbers were 50-50. Although some of the issues are women-focused, they could be broadly applied. There were also readings about class and race divisions, and men and masculinity. This class covered a broad spectrum and was, for the most part, very interesting. There were no lectures; the class was discussion based and Prof. Swain tried different methods, such as having student-led discussions. I would highly recommend this class to anyone, any grade, man or woman. It's a great overall introduction to the topics of Gender studies.\"",
            "review 3: \"02S with Virginia E.: This is one of those \"must take before graduation\" courses that should be mandatory for everyone. You'll discuss relevant issues to your daily life--i.e. the Greek system at Dartmouth, how women and men are portrayed in the media (on TV/movies/magazines/ads), intersections of race/class/gender, etc. It was definitely eye opening for many people in the class who hadn't ever considered such things before. The readings are great--stuff that you'll actually want to read. For the non-major, this class definitely isn't rooted in theory, and is more a class on gender roles in the everyday world. Both men and women take this class, and it's one of the department's prides. However, I don't think Prof. Swain had taught this class before, so she really didn't do that great of a job leading sessions. She had students lead discussions for just about every class, so she actually didn't do that much. Most of the time, she just sat back and let the students do all the talking. Her expertise is French women, so she talked a little bit about that, but other than that, students ran the class. Her assignments were also unreasonable, but I don't think she realized that until the class brought it up halfway through the course. She made us do journal entries for each of the readings (there were probably 2-3 articles a day), which was ridiculous, and of course, everyone saved them for the day before they were due. But after we complained, she changed it, so at least she was accomodating. She's a perfectly nice person and easy to talk to, but just wasn't the best professor to take this class with. So, strong recs for the course--definitely take it--but not so much for the prof.\"",
            "review 4: \"02S with Virginia E.: Professor Swain is a nice enough individual, but her unwillingness to let you interject your own opinions and the five minutes she gives you to discuss 100 pages of reading is frustrating. Take this class. DO NOT take it from Prof. Swain.\""
        ],
        "Ana Merino": [
            "review 1: \"06X with Ana Merino: The class would have been much better were it not for the 500 words we had to write on every one of our 25 readings and 8 films, in addition to a media file and paper. In addition, Ana Merino's difficulty with English was a huge problem. From what I've heard, she's a fantastic prof in Spanish...\"",
            "review 2: \"06X with Ana Merino: This is a great discussion-based class. It really makes you think about what you believe in concerning the subject and lets you express your ideas. The professor helps facilitate the discussion and is also very understanding. Just make sure you keep up with the reading and work.It's a lot of work, but I thought it was worth it.It's also pretty nice that the professor mixed up the reading assignments with comics and movies.\"",
            "review 3: \"06X with Ana Merino: Ana Merino is a terrible professor. The worst I have had at Dartmouth, no comparison. How she got a job is beyond me. She gives wildly rambling lectures that leave you wondering what her plan for the day was, routinely interrupts students when they speak (especially, perhaps only, when their views disagree with hers), marginalizes the opinions of any student who is not extremely liberal (or willing to fake it), and also has such a poor command of the English language that she frequently asks students how to spell a word, pronounce it, or for a clarification of meaning. She requires classroom participation and weighs it heavily in her grading metric, yet her attitude discourages certain people in the class from speaking...especially men, and especially men in fraternities - she doesn't hide the fact that she is against them. She is also selfish, requiring students to go to talks where she is introducing the speaker, even when the talk is about Asian Comics and is only tenuously related, at best, to sex, gender, and society. The English thing gets me especially, because the course is a lot of writing. All told, I'm going to end up turning in 60-70 written pages of my work, to be graded by someone who has a sub-standard understanding of the language. Am I the only one who is somewhat uncomforted by that? On top of that, we're now in finals period and I have no idea what kind of grade I could end up getting - I've turned in several things, but they come back to me with comments like \"very good\" or \"good writing\" with no notion of a grade attached. Don't ever take a class with Ana Merino, unless it is a Spanish class - I suppose she may be a good professor in that department. But if she teaches WGST 10 again, steer clear. I've heard from friends that this can be a great class, but with Ana Merino it certainly was not.\"",
            "review 4: \"06X with Ana Merino: a note on prof merino - gave more homework than anyone expected from an intro and summer course. more work than my \"serious\" courses this summer. readings + 2-page journals for each reading - for each class. friends who have taken the class in the past said it was more relaxed for them. on the other hand, she has a lot of interesting stories and is definitely passionate about the subject.\""
        ],
        "Giavanna Munafo": [
            "review 1: \"17F with Giavanna Munafo: This class has virtually no structure. It is super easy the first 5 weeks with almost zero work. However, there are a lot of projects and write-ups in the second half. Also, you get no real grades throughout the term so it is very hard to know how you are doing. Reading is not necessary, and the class is almost all discussions of your own ideas. Participation requirement is minimal. The class is not that hard, but attendance is checked and part of the grade. Limited x-hours, but a lot of required events outside of class. Also, the conversations can be very slanted and sometimes very boring. Giavanna is very nice and fluid with deadlines. Very interesting, but I will probably not be taking another class in this subject.\"",
            "review 2: \"17F with Giavanna Munafo: Overall great class. Prof Munafo is extremely cool (and woke) as well as flexible and understanding. Class is mainly discussion based, which is either super interesting or boring depending on the topic/paper being discussed. Can get by with little to no work (readings are unnecessary) most of the term, but end of term has a few more assignments including projects and papers (not very hard either). I would greatly recommend this class to anyone at Dartmouth because it is easy, minimal workload, and impactful--giving you a fresh new perspective on WGSS issues and fostering discussion outside the classroom.\"",
            "review 3: \"17F with Giavanna Munafo: This was overall a good class, but like any layup, you still have to put in work to get the A. I liked Munafo for the most part, but at the end of the day, I'm not sure how much I really learned. Most topics were interesting, and there are definitely worse classes out there. Good class if you want a pretty easy A (and are willing to do some work), but I might recommend other courses if you're really interested in the subject and want an in-depth understanding.\"",
            "review 4: \"14F with Giavanna Munafo: One of my favorite classes at Dartmouth. Prof Munafo is very flexible with timelines and making sure the curriculum includes topics that the students are interested in. During my term she had the seniors be the \"class leaders\" and essentially they were representatives for the students that Munafo would go to for advice on how the class was going and whether to move deadlines. I thought the discussions were really enlightening, which was also because my peers were very engaged as well and Munafo provided a good way to guide the discussion. On the other hand, class was slightly confusing because deadlines/etc. were constantly changing but overall I would recommend the course to anyone who's interested in taking the class.\""
        ],
        "Renee Bergland": [
            "review 1: \"18F with Renee Bergland: Bergland is an awesome professor. Like the review from 11F, you read the readings, go to class, lecture, and then discuss. You might have to do some informal presentations but they're literally no big deal. Also when she says bring your copy of your book to class, bring it! Yes, there's a lot of readings, but you can get away with reading one or two. Be sure to keep up with your lexicons; she's lax on due dates, but you'll get behind if you keep procrastinating. Also, just a fun, chill class to be in and Bergland is so quirky yet funny.\"",
            "review 2: \"18F with Renee Bergland: Overall a great and easygoing class. There are a lot of readings which you should try and keep up with, but you can get away without reading all of them. The structure of the class is pretty simple: do the readings, go to class, discuss them. There is a lax assignment due every Monday and Bergland is really chill with deadlines, but definitely try to keep up with the assignments or you'll have a lot of work piled up at the end of the quarter. Professor Bergland is a wonderful, chill, and quirky professor and I really enjoyed her class. Do as many readings as you can and try to keep up with the assignments. If you can come to class prepared with at least one or two comments you'll be golden.\"",
            "review 3: \"11F with Renee Bergland: This class is pretty straight forward: do the readings, go to class, participate in discussion, then go home and do more readings. Structure of the class: she lectures on the material you should have read for homework, then you kind of discuss it in class. Discussion will all depend on how much people participate and who actually does the reading. My class was fairly large for discussion so at times we would come to an awkard pause. You can get by through discussion not doing some of the readings but you'll need them for your papers. You're graded on participation, a 6-8 page mid-term paper, a group presentation (on the topic of your choosing that relates to the class), and a 6-8 Final paper. She gives you the prompt for both papers but is pretty flexible about your group presentation as long as you relate it back to what you learned in class. Also, she is very helpful during office hours and very approachable. I went to office hours to have her review my papers before submitting them and she was more than glad to help me with that. Overall a fairly straightforward easy third class and who knows maybe some of the material will be interesting to you.\"",
            "review 4: \"11F with Renee Bergland: This was a great intro class, very wide variety of readings and they were all really interesting. Professor Rabig is SUPER knowledgable about the topics and everything that is assigned. The only negative I found in this class is that most people did not take the class because they were interested, so they made no effort to learn from the material and actively participate. This made class discussions very difficult. If more people spoke, it would have been more enjoyable. I would highly recommend this class if you are interested in the subject and want to learn a lot about it! I think it can be very educational for all.\""
        ],
        "Mingwei Huang": [
            "review 1: \"20F with Mingwei Huang: Very easy class, but more work than expected. Lots of assigned reading, but all you have to do is answer questions so you can just find the answers in the readings and write them. Weekly discussion post and weekly reading journal due, with two slightly longer midterm writing assignments and an easy final project. If you put in any effort and make a genuine attempt to engage with the material you will have no problem getting an A.\"",
            "review 2: \"20F with Mingwei Huang: Easy class, but more work than I expected. We never met in person (except for optional discussions on Thursdays). There was a lot of reading each week, but I mostly just skimmed the material to answer the reading journals.There was a big group project at the end of the term which was actually fun to do. You should have no problem getting an A in the class. She is a super sweet and understanding professor.\"",
            "review 3: \"20F with Mingwei Huang: This was such a wonderful class! Prof. Huang is very kind and was understanding of how this term may differently impact students, so the course was pared down to only a few essential components. The reading is definitely a sizable amount, probably ranging from 70-130 pages a week. It was nice being mostly asynchronous, and all the readings were available from Day 1 so you could really work at your own pace. There was a weekly Canvas discussion and optional Zoom discussion once a week, both of which were helpful in going over certain more confusing topics. Also--going to Office Hours with Prof. Huang is really helpful to get ideas for your keyword assignments (2 midterm writing assignments that are actually graded based on quality rather than completion/participation). The final project is fun and collaborative, and not too difficult. Overall, a very fascinating course that will yield a strong grade if you put in decent effort.\"",
            "review 4: \"20F with Mingwei Huang: Decent amount of readings to do in a week but if you plan out your time right it really is not too difficult. Topics are interesting and very relevant but can be confusing so def reach out to Professor Huang if you are confused. Professor Huang is super nice and accommodating. There is one reading journal due each week (with readings attached) and then a final group project. Lighter workload overall compared to other classes and if you put in a decent amount of work your grade will reflect it. I for sure recommend taking this class.\""
        ],
        "Andrea Tarnowski": [
            "review 1: \"06W with Andrea Tarnowski: WGST 10 was an awesome class! We had great discussions on all the various topics that were addressed in the course. I left the class feeling that I had learned a lot about the society I live in and also a lot about myself.\"",
            "review 2: \"06W with Andrea Tarnowski: This was one of the best courses that I've taken at Dartmouth! Professor Tarnowski selected excellent readings and I always looked forward to attending this course because the discussions were so good. It really made me wish that I had discovered the WGST department earlier on in my Dartmouth career. I'd definitely recommend that everyone take WGST 10, even if it's not with Tarnowski.\"",
            "review 3: \"06W with Andrea Tarnowski: I loved this course and the professor even though I only took it to fill a credit and wouldn't normally have chosen a WGST course. The course readings were diverse and showed all points of view and topics within the scope of the course. Lots of discussion so attendance is important but work outside of class is not difficult unless you don't keep up with the reading. Professor was great at starting discussion but not controlling the direction of topic. Hard to know what your grade is throughout the term b/c a lot is based on disscussion and one group presentation.\""
        ],
        "Douglas Moody": [
            "review 1: \"21W with Douglas Moody: Doug Moody runs his class like a Writing 2-3 class. There are so many reflections, so much of the course is spent looking at the canvas, and there is a lot of busy work and group projects. He is a lovely man but don't take the class if you actually want to learn anything about feminism. Great prof and layup though!\"",
            "review 2: \"21W with Douglas Moody: This is definitely a layup but a painful one. Most of our classes were spent going over the syllabus and our assignments for the week. We had a lot of assigned readings but never talked about them in class so you don't have to do any of them. Lots of busy work and almost every assignment was a group project. Definitely an easy class and if you are looking for an easy A, this is a good class for you. If you are looking to learn anything, however, don't take this class. The prof is very nice and understanding but VERY disorganized. We didn't even have a syllabus and did not receive a single grade (though he told us at the end that if you do the work you will get an A).\"",
            "review 3: \"08X with Douglas Moody: I don't usually say things like this, but, Prof. Moody is the worst prof I've had at Dartmouth. After a term with him, I'm not sure he knows anything about WGST. Basically every class discussion turned into 1) Feminists have an undeservedly bad reputation 2) A discussion of race or 3) Stereotypes are bad. I actually learned the most from when my classmates would talk. But often, Moody would interrupt the students with some random comment. I'm sure he is a very nice person, but often his comments were even inappropriate. The only thing I would say Moody was good at was Blackboard. He is a pro at Blackboard, but that actually distracts. He spent the first 20 min of every class for about the first 7 weeks puttering around Blackboard while we watched. (Unfortunately, that's not an exaggeration). And yet, the final week of the term, we had 2 group projects and 2-3 essays due. Two group projects due within days of each other with different groups! Ridiculous. One was a video project in which 10% of your time is spent on content and the rest on making the project look pretty. Also: no one received a single grade or evaluation or paper back all term.\""
        ],
        "Angela H.": [
            "review 1: \"04X with Angela H.: If this had been my introduction to the WGST department, there is no way I'd have become a major. None of the other classes I have taken assign readings that advocate violence against a group of people as a resolution to tension, nor do they so continuously blame men as the source of evil in society. Rumor has it that this class can be great, but only in the fall apparently. I'd recomend Katz or A'Ness. Beware of anyone else, though.\"",
            "review 2: \"04X with Angela H.: A wonderfully nice professor and very powerful topics. A must take to learn about unbelievable issues that are going on around us and in the world. However, this is a very time consuming class because of the LARGE quantity of readings!!\"",
            "review 3: \"04X with Angela H.: I do not take humanities classes by a rule, but took wgst 10 for fun and ended up learning a lot. There's a lot of very complex gender theory that Rosenthal didn't really explain very well, and she didn't really teach anything (every class was just a discussion of the reading, which piles up if you don't stay on top of it) but the discussions really made me think and by the end of the term I am really happy that I chose to take it. I would definitely take this course if you want to try something new and want a completely new view of society. Also too, don't be scared off by the title- we explored a lot of class/race issues as well, not just gender, and none of us were raging feminists. There were even a few boys who came to class and taught the girls a lot by sharing their experiences.\""
        ],
        "Susan Brison": [
            "review 1: \"19F with Susan Brison: I was hoping this class would have a lot more discussion than it actually did, despite the size. Especially in the beginning of the term, I found myself wishing I'd taken another class as Prof. Brison was only lecturing/explaining the text from the day before to us. The sizes of the text were a little ridiculous. On average, I'd say we had 70 pages of reading, which I suspect most people did not do as she would explain it to us anyways. The class was based on our midterm essay and the final presentation or essay. Regardless, she was a really nice person and took a lot of time outside class to talk to us. Brison also brought in a lot of interesting speakers. Despite how I feel towards the class, I did learn many new things. If you're already very well versed in the basics of feminism, trans rights, gender studies, etc. this class may not be for you as you will find yourself bored and frustrated unless you read the texts thoroughly for your own self. If you are new to the field and want an easy time, then by all means don't hesitate to take this class.\"",
            "review 2: \"02X with Susan Brison: Good class with a great professor. The professor of this course always changes term by term, but I would find when Professor Brison is teaching it next and pounce on it like a feminist on sexism. The readings were great and interesting except for a couple. Reading responses challenge you to consider what you have read, and the course is mostly discussion. It is a great course even if you have never thought about gender issues before or always thought that WGST courses are just for feminist women. They're not.\""
        ],
        "Kristin O'rourke": [],
        "Emilia Sawada": [
            "review 1: \"21F with Emilia Sawada: Great class. Definitely a layup and made me aware of so many issues, raised my feminist consciousness.\"",
            "review 2: \"21F with Emilia Sawada: This class was informative and interesting. A decent amount of scholarly reading is assigned for each class (30-50 pages), however, you DO NOT need to do it because she covers the main ideas that she wants you to know. If you take notes in class and participate you have the ability to get an A. She likes students who go to her office hours. Each week there is a one-question quiz that asks you EXACTLY what you discussed in class. Prof Emi is very nice and interesting. If you are interested in this field of study you will like this class. It is overall pleasant, chill, usually straightforward, and I would recommend it.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"04S with Ulrike Rainer: I did not need to take this class but i am so happy that i did. It has been my favorite class so far. I found the prof interesting, class was a mixture of watching movies,lecture, and discussion. There was one oral presentation but it only was about five minutes so in reality it wasnt bad at all bc you do the presentations in groups. The reading is facinating and if you are interested in education or psychology at all you will probably love this course!\""
        ],
        "Laura L.": [
            "review 1: \"02F with Laura L.: many of the readins were interesting but it is very liberal. the readings can get rather repatative. if you're looking for an opposing view point, this is not the class. there is not too much work envolved, and the work required is not too difficult.\""
        ],
        "Paula A.": [
            "review 1: \"09W with Paula A.: All the book were really interesting. However, it was the first time Prof Sprague taught this course and since she is usually a spanish prof sometimes the lectures and discussions dragged on to fill the time of the 10A. I learned a lot and really enjoyed all of the assignments. -It was also a pretty bottom heavy course so just make sure you don't leave everything for the very end of the term\""
        ],
        "Jennifer Sargent": [
            "review 1: \"19X with Jennifer Sargent: I really liked this class! I wouldn't say it was as layupy as some said, but still pretty easy. We initially had daily reading responses that took a LONG time, but she ended up cancelling those. That eliminated all daily work and made the class a lot easier. Everyone presented once throughout the term, meaning sarg rarely lectured. All the student presentations got A's and were informative. There were 4 (I think) essays on guest speakers that were all graded pretty easily. As with most WGSS classes, you can make the essay your own and talk about your own opinions. Sarg is notorious for being tough, but she was lenient in this class. Just get on her good side and you'll have no issue. Definitely a good, fair class that I actually enjoyed and learned some stuff in. Having an A median was nice, too. Would reccommend!\""
        ],
        "Esther Rosario": [
            "review 1: \"23F with Esther Rosario: She is a distinctive individual with a unique personality that sets her apart. Despite her unconventional approach, she excels as a teacher, demonstrating a remarkable ability to engage and educate her students effectively.\""
        ],
        "Ivy Schweitzer": [
            "review 1: \"05W with Ivy Schweitzer: Even though the professor was biased, the readings provided a rounded view of the issues we studied. This class really opened my eyes to some of the abusive trends affecting both women and men today. People who think that women's and gender studies classes are useless obviously haven't taken them.\""
        ],
        "Brianne Gallagher": [],
        "Eng-Beng Lim": [],
        "Joseph Aguado": [],
        "Jung Ja Choi": [],
        "Kristin O'Rourke": [],
        "Misty De Berry": [],
        "Rachel Greenblatt": [],
        "Susan Overton": []
    },
    "WGSS007": {
        "Michael Bronski": [
            "review 1: \"08W with Michael Bronski: This course is essential to the Dartmouth experience. Professor Bronski is AWESOME and our class discussions were incredibly interesting and fun--I actually looked forward to see what would come out of the mouths of the girls in our class. With the exception of Yidl Mitn Fidl, all the movies in the class were a lot of fun to watch. A must-take course at Dartmouth before you graduate. Too bad it's a freshman seminar and not open to non-freshmen.\"",
            "review 2: \"08W with Michael Bronski: Pretty easy grader so you don't fix your writing much. The class can be dreadfully boring or really fun.\"",
            "review 3: \"08W with Michael Bronski: the readings dont match the discussions or the papers. it feels like two separate courses, and i didn't do any of the readings after the first few. the workload is not much at all if you don't do the readings, and bronski is very receptive to requests for extensions on your papers. he always goes out of the way to meet with students one-on-one, despite his busy schedule. discussion can become really boring, especially if the students aren't very into it. most of the students didn't really take the subject very seriously, and just started shooting off unsupported (not to mention close-minded) statements without actually thinking about what they were saying. i felt bad for the prof. my writing improved a bit from his detailed comments and suggestions, but much more just from the practice. go for a course with a lot of writing if you want to really improve your writing.\"",
            "review 4: \"08W with Michael Bronski: Great freshmen seminar. Professor Bronski is an awesome professor, and I loved this class. This class was a decent amount of work (2 one page papers, 2 five page papers, and 1 eleven page paper), but the material was really intersting to write about. There was way too much work for each class though. You didn't need to do the readings or watch the movies to do well on the assignments, so most kids didn't, but I tried to the whole term and it was a lot of work. I enjoyed most of it, so it wasn't that bad. In the beginning, Professor Bronski is a tough grader and really tears up your papers. He really helps you with your writing and if you do what he says, you'll end up with an \"A\" for the class.\"",
            "review 5: \"05S with Michael Bronski: Although there is a lot of writing (it was taught as a Freshman Seminar), the papers are well worth the effort. So much information is learned from the lectures and films that putting your own ideas down on paper is quite pleasing.\"",
            "review 6: \"05S with Michael Bronski: - Prof Bronski is really understanding and flexible with student needs - all papers have ungraded rough drafts and he allows revisions for finals below A- - a LOT of writing, esp since there are revisions on all of them - 4 1 pg papers, 2 6 pg, and 1 13 pg research paper\"",
            "review 7: \"05S with Michael Bronski: An extremely interesting course, even for those not necessarily into the subject material. Also, the prof is awesome.\"",
            "review 8: \"05S with Michael Bronski: As far as freshman seminars go, I think this class was ideal. It was a pretty interesting topic, and Bronski knew so much and was so excited about the material that you were forced to be interested. There was almost no reading that you HAD to do because the discussions were pretty much based on the films. The papers were graded very generously and there were revisions for every paper (even the one page ones), and if you got lower than an A- you could revise again. He always had good suggestions for papers too and really knew what he was talking about. There were 4 one page papers, 2 six page ones, and a 13 page final paper, which was quite a bit of writing, but it was spaced out well and never overwhelming, but he is also really willing to adjust timing. He really wanted to get to know his students and held a lot of office hours and meetings to talk to him about the class and your work. Basically, the class was great even though I wasn't even that interested in the subject because Bronski was such a good professor. I highly recommend taking a class with him!\"",
            "review 9: \"05S with Michael Bronski: Bronski is fantastic. Funny, interesting, and very responsive to students. The course material is varied, including film, TV, magazines, articles, photography, popular music, etc. The writing takes a bit of time, but the subjects are interesting, and the assignments are not unreasonable. I really loved this class!\"",
            "review 10: \"05S with Michael Bronski: Pros -great prof -prof gave 10+ minute breaks during my 2a. -watched lots of good movies -easy to get by without doing all of the reading -class is very laid back -If you work hard you will get an A Cons -lots of reading assigned -lots of writing assigned (though this will be the case for any seminar)\"",
            "review 11: \"05S with Michael Bronski: Teacher was extremely understanding of students' situations, but the class lectures tend to get boring and repetitive. Movies are fun. Essays are interesting. Readings aren't necessary to class discussion.\""
        ],
        "Douglas Moody": [
            "review 1: \"11F with Douglas Moody: Professor Moody is very nice. This course was a good intro for literary study of gender in science fiction, although a large part of of it was dedicated to reading articles relating to feminism in general. The readings are varied and interesting (usually). Each class is generally a discussion about what we read or watched (movies, Star Trek episodes, etc.), but rarely about writing. I think all the writing seminars are structured this way, though. I'm not sure this class helped with my writing in any way, since Moody only handed back one of my 4-5 papers, and some people didn't get any back. I think office hours would have been useful. If you want to expand intellectually, this is a nice writing seminar.\"",
            "review 2: \"07W with Douglas Moody: Moody is such a great teacher and I would recommend taking any class with him. He sparked interest in a topic that I never thought I would be interested in (science fiction) and the assignments were thought-provoking yet not difficult at all. The only gripe I have with him is that he never turned back any of my papers all term so I did not get any feedback; however, as long as you participate in discussions and do the readings you will get a lot out of this class.\"",
            "review 3: \"07W with Douglas Moody: you can write about basically anything for your 4 essays and final research paper. class discussions are very laid back and though there is a lot of reading, you get to watch movies as well, and prof moody is amazing. you'll absolutely love this class. take it!!\"",
            "review 4: \"07W with Douglas Moody: There was a lot of reading a frequent papers, but Prof. Moody was very reasonable and understanding. A great guy. Discussions could drag on a bit and it was important to stay on top of the reading.\"",
            "review 5: \"07W with Douglas Moody: moody is amazing! he's such a nice guy that really wants everyone to do well. if you go to class and participate he'll probably give you a great grade. i would definitely take another class with him. the only problem with moody is that he's kind of lazy/busy so we never really got feedback on our papers...but if there was a major problem with your writing he'd probably let you know. i was SO pleased with the class overall...especially since it was an excuse to watch cool movies.\"",
            "review 6: \"05S with Douglas Moody: Moody is a really nice guy. Class discussion was interesting and the work was very manageable. The only problem is that he takes a long time to return papers, but he is a fair grader.\"",
            "review 7: \"05S with Douglas Moody: The class was very easy and Moody brings up very interesting points. This was a facinating seminar, esp. since I hadn't take a class in WGST before. Moody is a great guy. I think I might even search for another class to take with him even if it doesn't apply to my major. He was pleasently dorky (in a fun way- ya know?) and obviously loved to teach. This was a great seminar. Readings were a decent length and interesting. Some of the novels I couldn't even put down...\"",
            "review 8: \"05S with Douglas Moody: This class was so great thanks to Professor Moody. He understands the difficulties of being a college student and is very accommodating. He was very flexible with paper deadlines and even topics, which was great because you basically can write about anything that interests you. There is a lot of reading and film-watching but it's all very interesting or entertaining (except for some of the books) but it isn't necessary to read EVERYTHING because the paper topics are very open and you can write them on what you wish. This was a great class and I can only imagine it getting better since it was his first time teaching it. Definitely take this seminar if you have the opportunity!\"",
            "review 9: \"05S with Douglas Moody: Professor Moody is an easy prof who genuinely cares about his students. He tried to make the class interesting, and did a pretty good job of it. However, he is not the best professor for leading discussions. He sits at the front of the room and just sort of drones on and on and every now and then asks is anyone has anything to offer. He doesn't really seem to take command of the class and where it's heading. Still, a very nice guy and an easy grader.\""
        ],
        "Evelyn Gick": [
            "review 1: \"07F with Evelyn Gick: This class definitely went beyond what you might expect out of a class on fashion with such a fluffy name. The material was interesting and the professor definitely knew what she was talking about. However, organization could be improved and probably will be in future terms. Oh, and blitzing out readings at 10:30PM should be outlawed.\"",
            "review 2: \"07F with Evelyn Gick: Very interesting class if you are into fashion and the sociological as well as the economical aspect. The professor isn't amazing and the class sometimes is poorly structured but its not a difficult class. We wrote a total of 4 papers and one was a 10 page research paper and the other 3 were 1 to 2 page papers. Make sure to participate in class and read the articles or else there really is no point in going to class.\"",
            "review 3: \"07F with Evelyn Gick: Gick is an AWFUL prof. She doesn't know much about writing research papers. Everything that I learned was the result of our TA's comments on my drafts. Gick herself barely edited our papers at all. She gave us tons of complex, very long articles to read on fashion and sociology (often blitzing them to us at 9:30 pm the night before), and we never even got to economics and fashion like we were supposed to. This class sounds cool but it SUCKED. We had to learn about the very specific fashions of all these different periods and we never really tied it together. This class was a complete waste of my time/tuition money, as will be any class you ever take from Prof. Evelyn Gick.\"",
            "review 4: \"07F with Evelyn Gick: This was a horrible course, not at all what I expected. With the exception of one supply and demand graph we were briefly shown, we did nothing at all with economics. And during that short time Professor Gick managed to give the class incorrect infomation (she said it was impossible for a country to have both the absolute and comparative advantage in the production of a good). It was more of a study of fashion through the ages and theories associated with it, which was not what I signed up for. Professor Gick was extremely irresponsible and careless with regard to the students' time management; she would send out assignments the night before a class meeting as late as 11 at night, which was another aggravation in addition to her inept lectures.\"",
            "review 5: \"07F with Evelyn Gick: prof. gick is such a nice lady but she really can't teach very well. she tries very hard but her lectures are simply not effective.\""
        ],
        "Adrian Randolph": [
            "review 1: \"07S with Adrian Randolph: He is the best prof ever. I really enjoyed this class and it was easy. There was not a lot of writting at all, but I still think that my writting improved. The course was very interesting, and you could take it in whatever direction you wanted for hte final assignment. TAKE THIS CLASS (also gets a CI and ART distrib out of the way)\"",
            "review 2: \"07S with Adrian Randolph: i had no interest in art history before signing up for this course. prof randolph inpired me to do readings i never thought i would and had really effective lectures for cementing the ideas and making everyone's writing tighter and cleaner. our first assignment was to write a SINGLE sentence! not too many papers, but he's a tough grader. you definitely earn your art cred through this class. and you get to go into the hood and see art live and discuss it. only bad thing, i felt like i was sort of on my own for a lot of the analysis of art though. and our class had 2 guys out of about 16. more guys should sign up!!\"",
            "review 3: \"07S with Adrian Randolph: As a 10A, this class was BRUTAL. The Prof just goes on and on, when it should def be more of a discussion class. Id thought that seminars were supposed to be writing-intensive, but we only had like 4 assignments throughout the whole term- one sentence, two sentences, a paragraph, and a six page paper. The workload made absolutely no sense, and the readings were completely unnecessary. I did the first two before I realized that they were pointless, and the rest of my spring was like a 2-class term, except for getting up early on Tuesdays and Thursdays and that stupid, stupid 6 page paper.\""
        ],
        "Jennifer Fluri": [
            "review 1: \"06W with Jennifer Fluri: Prof. Fluri is absoutely the most effective professor I have had since I've been here. Her seminar was focused on the idea of Gender and resistance, which she brought in many perspectives, ranging from women in Afghanistan, to Indigenious Women's Rights, to the revolutionary groups of the 1960s. She really helped me to fix my writing. I am confident that I am a better writer now, then when I came in. She's really responsive to her students and flexible. DEFINITELY TAKE THIS CLASS!!!.\"",
            "review 2: \"06W with Jennifer Fluri: This class seemed VERY disorganized. The new prof was just learning the ropes, so it was pretty easy to walk all over her. She didn't really lead discussions well. We just sort of sat there awkwardly until someone started the conversation, and when a topic came up that she had extensive knowledge in, she would talk endlessly about it and anything related to it. I left class every day feeling like I learned SOMEthing, but I don't really know what. Basic layout: 4 500 word response papers and a 2500 word research paper (with a 10 minute presentation of it).\"",
            "review 3: \"06W with Jennifer Fluri: Fluri spent a lot of time trying to help us get what we wanted out of the course. she really focused on helping us with our writing while discussing very interesting topics. very fair grader.\""
        ],
        "Priscilla F.": [
            "review 1: \"01F with Priscilla F.: totally lucked out my first term here... besides being an awesome prof, she's an amazing teacher. if you're willing, she can lead you to a whole new perspective on life. but you've got to put in the effort and look at things w/an open mind. also, i lucked out again in that our class really bonded and the dynamics between us were excellent. the quality of the class all depends on the attitude of the people in it, so i suppose you never know... not much hw, but what work there is you'll be excited to do.\"",
            "review 2: \"01F with Priscilla F.: This course was an amazing and rewarding experience. The readings were consistently interesting and inspiring, and Professor Sears is absolutely unbelievable!! She is a dedicated and caring educator, and I consider myself lucky to have been in her class. My only criticism is that the course only lasted for one term, because I would take it again and again if I could. For a first year woman, this class is a must!!\"",
            "review 3: \"01F with Priscilla F.: What a fantastic course! Tuesdays and Thursdays from 2-4 were the best part of my week, and we are all so sad to see it end. I think my review speaks for itself. The reason Professor Sears received an A as opposed to an A+ from me is that she is quite disorganized. If you need structure, I don't recommend you take this class. If you want to be challenged to think in ways you never have, do it. It's so worth it. If you're worried about work, it's minimal. No tests, just papers. Professor Sears is brilliant! You'll love her, even if she's a little crazy. Aren't we all?\""
        ],
        "Cirri M.": [
            "review 1: \"06F with Cirri M.: Title Says it all.\"",
            "review 2: \"06F with Cirri M.: I consider this class a rite of passage.\""
        ],
        "Mara Sabinson": [
            "review 1: \"05S with Mara Sabinson: This class was very interesting although it differed from the orl description to cover only western concepts. The prof is a theater department teacher and had never taught a wgst course but she was very good at discussions. However, she is funny at times becuse she is absentminded. The class is really easy as far as work becuse we basically watched movies every period nad only had two papers and a research paper. She is a very hard grader though, but she allows you an infinite # of rewrites so getting a good final grade shouldnt be a problem. I would recomend taking this class or at least one other class with this prof at some point becuase i assure you it will be an experience.\"",
            "review 2: \"05S with Mara Sabinson: Some readings were interesting, some movies were interesting. The professor should not be teaching a first year seminar. The TA didn't help and the papers were graded harshly.\""
        ],
        "Katharine Conley": [
            "review 1: \"05F with Katharine Conley: Professor Conley's own work focuses on Women Surrealists, and her passion comes through in the class. She knows a lot about the subject, sometimes even too much--she can go off on extended tangents in lectures, making note-taking difficult. If you are looking for a traditional WGST class this is not the class for you; very little time is given to questions of gender. We discussed the position of a woman within the movement on a superficial level but never went into much depth. I wish the class had gone into more in-depth analysis in general. Professor Conley does an excellent job of showing us artwork, but often leaves too little time to discuss that artwork. The papers were interesting and appropriate, and Professor Conley is an excellent critic. It is also nice to have two rewrite opportunities, one with the WA and one after having turned in the paper to Prof. Conley. Overall, I'd take this class again, even though there are ways it could be improved.\"",
            "review 2: \"05F with Katharine Conley: This was a very interesting course, so long as you did the reading and stayed engaged. Like my title says, Surrealism is kind of crazy, and for a while, before I stopped doing the reading and participating in class (bad idea) it boggled my mind and I thought about it a lot outside of class. Conley's very passionate about the subject, and it shows, but sometimes her passion would cause us to run out of real dicussion time, which I had looked forward to in my freshman seminar. She's still a great professor though, and a very fair grader.\""
        ],
        "Rebecca Biron": [
            "review 1: \"09W with Rebecca Biron: is great. Her lectures can get really complicated sometimes, and there will be lots of times when you'll be completely lost, but the rest of the time they are really enjoyable. Make sure to do the readings and assignments--those are the most interesting part of the class and they'll make sense about a week after you finish the course. The assignments aren't too hard, and the reading journals are a good way to analyze the reading that you've just done, so definitely keep up with those. Biron is also really accomodating and understanding (I am an athlete and had to miss a few classes and she was totally fine with it once I went and talked to her).\""
        ],
        "Alexis Jetter": [
            "review 1: \"02S with Alexis Jetter: If this class is an option for you, take it. Alexis Jetter is awesome. She is totally dedicated to the class, she welcomes students into her life and is a more effective teacher because of it. The reading is really interesting. This class gave me a totally new perspective on feminism i.e. that it's not all about man-hating, which is a perspective that needs to be more widely understood. And it gets you out doing your own journalism. Great class, good times.\""
        ],
        "Angela H.": [
            "review 1: \"04W with Angela H.: Rosenthal is an amazing professor who gives lectures that inspire interest in the subject. While the readings were sometimes long the class was really fun. I hope to take another class with her as soon as I can. I would suggest to anyone to take this class\""
        ],
        "Annabel Martin": [
            "review 1: \"04S with Annabel Martin: This class was so great-the professor is so understanding and down to earth. She loves students so much and loves to answer any questions, loves their creativity. If you give an hard, honest effort, she will see that and will help you out no matter what. The course subject of spanish film was very interesting and never old or repetitive.\""
        ],
        "Colleen Boggs": [
            "review 1: \"08S with Colleen Boggs: This course was not what I expected. The prof. didn't keep to the course description very well, and the exercises we did in class were dull. She was also not very understanding at times.\""
        ],
        "Jennifer Sargent": [
            "review 1: \"19S with Jennifer Sargent: This was definitely one of the best classes I have taken at Dartmouth. During the term, students are required to research and develop papers of various lengths, up to 30 pages. Despite the pretty intense time investment, Professor Sargent really makes the work worth your time by providing very in-depth feedback and helping you whenever you need it. Sargent is one of my favorite professors at the school because she is so good at guiding discussions, helping her students, and broadening the perspectives of all the students in her classes.\""
        ],
        "Laura Y.": [
            "review 1: \"03F with Laura Y.: Interesting, informative class with mostly good readings-some were a bit dry but probably neccessary. The prof really tried to make things interesting and prompted discussion and she made a lot of helpful comments on the papers we wrote. It would have been better if she gave us a 5 minute break after an hour since it was a 2a.\""
        ],
        "Margaret Darrow": [
            "review 1: \"06S with Margaret Darrow: We had constant work. Week by week, we had to turn in a rough draft and then a final draft. Only the final draft was graded, but I felt like this class took a lot of my time. The reading is intersting, but the lectures are redundant, just restating the readings. Our class was all females, so guys, maybe you should join just to be with a lot of girls.\""
        ],
        "Phyllis Katz": [
            "review 1: \"02W with Phyllis Katz: spare yourself\""
        ]
    }
}