{
    "ASTR122": {
        "John Thorstensen": []
    },
    "ASTR118": {
        "Aaron Dotter": [],
        "Jedidah Isler": []
    },
    "ASTR117": {
        "Elisabeth Newton": [],
        "Hans-Reinhard Mueller": []
    },
    "ASTR116": {
        "Jedidah Isler": []
    },
    "ASTR115": {
        "Brian Chaboyer": []
    },
    "ASTR087": {
        "James LaBelle": [],
        "John Thorstensen": [],
        "Kristina Lynch": [],
        "Ryan Hickox": []
    },
    "ASTR081": {
        "Brian Chaboyer": [],
        "John Thorstensen": []
    },
    "ASTR074": {
        "Elisabeth Newton": [
            "review 1: \"22F with Elisabeth Newton: I don't know who voted this a layup because it straight up isn't. The problem sets are hard as fuck and require you go into office hours to understand and begin to attempt, and if you're dedicated to doing well on them you'll put several hours a week into them. In addition, we have some more-reasonable coding projects and paper discussions/summaries and worksheets, none of which are too bad. We also have a final paper which is 6-10 pages on any topic of your choosing as long as you can relate it to the concepts of the class. The textbook isn't good. Elizabeth is a fucking gem though and I will defend her honor to the death; I went into her office hours sobbing about worrying I would fail the class and she gave me a hug and told me it was going to be alright. She's wonderful, and when she went on maternity leave we were able to convince her and Ryan to cut out the final exam just because no one wanted to do it. If you don't like astronomy and haven't taken multiple physics classes previously, don't take this course - but do take other classes with Elizabeth!\"",
            "review 2: \"20F with Elisabeth Newton: This class is so so so hard. Like actually hardest class I've taken by far. The PSets take 7+ hours a week to do and you HAVE to do them as a class or else you won't be able to do them. That being said, people tend to do fairly well on the PSets because everyone is working together and everyone goes to office hours together. There are also several programming exercises which aren't terribly difficult if you've had experience with matplotlib and data manipulation in Python before. There are about 4 of those. There aren't any tests or exams, but instead we have a final 6-10 single spaced review paper on radiative processes in astrophysics. Basically talk about some astrophysics topic and how the course material relates to it. Class composition is mostly grad students with one or two undergrads. Prof Newton is super nice and helpful with everything and the class itself is super interesting. It's also really hard in case you haven't gotten the memo. We use the textbook \"Radiative Processes in Astrophysics\" by E&R in case you're interested! Overall, definitely recommend but make sure to have taken at least P40 and A15 first and I'd recommend P41 and Math 13+. Don't take this class with a super tough courseload. Class size is usually about 6 so you all get super tight which is nice!\""
        ],
        "Brian Chaboyer": [],
        "Gary Wegner": [],
        "Hans-Reinhard Mueller": []
    },
    "ASTR061": {
        "Aaron Dotter": [
            "review 1: \"21F with Aaron Dotter: This class was pretty fun and engaging. It started out being more lecture than lab time, but as the term progressed we spent more time working with astronomical software and doing some pretty interesting data reduction and analysis. Dotter isn't the most engaging lecturer, but he's great during lab time and office hours. Would highly recommend this class to anyone interested in astronomy at Dartmouth!\""
        ],
        "Brian Chaboyer": [],
        "John Thorstensen": []
    },
    "ASTR025": {
        "Jedidah Isler": [
            "review 1: \"21S with Jedidah Isler: Prof. Isler is one of the most knowledgeable profs I've taken a class with at Dartmouth. Her lectures were incredibly intense but rewarding, and as long as you didn't try to write down every calculation she did you would get the gist of it. She was really understanding with the pandemic, and even still the workload was intense. But as long as you follow the structure of the class and don't submit your final paper drafts late the class has a nice flow, and never gets too overwhelming. I would definitely recommend if you are interested in astrophysics/astronomy, but it does require significant physics background (P13 and P14 at least).\"",
            "review 2: \"20W with Jedidah Isler: The material in this course is very interesting but the textbook readings are demanding. In combination with the term project, problem sets and exams, this class is a ton of work but can be rewarding if you are engaged in the subject. Prof. Isler cares a lot about the material, making for an engaging class. She is very willing to work with you outside of class if you find yourself struggling for any reason. Sometimes her lectures can be somewhat unclear, however.\"",
            "review 3: \"20W with Jedidah Isler: I would avoid but it is just me. She is not very engaging ie boring. Lectures are dull. Grading is tough. Plus she is lacking basic physics knowledge. I'm not sure how she obtained her PhD. But again may be it is only me. Wrong lol Ask upperclassmen\""
        ],
        "Aaron Dotter": [
            "review 1: \"22W with Aaron Dotter: This class made me realize I actually love cosmology...of course I've read Katie Mack and Carl Sagan and other popular science writers, but enrolled to see if I liked the subject for real. There is a ton of material and I spent probably way more time than necessary reading the textbook sections (Extragalactic Astronomy and Cosmology, Schneider, 2e) before class. Prof Dotter admitted he wouldn't use the textbook again, and I have to agree...it was presented as if you already knew the material and just needed an overview/refresher; not too high-level but also not as clear as other intro-level physics textbooks I've used. Lectures were fast-paced but had a great balance of equations/concepts and the occasional discussion of telescopes, surveys, probes, etc. Class started a week or so after JWST launch so tracking it as a class throughout the term was fun. Psets were infrequent and pretty simple. Exams were extremely fair. The final project is easy to do well on if you put in a consistent effort all along, go to office hours, make a good plan, etc. No computational background is expected but you do some rudimentary Python notebook modification. My class was tiny (8 people by the end, only 4-5 consistently showed up by the end, some were in quarantine/isolation) and didn't develop as much of a community as my P13, P14, and P19 classes did but taking it with friends would be fun. I definitely recommend this class!\"",
            "review 2: \"22W with Aaron Dotter: Professor Dotter is really cool and very chill. There were 4 problem sets in total, two in-class exams, and a final project. The problem sets were very easy. The exams were open book, open note, and very fair. Professor Dotter is a very nice person and always made time in office hours. He is very helpful, especially with the original calculation for the final project. A very nice prof and a very nice class overall\""
        ],
        "Ryan Hickox": [
            "review 1: \"14W with Ryan Hickox: Course: The material was very interesting, but there was a lot of it. Probably too much for a 9 week winter term. The first week is a review of basic astronomy stuff because the only prerec is Physics 14/16, but if you haven't taken Astro 15 (like myself) the first couple of weeks will be rough. Professor: Professor Hickox is a little scattered during his lectures, but really cares about the students. The first half of the class is a lecture then the second half is group worksheets which really help reinforce the material. They are also good exam prep. The exams aren't too hard and Prof. Hickox has review sessions before both exams and meets one-on-one with every student before each stage of the term papers is due. Workload: This class was a lot of work. Long weekly problem sets. Two exams and a major ten page term paper plus a poster presentation right before the final.\""
        ],
        "Brian Chaboyer": [],
        "Lauranne Lanz": [],
        "Michael DiPompeo": []
    },
    "ASTR019": {
        "Elisabeth Newton": [],
        "Mukul Sharma": [],
        "Ryan Hickox": []
    },
    "ASTR015": {
        "Elisabeth Newton": [
            "review 1: \"21S with Elisabeth Newton: I personally really enjoyed this class. There were 6 problem sets in total, a few paper discussions, two midterms (one of which was made optional in the end), an on-campus alternative to the midterm was the telescope lab and a term project. While this sounds like a lot - which it truly was sometimes - it was manageable if you put in the work and planned ahead. Lectures were pre-recorded and had to be watched before class meetings. During class, we solved worksheets based on the lectures in breakout rooms. The term project included an original calculation which might sound daunting but Professor Newton offered a lot of help during office hours. I know some people struggled with the project so starting early is the best advice. The TAs for the class were wonderful and always helpful during their office hours. Above all, Prof Newton really wants everyone to do well and is always willing to help out! If you're a Physics/Astronomy major, I'd recommend this class 10/10! If not, it might be a bit more work than usual but still rewarding.\"",
            "review 2: \"21S with Elisabeth Newton: Lots of work(not super hard just ALOT), pretty stressful, but learned a lot. Would recommend if you are very interested in this stuff and have an easier course load.\"",
            "review 3: \"20S with Elisabeth Newton: This class was difficult. The material itself was fine, but I think the adjustment to online courses was tough for everyone. The class was organized such that the class met twice a week synchronously to work in small groups to discuss problems on worksheets. There were also lecture videos that we needed to watch (watch them on 1.5x speed as they go quite slowly) and problem sets each week. There are 2 examinations and a term paper. The grading was somewhat harsh (I think by one of the TAs), and myself and other students often found that we lost points for very minor details and/or didn't know why we lost points. This course has by no means discouraged me from taking other ASTR classes in the future, but I will try my best to avoid taking them online. My advice is to organize a study group with other students so that you can work through difficult problems together and to go to office hours to discuss your term paper with Prof. Newton and/or the TAs earlier rather than later.\"",
            "review 4: \"20S with Elisabeth Newton: I think everyone reading this will understand that this term was the most chaotic term of a lifetime with everything going on in the world and the sudden shift to remote learning. Nevertheless this was the one class I took that made me actually want to do schoolwork, mostly because I'm very interested in astronomy and intend on majoring in it, but also because of the final project for this class. The entire course builds toward each student making an original calculation to the field of astronomy and writing a paper about it, and while that sounds difficult, professor Newton was constantly available for questions and consultation and was by far the best part of this class. That being said, the switch to remote learning was awkward and the rest of the course could have flowed more smoothly than it did. Would definitely recommend if you can take in person, if you're really interested in astronomy you can make this work online too, but it would have been so much better and more engaging in person.\""
        ],
        "Brian Chaboyer": [
            "review 1: \"24S with Brian Chaboyer: Not as much of a layup as A25, but really only the first two psets are time-consuming. We didn't even need to do an original calculation for the final project. The midterm was completely manageable. The worksheets were a little frustrating because 2 of the 4 people in my group didn't really contribute, but between me and the more actively engaged group member it all turned out okay. The observing lab was graded leniently, which I appreciated, because we had a long string of clear days and cloudy nights during the assignment window. The field trip to see the solar eclipse totality in St Johnsbury was fun, too.\""
        ],
        "John Thorstensen": [
            "review 1: \"22S with John Thorstensen: I really didn't find this class that bad, one p set a week, he's retired now but it seems like the department shoots for A-/B+ median. Definitely interesting material\""
        ],
        "Elisabeth Sowerwine": [],
        "Ryan Hickox": []
    },
    "ASTR004": {
        "Marcelo Gleiser": [
            "review 1: \"24W with Marcelo Gleiser: this class is pretty meh. however, it is a layup. some concepts are interesting, especially if you have any preexisting interest in the material (i did not). the projects (observing and final) are graded ABSURDLY easily. for the final, do the hubble age one - it is the easiest. the midterm and final are graded more harshly, but they are a fair test of broad-strokes concepts and pretty straightforward - it is pretty easy to discern from the lectures what the most important concepts are, and there aren't really \"tricky\" questions beyond that. you do not have to go to class, although i would encourage it. as long as you have watched the lectures and reviewed your notes for 1-2 days before the midterm and final, you can get an A. good SCI layup. the high point for me was the observing project which i REALLY enjoyed because i had never really looked at the stars in any meaningful capacity before it.\"",
            "review 2: \"23S with Marcelo Gleiser: Stupid fucking class - not a layup. Just expect to NRO and then not show up to classes. Ridiculously boring material and awful prof\"",
            "review 3: \"23S with Marcelo Gleiser: This class feels like a fever dream. You have a midterm, final, and two projects. Both of the projects can be done in a day, and they're graded easily. Make your projects look like you put a great deal of effort into them. No one goes to the lecture. Watch the recordings and take notes. Review your notes 1-2 days before the exams. It's a painful layup, but nonetheless an easy course to do well in.\"",
            "review 4: \"22X with Marcelo Gleiser: Okay so this class was not as bad as the other reviews make it out to be. There is a *lot* of room for improvement in the course setup, but in my opinion the content and the relative lack of work makes up for it. Class was entirely lecture-based (though the first three weeks were asynchronous virtual for seemingly no reason...) so if you want a discussion class this is not it, but if you just want to show up and take notes, that's definitely what it is. The course is definitely a history-based astro class, so if you want that (with no math at all. like literally none.) this is a good way to get a sci distrib. The readings and extra videos are actually optional, everything we were tested on was in the lectures. There are two projects, a midterm, and a final- one of the projects is an observing project which I thought was a lot of fun, but could definitely wreck your sleep schedule if you don't routinely stay up super late. The other project you can choose-- i made the astrolabe (which wasn't too terrible but was a lot more work than I thought it would be), but you could also just write an 8 page paper on pretty much anything, or watch a movie from a list and write a paper on that if you wanted to play it pretty safe. The midterm and the final were mostly short answer/paragraphs, and mostly followed the main points of the lectures. Now, for my complaints-- I definitely agree that the TAs were really hit-or-miss on grading, and the one time I emailed them about my project, they never got back to me, even just to say that I had emailed too close to the deadline and they couldn't give a decent response. Additionally, the lectures started out perfectly fine and easy, but once we got to modern theories they got much more confusing and difficult to understand, because we weren't really given the foundation to actually understand stuff like string theory or inflatons. The prof could also do much better with regards to powerpoint slides, they don't really have most of the actually important info on them and are usually unnecessarily vague/confusing (and the prof tends to go off on tangents sometimes). This was much, much more noticeable in the later weeks of the course. Overall I'd say that it's a solid sci distrib to take if you don't want to do any math or problem sets, but there are definitely some frustrating moments that I could do without.\"",
            "review 5: \"22X with Marcelo Gleiser: This class sucks, don't take it. It's boring, not at all relevant to anything you will do with your life, and way too much work considering how useless it is. The TAs grade extremely inconsistently, and Prof. Gleiser doesn't really look at any of your work, so your final grade is determined effectively by which TA you got on your assignments (some of them grade super generously, some are really harsh). Prof is actually a super nice guy, but the material is all over the place and he just uses his same slides from the physics classes he teaches. This class had 150 people in it this term, and about 30 would show up to class on a good day. Everyone I know who took it regretted it - don't be like us.\"",
            "review 6: \"22X with Marcelo Gleiser: This was a great class with fun and fascinating material. Completely accessible to non-majors, but obviously it is a science course so it still requires some scientific thinking (that is the whole point of the science requirement). I would disregard the negative reviews since they usually come from kids who failed science at high school or are too closed in their own majors to appreciate the stimulating world of science. I would recommend this and any course Gleiser has to offer. He is a worldly reknown physicist with much experience sharing scientific ideas with the public, so his lectures were always the most engaging.\"",
            "review 7: \"22X with Marcelo Gleiser: Terrible class if you want to actually learn something, but not a terrible class to take for sophomore summer considering that like 150 other people in your grade will be taking it. Didn't attend any of the lectures and just had to dedicate one day to bs the midterm project, one day to bs the final project, one day to bs the midterm, and one day to bs the final. If a course where you can do nothing for the entire term except for four days of cramming in work sounds like a fair tradeoff to you, definitely take this class. As much as I didn't care about this class, I'd prob sign up for it again if I were to go back in time.\"",
            "review 8: \"22X with Marcelo Gleiser: I don't know why so many people hated this class--it was definitely a layup and all you had to do was go to class and take notes. If you remotely enjoy physics or astronomy--or even sometimes question the abstract--it was not bad. The professor is really nice but the TAs are responsible for everything and they could be extremely hit or miss. Professor straight up reuses some of his PowerPoints from another class which is lowkey awful, but he slightly makes up for it by lecturing very well. Sophomore summer was probably the best time to take this class because you had to have known at least one person in it let alone multiple. Overall, I'd recommend it as a layup to anyone with the slightest inkling towards science.\""
        ]
    },
    "ASTR003": {
        "Jedidah Isler": [
            "review 1: \"20F with Jedidah Isler: NOT A LAYUP. If you are taking this course to fill a distributive or looking to see if Astro might be for you - NEWS FLASH THIS CLASS IS NOT A LAYUP AND ITS NOT FOR YOU! I mean, the workload for this class is like so beyond and tedious that I might as well be taking a freaking PHYSICS CLASS!! Like, literally, do not take this class - trust - you might as well just end your GPA at this point. Anyway...Good Luck!\"",
            "review 2: \"20F with Jedidah Isler: The prof is pretty good but there's a general feeling that the TA's are there to punish people for not understanding content rather than helping facilitate understanding. There are weekly reflections and astronomer questions graded out of 2 points and they're graded fairly harshly. This means that even if you spend a solid amount of time on these 1 paragraph reflections and try your best to reflect knowledge of course content, all it takes is 1 TA who doesn't like how you phrased something to get you a C on the assignment (In total, they are worth a significant portion of your grade and they can be .5/2, 1/2, 1.5/2, or 2/2). If you do well but not perfectly and spend a long time on them, you'll still end up with a C average in them and it'll bring your grade down quite a bit. There is also very little feedback, so the grades you receive feel largely arbitrary.\"",
            "review 3: \"20F with Jedidah Isler: This class is a fake layup, unless you are seriously interested in astronomy STAY AWAY. Isler and the TAs are not helpful at all and grading is extremely strict without a curve. Oh and don't get me started on the research paper because even though this is an intro they expect us to write PhD level papers.\"",
            "review 4: \"20F with Jedidah Isler: The worst class I have taken at Dartmouth. The professor is clearly very intelligent and excited about the material but has done a very poor job running the class. Nearly every lecture at least once, she says something along the lines of \"I would explain this, but we're running out of time today.\" The grades given out by TAs can be overly harsh and feel arbitrary. The prof and TAs sometimes seem annoyed by questions people ask, even if they're relevant to the material at hand and are common questions from students. This class is definitely not a layup, which I am okay with, but what is so frustrating is that the professor has clearly taken note that people across the board are struggling with the way she is virtually teaching material, but has changed absolutely nothing in her own approach. In fact, when people ask questions she becomes indignant and defensive. There is a constant barrage of assignments (labs, quizzes, questions, reflections, and group work) with little time to actually absorb the material and learn something. Would not recommend this class with this prof if you're looking for a SLA.\"",
            "review 5: \"20F with Jedidah Isler: DO NOT TAKE THIS CLASS! This was supposed to be my layup, I read the reviews here from Hickox and thought it would be easy - IT WAS NOT. It was my most intensive course, and I was also taking two upper level Econ courses during that term. Jedidah relies heavily on her TAs. Just straight up dont take this class.\""
        ],
        "Graham Edwards": [
            "review 1: \"23F with Graham Edwards: Probably one of the worst classes I've taken at Dartmouth. The course material isn't exactly difficult, but the lack of organization from the department makes it a difficult, inconsistent class. I have lost track of how many professors we have had. I don't actually know who our \"professor\" is, or even if that matters at all. We were initially told that it would be taught by two professors who were present on the first day, only to switch professors (sometimes within the same week) throughout the course. The TAs remained the same, and I think they were the only highlight of the course, but the adults made it incredibly hard to attain a general trajectory. For example, a new professor came in, spent an hour lecturing slides that we had done last week, and then we had a quiz on the slides he was supposed to teach (but did not) a few days later. Additionally, it's pretty hard to develop a relationship with a professor and understand who to email for questions when they just go AWOL. I think everyone had to rely on the TAs (who are sick/deserve a raise). Finally, just a general gripe, the workload is constant and the questions and material is taught on a very surface level, leaving you to figure it out on your own. On the first day, they lecture you about the merit of a B immediately after conducting a survey that showed 97% of the class is not an astronomy major and 85% is taking it for a graduation requirement. Pretty irritating. Don't take this class unless you want to think about Astronomy quite a bit. The labs are cool but the weather was bad so we didn't even get to observe the celestial objects that might make all of this worthwhile.\"",
            "review 2: \"23F with Graham Edwards: I would echo everything that the other reviewer said, this was one of the worst classes I took at Dartmouth. Avoid if you can. Even the people who took the non-lab-based section of the course still got screwed over with midterms that were not reflective of what was taught in class. The carousel of professors that rotated through the class were horrible lecturers and turned off any interest we might have had in astronomy. The labs were pretty easy honestly, but this was also because the weather was bad and we had to do makeup indoor substitute versions of them instead. Dartmouth's STEM departments hate the idea that not everyone is trying to be a STEM major and might just want a survey class for the distribs. I'd recommend Physics 1/2 although I heard that's getting worse too. The TAs were pretty helpful but even they couldn't fix the dumpster fire that was this class.\""
        ],
        "Ryan Hickox": [
            "review 1: \"21F with Ryan Hickox: If you are a STEM person or just someone trying to get your SLA/SCI requirement, I highly recommend this class! Professor Ryan is super lovely, caring, and engaging (no, serious, he is super funny and cheerful!) I will not say it is a layup, because it is demanding depending on the type of student you are (we have ungraded group exercises every week, a quiz every week, two midterms, one final paper, and, for the ones taking ASTR003 instead of ASTR002, 4 labs that are kinda fast to do), but it is definitely not hard to get an A-/A.\"",
            "review 2: \"17F with Ryan Hickox: Great class, both due to the fascinating material and the professor. Dr. Hickox is an excellent teacher, who really cares about the students doing well. He is consistently available for students, and is very reasonable in grading. On paper it seems like the class is a lot of work, with quizzes and group work every week, but he goes through everything in lecture and is more than willing to offer help or hints. The research project is intimidating at first, but there is plenty of guidance and the draft feedback is extremely helpful and thorough. The four labs are interesting, don't take too much time, and generally will help your grade. If you are at all interested in astronomy, or are just looking to fulfill the SLA, this is a great option.\""
        ],
        "Robert Fesen": [
            "review 1: \"15X with Robert Fesen: Layup city. This class is such a quintessential sophomore summer experience. There are 5,000 people in it, everyone is there to chill out and have a good time, and so is Fesen. He's a crazy, but crazy entertaining, dude--he'll spend most of class showing you movies of stars exploding and screaming \"WOW!!! LOOK AT THAT!!! ARE YOU KIDDING ME???\" Everyone laughs, he laughs, everyone gets an A, everyone gets drunk after.\""
        ],
        "Robyn Millan": [
            "review 1: \"22F with Robyn Millan: Overall really great class. Got my lab distrib out of the way with it too. The professors are really good, the content is really easy to understand as long as you pay attention in class, and ask questions where you don't understand. I would highly recommend this class WITH labs because I got to take out a telescope for the whole term and that was really fun. The content appears to move really fast and compact, but in class the professor had slides with all the information she'll test you on. The math was also a little tricky, but very intuitive. HIGHLY recommend.\""
        ]
    },
    "ASTR002": {
        "Ryan Hickox": [
            "review 1: \"23X with Ryan Hickox: Overall the class was very interesting. Hickox was a very good lecturer and a really nice guy. Like 2/3rds of the class dropped within the first week because they decided it wasn't enough of a layup for Sophomore summer. It ended up being a fair amount of work, but it became less time consuming as the term went on. It was also pretty easy to get an A as long as you put in the work. One of the main assignments was an essay, which you work on throughout the term and includes drafts that are worth very little but he gives a lot of feedback, so it took a lot of the stress about making sure the final draft was good. The math and scientific reasoning involved was pretty basic. If anything I wish the class was faster paced and dove deeper or into more material.\"",
            "review 2: \"23X with Ryan Hickox: If you are remotely good at STEM this will be a layup. I had zero background in astronomy, but I still easily ended up with an A. Slept through half of the lectures, did none of the readings, and basically only studied before the two midterms. The lectures are recorded so you can always go back to see if you missed anything important. The final paper did take some time, but the instruction was pretty clear and his feedback comments were really elaborate and helpful. Prof. Hickox is a gem. He is really passionate about the materials, which drove him to put effort into making the lectures fun and engaging. He also made an effort to get to know all the students despite it being a lecture class, which I though was really wholesome.\"",
            "review 3: \"21X with Ryan Hickox: HONEST REVIEW: This class sucks. Hickox is pretty dull in class but explains the topics well. I was personally never compelled to listen or even go to class for that matter. If you pay attention and maybe even take notes you'll get 80%+ at least on every quiz (above quiz median lol). The group exercises were switched to completion grades because so many kids were spending hours on these assignments so that was pretty good. If you have last year's quizzes you'll be golden and cop an A or A- with close to no effort. HOWEVER, the sequence of pointless essays you have to write is totally ass. 5 total: final essay overview (1.75% overall grade), a pointless practice essay, first draft (3.5 % overall grade), second draft (5% of final draft), and a final paper (29.75% of your grade). These essays are complete shitter tier I-do-not-care papers. They will put a damper on your summer vibes. Each word typed is like taking a needle to my fingertips. I fully regret taking this course I should've done astroworld 3 where you at least get to look at the night sky through telescopes. TLDR: class is boring, you can cheat to make it easier but the papers are so beat it makes me wanna float downstream on the river in an inflatable raft full of beer and Vicodin.\"",
            "review 4: \"21X with Ryan Hickox: Nice prof that is chill and accessible, and also wanted people to enjoy the class. Workload was weirdly high and a lot of it seemed to be busywork. There weren't any midterms/final exams, which was nice, but there were weekly quizzes that would vary week by week in how hard they were. First half of the term was a little dull, but second half was more interesting when you get into things like blackholes. Overall, it was hard for a class that I thought was supposed to be for nonmajors, but definitely not the hardest class I've ever taken here. And with a 2-course term, defo maneagable.\"",
            "review 5: \"21X with Ryan Hickox: I really liked Professor Hickox; at first I thought he was full of himself, but it's not a crime to be proud of your accomplishments and happy with your research and role as a house professor and lecturer, and it is admittedly cool that he can just name drop that he has to reschedule office hours because he has an important NASA meeting later. He is excited to talk to any student and readily accessible, and chill and flexible with deadlines. Good at explaining things. Office hours at his house and over zoom were interesting and extremely helpful. Observing nights were a good time and helped rediscover the awe of the night sky and the fact that there is so much out there. The final project feels a bit isolated and disjointed from a lot of the coursework. It's a lot of work, but it's spaced out throughout the term, so it doesn't have to all happen at once. It's all about a specific telescope and then a specific observation, and it feels limiting and needlessly complex at times because the scientific papers and data you have to look at is beyond the scope of a beginner course. There are a lot of small assignments that can be overwhelming and feel somewhat pointless sometimes when you have to write yet again question for a guest astronomer about research that you can barely understand from the press release, let alone the scientific paper. But I learned a lot about astronomy and got good marks. It was a nice distrib.\"",
            "review 6: \"21F with Ryan Hickox: Had to drop this class at the beginning of second week since it's just too much Physics background knowledge - the Prof says it's nothing, oh so basic but electrons jumping around and emitting/absorbing photons and light spectrum vs wavelength affecting visibility and all that shit is just too much for me. Ryan Hickox is a terrible teacher btw - I don't care/know how good he is at his profession but he always glosses over the important stuff during lecture and always announces quizzes/utilization of office hours/observing sessions/basically every non-official-class thing at the LAST minute, which is super disrespectful in my opinion. Aside from this, I second all of the comments about the unnecessary and super difficult work - take the \"question for guest astronomer\" thing for example. It's graded based on the \"interestingness\" of the question:) - which in order to have you should/need to - and this is what he says himself - read crazy difficult journal articles on that guest's work and demonstrate \"deep understanding of the concepts\" that you literally just learned today and might very well have no clue about. And you will have to do that for the final research paper too and it's just like, such an unwelcoming introduction to an already unpopular field - I really don't know why they do this. Like the enrollment ratio of 27/100 limit should already tell them sth but apparently not :)\"",
            "review 7: \"21F with Ryan Hickox: I got by with a B just because I did all my work...but I didn't understand what was going on 90% of the time because I don't have a physics background and he didn't explain it. You need a SCI distrib and aren't a STEM person? Definitely easier options out there.\"",
            "review 8: \"21F with Ryan Hickox: Not sure why everyone shit on this class. I found it to be relatively easy with a not-too-demanding workload. I enjoyed Hickox's lectures, either because I genuinely was interested in the material, or because of his lecture style. He can be a bit dull sometimes, and you'd do fine without going to every single lecture. Weekly quizzes were doable with your notes and the textbook, but sometimes were pretty hard. The math in this class wasn't too bad, mainly just plugging into equations and finding variable relationships (physics 1 level math, no need for calc knowledge). The midterm was pretty easy tbh, he lets you write out anything you want on a piece of paper and bring it to the exam. You basically just need to read the textbook summaries and take notes in class to get an A. The research paper is the only part that I was a little iffy on. There is almost no elaboration on his expectations or even how to do a research paper (this was my first time doing a scientific paper like this). However, he is very accesible and is there to help you if you put the time in. Just go to office hours or even email him to schedule a time to meet. Overall, I loved this class and found it to be an extremely interesting layup.\"",
            "review 9: \"20X with Ryan Hickox: Hickox is an incredible professor and lecturer. That said, this is not an easy class and he expects his students to pay attention in class and to do their homework with diligence. I gave medium effort and got an A- though so there is no reason you should not be able to get an A as long as you actually put in the effort. In hindsight, I should've given that extra bit of effort because the course is actually very interesting and he keeps the material relevant to non-majors so we stay engaged. I would highly recommend as a SCI distrib fulfillment.\"",
            "review 10: \"20X with Ryan Hickox: Overall great class. If you are willing to put in the amount of work expected (watching lectures every week, completing everything on time, putting in decent amount of work for final paper) an A is very attainable. The class is definitely less of a layup than I think it used to be, but a great class for Sophomore Summer. Also, Hickox is the GOAT.\"",
            "review 11: \"19F with Jedidah Isler And Ryan Hickox: Incredibly interesting if you are even remotely interested in astrology. Not the easiest class but I put in a medium level of effort (went to all lectures and did some of the readings) and got a B+. I definitely prefered Professor Hickox over Isler for both lectures and grading. Definitely a fake it till you make it type of class.\"",
            "review 12: \"18F with Ryan Hickox: Hickox is a super awesome professor, who is super passionate about astronomy. Be warned: this is NOT a layup(the research paper is deadly). However, if you want to actually learn something while getting a science distributive that won't kill you or take up massive amounts of time, this is the course for you. We had weekly readings that were a little time consuming if you saved them until the night before followed by weekly reading quizzes(nothing too in depth or hard, just checking to make sure you read it). I thought the midterm and the final were both fair if you put in appropriate study time. The research paper is pretty awful though. The TA's are super picky and it counts for 30% of your grade. That being said, if you meet with him and work on the paper super hard, I'm sure you could do well. Do not take this course if you are super passionate about science and are interested in astronomy. Through no fault of Hickox, I just found the material boring and dreaded class. It wasn't easy enough to be a layup, but not in depth enough for me to enjoy.\"",
            "review 13: \"18F with Ryan Hickox: This class is not a layup anymore. Robert Fesen retired. Hickox and Isler are ok and material still fun but research paper is bad and some of the TAs are not much fun.\"",
            "review 14: \"18F with Ryan Hickox: If you would be proud of good mastery (a B in the rubric) this is the class for you. If you enjoy having a million assignments per day, this class is for you. It is a wonderful opportunity to get to know how badly you miss the prof who retired (who had an A median) and to experience reading 120 pages every weekend with a quiz every monday. If you have trouble managing your time and/or would never read an astronomy textbook unless forced to do so this class is good news. The many different assignments, quizzes, and graded group work leave you with no time to waste; You are too busy with assignments to realize you have important major classes to work on. Oh yeah, the prof also boasts about going to Yale and Harvard, somewhere you won’t be going after you get the grade for this class. B+ for the effort :)\"",
            "review 15: \"17F with Ryan Hickox: Both this class and Hickox are great. The class covers a super wide range of topics concerning astronomy in general, the solar system, some light physics information and much more. The workload was not bad at all (a weekly quiz, two mid-terms, and a larger research paper, as well as some short online writing) and tests and quizzes were straightforward. Hickox himself is very nice and it's clear he is very interested in his field. He made lectures interesting and even knew everybody's first name (70+ people) by the first day of class. I highly recommend this class with Hickox.\""
        ],
        "Jedidah Isler": [
            "review 1: \"21F with Jedidah Isler: For the love of this galaxy please DON'T take this class, especially with Isler. The class had more course work than any course I've taken at Dartmouth. I got a better grade in CS 30 than this class. You don't learn anything. The quizzes are so dumb and unrelated to her lectures. The guests are cool but again, unrelated to course content. Lots of busy work. Grading is just ridiculous. You might get a 60% if you spend 10 hours on each writing. Just don't.\"",
            "review 2: \"20F with Jedidah Isler: THE WORST CLASS I HAVE TAKEN AT DARTMOUTH! DO NOT TAKE THIS CLASS UNLESS YOU'RE FINE WITH GETTING A C! The way this is taught and graded is an abomination to Dartmouth academics. Here's the workload for the class. a) weekly group work that is basically middle school math b) quizzes every week that have medians of like 70/80% c) guest astronomer questions (that you will almost always get 1.5/2 on) d) guest astronomer reflection (that you will almost always get 1.5/2 on) e) a research paper that is 8 pages and very challenging oh... and there's no curve... despite the median for every piece of work being like 80% despite grinding all semester and getting above the median in everything I'm still currently looking at an EXTREMELY low grade\"",
            "review 3: \"20F with Jedidah Isler: If you are even considering taking this class...JUST DONT. LITERALLY THE WORST CLASS EVER IT IS A WASTE OF TIME, IMPOSSIBLE TO DO WELL ON, AND YOU LEARN NOTHING. The organization is shit, the grading is impossible, the format of the class is bad, the lectures are bad, literally everything about this class is bad. DONT TAKE IT!!!!\"",
            "review 4: \"20F with Jedidah Isler: I don't know why the reviews are so harsh for her! She definitely is a tough grader, and the class is very difficult by all means. But Professor Isler is so sweet and a good lecturer, IMO! The class is also very organized. Quizzes are pretty difficult, as are many of the writing assignments, but all in all, a very interesting class!\"",
            "review 5: \"20F with Jedidah Isler: This class is certainly challenging. You will struggle even if you have a strong math/physics background. BUT you will learn a lot about astronomy and the scientific process! Jedidah Isler is a hard grader but she is a wonderful lecturer and amazingly helpful during office hours. If you are truly interested in astronomy and okay with getting a B+ please take this class!\"",
            "review 6: \"20F with Jedidah Isler: Do. NOT. Take. This. Class. (that's all I had to say but i have to make this review 100 characters to post it)\"",
            "review 7: \"20F with Jedidah Isler: This class is not a layup! It's also really interesting. I am now considering being an Astronomy/Physics major, after taking this class. The quizzes and reflections/questions can be really difficult, but once you get a hang of them they get A LOT easier. You HAVE TO read the textbook, when I read the textbook and took in-depth notes I did a lot better. The research paper was hard but I kind of enjoyed it. I highly recommend office hours, even if you don't have any questions. Professor Isler is a super interesting person and office hours are a great place to get to know her and feel more connected to the material. This class was definitely the hardest class I took this term, but I would recommend it if you are okay with getting a B.\"",
            "review 8: \"20F with Jedidah Isler: Looking for a fun, low-stress course where you learn about the universe and the way our world works? Then Jedidah Isler's Astronomy 2 isn't for you! Each week is presented with a consistent 4+ graded assignments and 50+ pages of textbook reading. It's a lot of work, so don't be deceived by the median! Not to mention that she grades extremely harshly — the two rough drafts of our final paper had D+ average grades throughout the 90-person class, so the whole time you're worried about your grade in the course! Isler struggles immensely at teaching, too. She's unclear about expectations, and frequently gives \"polls\" in-class about the material she didn't (properly) teach. After the class is divided on the answer, she says: \"Hmm! That's interesting! Something to think about!\", and refuses to tell you the correct answer. In addition, Isler dives you into the deep end by having you read advanced and irrelevant articles by \"guest astronomers\" and then docks points on you for not relating it to the course work enough! But, don't worry, if your question has to do with Isler's personal (again, irrelevant!) social views, then she'll give you full credit. Would not recommend this course to a friend. I came out of it having no greater understanding of the universe than I did 3 months ago, even though I finished the course with an A, and it was way too much work.\"",
            "review 9: \"20F with Jedidah Isler: Annoying class with a lot of work. I did fine in it only because of the amount of effort I put in outside of class because the lectures weren't all that helpful. Lots of assignments that are typically graded harshly too.\"",
            "review 10: \"20F with Jedidah Isler: WHATEVER YOU GUYS DO DON'T FUCKING TAKE THIS CLASS IT IS ABSOLUTELY THE WORST CLASS EVER. THE LECTURES DON'T HELP AT ALL WHATSOEVER ON THE TESTS. THE GROUP WORKS ARE FUCKING POINTLESS. SHE TOOK 7 WEEKS JUST TO TELL US HOW TO WRITE A PROPER RESPONSE FOR THE REFLECTION. IF YOU LOVE YOUR GPA PLEASE DO NOT TAKE THIS CLASS.\"",
            "review 11: \"19F with Jedidah Isler And Ryan Hickox: Incredibly interesting if you are even remotely interested in astrology. Not the easiest class but I put in a medium level of effort (went to all lectures and did some of the readings) and got a B+. I definitely prefered Professor Hickox over Isler for both lectures and grading. Definitely a fake it till you make it type of class.\""
        ],
        "Robert Fesen": [
            "review 1: \"18X with Robert Fesen: The first quiz and exam are hard but after that, the class gets easier. He drops your lowest test and three of your lowest quizzes. Make sure to study from past exams as well as from the class lectures.\"",
            "review 2: \"18F with Ryan Hickox: This class is not a layup anymore. Robert Fesen retired. Hickox and Isler are ok and material still fun but research paper is bad and some of the TAs are not much fun.\"",
            "review 3: \"17X with Robert Fesen: The class was marginally a layup. The class had no labs or HW, so the only work was to study for the assessments. But there were a lot of assessments: 4 tests and 11 quizzes. The Prof. didn't count your lowest test score and your lowest 4 quiz scores, which was pretty nice. But all the assessments were pretty rigorous. I spent about 8 hours each week studying -- although I usually study more than most students claim to. I think the course focused far too much on memorization. During orientation, Professors claimed that Dartmouth teaches classes focused on building skills, not learning information. So far that has generally been the case; but it was not the case with this course. The Professor would lecture about all the names of various parts of the universe and then we would be assessed rigorously in the form of 11 quizzes and 4 exams. It was as if the department thought this intro science class was too easy and cracked down on the Professor to make it hard, but since the class covered little to no conceptual thinking the only thing the Professor could do to make it hard was to test us rigorously on random facts that we will likely forget 90% of in a few months. That said, the exams were at least predictable. If you watch each lecture carefully and memorize all vocab terms, you will do well. I just wished the college would recognize that is ok to occasionally have a class with a high median. Sometimes students need to balance hard major courses. In any case, it doesn't help students to make them spend a lot of time memorizing facts that they will likely forget soon.\"",
            "review 4: \"17X with Robert Fesen: To those considering this for 18X: it's #fakenews that this a layup. If you're good at memorizing facts and you're good at math, then yeah, maybe you can call this layup. However, in my opinion, this is actually a relatively difficult course. I took it out of interest and because I heard it was easy. It's definitely super interesting (how could you not want to learn about the stars?) but the tests were challenging. As the reviewer below me wrote, you DEFINITELY need to spend time studying. I'm honestly mind blown the median is usually an A-. I NRO-ed the course after the first test because I knew I'd have to work my ass off for an A-. NRO was a good move. Don't get me wrong. It's not a bad class. But take it seriously.\"",
            "review 5: \"16X with Robert Fesen: This was not just a great class for sophomore summer, but also one of the better classes I have taken here at Dartmouth. Fesen is an energetic lecturer and loves outer space. He lays out exactly what you need to get an A and is always helping the class out with hints on questions/exam material. Take this class, get the A, live fast burn bright die young ;)\"",
            "review 6: \"15X with Robert Fesen: This is the perfect easy A soph summer class. The prof is so funny because he gets so excited to talk about stars it's cute. Just go to class so you'll be there for the pop-quizzes (they're super easy) and the grading is super flexible too. No reason why you shouldn't take this class.\""
        ],
        "Graham Edwards & Aaron Dotter": [
            "review 1: \"23F with Graham Edwards & Aaron Dotter: Holy disorganized class. We had FIVE different people teaching us at some point throughout. At the beginning it was supposed to be Edwards and some woman but then she maybe got fired or something so Prof. Dotter took over. And Edwards was gone for like a week to go watch an eclipse so the TA taught (ironically the best teacher), and then another graduate student taught us randomly near the end. Chaos. Then for final class they all sat in and it was like Lego Star Wars when you see everyone in the cantina. Terribly logistically done - none of the individual people teaching knew where our level of understanding was because of all the shuffling around, so it resulted in a lot of redundancy and confusion. That said, it's an interesting class and a FANTASTIC choice if you want a Science distrib without taking a real science course. If you were good at science in high school you'll crank here. I'm by no means a science student but am of the opinion that Astronomy is perhaps the most important science to know a little about to be a well rounded person (esp. because it kind of puts physics + chem + biology all together). Best science no doubt. My two SCI distribs were this and Astr 4, taking which was a breeze after taking this. Would recommend that path to people who don't want to go do a real lab etc. In this same way that CS30 is more about how you think & write about math rather than the actual discrete math, this course is more about how you approach scientific writing and thinking about the universe rather than doing the hard calculations.\""
        ],
        "Jedidah Isler And Ryan Hickox": [
            "review 1: \"19F with Jedidah Isler And Ryan Hickox: Incredibly interesting if you are even remotely interested in astrology. Not the easiest class but I put in a medium level of effort (went to all lectures and did some of the readings) and got a B+. I definitely prefered Professor Hickox over Isler for both lectures and grading. Definitely a fake it till you make it type of class.\""
        ]
    },
    "ASTR001": {
        "Brian Chaboyer": [
            "review 1: \"23X with Brian Chaboyer: Fun guy, not a super hard class. Took it for the lab, and as someone not super science-y they were pretty manageable. Some math required for the labs, nothing extreme (a little algebra and that's it). Weekly quizzes (no midterm or final) were decent, but it was easy to accidentally get a C on them if you don't pay attention in class. There's also a textbook, which I actually read, and I do think it helped a bit (a lot of people didn't read it though and I'm sure they were fine). I got an A- but I think it was a B+ median. Still a chill class. The final is a project you get to come up with.\"",
            "review 2: \"22X with Brian Chaboyer: Chill summer SLA class. Didn't put much work in outside of class except for labs, which are basically the only assignment aside from quizzes once a week. Quizzes are fairly easy if you take really detailed notes from lecture. Some of the labs were really disorganized but turn out find if you're super detailed. Thought content was interesting as well. Overall good summer layup.\"",
            "review 3: \"22S with Brian Chaboyer: Chill class with interesting topics and low workload. I'd estimate I spent like 4-5 hours a week on this course outside of the lectures, so if you want a low-stress SLA layup, then this class is for you. However, if you want a GPA booster, this class probably isn't for you. Test and lab grading definitely isn't kind, so you'd def have to put in more hours to get an A. The labs and tests were the only assignments. You have 4 labs over the course of the term, each requiring a fair bit of work but nothing stressful. Then, you have weekly open-note tests on Canvas, which are 30 minutes each and you'll get at least a C on them with no studying if you pay attention to the lectures. Chaboyer is a chill dude, not a great lecturer but the topics are interesting enough to make the lectures worthwhile.\"",
            "review 4: \"22S with Brian Chaboyer: This is pretty tough if you’re trying for the A like i was lol. Quizzes aren’t very forgiving (one person got 2/10 on a weekly quizz) and the labs are deceptively easy. Very interesting stuff, I definitely learned a lot, but it is not really a layup for humanities people trying for the TLA.\"",
            "review 5: \"20X with Brian Chaboyer: Co-taught by Professors Chaboyer and Newton. I thought this course was okay virtually. It definitely felt like a class that would be a layup if the course was taught in person, but it wasn't as much of a layup virtually. The lecture quizzes were extremely easy, but the weekly tests were sometimes arbitrary and difficult, and they were worth 36% of the grade in the course. Further, the labs seemed to be graded somewhat randomly (the ones we worked much harder on were often graded worse than those we just breezed through). Overall, the course was okay. I'd recommend taking it in person, but I probably wouldn't recommend taking it virtually.\"",
            "review 6: \"20S with Brian Chaboyer: I only took Astro 1 as a fourth class because of the pass/fail policy of 20S and I needed the SLA distribution, and overall it was fine. Format for the virtual term consisted of all asynchronous lectures, four labs, weekly tests, weekly group quizzes, and a final creative project. I didn't watch lectures past the first week and just read the textbook the day the tests were due, put in a moderate amount of effort in the labs and the creative project, the quizzes were fine as you collaborate with others on them, and I ended up with a B. I think during a normal term or one without the buffer of pass/fail it's certainly possible to do better but you would have to put in the effort. Based on past feedback I've heard, I don't think this class is a layup anymore, but definitely not a hard class if you give it a standard amount of time (especially given that there's no midterm or final). There are lots of office hours to take advantage of, and TAs were generally pretty helpful on labs, so just stay on top of the labs (really not a good idea to start them the day or two before they're due). Content gets a little dry and dull after the first few weeks, especially given that most students who take this class are non-STEM majors, but the SLA distrib is a great motivator for taking the class, especially for a virtual term.\"",
            "review 7: \"20S with Brian Chaboyer: Horrible class to take remote. The labs are hard and the lectures, which were reused from a previous recording, were very unclear with poor recording quality and teaching. Quizzes were hard. One perk was the final project, which was graded on a very easy scale and boosted grades up big time.\"",
            "review 8: \"19X with Brian Chaboyer: Co-taught with Newton. Poll everywhere questions, weekly quizzes, a few major labs, and a final creative project are the main grades for this class. I'm not exactly sure why the median grade dropped so much 19X, but I think the weekly quizzes must have been harder than previous years. Pretty much all of the questions came straight from the PowerPoints, so I would usually cram the night before and always did decently well. If you're not great at memorizing a lot of specific details though, you might have trouble with the quizzes. The labs weren't too bad, and the TAs are helpful if you need it. Like me, most of the people who take this class are not STEM people and really just want a layup for their lab credit. I'd still recommend the course for that reason, but set an NRO limit just in case you need it.\"",
            "review 9: \"19X with Brian Chaboyer: While interesting, this class was not easy and was not a layup. The quizzes have been changed and have become significantly more difficult. While there are still only 4 labs and if you need lab credit there isn't that much work, the class is not a layup.\"",
            "review 10: \"19S with Brian Chaboyer: This course was co-taught by Chaboyer and Thorstensen. This course is as close to a science layup as you can get. There's definitely some math and knowing some basic physics wouldn't hurt. There are weekly quizzes and a final project. There are also some in-class polls that do make up a small part of your grade. A lot of this course is just rote memorization of facts for the quizzes.\"",
            "review 11: \"19S with Brian Chaboyer: Co-taught with Thorstensen. Very easy class, great for the SLA distrib. The labs were easy to complete and the weekly quizzes were simple and nothing unexpected. Some work is required, I don't think most people could walk out having done no work and with an A, but if you even loosely did the homework and paid attention to the readings, it was an easy A.\"",
            "review 12: \"19S with Brian Chaboyer: Profs Chaboyer and Thornsensen are the men you need to go to. Fiesen retired. Too bad. Very interactive style lectures and a LOT of FUN even for non-science majors\"",
            "review 13: \"18X with Brian Chaboyer: TAKE. THIS. CLASS. If you need a SLA during summer take this class, but especially if you only need a SCI and are thinking about taking astro 2 TAKE THIS CLASS. It's an absolute layup there are no midterms or finals, the first day of class Chaboyer admitted that this class was geared towards non-stem majors. There are only 4 labs total, they are all two hours each and for two of them you actually get to look through telescopes, it's incredibly cool! The only thing you really have to do is go to class and pay attention which is easy because Chaboyer is an engaging lecturer and uses PollEverywhere really effectively so that you can really learn the material. There are weekly quizzes, but just review the lecture notes and you'll be fine, plus he drops the lowest two. Finally, while there is no final, there is a creative project that is really free form--I'm literally making a mug in the ceramics studio. It really shows how accessibly Chaboyer wants his class to be. TL;DR Astro 2 is fake news take this class\""
        ],
        "Elisabeth Newton": [
            "review 1: \"20X with Elisabeth Newton: Co-taught by Chaboyer and Newton, this class was incredibly easy taken remotely. Daily quizzes are straight from the lectures, as are weekly tests. Labs take some time but are straightforward. The final project was fun if you did a creative project. Newton and Chaboyer are both very clear lecturers, and most days' recordings were only around a half hour. This seems like the best way to get an easy lab.\""
        ],
        "Graham Edwards": [
            "review 1: \"24S with Graham Edwards: Interesting class if you like astro but definitely an easier lab class. There are 4 labs but the last one was canceled. His lectures can be boring, halfway through the class period would never be full. There is also 5 cumulative quizzes except the first, a writing assignment, a group project, and then a final project. Would consider this to be a busy layup.\""
        ],
        "John Thorstensen": [],
        "Michael DiPompeo": [],
        "Robert Fesen": [],
        "Yorke Brown": []
    }
}