{
    "CRWT040.14": {
        "Shalene Moodie": []
    },
    "CRWT040.13": {
        "Yanyi Luo": []
    },
    "CRWT040.10": {
        "Peter Orner": []
    },
    "CRWT040.09": {
        "Yasser Elhariry": [
            "review 1: \"21F with Yasser Elhariry: Absolutely take this class!! If you are interested in poetry, or looking for a fun class, or just anything, ABSOLUTELY TAKE THIS CLASS! You will love it!\""
        ]
    },
    "CRWT040.08": {
        "Thomas O'malley": [],
        "Thomas O'Malley": []
    },
    "CRWT040.07": {
        "Alaa Al-Aswany": [],
        "Alaaeldin Abdel Elasswany": []
    },
    "CRWT099": {
        "Cynthia Huntington": [],
        "Jeffrey Sharlet": [],
        "Peter Orner": [],
        "Thomas O'Malley": []
    },
    "CRWT011": {
        "Jeffrey Sharlet": [
            "review 1: \"24W with Jeffrey Sharlet: My WORST Dartmouth experience. He brags about giving students bad grades and clearly has favorites. He is so condescending and mean to students. JUST RUN.\"",
            "review 2: \"21W with Jeffrey Sharlet: Fantastic class - one of the best at Dartmouth. It's not easy, but Sharlet's teaching and feedback are worth it. I still remember the assigned readings, they were so moving. I believe I became a significantly stronger writer because of this class.\""
        ],
        "Alexander Chee": [
            "review 1: \"23S with Alexander Chee: If you’re looking for an interesting course with a very manageable workload, definitely take CRWT 11. I’m glad I chose it over CRWT 10 because writing about myself felt a lot more accessible and enjoyable, and I got to practice so much self-reflection. Professor Chee is a very talented writer and a helpful, honest teacher. He’s incredibly empathetic which helps during class discussions about more sensitive topics. He also sees through BS, and won’t hesitate to call you out on it, so take the class seriously. Your grade is made up of two categories: deliverables and participation. During the term you write two stories, one of which you turn in a first draft for to be workshopped in class. Both stories are due at the end of the term. The other deliverable is commenting on discussion boards for classmates’ short stories ahead of their workshop time. Do it on time and give actual helpful, specific feedback and you’ll be fine. The rest of the grade is participation both in assigned reading discussions and in workshop discussions, so whenever you can meaningfully contribute to the conversation, do it. You can get away with not doing the reading (though the readings are really good so I would try to get them done) since discussions usually go off-topic anyway.\""
        ],
        "William Craig": [
            "review 1: \"21X with William Craig: This was a great class, and I recommend it to anyone in the English major or anyone who just wants to take a creative writing class. Professor Craig begins the term by saying that everyone can expect either an A- or an A, so students really get out of the course what they put into it. The assignments of the class were six prompts with no minimum or maximum (but generally around 2 pages) that could be revised and edited toward a final portfolio, in which student selected their best works and wrote a cover letter for them. There were also 2-3 short reading reaction assignments and 2 blog posts. The best part of the class was the structure, in which students read each other's work and received extensive feedback on two of their essays. In this way, the class was entirely focused on improving one's writing ability and was very enjoyable. Craig can be a little frazzled sometimes and never responds to emails, but he really pays attention to your writing and is always willing to give more feedback during office hours. Can't recommend this class enough.\""
        ]
    },
    "CRWT022": {
        "Vievee Francis": [
            "review 1: \"21S with Vievee Francis: Prof. Francis is the GOAT, this is my second class with her and I'll be taking everything she teaches from now on lol. She is incredibly smart in one-on-one critique, and group workshops are also great. It was pretty chill and she gives you an A if you do all the work. Don't take this if you're just looking for a layup, but if you want to expand your brain into a more creative area then I completely recommend!\""
        ],
        "Matthew Olzmann": []
    },
    "CRWT021": {
        "Jeffrey Sharlet": [
            "review 1: \"21W with Jeffrey Sharlet: He thinks all Dartmouth students are \"children\" who can't think for themselves and have no problems. He also likes mocking students online for clout. NEVER take a class with him\"",
            "review 2: \"21W with Jeffrey Sharlet: Thinks the students at Dartmouth are children, doesn't respect any of the work we put forward. Seems like he regrets taking the job here.\"",
            "review 3: \"21S with Jeffrey Sharlet: His name is literally Shartlet and he spends wayyy too much time on Twitter and Librex to have time to teach the class. Also how does a writing prof not understand bait/sarcasm?\""
        ],
        "William Craig": []
    },
    "CRWT020": {
        "Katherine Crouch": [
            "review 1: \"24W with Katherine Crouch: Such a great class if you're looking to develop one longer piece and do a lot of words over the course of the term. Starts off with a full month of 500 words/day, emailing them back and forth to your accountability partner. Other students in this class will be great for giving you a better critique with more detail and really helping you improve your sense of plot, style, and overall capabilities. Definitely only try to take when you have the time to put in -- you will miss it when it's over!\"",
            "review 2: \"22W with Katherine Crouch: Crouch is kind, thoughtful and intelligent. She is also very widely read, and I liked the conversations I could have with her about different books and short stories. She's a New York Times bestselling author, so she has experience in the writing and publishing industry. I also liked that she brought multiple accomplished authors to speak to us and discuss about writing/publishing; it was very helpful. Now, class: you write 500 words 5 days a week with an accountability partner in order to build consistency. I enjoyed this a lot, but many people slack off. Crouch is not harsh, so she does not press the matter. You also turn in two long-form short stories. Some students in class turned in short pieces (like 4 pages), but their prose was so beautiful that the length did not ultimately matter. Class discussion is interesting and consists of discussing novels/short stories and giving peer feedback. I would recommend contributing regularly in class; it might not seem like it matters, but Crouch takes note of who contributes and who does not. Finally, you turn in a craft paper on a literary tool; it's not very high stakes, but you should put in some effort. Overall, lovely class with a lovely professor. Median was an A.\""
        ],
        "Alexander Chee": [
            "review 1: \"22F with Alexander Chee: Chee is a phenomenal writer and reader of fiction. Seriously, he is the fastest reader I have ever seen in my life. When he reads material, he comes to it with a genuine knowledge of literature and fiction production. With that said, I never had a problem getting him to read my work, but other students felt like he never read theirs. If you want to get the most out of the class, attend office hours as much as possible. Class itself was very, very boring. Chee is an introvert and that becomes obvious in his class. Although more than qualified to teach and inspire, his class itself is very quiet. But to be fair, most creative writers are more observational than talkative. He really will help you improve your writing if you take the initiative to approach him. The readings were very diverse and solid. We read 2 books and everything else was short fiction/craft essays. The final was a lot. We had to write two new pieces of 1500 words in length in addition to a craft essay. To be fair, you have the whole term to write them but, ... common, who's going to do that? Anyways, he is good, but class is long and boring. We only workshopped the last 2 weeks and everything else was discussion of published work.\""
        ],
        "Thomas O'malley": [],
        "Peter Orner": [],
        "Thomas O'Malley": []
    },
    "CRWT061": {
        "Jeffrey Sharlet": []
    },
    "CRWT041.01": {
        "Eugenie Carabatsos": [
            "review 1: \"22S with Eugenie Carabatsos: this class was a lot of fun! the other review is still right about the structure of the class– you spend the first week or two reading existing tv scripts and dissecting them, and then the rest of the weeks pitching and writing your own pilot. i think reading the work of other students was one of the best parts of this class, everyone's stuff was so interesting and a lot of it was really good. one thing to know is that some parts of this class do take a lot of time and it is pretty hard to actually write your script. having an idea for a tv show and writing the first episode of that show are not the same, so i'd recommend thinking about how you might want to start things off in advance. also, i really recommend having some sort of idea about what you want to write from the start!! i did not and it definitely made it more difficult when we started writing. but in general this class was good, the prof is nice and super chill, and i did always enjoy going to class even though it was a 2A. it also made me handle constructive criticism better, which is valuable. would recommend!\"",
            "review 2: \"22S with Eugenie Carabatsos: solid class, i agree with the other two comments for the most part. this is one of those classes where there's a decent amount of work but if you do it all you will get an A. If you're actually going into the entertainment industry, the class is still worth it, although it's not as helpful as I would have liked. Carabatsos is more of a theater person than a TV person so while her advice usually still applies, I kind of found myself wanting a little more. Still super interesting to go through all the pilot episodes of various shows, and also super cool to see everyone's scripts. You will have to share your work with everyone and be open to critique. Overall solid class\"",
            "review 3: \"20W with Eugenie Carabatsos: An amazing class to take if you've ever been interested in film or tv. Throughout the first two weeks of the term, you read through various different pilot episodes from popular shows such as Brooklyn Nine Nine, The Handmaid's Tale, Madmen, Fleabag, etc. and have open discussions about what you found interesting about certain techniques these scripts used during class. Eventually, you pitch your own television show to the class and spend the rest of the 7-8 weeks writing a Teaser, Act 1, Act 2 and Act 3 for your Pilot Episode. Once this part of the class begins, you spend most of class time going over different functions of a script and doing peer edits in class. Homework consists of reading tv scripts (first 2 weeks), writing your script, reading other people's scripts and doing revisions. The professor is super nice and tries really hard to make class engaging and fun. Although I wouldn't consider this class a complete layup, I was always stoked to go to her class. In the first two weeks, you can expect upwards of 100-150 script pages to read per week and then afterwards you'll spend most of your time trying to write your own script. There's deadlines once to twice a week to present your pages to the prof and your peer group. You'll also present your first draft of your script to the entire class which the class will critique in class for 20-30minutes. At the end of the term, you'll pitch your tv show again, make a \"Show Bible\", and hand in a final version of your script. That's basically it! It's not really hard to get an A in her class if you put in the work.\""
        ]
    },
    "CRWT040.05": {
        "Vievee Francis": []
    },
    "CRWT040.04": {
        "Vievee Francis": [
            "review 1: \"24W with Vievee Francis: This class was a bit of an oddball, but in a good way. The class periods themselves were extremely engaging, especially for a class scheduled during the nighttime 6B. A few of them were canceled last-minute, which is tough when we already only met once a week. Homework was pretty inconsistent in difficulty and distribution throughout the term, and if you're looking for a stringently organized course, you won't get that here. That said, if you're looking to genuinely learn about poetry, Detroit, and Poland, this will be a great experience. Grading-wise, do the work genuinely and earnestly, and Professor Francis will recognize that.\""
        ]
    },
    "CRWT040.03": {
        "Jeffrey Sharlet": [],
        "William Craig": []
    },
    "CRWT098": {
        "Andrew McCann": [],
        "Cynthia Huntington": [],
        "Jeffrey Sharlet": [],
        "Peter Orner": [],
        "Thomas O'Malley": []
    },
    "CRWT089": {
        "Andrew McCann": [],
        "Cynthia Huntington": [],
        "Jeffrey Sharlet": [],
        "Peter Orner": [],
        "Thomas O'Malley": []
    },
    "CRWT062": {
        "Cynthia Huntington": [],
        "Vievee Francis": []
    },
    "CRWT060": {
        "Peter Orner": [
            "review 1: \"21S with Peter Orner: For a senior workshop class, not stressful or intense at all. Orner is a super chill guy and there's tons of room to make the class how you want it. There were a few workshops throughout the term, you have to submit about three or so works and there's obviously a final portfolio at the end. A few small readings throughout, but nothing intense. Go to class, participate, and it's a fun and easy A.\""
        ],
        "Alexander Chee": [],
        "Thomas O'Malley": []
    },
    "CRWT040.06": {
        "Peter Orner": []
    },
    "CRWT040.01": {
        "Alexander Chee": [
            "review 1: \"23W with Alexander Chee: I don't understand the other two layup reviews. Professor Chee talks painfully slowly and doesn't give feedback on creative writing papers (there were only two assigned) until the very last week of term. The class has no structure -- students lead discussions and can essentially say whatever they want about the books we read (four random novels). I genuinely learned nothing about creative writing, and the most beneficial part of this class was peer feedback during the singular workshop dedicated to one of my pieces. I don't recommend this class.\"",
            "review 2: \"19F with Alexander Chee: Prof Chee is an amazing professor. He is kind, helpful, interesting, and understanding. I learn a lot in his class and he isn't an asshole about grades like most profs at this awful place.\"",
            "review 3: \"18F with Alexander Chee: Chee is a great prof. Super interesting guy, helpful, very genuine, tons of ideas. This class is great if you like horror, sci-fi, and writing, but writing speculative fiction is certainly harder than you would think... takes time but it's time you will probably enjoy spending.\""
        ]
    },
    "CRWT012": {
        "Matthew Olzmann": [
            "review 1: \"23S with Matthew Olzmann: Take this class!! Olzmann is so cool and an amazing poet. This class was super chill, A median, and it's more about you get out of it what you put in. First half is just learning about poetry and second half is workshopping. Wide variety of types of experience and interests in the class.\"",
            "review 2: \"22S with Matthew Olzmann: A great course, and definitely one worth taking regardless of whether you've been writing poetry your whole life or if you're just getting started. The course consisted of weekly poems, a presentation about the poetry of a specific author of your choice, attending two live readings, and a final portfolio and reflection. Each of the assignments felt reasonable and were fun to complete. In class, you read, write, and talk about poems. Because of the nature of the class and of poetry, you will need to step outside your comfort zone a little bit and be vulnerable when reading what you've written, especially if you're writing about trickier topics. However, you do get to know your class very well because of that. Professor Olzmann is welcoming, kind, and supportive, and you definitely can't go wrong taking this course with him!\"",
            "review 3: \"21S with Matthew Olzmann: A good class if you know you want to study creative writing or want to write poetry, but personally I found it to be a bit of a waste of a class slot. I certainly learned a lot during the class, and I feel my poetry improved, but at the end of the day it just seemed like another workshop, which I could get for free anywhere.\"",
            "review 4: \"20W with Matthew Olzmann: This class was a little different from other creative writing classes I've taken. There was only one round of workshops, which came a lot later, around week 7. Normally, each class started with the professor passing out a few poems (usually similar to each other and introduced 1-3 new concepts) and we spent some time talking about each one. There were 5-10 minute breaks in the middle of each class (it was a 3A). A lot of the time, the professor would make a little time for writing in class, usually along with a prompt. Every week, we had to turn in one poem. We also had to meet with the professor one-on-one 2-3 times throughout the term. Our final assignments were a final exam (just to show we'd learned the terminology) and a final presentation (about a poetry book of our choice). It was pretty straightforward. Grading is almost entirely participation. If you show up, talk, and do all the assignments, you're probably going to be fine. Olzmann is really nice and understanding. He makes sure to be encouraging of everyone's work. I will say that it's a very small class and poetry requires a lot of vulnerability, so be ready for that. Overall a pretty good class.\"",
            "review 5: \"20F with Matthew Olzmann: Super chill and enjoyable class. Other comment about his class is very accurate. I would recommend this class if you are interested in dipping your toes in poetry.\"",
            "review 6: \"20F with Matthew Olzmann: This class is interesting, exposes you to a variety of styles of poems and opportunities to interact with the genre, as well as classmates and the prof. It's not at all demanding in terms of workload: for the first 2/3 of the course, the only requirements are showing up to class, reading a bit of an anthology and commentary from the prof, and submitting a weekly poem draft. It picks up a bit later on with workshops, a poetry collection presentation, and a personal portfolio, but isn't hard at all. Be aware that some students arrive with extensive workshop and writing experience and others have only attempted a couple writing prompts in their lives--it is an into course, after all. Definitely a worthwhile class to balance out a tough term.\""
        ],
        "Vievee Francis": [
            "review 1: \"23W with Vievee Francis: Prof Francis is such a sweetheart. She just wants to see you try. She knows we're not real poets, but she talks to us like we really will become one someday. This is a beautiful class with such a positive aura about it. In my 4 years here, this was one of my favorite classes because it put me in an artistic headspace that's so difficult to achieve otherwise. Prof Francis gets it - she really does. Also, if you're interested, this is one of the best, pure layups I've taken at Dartmouth. You get an A for completion of your work. There is no homework because everything can be completed in class. TAKE THIS CLASS!!!\"",
            "review 2: \"21W with Vievee Francis: Vievee is so sweet and a really great prof. Taking the course over zoom was a bit strange and our assignments were a bit sporadic, but if you want to take a stab at writing poetry, this is the class for you. As long as you do the work and show up you will get an A, and if you really pay attention and take it seriously you can learn a lot from Prof. Francis. Also, writing poetry never really feels like work, it's a great creative outlet and a fun to mix in with other, more dense assignments in your other classes.\"",
            "review 3: \"19F with Vievee Francis: She was very nice and inspiring. She genuinely cares about her students, and doesn't wanna make our lives harder. Just make sure you take her class seriously and engage in her discussions. The class isn't too hard but it's not as easy as some might initially think.\"",
            "review 4: \"19F with Vievee Francis: vievee is such a gem omg i love her. honestly this class is probably the best class i've taken at dartmouth-- vievee is so generous and insightful and really cares about you. you're pretty much guaranteed an A in her class as long as you show up, but please don't take this class if you're just looking for an easy layup; there's genuinely so much you can get out of writing and learning about poetry with vievee.\""
        ],
        "Joshua Bennett": [
            "review 1: \"22F with Joshua Bennett: Professor Bennett is a hidden gem of a professor. I had never even heard of him (admittedly, I took this class for an ART distrib and I'm not too privy to the CRWT department), but he turned out to be one of my favorite profs I've ever had at Dartmouth. He's accommodating, caring, chill, kind, extremely smart and successful, and humble. That's a list of qualities that very few profs possess. So I honestly would recommend taking this class if only just to take it with Prof Bennett. As far as the class goes, I thought it was great. Each week consisted of several poems to read, and usually one heavier bit of writing (open academic letters, long-form articles, snippets of books). Every week we were given a poem prompt, spent the week on it, and the last 1.5 hours of class would be an open poetry workshop where everyone reads their poems and then has a seminar discussion about them. (We also had a midterm poetry review essay, and a fairly open final project about adapting a work we read in class.) Professor Bennett has a great way of pushing students to improve their poetry while also being very validating and kind about what students bring to class. We also have a mix of lecture/discussion about the week's readings. Like I said, I took this class for the distrib, but I was genuinely excited each week to come to class. Bennett also does a phenomenal job of creating a classroom culture where everyone is involved and excited. It was just a really cool experience, and I'm pretty sure all of my classmates would say the same thing. I recommend this class for ART distrib seekers (pretty lenient grading), poets, closeted poets, and anybody who thinks poetry is even a little bit fun. I certainly didn't regret it.\""
        ]
    },
    "CRWT010": {
        "Katherine Crouch": [
            "review 1: \"24W with Katherine Crouch: Great class! Professor Crouch is so nice and understanding and I thought the assignments were fun and interesting. Two novels + several short stories spread out over the term. Would definitely recommend! Rekindled my interest in creative writing.\"",
            "review 2: \"23S with Katherine Crouch: I loved this class. Maybe my favorite one I've taken at Dartmouth so far. Professor Crouch is so sweet and funny, and her teaching as well as the small size of the class really brought us together as a group. Since it's an intro class, you aren't expected to be amazing at writing right off the bat--just come in interested and willing to participate and you're already prepared. Readings are mostly short stories and one longer novel and a graphic novel. There are some short writing assignments too, as well as a very relaxed short essay in the middle of the term. We spent most class sessions either discussing the readings or reading our writing assignments to the class. Once people started working on their final projects (either a short story or the first chapter of a novel) we started workshopping those in and out of class too. It was really cool to get to read what other people were writing and to get feedback on my own work. Would take again for sure.\"",
            "review 3: \"21S with Katherine Crouch: Adored this class. Professor Crouch is so sweet and caring and made this difficult term a lot more enjoyable. The readings were really intriguing and the short story prompts were inspiring. Workload was reasonable - a few short story readings and a writing prompt or two every week, an essay, and our overarching final story. The class was unbelievably disorganized (there were two syllabi on Canvas and each contained different information), but that’s very understandable considering it was a Zoom term; I imagine it would’ve been a non-issue if in person. If you get a chance to take this amazing class, I would highly recommend it with Professor Crouch.\"",
            "review 4: \"20W with Katherine Crouch: Phenomenal class! Prof. Crouch was so nice & you could tell she genuinely cared about the subject. We read so many great short stories (emphasis on the short part) + she focused each week on a different aspect of our writing to improve upon. Workload: 1 page of writing per week, read some short stories, + final story (basically the culmination of what you've learned). Super easy class - feel like everyone got an A.\"",
            "review 5: \"20F with Katherine Crouch: Professor Crouch is awesome! She's super sweet and genuinely cares about her students being engaged with the class. She's very kind and supportive and is always trying to make her students the best writers they can be. This class is nice because it's not your typical lecture-based class, you find that during class hours that you discuss the assigned writing pieces (which are usually very interesting), write short pieces and present them to each other, and etc. You often go into breakout rooms with your classmates in order to create a movie script, fun dialogue, etc that you present to the class. Because of this, you feel like you are actually getting to know your classmates and actually communicating with them despite being over zoom. Overall, super fun class that truly does not require that much work outside of class. All you really have to do is write an assigned piece and read a quick short story before each class. The biggest project will be your 2500 word short story, but you spend quite a bit of time developing it and it really isn't that bad considering that it's a fun story that you create. 10/10 would recommend!\""
        ],
        "Thomas O'malley": [],
        "Alexander Chee": [
            "review 1: \"20F with Alexander Chee: Took this class in a completely virtual setting, went into it a little terrified by the other review that said that Chee isn’t scared about telling you that your story is trash. But I absolutely loved this class. The course title is self-explanatory; it’s basically an introduction to writing fiction. It doesn’t matter whether you’ve had experience writing fiction before. The class is a mix of upperclassmen and underclassmen who are all (mostly) interested in writing fiction. It makes the class dynamic pretty neat. Up until week six or so, the class is basically a repetition of reading 1~3 short stories for homework + discussing them in class. If you’re really interested in the reading material for a certain day, you’ll end up loving the discussion. If not, then it could be a little painful to sit through. You’ll see Chee talking for nearly 2 hours on some days. He gives out great tips and suggestions that come from his experience as a writer, but I sometimes felt as if he was thinking as he was talking which often produced long, awkward moments of silence. The last few weeks of the class are workshops. All the students get to present their work to the rest of the class and get feedback. It’s a nice opportunity to see how your story is received by people. The workload is light; because the whole purpose of the class is producing your own short story, you’ll be turning in weekly assignments which are basically pieces of your story. You can get very creative here, and Chee gives wonderful feedback (a great mix of constructive criticism, thoughtful suggestions, and at times some well-earned praise). I’m not sure if he was particularly blunt or imposing in any way. I just thought that it the type of feedback that a published writer like Chee would give. He does suggest some stuff that you might be a little meh about, but he never forces his opinion on you. In the end, he wants to see what you can come up with. That being said, Chee could appear to be scary at first. But once you get to know him personally (by scheduling one-on-one meetings with him, etc.), you’ll see that he’s the best. He’s also incredibly lenient and flexible with deadlines and is perfectly understanding that inevitable circumstances do pop up. He wants to make sure that you get the time and room to put good effort into your work, so he doesn’t mind if you turn in assignments a couple days late (no points deducted). Participate in class, show your effort, and give the impression that you’re working hard. Chee will know if you do put in good work and give you an A. Great way to get a ART distrib.\"",
            "review 2: \"20F with Alexander Chee: Incredible writer and prof, definitely reflected in this class. Went into it with a faint interest in fiction, came out with a much greater appreciation for the process and craft. Chee really cares about his students and will put in the time to make sure you are where you want to be. Readings and discussions can be dry if they aren't of your interest, but overall you pick up some incredible tips on becoming a better writer. Highly recommend for a distrib or even if you are just interested in writing.\"",
            "review 3: \"18F with Alexander Chee: Take this class if you like English or writing and need an art distrib. Workload is super light - easy weekly free write exercises at the beginning and readings for each class and then one long final short story. participation counts a lot, so speak up and do the readings. I would say it is easy to get an A (esp compared to other classes), but not a given. Chee is interesting. He's a smart guy and knows a lot about writing and different authors, but he's a very blunt guy. Not shy about telling you your story is trash and doesn't like when you disagree with him. I liked the readings and it was refreshing to have so much freedom with writing assignments.\""
        ],
        "Peter Orner": [
            "review 1: \"22W with Peter Orner: AMAZING CLASS, AMAZING PROF. Orner is incredibly kind, fun to talk to, and genuinely cares about not only his student's success, but their experience and comfort with the class and the assignments. It's a fair amount of work, though they're fun and engaging assignments, so I never felt overwhelmed and was always excited to do homework for this class. Your grade primarily comes from the effort you put in to your work and class discussions, so if you're thoughtful and engaged, you'll get an A even if you don't consider yourself much of a writer. Can't recommend this class and this prof enough!\"",
            "review 2: \"21S with Peter Orner: I LOVED THIS CLASS. It was so much fun and Prof. Orner is great. I'm doing the creative writing concentration, but I'd highly recommend this class to anyone looking for an ART distrib or interested in creative writing.\"",
            "review 3: \"18F with Peter Orner: Amazing class and amazing professor! He's a really interesting person, and his feedback strikes a good balance between helpful critique and encouragement. The workload is definitely manageable: two shorter writing exercises, two main stories, and a revised draft of one of the main stories for the final grade. The class is almost all discussion and workshop-- instead of lecturing at you, the prof has you learn and experiment with creative writing techniques from the stories you read. I found many of the stories quite enjoyable and the discussions pretty compelling. There's a ton of creative freedom in this class. No hard and fast rules you have to follow in your writing, and you don't have to make the changes suggested in the feedback if you don't want to (you can still get a good grade if the story works!). I can honestly say I've become a much better writer after taking this class. It's definitely inspired me to continue with creative writing in the future and in general look at things more ~creatively~. Take this class if you have even the slightest interest in creative writing! I'd take it over and over again if I could.\""
        ],
        "William Craig": [
            "review 1: \"22X with William Craig: I took this class because I believed there would be little work required. That was the case when I took a different writing seminar course with Professor Craig. And I guess that assumption still technically was true---all you really have to hand in is two stories at the end of the term, with the stories themselves having no strict requirements. However, it's actually really fucking hard to write a good story. It seems that there's a thousand things to keep track of, and no matter how hard you try to edit, it's still just shit. I ended up spending way too much time revising my stories, only or them to still be bad. Also you spend way too much time peer workshopping other people's stories, which are equally as bad as yours and have nothing valuable to be learned from. In the end, I just gave up and I am now eating the NRO. Only take this class if you 1) are actually interested in writing fiction and 2) already are skilled in doing so.\"",
            "review 2: \"22X with William Craig: If you enjoy creative writing or feel like you have stories you want to tell, this is a decent class. You are given a great deal of freedom and can really write about almost whatever you like. However, it is very easy to get lost in that freedom as Craig masks his disorganization as \"being chill,\" and its pretty unclear what he actually wants you to do most of the time, so if you like structure, this is not the class for you. As for Craig specifically, he is not the best teacher, as he really only tells you where to go with your writing, but not how to get there, i.e. he is good at teaching the broad strokes but is really not good at teaching the finer points of craft and storytelling. Most of what you learn in this class comes from your own experimentation or in the weekly small workshops with other students. Those workshops are definitely the best part, and if you buy in you can actually make some pretty great relationships and learn a lot. Overall, this class is fine; it was nice to take it over the summer and definitely required less time commitment than any of the visual arts classes if you're just looking for the distrib.\"",
            "review 3: \"20X with William Craig: Took this class randomly, not a major or anything. Absolutely loved it. The workload, while minimal, was really involving - you weren't just writing things for the sake of writing. Prof. Craig is really helpful when it comes to suggestions on syntax, dialogue, and story progression. It's also a very engaging class, you'll typically do 2-3 workshops where you submit your own work for the rest of the class to review, and other classes, you'll be the one reviewing other students' work. Super open seminar style of course - it was great. Grading was also more than fair.\""
        ],
        "Thomas O'Malley": []
    }
}