{
    "FRIT031": {
        "Tonia Convertini": []
    },
    "FRIT037.08": {
        "Yasser Elhariry": [
            "review 1: \"21F with Yasser Elhariry: Ended up taking this because I couldn’t get into anything else and I like poetry…it ended up being my absolute favorite class. The workload isn’t horrible unless you don’t like poetry (if that’s the case find another class). We read about one book of poetry a week, and wrote a poem of our own ever two weeks. Most of the class is just discussion but it is very laid back. Yasser is so cool, extremely knowledgeable, and very chill. There were also only 5 students, including 2 grad students from CompLit, so we all got really close. Highly recommend for anyone who’s a poetry lover!\""
        ]
    },
    "FRIT037.07": {
        "Matteo Gilebbi": []
    },
    "FRIT037.06": {
        "Damiano Benvegnu": []
    },
    "FRIT037.05": {
        "Nathalie Batraville": []
    },
    "FRIT035.02": {
        "Graziella Parati": [
            "review 1: \"19F with Graziella Parati: This is one of my favorite courses I have taken at Dartmouth. It is fascinating especially if you enjoy discussing history. You get the chance to listen to guest lecturers on certain topics (France, Spain, German film, possibly Japan) and most lectures emphasize multidisciplinary viewpoints (ie. art + architecture, film, history, literature, government, etc). There is a lot of reading that she expects you to complete, but it is usually not too challenging. Professor Parati is very engaging and funny – she is super interesting and passionate about the subject. In terms of assessments, your entire grade is based on two research papers (10 pages, and 13? pages) and class attendance. These papers were graded generously and you can write about whatever you want as long as it relates to fascism. She tries to scare off some of the students during the first week, but if you make it past that it's really worth it.\""
        ]
    },
    "FRIT037.04": {
        "Nancy Canepa": []
    },
    "FRIT037.03": {
        "Nathalie Batraville": []
    },
    "FRIT093": {
        "Tonia Convertini": []
    },
    "FRIT035.01": {
        "Graziella Parati": []
    },
    "FRIT034.01": {
        "Courtney Quaintance": []
    },
    "FRIT034": {
        "Eleonora Stoppino": [
            "review 1: \"05S with Eleonora Stoppino: Some interesting material introduced. Not too hard, not too easy, this class is good for people interested in literature, the Renaissance, or Italian history. Good discussion atmosphere\"",
            "review 2: \"05S with Eleonora Stoppino: Professor Stoppino is a delight, you learn about the renaissance, and you have a relaxing course during the spring with not too much work. take it!\"",
            "review 3: \"05S with Eleonora Stoppino: nora is great.\""
        ]
    },
    "FRIT033.01": {
        "Laurence Hooper": [
            "review 1: \"18S with Laurence Hooper: Very interesting class and cool prof. Laurence rambles a lot and can be boring, but he really cares about the material and is very interested in students' comments. He wants everyone to form a deep connection with the material. Reading was a lot and assignments were graded tough, but it's all because Laurence is so invested in the material. Overall, this class was great, and I recommend it.\""
        ],
        "Michael Wyatt": []
    }
}