{
    "LACS041.20": {
        "Patricia Stuelke": []
    },
    "LACS023.61": {
        "Matthew Garcia": [
            "review 1: \"22S with Matthew Garcia: Class started out well the first week then got progressively more disorganized. Example 1: moved a project deadline to monday on canvas, then didn't tell us the time it was due was much earlier than the time posted on canvas.\"",
            "review 2: \"22S with Matthew Garcia: Professor Garcia was very passionate and knowledgeable about the topic. Classes are mainly him lecturing with some participation. Lots of reading but everything is very interesting. Weekly discussion posts based on readings. We had a few papers and video assignment, which definitely took time/effort but were not crazy difficult.\""
        ]
    },
    "LACS009": {
        "Mingwei Huang, Jorge Cuellar": [
            "review 1: \"22S with Mingwei Huang, Jorge Cuellar: Very interesting class. One of my favorites at Dartmouth so far. Quite disorganized at times but very experimenting and daring.\""
        ],
        "Jorge Cuellar": [],
        "Mingwei Huang": []
    },
    "LACS025.12": {
        "Analola Santana": [
            "review 1: \"22W with Analola Santana: SO SO GOOD. If you want a class to fulfill your art requirement, this is the perfect class. Interesting conversation-based lectures and the materials are very engaging.\""
        ]
    },
    "LACS007.06": {
        "Sebastian Diaz": []
    },
    "LACS039": {
        "Marvin Chochotte": [
            "review 1: \"22X with Marvin Chochotte: This was honestly a pretty difficult class. The material was so interesting and I felt like I learned so much about Haiti and particularly history that is never talked about. But we had to do so many readings, and we went over all the readings in class so if you didn't do them then you would not do well on the quizzes. Professor Chochotte only lectured so it also made the class feel so long. I would say take this class if you are heavily interested in the subject matter, but otherwise it will be boring.\""
        ]
    },
    "LACS042.10": {
        "Pamela Voekel": []
    },
    "LACS080.60": {
        "Matthew Garcia": []
    },
    "LACS022.11": {
        "Marcela Di Blasi": [
            "review 1: \"23W with Marcela Di Blasi: Di Blasi is clear about how and why she grades the way she does. I liked how she made everyone participate through wellness check-ins and then began to discuss novels. We read a novel about every week.\"",
            "review 2: \"22W with Marcela Di Blasi: Some people should not be professors. Unfortunately, Di Blasi is one of these people. She was easily one of my least favorite professors in all my time at Dartmouth.\""
        ]
    },
    "LACS044.40": {
        "Carlos Cortez Minchillo": []
    },
    "LACS047": {
        "Andre Pagliarini": []
    },
    "LACS031": {
        "Jorell Melendez-Badillo": []
    },
    "LACS030.16": {
        "Christine Castro": [
            "review 1: \"21W with Christine Castro: Professor Castro was amazing. So kind, brilliant, understanding, and a fantastic teacher. The structure of the course was half lecture, half discussion/group activities to reinforce the material. I took the class online because of COVID, and Prof. Castro was so accommodating (no late penalties if you just communicated with her) and accessible for any type of help (always ready for a zoom meeting to help with assignments and give feedback). Awesome course material too--super interesting with a high quality syllabus.\""
        ],
        "Mary Coffey": []
    },
    "LACS024.70": {
        "Analola Santana": []
    },
    "LACS040.10": {
        "Bethany Moreton": [
            "review 1: \"22S with Bethany Moreton: Professor Moreton is not a professor I would recommend for anyone that likes clear communication from Professors. Professor Moreton does not respond to emails about anything. The only way to reach her is by going to office hours, but I had another class when she had office hours and whenever I tried emailing asking for another time to meet I never received a response. Her lectures are also super boring and she just likes to talk a lot. She assigns wayy too many readings and is a harsh grader. She also takes a super long time to grade and does not give real feedback. Her grading is super arbitrary.\""
        ]
    },
    "LACS030.15": {
        "Martina Broner Szychowski": []
    },
    "LACS001.10": {
        "Jorell Melendez-badillo": [
            "review 1: \"21F with Jorell Melendez-badillo: Pretty chill class, the first few weeks of the term were light, it was just readings and lectures. However, during the second half the class starts to pick up in workload, there was a midterm which consisted of four different essays, the book review, and the final podcast. Jorell is a great teacher and is really passionate about his work. Take this class if you want to learn more about Latin America and want a pretty chill class.\"",
            "review 2: \"21F with Jorell Melendez-badillo: This was easily my favorite class I took this term. The professor is one of the most passionate individuals you will encounter and you can tell that he really loves what he does. The work load itself isn't too bad but the readings can get pretty long and dense at times. It's manageable though because when they do, he'll tell you to split up the readings with your pods (which typically consist of 3-5 people and are made at the beginning of the term). He's also incredibly understanding. If you reach out to him he will listen with open ears and is always considerate. Also, he isn't a harsh grader so that's another plus for the class itself. Overall I'd highly recommend taking this class, you'll enjoy it.\""
        ],
        "Jorell Melendez-Badillo": []
    },
    "LACS030.14": {
        "Jeremy Mikecz": []
    },
    "LACS030.08": {
        "Andre Pagliarini": [
            "review 1: \"20F with Andre Pagliarini: This class gave me great insight into the world of Brazilian film. However, I’m not a humanities major, and LACS 30.08 had A LOT of writing for me. It was offered asynchronously in 20F, and over the course of the term, we had weekly Canvas posts (with at least 2 discussion comments), weekly scene write-ups, and 3 papers (5+ pages each). Not including my Canvas comments, I wrote over 24,000 words for this class and received feedback on none of it. I got feedback on my three paper outlines, but there were only 1-2 comments on each of them and I got the sense that whatever I wrote would have been fine. However, I did still enjoy this class. If you’re remote, don’t want to engage with other students that much, and simply want to be given assignments to complete each week, you’ll enjoy this class.\"",
            "review 2: \"20F with Andre Pagliarini: The other review gives a great description of this course. As a humanities major, even I thought the writing was overkill and have never had to write this much for any class before. At the start of the course, Pagliarini sent an intro email saying he was grading “almost pass/fail,” and I’m pretty sure he gave everyone who followed instructions and submitted on time an A in the class (median was an A). Considering how much work I put into the writings and readings for the course, some feedback would have been nice, especially knowing that I probably could’ve gotten the same grade spending half the time I did. I’d recommend this course if you’re interested in international film and/or need to fulfill an INT distrib, but you probably don’t need to spend as much time on it as you think. I can’t speak to Pagliarini’s teaching because I had really no interaction with him, but he seemed like a nice guy based on his emails and grading.\""
        ],
        "Reighan Gillam": [
            "review 1: \"24W with Reighan Gillam: Mega layup, but painfully slow at times. Very little work (1 short scene analysis, one 4-5 page paper, one 6-8 page paper, and \"literary luminary\" sheets on the readings where you just need to put interesting quotes and why you thought they were important). We also only watched 7 films all term, if I recall correctly. I learned a lot, but I think this class could be a lot more educational without being very difficult.\""
        ]
    },
    "LACS024.30": {
        "Desiree Garcia": []
    },
    "LACS083.50": {
        "Peter DeShazo": []
    },
    "LACS024.50": {
        "Desiree Garcia": []
    },
    "LACS032": {
        "Tatiana Reinoza": []
    },
    "LACS030.13": {
        "Jessica Smolin": []
    },
    "LACS008": {
        "Jorge Cuellar": [
            "review 1: \"22X with Jorge Cuellar: The content of the course was great. However, Professor Cuellar was extremely critical and disrespectful to students. He wrote his syllabus in an extremely subjective manner that resulted in his denial of points that would have been well deserved if not for his displeasure upon reading work that did not mimic his way of thinking. Often times he regards to bits of information mentioned in class that were not included in syllabus worksheets as reasons for point deductions in organization and brevity parts of the rubric. He had left unprofessional comments on students work, such as referring to their work as\"phoned in\", \"superficial\", and \"haphazard\". During class he presented himself as an amicable professor but makes petty comments during class that has made students feel discomforted and responds to emails in a passive aggressive manner. Most students that I have been in contact with regarding the class tend to share the similar statement that his class provided great content but his behavior as a professor converted his class into an extremely bitter experience that turned their excitement with the content sour. I would advise against taking any classes with this professor.\"",
            "review 2: \"22X with Jorge Cuellar: This professor does not know how to separate professionalism from personal situations and preferences. He favors students who have the flexibility to attend outside events, causing marginalized (FGLI) students to be disadvantaged since they usually have to attend office hours, work, and tend to family responsibilities. This professor expects you to run on HIS time. If you ever attempt to explain why you cannot make an event or deadline, he becomes passive-aggressive within emails and makes sly remarks in class, including “I know some of you had a terrible week last week” with a chuckle. He grades arbitrarily and does not clearly state expectations within assignment sheets. Even if you meet with him and follow his suggestions, he ALWAYS has a critique–your writing can never satisfy him. As stated in another review, he essentially focuses too much on what you have missing; he enjoys commenting on what HE would have written. I enjoyed the content, but the execution and class environment were dreadful.\""
        ]
    },
    "LACS007.05": {
        "Desiree Garcia": [
            "review 1: \"21W with Desiree Garcia: Unless you absolutely love film and theatre (AND I MEAN ABSOLUTELY), do not take this class. The prof is pretty nice but she grades so harshly and arbitrarily. First year seminars are generally supposed to be quite chill but I absolutely disliked this class. Just a forewarning for y'all fellow freshman.\"",
            "review 2: \"21W with Desiree Garcia: I loved the content and material of this course but this class was completely unenjoyable. Workload was medium, and you can get by without doing the majority of it, but the assignments were annoyingly graded. The class met once a week, only to discuss the content of the course and different musicals over time. We also had corresponding weekly essays (most were short) to write about the material, and they were graded only off of grammar and construction. Garcia never taught us how she wanted us to write or listed expectations on writing assignments, and she'd grade incredibly harshly on little writing details that weren't super necessary. I got an 80% on an essay and my feedback praised all of the ideas and content I wrote, but I lost points because I was a little over the word limit and used a little passive voice. If you enjoy examining the grammar of every sentence you write, this is definitely the class for you. This class was supposed to be my layup and ended up being much more stressful than it should've.\"",
            "review 3: \"21W with Desiree Garcia: I would like to reiterate what the previous reviews stated. Even though solely meeting as a class once a week appeared beneficial during the pandemic, the added stress from grading ambiguity outweighs it. Don't get me wrong, the topics were enjoyable considering that we had to watch films and write short summaries of scenes and musical numbers about them. However, with the absence of rubrics and reasonable grading, I would not recommend this class if you are attempting to improve your writing tremendously. I found my Writing 5 course more helpful since that professor did provide a lot of feedback, rubrics, outlined clear expectations, and appreciated what everyone brought to the class from the beginning of the term. The professor for this writing seminar is a nice person, but she never explicitly talked about her expectations and grades way too harshly. She focuses more on grammatical errors rather than the content and analysis. Expect to get 80s with more comments that praise your work than ones that pick at small grammatical errors that don't even impede the reader from understanding your point\""
        ]
    },
    "LACS050.17": {
        "Jorge Cuellar": []
    },
    "LACS024": {
        "Desiree Garcia": [
            "review 1: \"21W with Desiree Garcia: The class structure this term was very organized and easy to handle. Each Friday we had film journals due along with discussion board posts. We only had to respond to 5 discussion post questions all term for full credit. The movies in the beginning were not always super interesting, personally they get better towards the end of the term. Using premier pro, we had assignments to compare films, adding our own text/audio to films, and it was very fun to do. This class was mainly asynchronous too, with only 3 synchronous meetings to learn how to make the 3 different video projects we had to do(these were usually videos less than 3 min). Regardless of this, Prof. Garcia is good at getting back to you through email and answer any questions you have about an assignment. I took this class out of interest and do not regret it.\""
        ]
    },
    "LACS050.16": {
        "Sina Rauschenbach": []
    },
    "LACS038": {
        "Chelsey Kivland": []
    },
    "LACS050.15": {
        "Alexander Eastman": []
    },
    "LACS036": {
        "Francine A'Ness": []
    },
    "LACS050.13": {
        "Pamela Voekel": [
            "review 1: \"18W with Pamela Voekel: This class was awesome. There are various books and readings assigned every week, but Voekel provided all of it for us so we never had to buy anything. As long as you keep up with the readings and have something insightful to say in class, you'll be fine. Go to office hours and chat with her as well. Your grade is based on attendance (she really cares about this), participation, and 3 papers (4-5 pages each). Very manageable workload.\""
        ]
    },
    "LACS030.12": {
        "Patricia Stuelke": []
    },
    "LACS050.11": {
        "Peter DeShazo": []
    },
    "LACS007.04": {
        "Peter Deshazo": [
            "review 1: \"18W with Peter Deshazo: DeShazo gives about 50 pages of reading per night, and you have to write about a page (double-spaced) summarizing the reading. His lectures can get boring, and I fell asleep every other class. I also think he plays favorites a lot of the time. That being said, the syllabus allows for you to get fine grades even if you don't do well on his two-page essays (there are four of them). So I would take it again, but not if there was something better available.\"",
            "review 2: \"18W with Peter Deshazo: Amazing class overall. Prof. DeShazo is really knowledgeable about the things he talks about in class. His past experiences as a diplomat are interesting, too. Lectures can get dry sometimes, but you can learn a lot about the history of the Andean countries. The workload is manageable, with 4 two-page essays and a final research paper. Daily readings serve as good supplement to class material.\""
        ],
        "Peter DeShazo": []
    },
    "LACS099": {
        "Deborah Nichols": [],
        "Mary Coffey": [],
        "Matthew Garcia": [],
        "Richard Wright": []
    },
    "LACS098": {
        "Deborah Nichols": [],
        "Mary Coffey": [],
        "Matthew Garcia": [],
        "Richard Wright": []
    },
    "LACS089": {
        "Deborah Nichols": [],
        "Mary Coffey": [],
        "Matthew Garcia": [],
        "Richard Wright": []
    },
    "LACS082": {
        "Tanalis Padilla": [
            "review 1: \"12F with Tanalis Padilla: Course: Very interesting and generally well-paced. Sometimes, however, you will have to skim through hefty reading assignments during the second half of the course. Some say prof is biased against U.S., but the subject matter and materials clearly justify this. Essay prompts are very vague. If you're interested in the subject matter and don't mind a liberal slant, you certainly won't regret taking the class, despite some of these frustrations. Professor: Approachable and nice, but often vague in her essay prompts and ambiguous/boring in her lectures. Workload: Reading was manageable solely because it was interesting. There was still a hell of a lot of it assigned for every class.\""
        ]
    },
    "LACS080.02": {
        "Lisa Baldez": [],
        "Peter DeShazo": []
    },
    "LACS078": {
        "Mary Coffey": []
    },
    "LACS076": {
        "Bryan Winston": [],
        "Pamela Voekel": []
    },
    "LACS066": {
        "Shalene Moodie": []
    },
    "LACS059": {
        "Marvin Chochotte": [
            "review 1: \"24W with Marvin Chochotte: Class consists of lecture- kinda disjointed, Prof isn't the best lecturer but very knowledgeable. Sometimes we watch a movie during class or do worksheets in groups. Not mega engaging but decent enough. Readings for the week, if you do them and take a lot of notes (if you want to participate in discussion or have info for midterm/quizzes you should), take me about 2-4 hours on monday then theres no other work for the week. No papers, just 4 in-class quizzes, and midterm and final which got switched to both take home and open note. Midterms are ID terms, one short answer, one long. prof basically hands the prompts to you . Kinda layupy if you dont do the readings. I learned a lot? Also we only make it to 1989 like week 9, which I find ironic.\""
        ],
        "Anne Phillips": [],
        "Clifford Campbell": [],
        "Reena Goldthree": []
    },
    "LACS058": {
        "Yesenia Barragan": []
    },
    "LACS054": {
        "Clifford Campbell": [],
        "Marvin Chochotte": [],
        "Reena Goldthree": []
    },
    "LACS053": {
        "Lisa Baldez": []
    },
    "LACS052": {
        "Lisa Baldez": []
    },
    "LACS051": {
        "Silvia Spitta": []
    },
    "LACS050.09": {
        "Peter DeShazo": []
    },
    "LACS050.08": {
        "Peter Deshazo": [
            "review 1: \"23S with Peter Deshazo: SO MANY DAMN READINGS!!!!!!! Such an interesting class, but required a lot at times. Prof DeShazo is so cool and I loved the class overall. He is a very hard grader though.\""
        ],
        "Peter DeShazo": []
    },
    "LACS050.07": {
        "Peter Deshazo": [
            "review 1: \"23W with Peter Deshazo: He is a nice guy, looks like a grandpa, genuinely a nice person. His class is lecture-based and he has 4 papers for the class, 1 final research paper and that is all. I feel he does a great job grading, but his understanding of Latin America is from a pretty white perspective. Enjoy the class if you are American, criticize the class if you are Latinx.\""
        ],
        "Peter DeShazo": []
    },
    "LACS048": {
        "Mary Coffey": []
    },
    "LACS043": {
        "Jeffrey Dobereiner": [],
        "Ryan Collins": []
    },
    "LACS042": {
        "Deborah Nichols": []
    },
    "LACS030.11": {
        "Daniel Mcdonald": [
            "review 1: \"22F with Daniel Mcdonald: The class I took was quite engaging as it delved into two significant topics pertaining to Brazil: the upcoming 2022 Presidential Election, which happened in the middle of our term, and the ongoing environmental crisis in the Amazon. The workload was reasonable and easy to manage, making it a straightforward course. Our professor, McDonald, was incredibly friendly and approachable. He demonstrated genuine concern for his students, welcoming them during office hours. Sadly, he departed from Dartmouth after teaching the course as a lecturer. Overall, I would say it was a positive learning experience.\""
        ],
        "Carlos Cortez Minchillo": []
    },
    "LACS030.10": {
        "Jessica Smolin": [],
        "Roberta Stewart": []
    },
    "LACS030.09": {
        "Mary Coffey": []
    },
    "LACS030.06": {
        "Thamyris Almeida": [
            "review 1: \"22F with Thamyris Almeida: Overall, the class is interesting and the workload is manageable. There are usually 2 midterm papers with medians in the B range and a final creative project or a 10 page paper. Prof. Almeida is a nice professor, but attendance is mandatory and will affect your grade. Plus, it is a 9L during the fall. I recommend the course if you genuinely care about Latin American cinema and don't want to do a lot of work on a daily basis; however, this is not the course to take if you want an easy A or if you are unwilling to wake up before 8:50 am.\"",
            "review 2: \"22F with Thamyris Almeida: This is not a layup. The day to day work is very manageable, 2 short papers and a final project. However, she is a really difficult grader and her median paper grade was consistently a B. Do not take the class if you are looking for an easy A or have little to no interest in the topic.\"",
            "review 3: \"22F with Thamyris Almeida: I really loved this class. It’s definitely more of a history class than it is a “film class” but the professor is super knowledgeable and helpful. Overall, it’s a very relaxing course to take. Not an absolute LAYUP, but definitely an easier course (plus super interesting). Towards the beginning of the term I found the readings to be a bit extensive, but it got MUCH better after seeing the class dynamic (she also modified somethings since it was a new class). The two papers and final project were also very free lance.\""
        ],
        "Gerd Gemunden": [],
        "Silvia Spitta": []
    },
    "LACS020": {
        "Douglas Moody": []
    },
    "LACS007": {
        "Dennis M.": [
            "review 1: \"05W with Dennis M.: This course is fantastic, Professor Runnels is a wonderful man who really inspired interest in the subject. He's quite a man. The course is exactly as described and a lot of work, but worth it. I loved everything about this (the response papers could be a pain)... but the readings are interesting, the papers are easy, and he's a nice grader. If you're having qualms decided, don't anymore and just sign up for it - it's TOO great!\"",
            "review 2: \"05W with Dennis M.: This freshman seminar has been the worst class I've been in since I've gotten here, and it's all due to the professor. Professor Runnels does not do anything in the class. All he does is talk about current events and try to force discussion out of his students. His grading of papers is atrocious. You may get your paper back with no writing at all except page after page of \"+\" next to certain paragraphs, only when you get to the end of the paper, you receive a grade of \"B.\" If he was going to grade like that, at least substantiate why a B was given! Even though this was a course on Chicano autobiographies, he barely talked about the literary features of the books. Instead, everything was a discussion about contemporary topics like bilingual education, affirmative action. For 2 weeks, all we did was talk about affirmative action and the pros and cons of it. Runnels is clueless about Dartmouth. In our discussion of Affirmative Action, SAT scores came up. Runnels claimed that \"the average SAT score at Dartmouth is a 1200.\" I'm not lying about this! Plus, he also talked about how people who scored 1600's on their SAT's weren't really that impressive when he had those students in his class, and that recruited student athletes were some of the best students he's ever had. Then he proceeded to get a tally of the number of students who scored 1500s, 1400s, etc. in the class. Runnels fills his discussions with politically incorrect statements. When referring to Asians and their high scores on the SAT's, he called them \"Orientals.\" Also, when talking about remote possibility of legalizing illegal Mexican immigrants in a Congress Bill, he said that \"there's not a Chinaman's chance of it passing.\" Runnels is the worst professor at Dartmouth, even worse than Shelby Grantham. Beware this professor if you ever consider taking one of his courses.\"",
            "review 3: \"05W with Dennis M.: good seminar but lots of work...don't take other time comsuming classes with this seminar.\"",
            "review 4: \"05W with Dennis M.: The material for this course was interesting but the lectures were somewhat dry. There were def enjoyable parts of the class, but the Prof seemed to have a hard time engaging students in class discussion. Which made for an unexpected amount of dead air during class while he attempted to pry discussion out of the class.\"",
            "review 5: \"02W with Dennis M.: runnels ruined this class. it had potential to be interesting because some of the reading was pretty good--although i admit that some readings were also pretty bad--but runnels killed any chance of students becoming interested in class material when he decided to drone on about nothing every class lecture. you can't really miss any classes since there's only about 10 students enrolled, and if you looked around the room during the hour we were held captive three days a week it would've been common to see eyes glazed over and heads nodding off in boredom. to credit runnels, he has some good ideas, but he blew it with this one. to make matters worse, i think he was THE HARDEST GRADER I'VE HAD YET. that just made me resent him even more. especially since sometimes we wouldn't even discuss the books enough to write a good paper on it. he's one of those profs that's like \"have this book read by monday so that we can discuss it in class that day\" and then when monday comes you're all prepared and he decides to spend the entire class period talking about his childhood instead or something. a good man, yes, but a bad teacher.\""
        ],
        "Julie Lirot": [
            "review 1: \"09W with Julie Lirot: I think this seminar will be different the next time it is taught. However, there are some things I feel like I need to point out. First of all, the class is not what it sounds like in its description--it is not at all focused on the history of Latin American revolutions. You don't read historical essays or documents relating to the revolutions. You don't even really discuss the revolutions in depth or see different points of view on the revolutions. Instead, the class focuses on novels and plays that are somehow related to revolutions in Latin American countries. The four books we read were \"Death and the Maiden,\" by Dorfman, \"In the Time of the Butterflies,\" by Alvarez, \"Before Night Falls,\" by Arenas, and \"Leopard in the Sun,\" by Restrepo. These works may have been interesting for some, but personally I did not think very highly of them, with the exception of Death and the Maiden. There was nothing significant about \"Butterflies\" and \"Leopard.\" \"Before Night Falls\" is a very interesting book that certainly opens your mind a little bit, but it is a very, very, very sexual book which can be hard to read sometimes. The professor is nice and available to meet outside of class, but she expects too much of the class. The work load was pretty ridiculous, and it was confusing--I found myself frequently not knowing when things were due, not only because we had so many different assignments simultaneously, but also because the professor simply could not clearly explain when our assignments were due. Overall, this was like a high school English class. To be fair, this was the professor's first time teaching a seminar, and I am almost certain she is going to make changes for next time.\"",
            "review 2: \"09W with Julie Lirot: The response papers that went along with each reading assignment were kind of a pain, but they definitely helped me analyze each book in smaller parts. I also developed most of my ideas for papers from my response papers and my classmates' response papers. Writing a response made it a lot easier to discuss the books in class because we already had points and observations prepared. Professor Lirot is very helpful when it comes to writing papers. For every paper, we handed in a first draft and then had individual conferences with her to discuss changes. This method definitely helped me improve my final drafts of each paper. The workload that she assigned was definitely heavy, but it was doable and I feel like I learned a lot because of it. At first, Professor Lirot seemed like a very tough grader, but the key to doing well in her class is simple: if she sees that you are making a serious effort, your grade will reflect that.\""
        ],
        "Peter Deshazo": [
            "review 1: \"16S with Peter Deshazo: DeShazo is amazing. He has such a storied life and has worked in the situations he has talked about - manageable course load and manageable assignments. Take it for DeShazo, he's phenomenal\""
        ],
        "Robert Herr": [
            "review 1: \"13W with Robert Herr: Course: Fantastic course. Material was incredibly interesting and engaging (a class all on Bandits). Movies were interesting, articles provided great insight on topic. I learned a lot about corridos, Latin American depictions in Hollywood, and bandit lore. Professor also made some fascinating connections between bandit tales and the narcorridos (songs about the narcotraficantes in South America). Professor: Knowledgeable, kind, accessible, fair grader. Provides great feedback on how to improve your essays and is incredibly reasonable with assignments. Excellent professor. Workload: Movies sometimes could eat up some time, but all were interesting and fun to engage with. A reasonable amount of additional reading, although Professor Herr was flexible if you couldn't get around to doing some of the reading. 2 essays and 1 longer research paper were the bulk of the work - plenty of time for all of them, with great assistance along the way.\""
        ]
    },
    "LACS004": {
        "Beatriz Pastor": [
            "review 1: \"09W with Beatriz Pastor: Both of these professors are extremely qualified and getting them together is an amazing opportunity.\""
        ],
        "Rodolfo Franconi": [
            "review 1: \"13W with Rodolfo Franconi: Course: I would recommend anyone interested in Latin American culture to take this course. A broad range of topics are covered in a cohesive way. Professor: The professors are accessible and want you to have fun learning a lot. They work with the class to tailor the course to the groups interests. Workload: The course is lecture-based with a midterm, three 2-page papers and a final paper. The readings are interesting and specifically selected, so you're not wasting your time with busy work.\""
        ],
        "Andre Pagliarini": [],
        "Sebastian Diaz": []
    },
    "LACS001": {
        "Pamela Voekel": [
            "review 1: \"22F with Pamela Voekel: Voekel is an amazing understanding Prof. Course load was so easy; two essays which if you go to office hours she essentially does for you. In general, a good conversationist who keeps the class engaged and refreshed. She makes learning fun a very good course to take for freshmen or upperclassmen with an otherwise heavy workload! Doing a full analysis of the readings is not necessary just skim over them before class because it is all discussion based. Don't let the readings scare you off you don't really need to do them in full.\"",
            "review 2: \"22F with Pamela Voekel: Voekel is such an amazing prof! She is so understanding and really tries to work with you, I actually struggled a lot with the final paper and she gave me a two-week extension. I'd go to her office hours even if just to get to know her, she really cares about her students and teaching. The coursework was really manageable, I skimmed all the readings and did great. You definitely get what you put in, but honestly, a great course overall especially if you have harder classes to balance.\"",
            "review 3: \"22F with Pamela Voekel: Prof Voekel is the best. She is very understanding and very engaging, which helps when she is leading discussions for like 60% of the course. If you are someone who struggles to make it to class, this class might not be for you. In the syllabus it says that you will not pass the course if you miss more than 3 classes through the whole term. Not sure how strict she is because she didn't always take attendance, but something to keep in mind. Very manageable course load, but front loaded into the first 4 weeks. Which if you're taking stem classes that start to weigh down the most in the latter half, is very nice. Would highly recommend this class to anyone as we had super interesting and engaging discussions.\"",
            "review 4: \"21W with Pamela Voekel: Prof voekel is the best, highly recommend taking this class with her. As others have said the readings were dense at times but you could skim parts of them. Totally manageable workload, but you do have to participate in discussions, so be aware of that. Overall, I LOVED our discussions. They were always fascinating, and it was fun to hear how different people's life experiences influenced the way they interpreted our readings. I liked how prof voekel just let them play out naturally and didn't try to impose a strict plan for the discussion. It was the first online class that I've had that had an organic feel to it. i think it takes a special skill set to be able to facilitate discussions like that and essentially lecture on the fly to some extent, and she killed it.\"",
            "review 5: \"20S with Pamela Voekel: Pam was VERY accommodating during the class period, and I personally was very happy with that. There are like 3 zoom meetups total and the 5 written works are not that rigidly structured, if you aren’t able to meet deadlines or would rather modify the assignment, Pam is great about doing so. The readings were a bit dense, but some kids didn’t even do them or just watch youtube vids/gave opinion talks -- if they were latin of course. There is a lot of cool, interesting reading to learn about though if you’re not, although it does tend to focus on the imperialism and colonial warfare a bit. Also the works were Mexico, Cuba, Argentina focused but we did have some cool readings about the New Mexico Navajo diaspora and Dominican realist literature\"",
            "review 6: \"17F with Pamela Voekel: I took this course as a freshman, and am so glad that I did. The material can be dense but Voekel is excellent at invoking conversation and posing interesting questions. She is very understanding/flexible and wants you to do well. She is very available and wants to hear your ideas, you have to speak up in this class, it is about 80% discussion based on the readings. There are a lot of readings and you read about 5 books in 6 weeks or so which can be daunting but she doesn't test on minute book content, it's very much overview of the book supplemented by other readings. There are no tests, just three papers and a few one question quizzes. This class is hard to do poorly in. Read the material, participate in class and get to know Voekel. She is very energetic and passionate about the topic and made the course really enjoyable!\"",
            "review 7: \"16F with Pamela Voekel: This class was really amazing and very key to my introduction into Latin American studies. Professor Voekel gives lectures here and there throughout the class that are mainly based off of the readings. The class seems a bit disorganized, but retrospectively speaking it really is not. The reading material is a little dense, but the discussions that Professor Voekel prompts are very useful at putting the readings into context.\""
        ],
        "Lisa Baldez": [
            "review 1: \"20F with Lisa Baldez: Professor Baldez adapted wonderfully to online learning. Her class was interesting, full of discussion, and super interesting guest lecturers. I really enjoyed what I learnt. Her canvas page was also super easy to navigate and super organized. It was easy to find any reading we needed (which was super useful for when we wrote papers). It's also a very much an intro class, where you jump around topics quite fast, or as Prof. Baldez called it, a \"tapas course.\" And she even left the last week of the term blank in the syllabus so that we could use it to delve into current events in Latin America. We were expected to read a moderate amount of material before class, and then were expected to do group activities and discussions pertaining to those readings. She rarely lectured during our zoom meetings, and instead lectured in pre-recorded videos that we were to watch before class. We wrote two major papers, with a bunch of short essays and discussion posts and other sorts of activities sprinkled throughout the term. She also focused a lot on familiarizing students with academic writing in history and political science. My only complaint is that I felt like her writing expectations felt a bit unclear to me, and her essay prompts could feel convoluted. Also, as a STEM major, I found it a bit hard to keep up with all the work. However, this is one of those classes where you'll get a good grade if you genuinely put in the work and participate in class. She even hosts x-hour classes for students to go up and ask questions about the upcoming papers and clarify what she wants. I would fully recommend this class to anyone interested in Latin America and how the past influences the present of the region.\"",
            "review 2: \"13S with Lisa Baldez: Course: This course was excellent. Though it was tough to get through the background information in the first week or so, the rest of the class was incredibly interesting and a great introduction to important topics in history, political science, and gender studies. Professor: Professor Baldez is my new favorite professor, hands down. I came to the first day of LACS 001 simply shopping for courses. I had not planned on taking this course, but was instantly won over by Professor Baldez's enthusiasm and approachability. Professor Baldez is fair, understanding, and will give you feedback on your work along the way. Additionally, she has a great sense of humor, which really added to the lectures. I recommend taking this course early in your Dartmouth career, as it is a fantastic introduction to Latino & Caribbean Studies and an even better avenue to meeting one of the most genuinely kind and fascinating people you will encounter in your life. A++ Workload: The workload was perfect for first-year students. The course work was evenly paced, with a midterm, final, two take-home papers (5-7 pages), and two film reviews (2-4 pages). There was a lot of content covered between the midterm and the final, so study as you go.\"",
            "review 3: \"09S with Lisa Baldez: great 3rd class. sign up for the TA. you'll get answers to tests. btw, be careful of the first test - it tends to be very picky on multiple choice. make sure you know EXACTLY what is going on and the actors involved. prof. baldez is stellar. she's awesome to just talk to about stuff. definitely worth taking to learn about what's going on in latin america.\"",
            "review 4: \"06W with Lisa Baldez: This class was a great intro class because it covered a wide range of issues throughout Latin America and it focussed on material that was current (all post-2000). You could kind of go in whatever direction you felt most comfortable with in the class, so if you are a gov person, you could focus on gov aspects, econ people, econ, history, etc. Baldez is an interesting lecturer (self-proclaimed \"Montel style lecturer), but the article readings were not really covered in class, meaning you actually had to read at least most of the assigned readings for your papers to be good. Though the class was paced quickly, the material never became dead or boring. The first couple weeks of the class seemed unorganized, but there was a high turnover of people who dropped/added the class.\"",
            "review 5: \"06W with Lisa Baldez: Most of the time when you're studying history and government you end at 2000 and you're left wondering how your knowledge applies to today--this class is completely different. You learn about how the history, economics, government, etc of Latin America apply to five current situations in various Latin American countries. This makes the class incredibly interesting because its history unfolding right before you-Baldez lectured about Chilean elections that happened the day before and how they relate to Chile's history. Plus Baldez is awesome-if you're going to take the class, take it with her.\"",
            "review 6: \"06W with Lisa Baldez: Professor Baldez is great! She knows so much about Latin America and presents comprehensive lectures. There is a ton of reading, much of which is difficult to wade through, and the papers are very challenging. Despite the difficulty of the work, if you attend class and do the work, you will learn a lot about the countries and cultures of Latin America.\""
        ],
        "Marysa Navarro": [
            "review 1: \"04S with Marysa Navarro: Professor Navarro was a fascinating lecturer. She is incredibly knowledgeable and has firsthand experience with the culture. The lectures were interesting, fast-paced, and fun. However, the final grade was based on an in-class midterm and 2 papers. Prof. Navarro is a tough grader and expects a lot. But I'm still glad I took her class...I learned a lot and enjoyed it.\"",
            "review 2: \"04S with Marysa Navarro: This class was incredibly disorganized. I did not find Professor Navarro to be a good lecturer at all. The bias of the course as well as the biased sources (everything was frankly very anti-American and very Marxist) was really not the best way to teach the course. Navarro's fellow teacher, who's name escapes me, was a visiting professor, who was all right, but nothing to write home about. Though I find Navarro to be a real character, she really is very antagonistic, very anti-American, and frankly aside from her disorganized lecturing, if you aren't one for monolithic America bashing and tirades against the IMF and World Bank, don't take this course.\"",
            "review 3: \"02S with Marysa Navarro: Watanabe was gave very organized lectures that were easy to follow. Navarro seemed to be following some sort of organization, but it was definitely difficult to find the structure. She just talked and talked. There was a lot of information to cover so many time the lecture felt rushed and there was no time for class participation.\"",
            "review 4: \"02S with Marysa Navarro: This class was very interesting and I learned alot even though I came in with alot of familiarity with the region. It has very hard grading, however, which is unfortunate, but that should not deter you from taking the class if you have any interest in the region. The readings served to give country-specific examples of themes that were covered in class, allowing you to see the trends that exist throughout the region and to gain a better understanding and appreciation of it.\"",
            "review 5: \"02S with Marysa Navarro: From reading the description in the ORC, I expected this course to be very interesting. It turned out to be exactly the opposite. Professor Navarro's lectures were impossible to follow and just seemed to be a continuous storyline of history. Professor Watanabe's lectures were well-organized but completely irrelevant to what was tested and the course readings. The readings are excessive and incredibly boring, and seem to be solely a far too detailed story of Latin American history. This course was a huge dissapointment, and despite knowing the material and doing all the reading, it was still hard to do well on the tests or papers.\"",
            "review 6: \"02S with Marysa Navarro: Although Professor Watanabe's lectures were always organized and almost always interesting, Professor Navarro's complete lack of teaching ability breaks this class. The class never knew who was teaching on any given day and when Professor Navarro would step to the podium, groans could be heard throughout the lecture hall. It was almost like there were thirty dying cats under the seats. While the in class midterm was graded a little tougher than I would have thought, Professor Watanabe provides more than adequate feedback to justify the grade. The midterm essay, on the contrary, was graded by professor Navarro and not returned until the FINAL DAY of class. It seemed as if she was finishing her grading IN THAT CLASS as well. She provides no justification for anything and scribbles a question mark here and a snide comment there hoping that a few pen marks would make it seem like she did something. Her lectures are disorganized and most times she contradicts herself frequently. Her inability to present the information makes it impossible to pay attention from fear of becoming frustrated. One more downside to this course is the amount of material presented in such a short period of time. If you decide to take this course, GOOD LUCK!\""
        ],
        "Felipe Arocena": [
            "review 1: \"07S with Felipe Arocena: it was ok i guess\"",
            "review 2: \"07S with Felipe Arocena: A good intro/overview class. Professor Arocena is AMAZING...a visiting prof, so go on the Argentina/Uruguay FSP to have him!!\"",
            "review 3: \"07S with Felipe Arocena: Prof. Arocena had gave interesting lectures but because student presentations were the bulk of the classes he rarely gave full period lectures. That said, overall I am glad I took this course.\"",
            "review 4: \"07S with Felipe Arocena: The course was a solid introduction to the LACS department. Most of the readings were very interesting, especially those on politics and economics in Modern Latin America. However, some of the other readings, particularly those in Understanding Latin America, were dry and repetitive. Professor Arocena is a very good lecturer. With that in mind, we may have spent too much time on student presentations and too little listening to Arocena's lectures. Grading is based on two open-book take-home exams, a student presentation, and class participation. I highly recommend this course.\""
        ],
        "Andre Pagliarini": [
            "review 1: \"19F with Andre Pagliarini: Professor Pagliarini expects decent participation and work from his students. The balance between lecture and discussion was solid and quite near fifty-fifty. We had biweekly readings, four papers of 4-5+ pages, and numerous films to watch and later discuss. There was no in-class final examination. Overall, though, it was a manageable workload coupled with fulfilling course periods. I would recommend this class to anyone with an interest in Latin America or looking to fulfill a Non-Western distrib.\""
        ],
        "Jorge Cuellar": []
    }
}