{
    "LAT010.01": {
        "Jennifer Lynn": [
            "review 1: \"22F with Jennifer Lynn: Great class, Lynn is an awesome and compassionate prof, would recommend her for any class. There were translations due every class for some portions of the term, but they were never too difficult or long and she was always extremely lenient in grading them. Most classes were spent going over / correcting our translations in small groups and then reviewing as a class so you could pretty much always fix any mistakes before handing in your work. There were two take-home midterms (both of which were very short projects that took 30 min - 1 hour to complete) and a take-home final which wasn't much work at all. This class has many fun trips to the book arts workshop and you get to look at some cool books in the Rauner. She also brings her dog into class sometimes. Overall, I really enjoyed this class and would recommend it to anyone who gets the chance to take it.\"",
            "review 2: \"22F with Jennifer Lynn: interesting class. It assumes you have a working knowledge of Latin and while you will go over tricky grammar, this isn't the majority of the class. midterms were projects that were hard not to get an A on. homework was assigned daily but took a max of 1.5 hours, normally more like 1 hour max. homework was graded but I never got below an 85 (and only below a 90% once) on an HW assignment - I also had an average to not great Latin background coming into this class. I did hear my classics major classmates wishing it were harder, so bear that in mind. This class focuses a lot on the various forms of literature so you get to spend some time in Rauner and the Book Arts workshop which was just awesome. Professor Lynn is amazing and brings her dog, Emma the \"wonderdog\" in to class sometimes. Would 100% recommend this class.\""
        ]
    },
    "LAT018.02": {
        "Patrick Glauthier": []
    },
    "LAT002": {
        "Bryce Walker": [
            "review 1: \"22W with Bryce Walker: Pretty much as easy as Latin 1. The grammar is a bit more complex but you work up to it so it doesn't feel hard. Everything said in the reviews for Lat 1 with Walker apply here too\""
        ],
        "Jennifer Lynn": [
            "review 1: \"21W with Jennifer Lynn: Latin 2 seems like a new course since it was only offered since the start of 2021, but it's really just Latin 3 repackaged so they could add an extra course to the Latin language requirement. Overall, very similar to Latin 1 in that you have quizzes, translations, Latin Help desk, etc, with more grammar and such thrown in. Definitely one of the easiest languages to get the requirement out of the way. I will say that I think Walker is a bit more chill than Lynn, having been in both of their classes before, but both of them are very nice and clearly love the language (Lynn just tends to make sure everyone's on task more often)\""
        ],
        "Maria Gaki": [
            "review 1: \"23W with Maria Gaki: Same format as latin 1. Introduces some new grammar and vocabulary. I don't think your prof makes that much of a difference, because the class is very much dependent on you teaching yourself, but Gaki was really nice and helpful. Class consists of translating passages in your group and occasionally going over new forms or playing kahoot. I found the class easy to do well in as long as I kept up with everything. I highly recommend spending at least an hour or so every day going over vocab, because that helps a lot with translations when you dont remember exactly what form the word is in.\""
        ],
        "Patrick Glauthier": [],
        "Simone Oppen": [],
        "William Dibble": []
    },
    "LAT030.08": {
        "Timothy Pulju": []
    },
    "LAT033": {
        "Patrick Glauthier": [
            "review 1: \"23W with Patrick Glauthier: Great class, we read selections from quite a few authors including some that you might never read otherwise. Glauthier (who is excellent) has been experimenting with a format with no midterms, but instead polished translations throughout the term, which worked very well and was fun. Weekly language quizzes weren't too bad, and there are two short essays that you sign up for throughout the term for discussion later.\""
        ]
    },
    "LATS007.02": {
        "Douglas Moody": []
    },
    "LAT031": {
        "Margaret Graver": []
    },
    "LAT029": {
        "Roberta Stewart": []
    },
    "LAT027": {
        "Margaret Graver": []
    },
    "LAT025": {
        "Roberta Stewart": []
    },
    "LAT023": {
        "Patrick Glauthier": []
    },
    "LAT018.01": {
        "Margaret Graver": []
    },
    "LAT021": {
        "Margaret Graver": [],
        "Patrick Glauthier": []
    },
    "LATS008": {
        "Matthew Garcia": []
    },
    "LATS020": {
        "Matthew Garcia": [
            "review 1: \"22F with Matthew Garcia: Really great, engaging, and interactive class. Would highly recommend if you need the distrib, want to take a course with Matt, or a history/lacs major/minor. Two simple video editing projects which he shows you how to do and are super cool, weekly discussion posts that are fairly simple, participation, and a final 5 page paper. Really nothing to stress about, super chill prof as well and he funny asf. Just make sure that you don't glorify Cesar Chavez cuz he hates him.\"",
            "review 2: \"21F with Matthew Garcia: Take this class. Garcia is so chill. There are no midterms only really easy discussion posts and assignments. The material is super interesting and Garcia is an expert on the subject. He brings in tons of experts in the field because he is friends with all of them. No lie we watched a movie and he brought in the award-winning director.\"",
            "review 3: \"21F with Matthew Garcia: This class was awesome!! Prof. Garcia is really knowledgable on the subject matter (we read his book on Cesar Chavez and the UFW) and his lecture style is really engaging. I liked the structure of the class, although there was a lot of reading and I had to skim a lot of it. He makes you do some video editing projects that turned out to be really cool, and a super good skill to have. The final paper was very open-ended and could be a fun assignment if you write about what you're passionate about. Great introduction to the LATS program.\"",
            "review 4: \"21F with Matthew Garcia: Be prepared to hear this man rant about how bad Caesar Chavis was. There were a lot of readings but they're skippable. You have to submit a discussion post every week.\"",
            "review 5: \"21F with Matthew Garcia: It's an easy class. Tbh class should've just been called the faults of Chicano movements because he only focuses on Mexico and the wrongs with the movement leaders.\""
        ]
    },
    "LAT030.06": {
        "Roberta Stewart": []
    },
    "LAT026.02": {
        "Margaret Graver": []
    },
    "LATS025": {
        "Desiree Garcia": []
    },
    "LATS012": {
        "Tatiana Reinoza": []
    },
    "LAT024.01": {
        "Patrick Glauthier": []
    },
    "LATS037": {
        "Israel Reyes": [
            "review 1: \"22S with Israel Reyes: it was quite disorganized. many aspects of the class were interesting but it felt like freestyling more than anything.\""
        ],
        "Douglas Moody": []
    },
    "LATS030.01": {
        "Elias Krell": []
    },
    "LATS046": {
        "Almita Miranda": []
    },
    "LATS045": {
        "Jonathan Cortez": [
            "review 1: \"21F with Jonathan Cortez: Really interesting class and passionate prof! Even though it was pretty easy, I did not feel like it was a layup just because I learned so much.\"",
            "review 2: \"21F with Jonathan Cortez: Cortez is the living stereotype of a narrow-minded, inflexible, liberal Ivy League professor. He seems to believe that all people of color have at all times serve within institutions as the oppressed—and nothing else. (This is being written by a student of color.) Such essentialist views lead to frustrating and sometimes hateful views of race, politics, and identity. If you're looking for an overwhelmingly simplistic understanding of history for which you practically have to do no reading, this is the course for you. If you're a serious academic learner searching for a deeper understanding of international relations between different peoples and states, I would recommend looking elsewhere.\""
        ],
        "Almita Miranda": [
            "review 1: \"16S with Almita Miranda: Class was great, Miranda is the sweetest. Less than average workload & reasonable final paper highly recommend.\""
        ],
        "Bryan Winston": [
            "review 1: \"22S with Bryan Winston: Definitely a layup. 3 papers that were 3-4 pages and a final project that was super easy. However, the class format was discussion based which was awful because no one did the readings (pretty sure prof included). The class sounds interesting but I sadly learned very little due to the poor structure and lecturing. Would recommend if you want an easy class, but expect to learn absolutely nothing and sit through some horrible class discussions.\""
        ],
        "Desiree Garcia": []
    },
    "LATS007.01": {
        "Marcela Di Blasi": [
            "review 1: \"17W with Marcela Di Blasi: I really enjoyed this class with Di Blasi. While there is a lot of reading (one book per week), the subject matter and class discussions are enjoyable (despite being about race, it never got really political). Because of the structure of the class, falling behind is pretty difficult and if you do, you're going to start a new novel the next week. There were only three essays of increasing length with a lot of time to write them. Di Blasi is very particular about how she wants certain things written but gives no rubric to follow. Fortunately she's big on peer review which gives a lot of opportunities to ask her questions. Di Blasi is very nice and laid back. The only hard deadlines are online discussion posts and final paper due dates but she likes to put them at weird times like 6pm on a Saturday. She is almost always able to meet even outside of her office hours. Would recommend to anyone looking for an interesting seminar.\""
        ]
    },
    "LATS044": {
        "Christina Gomez": [
            "review 1: \"23X with Christina Gomez: Professor Gomez is a force to be reckoned with and I adore her. She works at UChicago most of the time and it makes me a little sad I don't go there. Of all the college classes I've taken, this one was the one that was ACTUALLY like what my high school teachers said college would be like, if that makes sense? The midterm felt like an AP test. There was an in-class essay. I haven't written an in-class essay in years. The essays were interesting, and the final was a podcast to mix it up a bit. I'm a creature of habit and I like my essays, but Professor Gomez is one of those profs who believes in you so aggressively that you end up leaving your comfort zone begrudgingly but willingly. I hate GarageBand with all the passion of a thousand burning suns. There was screaming, and crying, and a little hyperventilating when I thought I deleted my whole file. But I am so damn proud of the final product that I actually shared it with some people instead of just submitting it. The material was incredible, the professor was the perfect combination of impressive and approachable, and the workload was a lot but every part of it felt meaningful. This actually shifted my academic trajectory. It changed how I think about my community, my history, my home, and my goals. Of all the classes I've taken at Dartmouth, this is one that I think I'll remember as life-changing in 20 years.\""
        ],
        "Almita Miranda": [],
        "Marcela Di Blasi": []
    },
    "LAT015": {
        "Neeltje Kuin": [
            "review 1: \"18F with Neeltje Kuin: Really solid class that I thoroughly enjoyed. Workload seems heavy at first glance, but you could just skim through the English readings and take notes in class and be more than fine. Also, she doesn't make you write your translations out or turn them in except for a few english to latin compositions of short passages at some points in the term, so translating is not much work either. This class seems kind of medium-level in workload, and the tests aren't too hard to study for either if you have a solid background in Latin grammar. Highly recommend\""
        ],
        "Simone Oppen": [
            "review 1: \"20F with Simone Oppen: I really, really enjoyed this class. Mainly took it to finish out my language requirement but it ended up being very enjoyable. Professor Oppen is possibly the sweetest, most understanding human on Earth and her passion for what she teaches is really infectious. And that is coming from someone who by the time I took this class was really done with Latin as a subject. It is by no means a walk in the park, there are tons of readings and translations and pretty much something due for every class which you will discuss in class. Expect ~15 hours a week in work, but most things are graded for completion and the weekly quizzes (because I took it online) were open note, fairly straightforward, and didn't have any unfair questions. The small class also really helped being online since it felt like a nice little community I could look forward to during an isolating time. The class covered a lot of interesting Roman authors and Professor Oppen tried really hard to make the class interesting and would often poll us about what we wanted to study. Additionally, you never needed to stress yourself out about knowing everything about grammar since she would review all the time and constantly make sure we understood the concepts. Participation is basically mandatory in class, so always come prepared. Even if you don't have time to do all the work, try to do some so that you can volunteer to do that section. Put in the work and you'll definitely succeed.\""
        ],
        "Emilia Barbiero": [],
        "Pramit Chaudhuri": []
    },
    "LATS011": {
        "Angela Hernandez": [],
        "Francine A'Ness": []
    },
    "LAT030.04": {
        "Margaret Graver": [],
        "Neeltje Kuin": []
    },
    "LATS099": {
        "Deborah Nichols": [],
        "Mary Coffey": [],
        "Matthew Garcia": []
    },
    "LATS098": {
        "Deborah Nichols": [],
        "Mary Coffey": [],
        "Matthew Garcia": []
    },
    "LATS089": {
        "Deborah Nichols": [],
        "Mary Coffey": [],
        "Matthew Garcia": []
    },
    "LATS051": {
        "Silvia Spitta": [
            "review 1: \"07S with Silvia Spitta: For this class we had weekly \"thought papers\" that were only a page long. We also had a ton of reading (way too much for anyone to keep up with all the time), and just discussed it during class. Pretty easy, somewhat interesting, an easy out for a distrib. I would have liked there to be more to our grades than just our thought papers and a couple of powerpoints, but I don't expect there to be any grades below a B+ in the class.\""
        ]
    },
    "LATS041": {
        "Douglas Moody": [
            "review 1: \"19S with Douglas Moody: MOODY! Professor Moody is great. Very easy class and very engaging. Highly recommend taking a moody class at one point. This is a great class to do it.\"",
            "review 2: \"08F with Douglas Moody: Professor Moody is incredibly nice. Great Class.\"",
            "review 3: \"08F with Douglas Moody: The class discussed many topics related to latinos in the media ranging from performance art to movies to music to comic books. There were essentially no lectures and class was entirely discussion (as the term progressed, there was less importance put on the readings). While there were a bunch of different assignments, including a takehome midterm, a podcast project, and a presentation, the only grade we received was the final grade that appeared on banner student. Professor Moody is a very passionate professor who values class attendance and participation very highly. He brings in guest lecturers such as Arturo Sandoval and Pop Master Fabel, which are awesome. He also places a huge emphasis on the final project.\"",
            "review 4: \"07F with Douglas Moody: I really enjoyed the course. I learned a lot and was interested in the material and the class discussions. The course was laid-back, as was Prof. Moody. If you are not a very artistic person, and want to fulfill your ART distrib, or even if you don't need to, this is a great course to take.\"",
            "review 5: \"07F with Douglas Moody: since the work load wasn't terribly heavy, I would recommend anyone looking for a fourth course to choose this one. work consists of readings for every class (manageable and some are very interesting), an oral presentation on a reading assingned to you, an iMovie final project and a final paper of 7 pages. this might seem like a lot, but everyone got their work done and Professor Moody is a really fair grader. take this course! it also fulfills an ART distrib, so if you can't draw like me, this is GREAT!\"",
            "review 6: \"07F with Douglas Moody: Professor Moody is an awesome prof who is passionate about his subject matter. The class was discussion based, with students presenting on the material and leading the discussion. Readings were optional as you did not have to read them in order to participate but could rather draw on personal experience or observations. I would recommend this class. It's not much work and it's pretty interesting.\"",
            "review 7: \"02S with Douglas Moody: Fantastic course if you are at all interested in 1 - concepts of identity through various mediums (film, music, art, internet) 2 - questioning identity, hybrids of cultures and races 3 - discussing with your peers during class 4 - questioning stereotypes, how to change them 5- who is art for? who creates it? Not a class for the shy of public speaking, be prepared to debate varying issues with other students who may share very extreme views. Discussion based course with a good deal of personal experience and interesting assortment of readings being brough to class.\""
        ]
    },
    "LATS040": {
        "Richard Wright": [],
        "Sunmin Kim": []
    },
    "LATS007": {
        "Dennis M.": [
            "review 1: \"07W with Dennis M.: Some of the books we read in this class were good but the class \"discussions\" were awful. There was no discussion at all and Professor Runnels talked the entire time about irrelevant topics. Professor Runnels failed to do any teaching the entire term.\"",
            "review 2: \"06W with Dennis M.: I was planning to drop the course when I received the syllabus and saw the amount of work we have the first few weeks, which is loaded with reading, response papers, and a few analysis paper. But I am glad I didn't, because the course becomes really easy in the middle to the end of term. The response papers are actually not tough when you know that he is not going to grade any of them. And the prof gives better grades for what my other profs would have given and he is really lenient with attendance considering it is a fs.\""
        ],
        "Marcela Di Blasi": []
    },
    "LATS005": {
        "Christina Gomez": [
            "review 1: \"04X with Christina Gomez: This class was really interesting. Professor Gomez is great and really passionate about the subject matter. There is a lot of reading but tests and papers are fairly easy.\"",
            "review 2: \"02X with Christina Gomez: I took the course for a SOC distrib and the prof was great... the work load was not too heavy and I thought it was a wonderful summer class, even though I hate reading in general. If I still needed another humanities class, I'd definitely take another one with Professor Gomez\"",
            "review 3: \"02X with Christina Gomez: This was an absolutely awesome class. The material was all very interesting and informative, and the professor inspired me to keep up in the class. She is an excellent professor with much passion and knowledge and teaches the class with vigor. If you take the class just because of the professor, WELL DONE on your part!! The class itself had outstanding readings and really prepared me for class. I actually read most of all of the books, completing a couple, and I usually don't read much at all (a few chapters). I loved this class, and I learned a heck of a lot, and I extremely recommend you take the class!!!\""
        ],
        "Marcela Di Blasi": [
            "review 1: \"21F with Marcela Di Blasi: She didn't care about anyone. This class was unorganized and she often would come to class late. She doesn't give feedback on any assignments, and she grades you arbitrarily. If she likes you, then she will give you a better grade. She apparently gives out only 2 A's per term, whereas everyone else gets an A-, B+, or a B. She is rude and I felt like this class was such a waste. I would never recommend this class. There was a ton of reading and she doesn't reply to emails. She doesn't even remember the pages that she assigns. If you want to learn, this class isn't for you. It consists of pure discussion and she doesn't even do the reading, maybe 20 years ago.\""
        ]
    },
    "LATS003": {
        "Matthew Garcia": [
            "review 1: \"23W with Matthew Garcia: Garcia seems like a nice guy. However, I found this class to be more difficult than expected due to the focus he put on his personal political beliefs. This became especially pronounced towards the end of the term. He also didn't make expectations for assignments to be very clear. The first two weeks of the course were interesting and the rest... I'd say to take this if you're interested in majoring in lats but most of the course isn't even focused on that. Garcia also got extremely made at our class towards the end of the term and blasted us with a canvas announcement. Barring a major revision to the course, I would recommend avoiding it.\"",
            "review 2: \"23F with Matthew Garcia: Do not take this course. No longer a layup. Grading is oddly skewed. If you want to do well make sure you go to office hours.\"",
            "review 3: \"21W with Matthew Garcia: Took it remotely with Garcia, was super chill. Had weekly lectures to watch and readings and one discussion post a week. Beyond that had 3 medium sized assignments throughout the term and that was it. Garcia seemed like a great prof, didn't get that much time one-on-one just from the nature of the course but I'd recommend him.\""
        ],
        "Andre Pagliarini": [
            "review 1: \"20F with Andre Pagliarini: Took this online. Was asynchronous but a lot of work with NO prerecorded lectures. Grades were completion based so everyone who did the assignments was given full credit and A's. But a looottt of work. 3-page discussion essay on the readings due every week. About 50-100 pages of readings on top of 2 films almost every week. Further, current events digest discussion due every week. You choose a country and find an article and discuss it on canvas. You also had to reply to one other discussion. There were also 2 films to watch almost every other week. Once again, another long discussion post on the films and reply to 2 other discussions. On top of that, there were 4 papers. 2 5-page papers, a final paper, and a 3-5 page current events digest paper where you basically summarize your discussion posts and relate them to the readings. The papers were not that bad but the sheer volume of posts, papers, and discussions are pretty time-consuming. Pretty good class. You learn about Latin America, the term Latinx, and the Latin experience of immigrants and their kids in America. Overall, a class everyone gets an A, but the sooo much work. Thank god to was online!\""
        ],
        "Marcela Di Blasi": [
            "review 1: \"21F with Marcela Di Blasi: The course and professor were great. The class was based on group discussions of novels, while relating the works to core concepts and themes of Latinidad. The class was entertaining and the work never seemed to be a burden. Most assignments were based on creative writing and one's ability to demonstrate comprehension of the relevant novel. I really enjoyed the course, Professor Di Blasi did an outstanding job teaching it, and I would highly recommend enrolling.\""
        ],
        "Bryan Winston": []
    },
    "LAT087": {
        "Hakan Tell": [],
        "Lindsay Whaley": [],
        "Margaret Graver": [],
        "Paul Christesen": []
    },
    "LAT085": {
        "Hakan Tell": [],
        "Lindsay Whaley": [],
        "Margaret Graver": [],
        "Paul Christesen": []
    },
    "LAT028": {
        "Edward Bradley": [
            "review 1: \"04F with Edward Bradley: very interesting material, pretty fast-paced and homework must be done pretty thoroughly, but bradley is excellent, the very picture of old New England intelligentsia. always engaging and often relates course material to his many stories (ie when he saw winston churchill or shot a duck as a boy)\"",
            "review 2: \"04F with Edward Bradley: Although I thought the pace to be a little fast, the material was interesting and Bradley knows it cover to cover. Great upper-level Latin course, though if you're not serious about the language I'd say stay away.\"",
            "review 3: \"02F with Edward Bradley: Professor Bradley is a great professor. He truly understands the material and, though at times he did assume students knew more than they did, tried to push forward in a way that both he and his students would enjoy. His selections for translation were sometimes important (boring) but more often interesting, beautiful, or even fun. Yes, Latin can be fun!\"",
            "review 4: \"02F with Edward Bradley: Though at times Prof. Bradley may seem to go off on tangents - they were always very interesting and showed just how much he knew about Classics. Prof. Bradley is definitely one of the best professors at Dartmouth. He was incredibly knowledgable, helpful, and always available in office hours. As for the course - the material was sometimes obscure and difficult to get through...but rewarding once you got through it. I had little experience with literature of this period (Late Empire/Middle Ages), and this course is an excellent survey of the various types of works spanning this era. A must for any Classics major...\"",
            "review 5: \"02F with Edward Bradley: This class was enjoyable the whole way through. Professor Bradley is so knowledgeable, and few of my classes at Dartmouth have been as worthwhile. We were just required to prepare for each class by translating a specified section of the text, and a final paper (we could choose our own topics) was also a requirement. I highly recommend this class!\""
        ],
        "Marie-Claire Beaulieu": [
            "review 1: \"09S with Marie-Claire Beaulieu: This class was different in that the medieval Latin that you read here is quite different from the other types of Latin that you'll see in Latin lit classes. There was a lot of work near the end of the term, in that there was a presentation, final, and a final paper, but as long as you budgeted your time well it wasn't be a problem. Prof. Beaulieu was really into grammar, so the tests had a lot of grammar questions, but the exams were pretty straightforward and as long as you did the homework the class was doable and interesting, even if the Latin is different from what you're used to.\""
        ],
        "Monika Otter": [
            "review 1: \"07S with Monika Otter: The class is a lot of fun if you're interested in the topic... Professor Otter is great (Medieval literature, Latin and otherwise, is her area of expertise-- she's an English/CompLit prof technically) and the reading is really interesting. Be prepared to do significant work translating outside of class, but if you do that you'll be fine for class. Also, Prof. Otter is very strict about missing class, so plan on going!\""
        ],
        "Thomas Hendrickson": []
    },
    "LAT026": {
        "Margaret Graver": []
    },
    "LAT024": {
        "Christopher van": [
            "review 1: \"08W with Christopher van: The only problems with the class were a) it was during winter term, so we didn't have that much time to discuss the cultural aspect of the literature b) the professor was out job-hunting during this term and had to miss a few classes (since the class met only 2x a week, it strongly affected the class). The professor is a visiting professor, though, so the next time the course is taught it will probably be different. My Latin certainly improved.\"",
            "review 2: \"08W with Christopher van: I took this class for my culminating experience and it was probably the easiest Latin class I've taken at Dartmouth. The translation was very manageable- about 150 lines per week and the quizzes, though they were supposed to be cumulative, were always from the section we had just read and included translation passages and 1 grammar point. There were 4 quizzes, a midterm with a few easy questions about content of the english reading, and a final (not reasearch) paper about any topic. Chris was always available but set up the course to be too ambitious. At the beginning of the class he seemed to have a good plan on teaching how the fasti related to other roman themes but we spent the vast majority of time just translating so we would get through it all. Overall not bad though. I enjoyed going to class- it was pretty straightforward.\"",
            "review 3: \"08W with Christopher van: ok so the book we read was ridiculously boring, but van den berg def made up for it by being the easiest prof ever. def take latin with him.\""
        ],
        "Holly Haynes": [
            "review 1: \"05S with Holly Haynes: When it comes to in-class translation (either of prepared translations or translations at sight) Professor Haynes is a hardcore grammarian. So if you didn't know how to translate Latin reasonably well coming in, she will fix you by the end of the term. I'm a stronger translator because of her. Her knowledge of the material and many of the texts' allusions is strong, though I wouldn't say \"impressive.\" She misses a lot of classes because of \"head colds,\" and then she can be seen later than evening partying at India Queen or the Canoe Club, which I've heard is quite a disturbing sight. But no matter, because you get the day off of class probably 5 times a term. All that aside, I very much like the Latin she chooses for us to read, and I feel comfortable learning how to translate better from her.\"",
            "review 2: \"05S with Holly Haynes: Professor Haynes is great! She is extremely laid back yet very informed about the subject. She wants you to get the material, struggle with it, and eventually learn it. She's flexible and every once in awhile decides to cancel class, which can be a real boon. Do it!\"",
            "review 3: \"05S with Holly Haynes: I was originally looking forward to a class just on Ovid, which is what was described in the ORC but it turned out great that we had such a variety. We read Ovid, Propertius, Livy, Virgil, Horace, and a couple others. The class was supposed to be graded on heavy participation, which meant doing the translations for homework, quizzes after every author (6), and a final. However, after the first 2 quizzes, Professor Haynes just made the quizzes optional if you wanted to improve your quiz grade. The final ended up being take home also. She assigned A LOT of reading for homework but after a while you learned about how much we would go through in class and since the final was a sight translation, it wasn't necessary to get all the way through the homework. Professor Haynes really knows her Latin and I had a great time in this class. I definitely recommend!!!\""
        ],
        "Robert Cioffi": []
    },
    "LAT022": {
        "Margaret Graver": [
            "review 1: \"06F with Margaret Graver: This course centered around Lucretius' De Rerum Natura, On the Nature of Things. The reading could get rather dense at times, but the translations weren't too difficult if you are experienced at Latin. Prof. Graver does a great job to make herself available for students that need help with the material. Even as a first year, don't be afraid to take this class if you place in Latin 22. It's definitely worth taking if you're interested in Latin literature.\"",
            "review 2: \"05F with Margaret Graver: Professor Graver centered the focus of the course around a study of friendship in the Roman Republic. I would never have thought, coming into the course, that the material would have been so deep and engaging. She has some expertise in the subject too, having written a book and articles on the subject. She's great and does a great job of forcing you to learn Latin while studying something much deeper. It was a great class, even though it falls third for me behind Bradley's Vergil course and Bradley's Medieval Latin course. I love you, Edward!!!\"",
            "review 3: \"05F with Margaret Graver: You should probably only take this class if you are really interested in Latin and analyzing one theme to death. Professor Graver was extremely helpful and really cares about making sure you don't fall behind. She schedules conferences to talk about how everything is going and lets freshmen re-write papers with no penalty. If you really like Latin and possibly want to major or minor in it, then you should take this class- otherwise, you probably don't want to put yourself through it.\"",
            "review 4: \"05F with Margaret Graver: I actually did enjoy this class a lot. For a 10A, it went by really quickly and I liked that we usually split it up into an hour of lecture/discussion about friendship and then an hour of translation. The course was split up into 5 units. The first 2 related to Cicero's letters to his friends, the 3rd was Catullus' poetry, and the last 2 were Cicero's philosophical writings about friendship (the De Amicitia). At the end of each unit there was a short quiz which had a couple of translation sections and then short answer questions or IDs from the lecture part of the class/readings. The grade was also based on 3 essays- 2 3-4 page papers and a 10 page research paper at the end (only 1 of which actually involved close analysis of latin- the other 2 were more philosophical). There was also a 20 minute oral report midway through the class that invovled researching a certain friend of Cicero. The grading was not difficult and Professor Graver always told us what she was looking for. I guess why I was surprised by the course was the amount of time we spent talking about Epicureanism/Stoicism etc. instead of reading latin. There was almost no grammar discussed but she expects you to know it so make sure you have a good background in the basics before taking the course. Also, even though in theory the class only met 2 times a week, it was more like 4 times because on wednesdays either the x-hour was used or we had to have conferences with her (which were good to get to know her but not always helpful, although she is more than willing to read papers before the due date) and the quizzes were taken on our own time on fridays usually. Overall, not a bad latin course and a good professor. But just know that you will spend just as much time learning/reading about history/ideas as you will studying the latin.\"",
            "review 5: \"03F with Margaret Graver: This was a very nice course. I took it not having done Latin since high school, and without actually placing out of Latin 10. I just kinda skipped that one because I really like Lucretius. After doing the intro stuff from books 1 and some of 2, you really get to focus on what you want. The class looked at a section on erotic love in 4 and one on the plague at the end of 6. You also do individual work; a close reading of one section, such as atomic physics, free will, mortality, fear of the gods, evolution, anthropology, anatomy (it's all in there), and then a final paper that you can relate to the first paper (I did, it makes life easy). The workload isn't too bad, and there aren't too many curveballs in the Latin. There are weekly quizes, which sound like a pain but actually are quite nice since they never cover more than 2 days of lines.\"",
            "review 6: \"03F with Margaret Graver: I liked the class a lot, but I only recommend it to people who are pretty interested in the subject material or enjoy working with latin.\""
        ],
        "Holly Haynes": [
            "review 1: \"05W with Holly Haynes: This class is not very stressful, because we dont have midterms or finals. We had one, 2-3 page paper due at the end of the term. Besides that, it's basically just doing about 60 lines of translations for every class, which isnt really that bad. Haynes picks favorites though... and they always seem to be guys...\"",
            "review 2: \"05W with Holly Haynes: I had a blast in this class, but mostly because there were a lot of fun people taking it with me. Prof. Haynes is generally a solid prof, but her style can be frustrating: she wanted to teach us effective methods for sight translation and gave us a lot of practice at that, which I did appreciate, but we didn't always get through the material she wanted to get through and I don't think we discussed the material we were reading enough. It was a fun class, but probably not the most intellectually stimulating class out there.\"",
            "review 3: \"05W with Holly Haynes: The course material is very interesting and you cover a very wide range of texts too. the ORC description is right on in terms of authors. Prof Haynes is funny and full of energy. she assigns an unrealistic amount of lines for homework but rarely was all of it covered in the next class. so the work load is not terrible, no final, only a short paper.\"",
            "review 4: \"05W with Holly Haynes: It was more or less what I was expecting, and so was Professor Haynes. She expected a reasonable amount of work and effort from her students. She got a little less than she was hoping for, but I think that's not unusual. Though this time period was clearly not her specialty, she enjoyed teaching it, and made it enjoyable for us. The selection of readings was interesting, and she's a solid translator/grammarian.\""
        ],
        "Christopher van": [
            "review 1: \"07F with Christopher van: This course was pretty generous as far as upper level Classical Lit classes. Prof. van den Berg was really easy to talk to and really fair in terms of evaluations. The material, Terence's \"Eunuchus,\" was a little dry and the class discussions were not spectacular, but otherwise this was a pretty stress-free class that was definitely worth taking.\"",
            "review 2: \"07F with Christopher van: I enjoyed the class. Prof. van den berg was a great prof; very easygoing and approachable. I learned a lot, and I feel like the pace was just right so that I wasn't dying, but I feel like my reading skills improved.\"",
            "review 3: \"07F with Christopher van: Latin 22 was not difficult so long as one completed the assigned translations. Much of this course and its level of difficulty depended on the professor. This was van den Berg's first term at Dartmouth, and so much of the term was spent testing things out and finding systems the worked. Van den Berg is extremely knowledgeable and had very much insight to add. The weekly quizzes were pretty easy and he was lenient with grading throughout the term.\""
        ],
        "Patrick Glauthier": []
    },
    "LAT020": {
        "Edward Bradley": [
            "review 1: \"06W with Edward Bradley: Bradley is one of the best profs I've had at Dartmouth.\"",
            "review 2: \"06W with Edward Bradley: This was my least favorite latin class i have taken at dartmouth. My main problem with the class was that it seemed to be more english/theme oriented than actually concentrating on latin. while we did translate a lot in class, during the term there was no grading on how well we could do the latin. Our grades were based on 2-3 1 page analyses of the Latin for the day and there was a 2 hour midterm in which we had to write an essay about the use of the word for \"pity\" in the book. The final was more latin based and we had to be able to translate any 15 or so lines from book 12 and read with the meter. There were 100 lines to translate for each class and even though the latin isnt too hard, it took a while to do it all, which i would recommend doing since prof. bradley often called on random people to translate. it was also too similar to classics 5 in which we read the aeneid in english. if you're looking for a latin class that focuses on latin, this isn't the one to take.\""
        ],
        "Ariane Schwartz": [
            "review 1: \"12F with Ariane Schwartz: Course: I would recommend the course if you like Horace. Not sure if it'll ever be taught again since she's a visiting prof. Class could be dull but it had its moments. I especially loved seeing all the complexities and intertextual references hidden in his odes and epodes. Workload was fairly heavy but the Latin wasn't bad, especially after the epodes. We did nearly all the epodes and 30+ odes, as well as the carmen saeculare in its entirety. Professor: She was very nice but a little dull. Clearly a master of Horace, however. He was the subject of her phD thesis. She's very straightforward and a fairly easy grader when it comes to essays. My only complaint is that others in class were clearly not doing work yet the median came back as an A and my own grade felt less significant because of the easy grading. Workload: Workload was fairly heavy but the Latin wasn't bad, especially after the epodes. We did nearly all the epodes and 30+ odes, as well as the carmen saeculare in its entirety.\""
        ],
        "Margaret Graver": [
            "review 1: \"07W with Margaret Graver: I really liked the subject matter for the class- it was a study of Virgil's Eclogues and Horace's Epodes during a tumultuous time in Roman History. It was pretty much your typical latin class- translation for every class, a translation quiz after every poem, and a few writing assignments. I really liked the topics for the writing and felt that they were original- we had to do an apparatus criticus study, an assignment on different translations of a poem, and an oral project on one of the epodes. There was also a longer final paper. The grading was tough but not terrible and Graver is super organized and knows what she is talking about. My only concern was that sometimes I felt like we left it really open ended- we would discuss a poem for a whole class and different interpretations but never really conclude anything. I wish we had maybe done a little less translation and a little bit more english reading to see how scholars interpreted the work. Defintiely take the class though- the poems are crazy!\""
        ],
        "Patrick Glauthier": [
            "review 1: \"21F with Patrick Glauthier: I don't know what's going on with the course numbering system in the Classics department, this review should be in LAT 24.01 but apparently it was listed as LAT 20 in 21F. Whatevs. Anyway Glauthier is literally the most amazing professor. Because it was such a small class (about 10 or so) we really got to engage in good lighthearted but still intellectual discussions over the minutia of the Latin, variations between different translations and transcriptions, word origins, etc. Glauthier even shared with us a not-yet-published article he wrote about metempsychosis in the Annales, which was very cool. We had about 60 lines to translate at the start of the class, which steadily ramped up to 100 at the end of the term. There were two short essays over the course of the term, one on the origins and prior tellings of a myth in the Met (yes, the Metamorphoses, not the Aeneid, weird numbering) and another that was a literary/Latin analysis of a myth. There were a few options for the final project - I ended up writing an academic commentary for a short section of the Met which is to date the most incredible thing I have produced, but you could also write an essay or generate a new interpretation of a myth.\""
        ],
        "Sarah McCallum": []
    },
    "LAT010": {
        "Jennifer Lynn": [
            "review 1: \"22W with Jennifer Lynn: Great class, not much work at all, and Lynn has infectious energy and passion about the subject. We also had some fun trips to the book arts workshop and rauner! Would recommend this class to anyone with decent latin\"",
            "review 2: \"20F with Jennifer Lynn: Professor Lynn is AMAZING! She is enthusiastic, helpful, and overall a great person. She is most certainly an expert when it comes to the material, but she is very approachable and down-to-earth. She genuinely wants to see her students succeed and enjoy Latin. She gives students the opportunity to get additional help in the form of office hours and Help Desk (she is usually the prof hosting it). Her class is very focused on translations and grammar, but she makes it fun with the class format (i.e. group work). It's not hard to do well if you put the work in to understand the grammar and material. Definitely take this class!\"",
            "review 3: \"20F with Jennifer Lynn: Great way to get a LIT distrib! Professor Lynn is super knowledgable, passionate, and approachable on this. The amount of homework is quite manageable, and I can tell that Prof. Lynn really cares about her students learning. The Learning Fellows are also super helpful. For the midterm we did a translation in small groups, and we will have a similar thing for the final. (No exams because of online learning and cheating). You can go to Latin help desk and get your homework done there for a guaranteed A, I really loved this class!\"",
            "review 4: \"20F with Jennifer Lynn: Professor Lynn is an eccentric person, but overall is great! Latin can get very boring and she definitely finds ways to keep it interesting. As someone who took the class for the sole purpose of completing the language requirement, I can say it is a solid move and was not very challenging or stressful, and my latin definitely improved over the course of the term. Prof Lynn talks a LOT and can get off track and run over class time but overall is a great woman.\"",
            "review 5: \"19S with Jennifer Lynn: Prof Lynn is a great teacher. She really cares about having her students learn the material, is super approachable, and will make time to help you out in office hours if need be. Her classes are super interesting because she always has some wild story to tell about her horses. Nevertheless, we still get a lot done. The pace of the class is entirely dependent on the people in it, so she picks up or slows down accordingly. I would highly recommend this course with her; if you work hard and show up, you will emerge with a good grade.\"",
            "review 6: \"19S with Jennifer Lynn: Professor Lynn is very nice, outgoing, and knowledgeable when it comes to her teaching. The class consists mostly of written or online homework assignments, occasional quizzes, and a midterm and a final as the \"big\" exams (although they don't constitute an unreasonably large amount of the grade). None of the work is overly difficult or tricky, as Professor Lynn genuinely wants all of her students to do well and to gain exposure to a variety of Latin authors and the remaining grammatical forms before progressing to more advanced courses that require greater facility with the language. As long as you do the homework and participate/learn in class, there's no reason you can't get an A.\"",
            "review 7: \"19F with Jennifer Lynn: Professor Lynn is awesome! She's super enthusiastic about the material and cares that everybody in her class does well. Class was always fun and entertaining, the workload wasn't overwhelming, and the tests were on the easy side. Probably the most fun I've had in a Dartmouth class! Definitely take this class, even if you're not super interested in Latin or classics, its worth your time.\""
        ],
        "Margaret Graver": [
            "review 1: \"05F with Margaret Graver: This is a good class to brush up on Latin with after not doing it for a while. We went over all the grammar gradually as we read Seneca. I feel well-prepared for Latin 20\"",
            "review 2: \"02S with Margaret Graver: Brilliant course and professor! Tremendous and engaging readings. I hadn't done Latin in over one year and yet I caught-up within the week, and then we were rolling! The course was fast-paced, but no one was left behind. I know that one student was struggling at the beginning. After dutifully attending office hours, she was right with the rest of the class. Professor Graver is a Gem!!! TAKE THIS CLASS WITH HER!!!!!\"",
            "review 3: \"02F with Margaret Graver: This fall we read Petronius and Seneca, both fun authors. I felt that the workload was light and the tests were not too difficult. However, the class was also taught at 9am, 4 days a week, and professor Graver, while knowledgable and very nice, had one of those soothing voices that does not command attention that early in the morning. At times I found her to be uninteresting, and frankly, boring. Not to say that she didn't teach us well, but it was a struggle to stay awake in class.\""
        ],
        "Holly Haynes": [
            "review 1: \"04F with Holly Haynes: The big problem with this class was that it wasn't really neccessary to attend class or do homework to get by in the class. Also, Professor Haynes cancelled class a lot at the last minute, which was kind of frustrating. In general though, Professor Haynes is a very nice person and she seems to know what she is talking about in class. She runs classes well when she has them.\"",
            "review 2: \"04F with Holly Haynes: I took this class so that I would be able to take higher level latin classes in future terms. It was a good transition from high school Latin because we reviewed a lot of key grammar points- usually 1 per week. The course was based on learning how to do more sight translation, which appeared on the tests and made them more difficult. There was neither a midterm nor a final but a quiz every 2 weeks. The readings were moderate and occasionally difficult but Professor Haynes made them easy to understand. She was very patient with explanations and really knows Latin and she is very enthusiastic.\""
        ],
        "Antonia Syson": [
            "review 1: \"07S with Antonia Syson: The material in this class moves along pretty quickly, so you need to keep up with it. It was tempting to forget about the translation sections that we didn't cover in class, but the final had a section that speficially focused on material we'd prepared independently. Each class, we would go over the section (usually 15-20 lines) that we had prepared for homework. She goes around and asks each person to work out a translation of the next sentence or phrase. Unless you're incredibly good at remembering vocab and can translate it on the spot, you definitely need to prepare carefully. That being said, she was always willing to help if it was obvious you'd tried. There were quizzes almost every week, which ranged from unprepared translation to sections we'd gone over in class to grammar and vocab exercizes. She tells you what each will focus on, they weren't too difficult, and she drops the lowest grade. The review exercizes assigned as homework don't count as a part of your grade, but it definitely helps to submit them and look over her feedback. Professor Syson was very willing to meet outside of class and go over sections that I'd missed or not understood. She was usually pretty good about addressing questions in class, but I sometimes felt she was more focused on getting through the translation than on making sure we understood the grammar behind it. She was always cheerful and energetic, which absolutely made the class more enjoyable.\"",
            "review 2: \"07S with Antonia Syson: syson is the best prof!! really available to meet with if you need it and her tests are easy.\""
        ],
        "Christopher van": [
            "review 1: \"07F with Christopher van: The reading was interesting, the professor is a nice person and also available outside of class (one of the only profs I've taken a class with who actually checks email on the weekends). The class was entirely quizzes with one midterm and no final, not too difficult, and the reading was challenging without being impossible.\""
        ],
        "Patrick Glauthier": [
            "review 1: \"23W with Patrick Glauthier: Prof Glauthier is such a chill and nice prof. Little work outside of class and chill class (doing translations in small groups). Definitely easy A if you put the smallest amount of effort in.\""
        ],
        "Roberta Stewart": [
            "review 1: \"06S with Roberta Stewart: this year was catullus and cicero with prof. stwart. lots of fun. i took this class without taking latin three after 6 years of HS latin, if you've had 4 years or more of latin the classics department will probably let you skip three to take ten and ten is a lot more fun\""
        ],
        "Bryce Walker": []
    },
    "LAT003": {
        "Timothy Pulju": [
            "review 1: \"08W with Timothy Pulju: This is a solid course and gives you a good grounding in Latin grammar. Pulju is a great teacher; he's funny and he's really good at teaching the material. Best of all, he gives just the right amount of work. A lot of the other Latin profs give you 2 or 3 times as much so you're spending hours every night on work. Homework was only 30-60 minutes a night for me usually.\"",
            "review 2: \"05S with Timothy Pulju: Introductory Latin can be a bit dull; it's a lot of memorization and large amounts of material to be remembered and spouted back, but Prof. Pulju is funny and quirky and definitely efficient in getting through everything. He's fair and helpful with questions, so he makes the intro courses as interesting as they can be. He even showed a clip from Monty Python to demonstrate a certain grammatical point.\"",
            "review 3: \"05S with Timothy Pulju: You might never speak it ever again after you finish this class, but it's an awesome choice, especially for a foriegn language requirement. Latin 3 is the second and last latin class required for the Lang. requirement, and Pulju is an awesome professor to learn from. His philosophy is that the grammar is much harder to look up than the vocabulary though, so he emphasizes that more heavily than some of the other profs, and he's a linguistics professor, which comes across in his classes too. I had him for Latin 1 too. He's a really nice, understanding, knowledgeable and funny prof. Great class-even better than I expected.\"",
            "review 4: \"05S with Timothy Pulju: Professor Pulju laudandus est. His knowledge is truly impressive: he not only teaches latin well, but as a linguist he links what we learn to numerous other languages. His historical anecdotes and sophisticated humor never cease to entertain the class. There's even a facebook group dedicated to him.\"",
            "review 5: \"05S with Timothy Pulju: Just take Latin with Pulju. 'Nuff said. In actuality, Pulju gives a lot of work, but that might be standard for Latin. Latin 3 is MUCH harder than Latin 1, and I took them successively. I cannot imagine people who placed out of Latin 1 taking this class (the ones who did floundered). Seriously, consider Latin 1 first. Other than that, great class. Take it!\"",
            "review 6: \"05S with Timothy Pulju: Prof. Pulju is, above all things, unique. It's worth sitting through ANYTHING to have him as a prof.! That being said, he grades unfairly. One mistake on a quiz will be worth 10%, even if it's one of 40 possible.\"",
            "review 7: \"04W with Timothy Pulju: There is nothign special about the class. YOu have your textbook, the lectures follow the text (which the assignments are directly pulled from), and the exams fairly test the material you read. I assume it isn't much different than any other language course here at Dartmouth, except there are NO DRILLS. That said, Professor Pulju is an awesome teacher, and definitely made the class worthwhile. He's really funny, and knows a pantload about the material, so the result are fairly interesting lectures (despite being about LATIN). I had him for Ling 1 a term earlier, and was so thankful he was teaching latin. Take Pulju at all costs; you won't regret it.\"",
            "review 8: \"04W with Timothy Pulju: Prof Pulju made Latin really enjoyable. Great class!\"",
            "review 9: \"04S with Timothy Pulju: Prof. Pulju is such a great professor. He made Latin very interesting, and was very helpful in explaining the difficult aspects of the language. I highly recommend any class that Prof. Pulju is teaching; he is one of the best professors I have had.\""
        ],
        "Antonia Syson": [
            "review 1: \"08W with Antonia Syson: Professor Syson is an excellent teacher, genuinely interested in helping her students learn and become interested in the course material. Top notch.\"",
            "review 2: \"08W with Antonia Syson: Most of the people are in the class just to fulfill their language requirement. I absolutely hate foreign languages but Syson made this class quite bearable, even interesting at times. Take this class for your language requirement it is good. Syson is a very good prof.\"",
            "review 3: \"07W with Antonia Syson: makes learning latin very interesting or at least makes sitting through class tolerable\"",
            "review 4: \"07W with Antonia Syson: I really liked this class. Professor Syson was so energetic; it gave me motivation to pay attention. great way to finish my language requirement\"",
            "review 5: \"07W with Antonia Syson: Professor Syson is one of the most energetic teachers I've ever had, so every class is interesting. That being said, her lectures can be a bit disorganized, and she will sometimes try to teach rather complex grammatical ideas without adequate introduction. If you're willing to go over the notes and practice on your own, though, this shouldn't be a problem. I liked the structure of the class - unlike Latin 1, quizzes were only given twice a week and we didn't waste large amounts of time going over them. Professor Syson did an excellent job of integrating real Latin readings into the class, and I liked how her focus was more on learning the skills and concepts needed to translate the readings rather than on memorizing every vocabulary we encountered. I feel like I really learned some valuable skills in the class, and that I'm well-prepared for more advanced Latin classes.\"",
            "review 6: \"07W with Antonia Syson: Coming into Latin 3 after having never done Latin at Dartmouth before, I wasn't sure what to expect. Prof Syson however was extremely effective at getting students to quickly progress through material, to reading real latin. She was very accommodating and available outside of class, which ended up being one of her best resources.\""
        ],
        "Paul Christesen": [
            "review 1: \"07W with Paul Christesen: as frustrating as it sometimes was to have a quiz every day, it actually ended up being really helpful in the long run, because it not only helped you learn the material better, but it counted as the majority of your grade, so you could do well on the daily quizzes, but just ok on the exams, but because your overall performance was good, your grade wouldn't end up being too bad.\"",
            "review 2: \"07W with Paul Christesen: Christensen's quizzes require a lot of daily preperation, but they also help you learn the material. I also took Latin I with him, and he was a bit cheerier during that class than he was this term. I think maybe he had some stuff going on, because he seemed irritable. He is generally entertaining though, and makes you want to do your work. All I can say is this class is *a lot of work.* You may not have to go to drill, but the 40 minutes a night you would have spent in drill will be replaced by 2-3 hours of latin homework NIGHTLY. I got a B- in the class and never spent less than 2.5 hours on Latin a night. He randomly calls on people in class, so you cant really get away with not doing this work.\"",
            "review 3: \"06W with Paul Christesen: Latin 3 is not the most exciting course material ever. Wheelock's latin is pretty straightforward though, and if you can learn the chapters, you'll be fine. Christesen gives quizzes everyday, so it's tough to miss class. He is also a very funny person, and likes to ask really random nonsense questions during class to keep people awake. Bottom line, if you need to finish your language requirement or are interested in continuing with latin and you are willing to put in the work, this is an awesome class. If you just want to finish the requirement without too much effort, you might want to choose a different prof.\"",
            "review 4: \"04S with Paul Christesen: prof. Christesen is very energetic (sometimes a lil loopy). GReat PRof! I f your think ing bout taking this class to fulfill your language req. I reccomend it. however while there is DO DRILL, there are daily quizes...so attendance is Imperative! really enjoyed Latin 1 & 3....You definitely have to put in the work.\"",
            "review 5: \"04S with Paul Christesen: Took Latin 3 for my req. but the prof made it much fun. There is lots of work but it really ends up helping out, and it's more tedious rather than hard.\""
        ],
        "Holly Haynes": [
            "review 1: \"05W with Holly Haynes: Much easier if you do the homeworks and translations as they help you learn the material\"",
            "review 2: \"05W with Holly Haynes: compared to my high school latin, this course was really fast. however, because i had already learned the material we were learning (in high school) it was a nice refresher. the others in the class who hadn't had latin before perhaps had more difficulty, but its not impossible in any way. haynes is a good prof too.\"",
            "review 3: \"05W with Holly Haynes: I'm not great at foreign languages to begin with but this class was incredibly difficult. If you have to get a language requirement, i don't know how hard other language courses here are, but this one is extremely difficult. The prof is decent but not helpful if you aren't good at the material.\"",
            "review 4: \"04W with Holly Haynes: She flirted with guys in our class rather than teaching the material.\""
        ],
        "Bryce Walker": [
            "review 1: \"22S with Bryce Walker: Great class, Walker is awesome. The translations can be kinda tough sometimes but Walker + the learning fellows do a good job of helping you through them.\"",
            "review 2: \"21F with Bryce Walker: Latin at Dartmouth is great! Absolutely recommend this class and language to anyone with the slightest interest in learning Latin, or if you just want to check off that language requirement. Latin 3 is not a breeze: there are several homework assignments between every class, and reading real Latin poetry from the textbook is kind of brutal at times, although the Learning Fellows were very helpful with working through it. Professor Walker is super nice, very relaxed, and held a weekly Kahoot every Friday with a candy bar as a prize, which was always worth looking forward to. Overall, a good class and definitely one I'm glad I took.\"",
            "review 3: \"21F with Bryce Walker: Walker is so nice and made this language requirement a lot of fun and even told me he would try to make sure it was as painless as possible. It's worth mentioning that the Latin department recently added in Latin 2 so there are now three courses to take for the language department (the old Latin 10 is now Latin 3 was Latin 10 and Latin 3 is now Latin 2). As a result, this class felt a bit harder than Latin 1 and Latin 2 since we were looking at actual Latin poetry, which has its own bizarre translations and felt trickier than the textbook, but as usual, quizzes are re-takable, Latin help desk is available for homework help and overall it's a pretty easy class. We had a field trip to the Rauner library to see old books written in Latin, which was pretty cool.\""
        ],
        "Simone Oppen": [
            "review 1: \"20W with Simone Oppen: Oppen is perfectly okay as a Latin 3 prof. Latin 3 as a whole is basically identical to Latin 1 except you cover a lot more grammar, which end up being awkwardly rushed into the last week of class. If you know Latin 1, you’ll be fine. It's truly exactly the same. That being said, this was Oppen’s first teaching job and it shows. She was clearly dropped into the middle of a program that she didn’t really know how to teach, and wasn’t always pleased with. As a person, she’s super sweet. You can literally ask her to gloss the entire sentence for you, and she won’t make you feel stupid/get mad at all. She’s a fair grader, and clearly passionate about classics. On the flip side, she dislikes Cambridge Latin and truly at times struggled to figure out the correct balance of telling us how things work and just letting the book do it, which resulted in us having to rely more on the book than I would have liked. But honestly, she won’t make your time in Latin painful or hard. If you’re in her class, there’s really nothing to worry about. Give her another year or two of experience and she’ll be good.\"",
            "review 2: \"20S with Simone Oppen: Prof Oppen is super sweet. The class was really different in an online format but she did her best to teach us. Easy extra credit opportunities showing up to office hours or help desk. Homework is every night but pretty short. The translations do get challenging by the end but you can really buffer your grade with good attendance and homework completion. She is not the easiest prof for latin 3 but she isn't bad and truly has her students backs.\"",
            "review 3: \"20S with Simone Oppen: Pretty easy class as a continuation of Latin 1. Doing the homework/translations is all you need to do to study for the exams and get a decent grade. Professor Oppen was a pretty good professor and very personable, definitely better than the 20W reviews on here.\""
        ],
        "Jennifer Lynn": [
            "review 1: \"21S with Jennifer Lynn: I think the best word to describe this class is meh. Unless you find latin super engaging its a pretty boring class. Every class all we do is go into breakout rooms and translate, which I guess makes sense but it's just boring, not sure if other profs do the same or not. She's also a pretty strict grader, like making you use proper long marks and what not. I took a lot of Latin in high school so she didn't really teach me anything, but can't speak for people who just started taking latin in college. This is literally the most mid basic class; it's not super hard but its not a guaranteed A; it's not that engaging but it also doesn't entirely make you want to fall asleep. Prof is like nice enough.\"",
            "review 2: \"21S with Jennifer Lynn: This class is a layup, Lynn is amazing. Only thing that can suck is if your group for the term sucks. Honestly even with my horrible group I still managed to somewhat enjoy it. Lowkey just made it a meme. Anyways if you're deciding who to take this class with TAKE IT WITH LYNN. If you placed into Latin 3 and are deciding to take this class or a different language TAKE LATIN. Remember there are no drills!!\"",
            "review 3: \"20W with Jennifer Lynn: Professor Lynn is super sweet. I suspect like the majority of the profs teaching LAT 3. A reasonable amount of work. Plus she allowed us to work a week ahead on online assignments. She always has a million stories to tell about her dog, squeaking floors, the temperature in the house, kids, Europe, ancient coins, etc. Ie take LAT 3 even just for fun\""
        ],
        "Patrick Glauthier": [
            "review 1: \"20W with Patrick Glauthier: Prof. Glauthier is a really great Latin 3 Prof; he is really patient and helps you understand sentences if you don't get it at first. He also challenged us to do short English to Latin translations, which really helps you grasp the sentence structure and case usage. Overall, Latin 3 is a very easy course, but Prof. Glauthier makes it enjoyable and interesting.\"",
            "review 2: \"20W with Patrick Glauthier: Super easy class. All quizzes can be taken multiple times at \"Latin Helpdesk\" until you do well enough on them. Tests are very fair and they rarely, if ever, throw something unexpected at you. No drill, but rumor has it Latin will be 3 terms to fulfill the language requirement next year. All of the professors seem to teach the same curriculum and grade similarly.\""
        ],
        "Amanda Loud": [
            "review 1: \"07W with Amanda Loud: Professor Loud had an interesting approach to teaching this course. Very rarely were we taught the concepts we were learning, often times it was left to us to read the chapters and learn the material, afterwards however she spent time making sure we understood what we had in essence taught ourselves. Instead, she used that extra class time to cover aspects of Roman history and culture which was sort of an added bonus. You didn't even have to pay attention to this if you didn't want to but the mid-term and final offered extra credit for Roman history questions. She is very intuitive to the mistakes students make and if she notices something that a couple students are missing in the homework she'll be sure to mention them and make sure everyone is on the same page. After having Professor Christesen for Latin 1 (who is also amazing) I was skeptical at first as Professor Loud has some quirky antics, but she eventually won me over and I had a great time in the course.\"",
            "review 2: \"06S with Amanda Loud: I had Professor Loud for Lain I the previous term, and I am now confident in my Latin abilities. I will be taking Latin 10 because Professor Loud made the class so interesting. I would have NEVER expected to continue in the department, but now I'm a major (Classics, not Latin specifically). If you want to learn great grammar and Latin, take the course. It's a lot of work, but it's worth it.\""
        ],
        "Phyllis Katz": [
            "review 1: \"06W with Phyllis Katz: Professor Katz is awesome. Really nice and responsive. The class is somewhat diverse, consisting of students with extensive high school latin background as well as students with just 1 previous term at Dartmouth. The textbook is great\"",
            "review 2: \"06W with Phyllis Katz: Latin 3 was so much easier for me than Latin 1, and I took both at Dartmouth in consecutive terms. I'm convinced it was the prof that made the difference. Prof. Katz was a wonderful teacher who allowed the class to move at it's own pace, rather than forcing the material at the class at her own designated pace. If you take LAT 3, get Prof. Katz!\""
        ],
        "Samuel Findley": [
            "review 1: \"05W with Samuel Findley: i had latin in high school, and took latin 3 without having taken any other latin at dartmouth. this was tough for the first week, but easy after that\"",
            "review 2: \"05W with Samuel Findley: Great course! The work load is a little above average, but the classes are fun and interesting.\""
        ],
        "Roberta Stewart": [
            "review 1: \"07S with Roberta Stewart: This course could have been rough, but because there were only six students in the class Prof. Stewart took a much more laid back approach which made the work load and material easier to digest.\""
        ],
        "Roger Ulrich": [
            "review 1: \"02W with Roger Ulrich: Boring, pointless and annoying.....not worth suffering through to get your language requirement. Drill at 5am would be better. I am not kidding\""
        ],
        "Edward Bradley": [
            "review 1: \"03W with Edward Bradley: The language requirement at Dartmouth stinks, and it's a major major fraud. I guarantee you that if you gave an editorial in Le Monde to a French major or an editorial in Der Speigel to a German major, etc. and told that person to read it in a half-hour and write a response to it in the foreign language in question in about an hour, he/she would not be able to do it. By all rights, that is not fluency. The only proper way to learn a language is by going and living for at least an entire year in a country where that language is spoken. Learning it back in the US to any degree of respectable fluency requires a dedication to that language (and a forswearing of much interaction in English) that most Dartmouth students can't afford the time for. So if during freshman week you didn't place out of the language requirement or place into Language 2 or 3 in whatever you studied in highschool, Latin is a great way to fulfill the language requirement. The main reasons being: --There is no Latin 2. After you pass Latin 1 you take Latin 3, and after you pass Latin 3 you've fulfilled the language requirement. This means 2 terms of torture (and only 2 wasted course credits which could have been used for more interesting courses) instead of 3. --They do not expect you to be able to speak Latin, for the obvious reason that it's a dead language. This means NO DRILL!!! It also makes the class easier. You are mostly expected to just translate (and 90% of the time it's Latin into English, rather than the other way around). --Wheelock's Latin. This is the textbook that is most often used at Dartmouth. If you can, try to get into a section with a professor who uses Wheelock's Latin. It is a very good textbook. It uses the old-fashioned grammatical approach to teaching a language rather than some of the dipshit methods that a lot of recent language textbooks tend to use while ignoring grammar. --Learning Latin will improve your understanding of English, since a lot of words in English are derived from Latin words. This is one thing that may actually prove useful in terms of overall education, rather than pretending to be fluent after 2 terms and an LSPlay spent shopping and eating at McDonalds in Paris or Berlin or wherever. Latin is not a gut. Latin is one of the most grammatically complicated languages in the Western Hemisphere. It's a lot of work, and it will become extremely difficult if you slip behind even a little bit in the work, especially if you do not keep up with memorizing vocabulary words or become lax with your homework. Latin is also a little faster-paced since it's a two-term sequence rather than a three-term sequence (personally, I think this compression helps to retain what you've learned). If you are a freshmen, you might want to consider putting off taking Latin until your sophomore year and enjoy your freshman year (and you may or may not be better prepared to handle the class after a year of adjusting to Dartmouth)--that's what I did. Having said all of this, Latin is by far the most painless way to fulfill the language requirement if you haven't already placed out of it, or placed into Language 2 or 3 of whatever you took in highschool. Professor Bradley was absolutely amazing. He is one of my favorite professors at Dartmouth, and I say this after having taken only one course with him, in a subject that I loath. Bradley is so incredibly charismatic that he actually made me enjoy the class. Because of him, I was even tempted to go on to take Latin 10, despite not needing it for the language-requirement and the fact that I hate language classes with a passion (in case you hadn't already figured that out). After passing Latin 3, I shedded that particular delusion, but the fact that Bradley even got me tempted to take Latin 10 speaks volumes. Bradley is a fair grader and is an extraordinarily good teacher. I am not sure if it's his teaching method, his personality, or a combination of both, but Bradley is very effective at teaching Latin. He spends most classes going over the homework, and has each student read something aloud in class from his or her homework, and he is very gentle when handling a student who has gotten something hideously wrong. It is this quality in him which makes his students more willing to speak up and try to learn something. Bradley also has a tendency to go off on long tangents about ancient Roman history, which though generally off-topic with respect to actually learning Latin they were usually grounded in some portion of the homework, and it actually made the otherwise-bland homework interesting since Bradley provided background info (don't worry; you're not tested on this info; just your ability to translate Latin). Bradley even assigned one or two really randy poems by Catullus, which were entertaining. What more could you ask for? A class where you study a little bit of ancient pornography! Bradley was somewhat irregular in how often he gave quizzes and collected homework, but his tests and quizzes were quite fair. Latin 3 differs from Latin 1 in that in Latin 1 you're studying most of the really important parts of Latin grammar. In Latin 3, you finish up the last bits of important grammar such as the subjunctive case, and then you get into the more obscure things that you rarely encounter, such as the supine. You are also expected to read an actual non-textbook work of Latin. Bradley had us read a short play by a 12th-century christian nun, and we read this play over the course of several weeks (at the rate of one or two pages per week), so if you did your homework with the play you would be fine. For the same rant about the language requirement and my review of Latin 1, look up Latin 1 in '02F with Prof. Hawthorne.\""
        ],
        "Myles McDonnell": [
            "review 1: \"03S with Myles McDonnell: This prof was cool man. He also taught latin like a smatin. You will get good education here my brotha.\""
        ],
        "Elissa Faro": [
            "review 1: \"09W with Elissa Faro: Prof. Faro is quite humorous and knows how to run class without too much pressure. The class is almost no work provided you pay attention during the lecture and make a bit of an effort to memorize the vocabulary as you go through the book in class.\""
        ],
        "Emilia Barbiero": [],
        "Margaret Graver": [],
        "Margaretha Kramer": [],
        "Neeltje Kuin": [],
        "Robert Cioffi": [],
        "Scott Arcenas": [],
        "Timothy Baker": []
    },
    "LAT001": {
        "Timothy Pulju": [
            "review 1: \"19F with Timothy Pulju: Fantastic athlete friendly class. The book is not just a Latin language book. It has a fascinating story inside. I had satisfied my language requirement before and took the class because of the book. It was well worth it. Class utilizes all extra hours but there is no morning drills. Words quizzes can be tough but in general it is a very straightforward class. Quizzes can be retaken as many times as you wish during pizza hours on Tues/Thurs nights. You get what you get and don't get upset. I think most of us got A- or around it. I've heard later that Professor Walker is fun and gives extra credit what others don't offer. However, Professor Pulju cracks jokes too sometimes. Also he has Minnesoooota accent. I recommend to take it anyway. All the profs were nice and friendly when we went to the cemetery to read thumb stones notes.\"",
            "review 2: \"19F with Timothy Pulju: I took this class just for fun as a layup and ended up enjoying it a lot! If you have a background in any Romance language already, this class is pretty easy - memorizing macrons and the declensions takes some time, but I think in terms of language courses this isn't bad at all (plus no drill!). Pulju is a great prof - he's technically in the Linguistics department and his focus is historical linguistics, so he knows a ton about the history of the Latin language and it's really fascinating. There are small homework assignments every day, but they're totally manageable and really help a lot with solidifying the language. Recommend this for anyone looking for an easy, two-term, no-drill language requirement or if you're just really into learning about Latin in general!\"",
            "review 3: \"08F with Timothy Pulju: pulju is a great prof. quite brilliant. latin is latin, the class is what one would expect it to be.\"",
            "review 4: \"07F with Timothy Pulju: The prof was really great and made the material interesting. Two thumbs up:D\"",
            "review 5: \"05F with Timothy Pulju: The course was a little bit fast, but when there was a need to slow down the prof was always responsive. The class demands a lot of memorising but the prof tries to make it as interesting as possible. On occasion he came out with some funny jokes.\"",
            "review 6: \"05F with Timothy Pulju: Pulju is an excellent teacher but you might do better grade-wise to take it from someone else. He is much more particular about detail than some of the other profs - if you really want to learn, take from him; if you're looking for a good grade, consider someone else. I learned a lot in this class but my grade did not reflect it - the grading policy was high school all over again, and decent but not perfect homework and quiz grades (partially due to missing one or two of the 8:45 classes) pulled down very good grades on the midterms and final. Consider yourself warned.\"",
            "review 7: \"04F with Timothy Pulju: Pulju is brilliant and a very good professor. His vast knowledge and obvious interest in the subject help to make this course both interesting and do-able. I definitely recommend this course to people looking to fulfill the language requriement or expand their vocabularies. It's a considerable amount of work, but homeworks keep you from falling behind and makes tests easier to handle. Overall a very worthwhile class.\"",
            "review 8: \"04F with Timothy Pulju: The course itself was okay. It beats waking up for drill, however, it is very time consuming and a lot of material to learn in 10 weeks.\"",
            "review 9: \"04F with Timothy Pulju: this class wasn't too bad if you're trying to finish your language requirement in 2 years and without a drill. if you're taking it because you think it'll be interesting, make sure you're gonna like latin first.\"",
            "review 10: \"04F with Timothy Pulju: Paced too quickly. It's hard to keep up with all the material unless you work really hard outside of class. Just doing the homework isn't enough to learn everything. The prof doesnt seem to really care much about the students... the lectures are alright.\"",
            "review 11: \"04F with Timothy Pulju: I always had a really hard time learning languages, and was looking for an easy was out of the language requiremnt when i selected this course. Prof. Pulju, however, was amazing and inspired interest in the subject. He, for the most part, made learning latin easy and interesting. I had so much fun learning latin from prof. pulju that now i will probably continue further than just the required courses.\"",
            "review 12: \"03F with Timothy Pulju: This was a pretty good class. I've always been interested in taking Latin but I found the textbook to be pretty boring. However, Professor Pulju is a really funny guy and he definitely made it more interesting. He also went out of his way to stir more interesting, writing up really funny summaries of the history of Rome which definitely livened up the subject. Overall, a decent class, but a great prof.\"",
            "review 13: \"03F with Timothy Pulju: Professor Pulju is awesome and really brought the dead language to life. We moved really fast, but he was realistic with his expectations of us and didn't expect us to know every last piece of vocav, which was nice. Pulju didn't really lecture as much as answer our questions, but it created a good atmosphere of us being motivated to learn the material ourselves. Then we'd ask him questions to solidify the concepts. Worked well, and I really enjoyed the class. Can't wait for Latin 3.\""
        ],
        "Bryce Walker": [
            "review 1: \"23W with Bryce Walker: Sweetest Prof, will go out of his way to help you out even if you skipped class ect. Very easy just a lot of busy work.\"",
            "review 2: \"22W with Bryce Walker: This class is definitely a layup. Just do the work on time (or even most of the work, mostly on time) and go to class (most of the time, you can skip up to like to 3 without it hurting your grade) and you will get an easy A. Also participation is easy because he cold calls on you and helps if you struggle, so I think everyone gets a good participation grade. I also really like professor Walker. He’s a very nice guy, explains the material well, and makes it very easy to ask questions or struggle. I don’t like Latin at all but liked this class. Also there’s no drill. I think everyone should take this class if they want an easy language credit.\"",
            "review 3: \"22F with Bryce Walker: As someone who never took Latin before Dartmouth, I loved this class! Walker is super super fun and engaging and enthusiastic about the material, work was every day but not a lot (20 minutes of homework consistently every day in the form of canvas translations and easy quizzes), and you actually learn a lot of latin (I was surprised at how much I knew by the end of it). If you're looking for a language to take, definitely try Latin!\"",
            "review 4: \"21F with Bryce Walker: Walker is the best, this class is a layup, plus there's no drill. Pretty much everything you could hope for in a language class\"",
            "review 5: \"20W with Bryce Walker: This class was a layup. The content is interesting. In class you pretty much just do translations as a large group. This can be stressful but he will help guide you to the right answer if you are struggling. He is very open to having the class work as a team on translations so nobody is singled out for too long. There is homework every night but never more than an hour of work (on average maybe 20 minutes). The TAs are helpful and help desk will be a lifesaver if you ever don't get a chance to prep for a quiz and end up with a 2/10. Prof Walker is great for students who want to learn latin without constantly being stressed about a grade or macrons.\"",
            "review 6: \"20F with Bryce Walker: Take this class, and take it with Walker! Do you want a class with a great prof that is both easy and interesting? Look no further. There is homework for every class, but each assignment is relatively straightforward. Despite the difficulties of Zoom, Prof Walker made the class engaging and exciting. He is easily one of the best profs I have had at Dartmouth. Also shoutout to the TA, Duncan. Unlike my other classes, I actually enjoyed logging on for this one. You can get an A with not much effort, especially if you have prior experience with a Romance language. Even if you don't, I would still highly recommend this course!\"",
            "review 7: \"19W with Bryce Walker: Walker is so chill and this class is so easy. Requires small amounts of time on daily assignments and attendance is mandatory. For every assessment there is a \"sample\" posted in advance which is pretty much identical to the quiz or test. Overall, if you put in a little bit of work you will easily get an A.\"",
            "review 8: \"19F with Bryce Walker: Took this class mainly because it doesn't have drill and is only two terms. As all the other reviews have said, Walker is really chill and the class is pretty painless. There's homework every day, but it's mostly busywork to help you renforce concepts you've learned in class. I'm actually surprised how much I enjoyed this class. The textbook has odd and very entertaining stories, but you do need to pay attention in class to get clear explanations of the grammar. Exams are very straight forward and no one is out to get you. I highly recommend if you need a language requirement, don't want to put in massive amounts of effort, but also want to enjoy the class you're taking. It's fun.\"",
            "review 9: \"19F with Bryce Walker: Please Read *** If you are planning on taking LAT 001, please take it with Professor Walker. He is probably one of the best professors I've ever had in Dartmouth. Besides being super chill, he makes sure that every student is learning the content in class. This class has homework every single day, but they're relatively easy and is totally manageable to do them. You will have to take several quizzes (probably 3 quizzes a week), but if you did not do so well, you're welcome to retake the quiz as many times as you want in Latin Help Desk ( PS: THEY GIVE YOU PIZZA!!)\"",
            "review 10: \"18F with Bryce Walker: Best class ever, but only take it with Walker. Super chill guy and very good lecturer. I heard other profs can be pretty tough, but Walker made certain homework assignments extra credit towards the end of the term.\"",
            "review 11: \"18F with Bryce Walker: if you're smart take it with walker, a true chiller, makes the class bearable. In class translations, daily homework that doesn't take long (esp for a language). If you're looking to get a language requirement out the way this is the class for you\""
        ],
        "Paul Christesen": [
            "review 1: \"07F with Paul Christesen: the class was great because prof. christesen was really good about making sure that we learned the material but there was so much work for the class. there were written exercises due for each day and a quiz each class. at the end of each week we had to turn in the entire workbook sections for the chapters covered which would take several hours to complete. i liked the class because it was very thorough and definitely filled in the gaps in what i knew (two years from high school), just took so much time outside of class.\"",
            "review 2: \"07F with Paul Christesen: This course requires a lot of work. There are classly quizzes and homework assignments. Homework can take anywhere from an hour to 3 hours. Every X-hour is used. The class has to be a priority or you will fall behind. With that said, it was fun, I really enjoyed learning the Latin, and I feel that it greatly improved my english vocabulary and grammar.\"",
            "review 3: \"07F with Paul Christesen: Not a bad course if you go every time and are willing to spend 20+ hours a week on it. Class consists of a quiz every day, going over homework and a very brief lecture. If you have a hard class or another class that requires a lot of time do not take this course.\"",
            "review 4: \"07F with Paul Christesen: Latin is a good way to fulfill the language requirement because you pick up so much about the romance languages. You are also able to analyze the basic meanings of English and dissect its origins by learning Latin. Latin 1 with Christesen will no doubt be an experience; he makes learning contagious, is witty, and very devoted. The course provides a breadth of knowledge to be gained by the student, but that comes at the expense of much stress and toil. Also, beware not to miss classes because Christesen may seem lenient with his attendance policy, but he is actually very harsh (he allowed virtually no make-up work/quizzes). But on the whole a well-recommended course.\"",
            "review 5: \"07F with Paul Christesen: This class is a lot of work but it also makes you learn latin very quickly. The daily quizzes, while annoying, make it very easy to stay on top of the work. The rest of the homework is basically translations and quite boring. If you are an athlete, beware of Christensen. In his description his attendance policy sounds good but in reality when I had to miss class for games, he gave me zeros on the day with no opportunity to make the assignments up. This is even after I talked to him about making up the assignments well before the missed classes. Overall this is a good class to take for your language requirement but it does require quite a bit of work.\"",
            "review 6: \"06F with Paul Christesen: If you're looking for a language requirement that doesn't involve drill Latin is the class for you, especially if you take it with Christesen. Christesen is extremely energetic and has a passion for teaching classics. He's fluent in many different languages and puts learning latin into a great perspective. The course moves very quickly but it's all memorization. There is a quiz everyday on the previous chapter but it's an easy way to boost your grade. If you have an A going into the final you're exempt! I highly recomment taking this course with Christesen, he's a great guy and will go to any length to help you learn the material. He's also got a great, albeit weird, sense of humor.\"",
            "review 7: \"06F with Paul Christesen: Christesen made the class. I do not recommend taking Latin with a different professor unless you really hate drill.\"",
            "review 8: \"06F with Paul Christesen: Be prepared to do a lot of work in this class. You may not have to go to drill, but you will spend twice that time on homework. I also took two terms of Spanish here and Spanish is probably half the amount of homework as Latin. Christensen gives a quiz every day, and your quiz average is basically your final grade in the class. Midterm and Final can make your grade go up from a B to a B+ maybe if you do super well, or down from a B to a B- if you do miserably, but dont worry about them too much. They are SUPER long and YOU NEED TO KNOW VOCAB AND PRINCIPAL PARTS for them, but like I said, they dont count for much, so whatever. If you are the kind of person who gets As in everything you do, or As without much effort, then definitely take the class with Christensen. If you have an A average on your quizzes at the end of the term, you dont have to take the final-- definitely makes finals term much more managable.\"",
            "review 9: \"01F with Paul Christesen: Latin 1 is pretty straightforward. Don't get behind in the homework assignments and you'll do just fine. It's an entirely self-taught class, but I wouldn't want to take it with anyone but Christesen because he's damn amusing.\"",
            "review 10: \"01F with Paul Christesen: Can you really expect to enjoy learning a dead language? Well, no, but with Professor Christesen it's somehow almost exciting! He is a fantastic professor. He has meetings with all of his students so that he can get to know them, and he really cares about them. He gives daily quizzes, which sounded horrible to me at first, but which really helped me learn the material. (Plus I realized that HE has to grade/correct ALL of those quizzes daily, which proves how hard he works to help his students.) He also calls on everyone in class to make sure that they're doing the work, but he doesn't make you feel stupid if you don't know the answer. He uses phrases like \"Great!\" even if you are butchering your translations. Also, while teaching, he can be pretty funny. I really kind of enjoyed Latin, and the best part is that because I took Latin I from Professor Christesen, Latin III was almost no work at all. You don't have to take Latin I, but please, please, please take a course with Professor Christesen sometime. You will be so glad that you did! He is honestly the best professor I have ever had at Dartmouth!\""
        ],
        "Jennifer Lynn": [
            "review 1: \"24W with Jennifer Lynn: Lynn is great! As someone without any background in Latin, this was a wonderful experience. I hear Lynn is stricter than the other professor, but I personally preferred this because I felt like I learned a lot. I highly recommend this class for anyone looking for an easy Language Credit.\"",
            "review 2: \"21F with Jennifer Lynn: A lot of hw every week but the class is not hard if you do the work. Classes are pretty repetitive as we just do group translations every day but not too boring.\"",
            "review 3: \"20F with Jennifer Lynn: Awesome professor and layup language class if you're looking to get out of the language requirement. It's very easy to get an A if you put in the work and the class is very well-structured, making it a great transition to the online format.\"",
            "review 4: \"19F with Jennifer Lynn: Prof. Lynn is a great teacher! She's super sweet and really great at explaining Latin grammar and concepts. All of the Latin classes have the same homework and quizzes (with samples posted before) because we all share the same Canvas page. Latin is comparatively the most painless way to get your language requirement out of the way - it's very easy to get an A in the class and there's no drill.\"",
            "review 5: \"19F with Jennifer Lynn: Professor Lynn is so full of energy and life and definitely makes Latin 1 a painless language class for anyone trying to get it done without drill. She has so much passion for the subject and constantly provides helpful ways to understand the material. There are also two learning fellows to help during class when we have translations who usually quite nice. Finally, there's Latin Help desk, which is a god sent. You can retake quizzes, do homework with learning fellow help and eat pizza. Honestly, one of the best structured and least stressful classes I've taken!\"",
            "review 6: \"19F with Jennifer Lynn: Professor Lynn is so energetic and fun, she makes class enjoyable. Quizzes are almost weekly but most, excluding vocab and conjugation, are simple memorization. Latin is really easy to learn as long as you don't fall behind.\"",
            "review 7: \"19F with Jennifer Lynn: There are so many small assignments that are easy to miss, but that also ensures that you are going to get a good grade, basically. It's a lot of work every day, but that means that you really don't have to prepare that much for the midterm and the final. You can literally resist every quiz as many times as you want. Her dog is so cute, and she is so kind and engaging - she definitely makes the class a lot of fun, and I was really glad that I took it.\"",
            "review 8: \"18F with Jennifer Lynn: Prof Lynn is SUPER energetic; really enthusiastic and passionate about Latin and it shows. Not a hard class at all — there are daily hw assignments but they're short and shouldn't take too long, lots of short but easy in-class quizzes (memorization based), midterm was fine. Class usually consists of reading one Latin story and translating it as a class, going over the lesson for the day, and then reading another story in small groups. I took it to satisfy my language requirement (in two terms without drill) but you actually learn a lot about the English language too, which is useful and interesting. If you put in the required work, it's very easy to do well.\""
        ],
        "Amanda Loud": [
            "review 1: \"08W with Amanda Loud: Great Prof, she knows what she is teaching. Might improve your grammar skills in English. Interesting history of the language.\"",
            "review 2: \"06W with Amanda Loud: You will learn Latin. You will also do a ton of workbook. A freakin' metric ton. Loud is a good prof, always excited and understanding. Lots of work, though. Lots. Understand yet? Tons.\"",
            "review 3: \"06W with Amanda Loud: She treated the class like high school students, talked down to us a lot, and was very disrespectful of students with disabilities--actually told the class about one student's learning disabilities when he left the room, just said inappropriate things a lot. Has very little knowledge of Dartmouth campus and class schedule--office hours were only offered during the 11-hour class. Did give home phone number and said we could call before 9 p.m. The homework structure was backwards--the stuff she collected was all unnecessary and VERY time-consuming busy work, while she only collected the work that was useful for learning the material a handful of times. Quiz every day.\"",
            "review 4: \"06W with Amanda Loud: This class is a lot of work because there is so much material to cover, but it isn't really that difficult. Professor Loud is great, she always tries to make class interesting (which isn't that easy with Latin). There are quizes every day, so you have no choice but to keep up with the work, but if you do well on the quizes then you don't have to take the final which is a big relief during finals period.\"",
            "review 5: \"06W with Amanda Loud: Professor Loud is fantastic. She is always energetic, and she's always more than prepared. She teaches with both confidence and humility, and she makes a potentially dry subject very interesting with historical facts and anecdotes. I have decided to become a Classics major because I liked her so much. She's very understanding and very helpful. Lethargy is not acceptable in this course - effort is the only requirement for success.\"",
            "review 6: \"06W with Amanda Loud: This class was pretty easy. Just make sure you go to class everyday and study the vocabulary.\"",
            "review 7: \"06F with Amanda Loud: The professor was always energetic, which was great for a 9L class. She provided lots of entertaining facts that worked well with the material and made learning Latin far more interesting. The homework was usually not too difficult; it wasn't graded and we always went over it in class. Likewise, the daily quizzes were good for reinforcing what we had just learned, and the professor was always willing to address any questions we had. In spite of this, I'm not sure I really learned much Latin. We usually spent most of the class on the quiz and reviewing homework, so her lessons seemed a bit rushed, and didn't always entirely prepare us for that night's homework. Also, the quizzes focused almost exclusively on vocabulary and grammer, with some translation added after a while. I didn't have trouble memorizing the vocab and grammar, but since the end of the term I've forgotten a good amount of it. I think it would help to spend more time on reading, writing, and translation earlier on in the term. In summary, it's a good class; it would probably be better if a little less material were covered in greater depth.\""
        ],
        "Edward Bradley": [
            "review 1: \"03F with Edward Bradley: Latin 1 isn't the most interesting material, but Bradley is definitely the professor to get if you're taking this class. He's really nice and understanding, and the class is fair. It really helps you understand the material. Most people in this class are taking it to fulfill their langugage requirement\"",
            "review 2: \"03F with Edward Bradley: This class was easy as long as you did the work-he told us everything that would be on each quiz as well as the final. Bradly is incredibly funny and gives great lectures. He is definitely one of the best I have had so far.\"",
            "review 3: \"03F with Edward Bradley: I took this class during a four course term. This was a mistake- in order to do really well, you needed to do every homework assignment very carefully (at least if you have no Latin experience.) The final was fair in that you knew exactly what would be on it, but this did not guarantee that you would do well.\"",
            "review 4: \"01F with Edward Bradley: Just getting my language requirement Bradley is a great guy and very interesting but Latin is very dry stuff....and not to helpful in the world these days\"",
            "review 5: \"01F with Edward Bradley: Great instructor who gets you excited about latin. The course moves quickly and demands much memorization, but overall it is a fair introduction to a demanding language.\"",
            "review 6: \"01F with Edward Bradley: this class is a good way to fulfill your language requirement without having to take drill. it's also pretty useful in other romance languages, linguistics, and pre-med classes. bradley is entertaining and despite his somewhat gruff exterior is understanding and approachable. lots of memorization though and requires some work if you want to do well on the exams.\""
        ],
        "Holly Haynes": [
            "review 1: \"04F with Holly Haynes: Prof Haynes is a great. She's interesting and fun. There weren't any pop quizzes and she prepares you well for the quizzes she gives. She tells you the type of questions to expect on the exams to help guide your studying. Also, she is quick to answer emails and questions. The course is fast paced, which requires you to be on top of things. As long as you keep up with the work and memorize things well the first time around you'll be fine. There is a lot of vocabulary to remember so I suggest you make notecards/flashcards so as to make reviewing for exams and quizzes as painless as possible.\"",
            "review 2: \"04F with Holly Haynes: If there is a better way to get rid of your language distrib, i haven't heard of it. I took 4 years of latin in high school but didn't get any credit for it, so i ended up in latin 1. That made this class less difficult for me and more fun. But in any case, if Latin 1 is on your agenda, take it with Haynes. She is one of the top profs i've had here. She lectures well, cares about how people do, and has a great teaching style. We rarely used the x-hour and ended up with a regular 9 (MWF) class period, partly because i don't think she enjoyed waking up early 4 or 5 days a week any more than we would. The textbook and workbook were great, and i'm not the kind of guy to cheer for textbooks. Definitely take this class, and take it with Holly Haynes. As a kicker, she brought us donuts for our final. What a gal.\"",
            "review 3: \"04F with Holly Haynes: Prof was interesting, would reccommend this class.\""
        ],
        "Mary J.": [
            "review 1: \"02F with Mary J.: but the professor made the class. Yes, it's great to have a language without drill, but this is basically a class which you need to teach yourself through the homework. Therefore, the necessity exists for the teacher to be able to teach through the homework you've done, as well as clarify general concepts. Aside from doing all of that well, Prof. Wilson also gave loads of background regarding the way the language played into Roman culture, etc, especially in light of the works of Virgil. We ended the class by working to understand the grammar in the first 33 lines of the Aeneid. Very interesting class. Great Prof.\"",
            "review 2: \"02F with Mary J.: Alright, this class was interesting, well taught, and has an amiable and fair prof. You want to take this. The tests were pretty tough though. You will have to study a bunch. It is worth it though. LATIN IS THE MOTHER OF ALL TONGUES!! Why the hell would you want to study somethig silly like spanish, or even worse, french? Ha. What kind of real man, wants to learn French anyway? I love you professor Wilson.\""
        ],
        "Maria Gaki": [
            "review 1: \"24W with Maria Gaki: The experience shouldn't be too different from instructor to instructor as the Latin department has created a system that basically anyone could use to a degree of success. However, Gaki was a very nice instructor and wanted to see her students do well. There is a big workload but this is still likely to be the least taxing way to finish your language requirement.\"",
            "review 2: \"23F with Maria Gaki: Decent amount of work (about three assignments due before class, they aren’t super hard though), but as long as you do them on time you’ll get a good grade. Gaki was also fairly chill and is friendly towards her students. Would def recommend\""
        ],
        "Kevin G.": [
            "review 1: \"02F with Kevin G.: Hawthorne is a really nice guy, and I think this is his first term teaching at Dartmouth. My favorite classes were spent learning about and reciting Latin poetry and Greek and Roman philosophers. But days like that were rare. Our sole text was \"Wheelock's Latin,\" which is a great book and one of the best textbooks, so they say. All we did in class, however, was go through last night's reading--Hawthorne often taught with the book tucked in his arm. I understand that it was necessary to go over homework (every other day we had to turn in exercises that were corrected but not graded), but I wish that Hawthorne could have taught the material in a new way, or put a spin on it--basically, he could have done a lot more to make Latin 1 interesting and to make it worthwhile to attend class. We had a quiz almost every week, a midterm and a final, two oral exams (reading passages aloud to him to make Latin feel like a language and not just a \"puzzle\") and those corrected-not-graded exercises. If you can find another teacher who uses \"Wheelock's Latin,\" I'd go for him or her. (I was in Rutter's class the first day. He seemed like a very dynamic prof, but the books he used emphasized fluent reading and comprehension of Latin more than grammar lessons. \"Wheelock's Latin\" focuses more on the grammar.)\"",
            "review 2: \"02F with Kevin G.: The language requirement at Dartmouth sucks, and it's a major major fraud. I guarantee you that if you gave an editorial in Le Monde to a French major or an editorial in Der Speigel to a German major, etc. and told that person to read it in a half-hour and write a response to it in the foriegn language in question in about an hour, he/she would not be able to do it. By all rights, that is not fluency. The only proper way to learn a language is by going and living for at least an entire year in a country where that language is spoken. Learning it back in the US to any degree of respectable fluency requires a dedication to that language (and a forswearing of much interaction in English) that most Dartmouth students can't afford the time for. So if during freshman week you didn't place out of the language requirement or place into Language 2 or 3 in whatever you studied in highschool, Latin is a great way to fulfill the language requirement. The main reasons being: --There is no Latin 2. After you pass Latin 1 you take Latin 3, and after you pass Latin 3 you've fulfilled the language requirement. This means 2 terms of torture (and only 2 wasted course credits which could have been used for more interesting courses) instead of 3. --They do not expect you to be able to speak Latin, for the obvious reason that it's a dead language. This means NO DRILL!!! It also makes the class easier. You are mostly expected to just translate (and 90% of the time it's Latin into English, rather than the other way around). --Wheelock's Latin. This is the textbook that is most often used at Dartmouth. If you can, try to get into a section with a professor who uses Wheelock's Latin. It is a very good textbook. It uses the old-fashioned grammatical approach to teaching a language rather than some of the dipshit methods that a lot of recent language textbooks tend to use, while ignoring grammar. --Learning Latin will improve your understanding of English, since a lot of words in English are derived from Latin words. This is one thing that may actually prove useful in terms of overall education, rather than pretending to be fluent after 2 terms and an LSPlay spent shopping and eating at McDonalds in Paris or Berlin or wherever. Latin is not a gut. Latin is one of the most grammatically complicated languages in the Western Hemisphere. It's a lot of work, and it will become extremely difficult if you slip behind even a little bit in the work, especially if you do not keep up with memorizing vocabulary words or become lax with your homework. Latin is also a little faster-paced since it's a two-term sequence rather than a three-term sequence (personally, I think this compression helps to retain what you've learned). If you are a freshmen, you might want to consider putting off taking Latin until your sophomore year and enjoy your freshman year (and you may or may not be better prepared to handle the class after a year of adjusting to Dartmouth)--that's what I did. Having said all of this, Latin is by far the most painless way to fullfill the language requirement if you haven't already placed out of it, or placed into Language 2 or 3 of whatever you took in highschool. Professor Hawthorne was inoffensive. He was neither particularly good nor particularly bad. This is no surprise, because it is very hard (and rare) for a professor to really shine when teaching such a mindlessly mechanical class as an introductory language class. Asking for brilliant teaching in a class like this is like asking for brilliant teaching in 3rd-grade arithmetic. Hawthorne was a competent teacher and a fair grader (he gave me a bad grade in the class, but then again I deserved it!). I have no complaints about him. An upper level class would no doubt prove a better test of how good or bad a professor he is. Testing and papers vary in every course, depending on the professor. Obviously, there were no papers in this class. Hawthorne gave a quiz every Friday on the material covered that week, and gave a midterm and a cumulative final. The quizzes and exams were easy if you had done the work, and if you hadn't, quite difficult! Coming attractions: Look up Latin 3 with Prof. Bradley in '03W for the same rant about the language requirement, much praise of Prof. Bradley, and what Latin 3 is like.\""
        ],
        "Samuel Findley": [
            "review 1: \"04F with Samuel Findley: Professor Findley is a great prof. He loves Latin and he’ll make you love it too. The homework assignments can be somewhat long, but you’ll learn the material if you do them.\"",
            "review 2: \"04F with Samuel Findley: latin can be pretty dull and boring but prof. Findley is a great teacher and often makes class fun\""
        ],
        "Jeremy Rutter": [
            "review 1: \"07F with Jeremy Rutter: Rutter teaches the course by having you teach yourself the material and then going over it in class the next day. He covers a chapter every two days, with a quiz on the first day - before you've had a chance to go over your mistakes. There's also way too much homework - I was spending 2-3 hours a night on new material. Once I was done with the assigned material - not all of which was helpful - there was no time left to go over problem areas or just plain study. Admittedly, languages don't come naturally to me to begin with, but I look at the smaller amounts of work Pulju assigned to my friends in his class and I say, \"Dang, if I'd had that smaller amount of work, I could have had time to actually study!\" I feel like I could have done much better with less assigned busy work. The course also went at a very fast pace, but that's true of all the Latin courses, not just Rutter. I will, however, say this for Rutter: I've never had a prof go so out of their way to make themselves available. When I was struggling, he called me into his office to say let's talk, let's get you back on track. It was great, and I am very appreciative for it. I hear great things about Rutter's Classics courses from Classics major friends. Apparently he's one of the world's leading experts on Greek archaeology. So, I'll say this: take a Classics course with Rutter and take Latin 1 with someone else, but don't take Latin 1 with Rutter.\"",
            "review 2: \"07F with Jeremy Rutter: The class is a ton of work. I was constantly doing homework, which is good practice. Just be forewarned: This class is time consuming. That being said, Prof. Rutter is fantastic. He is always available and truly invests time in each student. He notices weak points immediately and then works with you to correct them. I really enjoyed having him as a professor.\""
        ],
        "Brice L.": [
            "review 1: \"02W with Brice L.: Prof. Erickson was an effective teacher and made the material easy to understand. He stressed that the goal of the class was to enable us to read Latin on our own -- halfway through the 1-3 sequence, I feel as though I am well on my way.\""
        ],
        "Emilia Barbiero": [
            "review 1: \"18W with Emilia Barbiero: Good class - She seems intimidating but forces you to learn the material pretty well, and makes the class enjoyable! It helped me sty awake that early in the morning, too.\""
        ],
        "Florencia Foxley": [
            "review 1: \"22F with Florencia Foxley: Latin 01 follows the same format across professors so if you are considering taking the class I wouldn’t focus too much on what Professor you get - all the material and assignments are the same. The course is generally easy but the homework can be much at times. It is not difficult just extremely time consuming. With that being said, if you are looking for an easy way to fulfill the language requirement definitely take Latin! If you do the work you should easily get an A. Professor Foxley is generally nice though sometimes she gets very passive aggressive. Overall it was a good experience and I would recommend.\""
        ],
        "Giampiero Bevagna": [
            "review 1: \"06F with Giampiero Bevagna: I never took a latin course before this, but all i did was keep up with the chapters and as much vocabulary at a time as possible and i was fine. doing the book work after each chapter really helped to solidify the vocabulary and new concept introduced in the chapter. the class is paced in a way that if you don't keep on top of the chapters, you will fall behind and have a hard time.\""
        ],
        "Hakan Tell": [
            "review 1: \"05F with Hakan Tell: I really liked the class. The work, tests, and quizzes aren't too hard if you pay attention in class and actually do the work.\""
        ],
        "Katherine Kretler": [
            "review 1: \"09F with Katherine Kretler: I took this class for no other reason than to satisfy my curiosity for Latin, and I seriously regret doing so. The text for the course was, in my opinion, a mistake. Prof. Kretler didn't help matters any with her confusing take on charades and inability to actually instruct students either in or out of class.\""
        ],
        "Roberta Stewart": [
            "review 1: \"07W with Roberta Stewart: pretty easy, kinda boring\""
        ],
        "Elissa Faro": [
            "review 1: \"09F with Elissa Faro: Missing too many classes depreciates your participation credit in this class. Unfortunately, pledge term made this 9L a pain to attend, not to mention the 2 quizzes we had every Monday and Thursday morning. Also, Latin students straight out of high school always looked to set the curve.\""
        ],
        "Afroditi Manthati-Angelopoulou": [],
        "Margaretha Kramer": [],
        "Neeltje Kuin": [],
        "Patrick Glauthier": [],
        "Sarah McCallum": [],
        "Simone Oppen": [],
        "Suzanne Lye": [],
        "Thomas Hendrickson": [],
        "Timothy Baker": [],
        "William Dibble": []
    }
}