{
    "AAAS039.07": {
        "Alison Martin": []
    },
    "AAAS021.15": {
        "Darryl Barthe": []
    },
    "AAAS031.80": {
        "Monica Ndounou": []
    },
    "AAAS055.02": {
        "Ayo Coly": [],
        "Mark Williams": []
    },
    "AAAS035.01": {
        "Kimberly Brown": []
    },
    "AAAS021.05": {
        "Darius Scott": [
            "review 1: \"22S with Darius Scott: Painful. Prof Scott is leaving so maybe it will be good now but he left a lot to be desired as a professor. Not engaging at all.\""
        ]
    },
    "AAAS054.05": {
        "Laura Edmondson": []
    },
    "AAAS020.15": {
        "Misty De Berry": [
            "review 1: \"22W with Misty De Berry: One of the best professors ever! If you can take any class by them, I would highly recommend. Wonderful person and professor\""
        ]
    },
    "AAAS085.01": {
        "Peter Orner": []
    },
    "AAAS067.09": {
        "Kimberly Brown": []
    },
    "AAAS065.06": {
        "Eli Rosenblatt": [],
        "Shaul Magid": []
    },
    "AAAS039.06": {
        "Alison Martin": [
            "review 1: \"23F with Alison Martin: I loved the class! I got a new album out of it, a collection of Hip-Hop music from its birth in the 80s (as we learned) with \"Rapper's Delight,\" to the rise in female representation and feminism with Queen Latifah, to the West Coast v East Coast Beef, and the Rise of the South (bounce music, Outkast, more). You'll learn more about the history while only doing a weekly discussion post, a listening journal, two deeper listening essays, and a final creative project. The final for my class was \"create a lesson on another 'moment that changed hip-hop,' reflecting Prof. Martin's weekly lessons.\"\"",
            "review 2: \"21F with Alison Martin: Easiest class I've ever taken at Dartmouth. There are no tests, a couple of short papers doing song analysis, and chillest professor ever. 10/10 recommend.\"",
            "review 3: \"21F with Alison Martin: God BLESS Dr. Allison Martin. She is the best prof I've ever had. She's understanding and just wants a respectful class that's excited about thee topic and wants to really learn. The material was so cool and interesting. We had a couple of music analyses, a group presentation, and a short paper. I want to say the minimum for her writing assignments was 300/400 words but that's because she doenst want you to pad your work with shit no body cares about. Do the work, it is s incredibly worth it. This is a highly sought after class so dont take the place of students who are actually ready to learn.\""
        ]
    },
    "AAAS020.01": {
        "Julia Rabig": [
            "review 1: \"22F with Julia Rabig: Please only take this class if you are really interested in research and/or need more research experience to add to your resume. This class is centered on interviewing a Black Dartmouth alumni so that the archive can be preserved in Rauner. In essence, this class is structured around having students doing unpaid labor for archives and responsibilities that should be placed on paid staff at the library. Because the digital exhibit will be kept at Rauner, the professors, ESPECIALLY Professor Rabig, want perfection. Prof Rabig will contact you even after the exhibits and grades are due so that you can continue to revise the exhibit even after the term is over. To make matters worse, they do not make expectations clear. They will email the class and post Canvas announcements sometimes the day items are due or even AFTER. Unfortunately, I did not find this course to be well organized and would not consider it a layup at all. Don't get me wrong. I did enjoy the content and had a great experience interviewing my narrator. However, there are many improvements that still need to be implemented to prevent students from feeling overwhelmed on the last week of the term and after.\""
        ],
        "Bryan Winston": []
    },
    "AAAS060.01": {
        "Paul Musselwhite": []
    },
    "AAAS031.90": {
        "Monica Ndounou": []
    },
    "AAAS068.08": {
        "Trica Keaton": [
            "review 1: \"22W with Trica Keaton: Professor Keaton is so kind and is always receptive to the class’s needs. Only assignments were a midterm journal (one entry per week 1-6) and the final montage/presentation. Prof. Keaton lets you select whether to work individually or in a group, and is super open to you presenting over what interests you. Amazing guest lectures. Amazing way to expose yourself to Black French film, contemporary and historical.\""
        ]
    },
    "AAAS067.06": {
        "Kimberly Brown": []
    },
    "AAAS065.65": {
        "Andrew Caplan": [
            "review 1: \"21X with Andrew Caplan: DO NOT TAKE THIS CLASS, THIS PROFESSOR IS CRAZY AND WILL NOT GIVE YOU A GOOD GRADE. I REPEAT DO NOT TAKE THIS CLASS, NOT A LAYUP AT ALL, EVEN THE PEOPLE THAT HE LIKED, HE GAVE A MAX OF AN A- TO, so if you are genuinely interested in this class I guess, go ahead, but if you are looking for something that doesn't wreck your GPA, DO NOT TAKE THIS CLASS\""
        ]
    },
    "AAAS039.05": {
        "William Blue V": [
            "review 1: \"21S with William Blue V: I love Dr. Blue and I'm incredibly sad he's gone. He was a visiting prof but that class was so amazing. If he comes back to Dartmouth be sure to take a class with him.\""
        ]
    },
    "AAAS039.03": {
        "Taylor Bynum": []
    },
    "AAAS007.01": {
        "Ayo Coly": []
    },
    "AAAS039": {
        "Taylor Bynum": []
    },
    "AAAS031.10": {
        "John Heginbotham": [],
        "Monica Ndounou": []
    },
    "AAAS082.10": {
        "Nicholas Rinehart": []
    },
    "AAAS061.05": {
        "Marvin Chochotte": []
    },
    "AAAS033.10": {
        "Shamell Bell": []
    },
    "AAAS028.10": {
        "Darius Scott": []
    },
    "AAAS090.10": {
        "Vaughn Booker": []
    },
    "AAAS024.50": {
        "Linette Park": []
    },
    "AAAS022.10": {
        "Vaughn Booker": [
            "review 1: \"17F with Vaughn Booker: Booker is a good prof and the class is well organized. If you're not super interested in learning about Black people and/or Christianity, would not recommend this class for you.\""
        ]
    },
    "AAAS007.05": {
        "Julia Rabig": []
    },
    "AAAS091.05": {
        "Shalene Moodie": []
    },
    "AAAS009": {
        "Adedoyin Ogunfeyimi And Clifford Campbell": [
            "review 1: \"20F with Adedoyin Ogunfeyimi And Clifford Campbell: I took this class for the distribs, but it ended up being one of my favorite classes at Dartmouth - this is the definition of having a liberal arts education. Profs. Doyin and Campbell are very knowledgeable about the African diaspora, and chose readings for the class that prompted really interesting discussions (and that they had a lot to say about). The class atmosphere was very relaxed - Doyin prefers that people call him by his first name - and each class started and ended with random chitchat between members of the class and the professors. As a result, everyone felt comfortable voicing their ideas and talking about what interested them in the assigned reading, whether that meant analyzing the reading itself, or connecting it to personal experiences / ideas presented in other classes. In the AAAS major, it seems to be common to take intro-level classes later, so this class had a lot of juniors/seniors that knew a lot about Black literature, for example. Despite my relative lack of knowledge, I feel like I gained a lot by taking this class. Grading is based on two papers (6-page midterm, 8-10 page final) and participation.\"",
            "review 2: \"20F with Adedoyin Ogunfeyimi And Clifford Campbell: This is hands down the best class I've taken so far at Dartmouth. The assigned readings were all very interesting and it was admirable how knowledgeable Campbell and Doyin were on the subject. The discussions we had based on the readings were great too. The only assignments we had were two essays (one in the middle of the term and one at the end), and the prompts for both were open in a way that allowed you to really assert and solidify your opinions on the diaspora. I will recommend this class 10/10 times.\""
        ],
        "Clifford Campbell": [
            "review 1: \"22W with Clifford Campbell: Definitely sign up for this class if you can get a spot! The workload is relatively relaxed, with readings assigned before every class (about 20-30 pages before a class), and week four we got a 2000 word essay, final was a 3000 word essay, which weren't too bad to write as long as you'd start a weekish in advance. Prof. Campbell is incredible, he's an engaging lecturer, funny, and he's a treat to talk to in his office hours (which I definitely recommend you attend if/when you can).\"",
            "review 2: \"20F with Adedoyin Ogunfeyimi And Clifford Campbell: I took this class for the distribs, but it ended up being one of my favorite classes at Dartmouth - this is the definition of having a liberal arts education. Profs. Doyin and Campbell are very knowledgeable about the African diaspora, and chose readings for the class that prompted really interesting discussions (and that they had a lot to say about). The class atmosphere was very relaxed - Doyin prefers that people call him by his first name - and each class started and ended with random chitchat between members of the class and the professors. As a result, everyone felt comfortable voicing their ideas and talking about what interested them in the assigned reading, whether that meant analyzing the reading itself, or connecting it to personal experiences / ideas presented in other classes. In the AAAS major, it seems to be common to take intro-level classes later, so this class had a lot of juniors/seniors that knew a lot about Black literature, for example. Despite my relative lack of knowledge, I feel like I gained a lot by taking this class. Grading is based on two papers (6-page midterm, 8-10 page final) and participation.\"",
            "review 3: \"20F with Adedoyin Ogunfeyimi And Clifford Campbell: This is hands down the best class I've taken so far at Dartmouth. The assigned readings were all very interesting and it was admirable how knowledgeable Campbell and Doyin were on the subject. The discussions we had based on the readings were great too. The only assignments we had were two essays (one in the middle of the term and one at the end), and the prompts for both were open in a way that allowed you to really assert and solidify your opinions on the diaspora. I will recommend this class 10/10 times.\""
        ],
        "Adedoyin Ogunfeyimi": [],
        "Shamell Bell": []
    },
    "AAAS062.75": {
        "Pamela Voekel": []
    },
    "AAAS021.10": {
        "Cornel West": [],
        "Kierstan Thomas": []
    },
    "AAAS020.50": {
        "Deborah King": []
    },
    "AAAS027": {
        "Vaughn Booker": []
    },
    "AAAS060.50": {
        "Clifford Campbell": [
            "review 1: \"23W with Clifford Campbell: Campbell is a solid professor. If you do the readings and participate, you will do really well. Papers are graded more than fairly if you follow his instructions\""
        ],
        "Celina de Sa": [],
        "Darius Scott": []
    },
    "AAAS035.50": {
        "Joshua Bennett": []
    },
    "AAAS032.15": {
        "Monica Ndounou": []
    },
    "AAAS067.80": {
        "Nathalie Batraville": []
    },
    "AAAS065.01": {
        "Laura McTighe": []
    },
    "AAAS062.50": {
        "Shalene Moodie": []
    },
    "AAAS060.05": {
        "Celina de Sa": []
    },
    "AAAS036.50": {
        "Clifford Campbell": [
            "review 1: \"20W with Clifford Campbell: Highly recommend taking this class. Professor Campbell is likely one of the friendliest and funniest profs you'll ever meet, and his classes are very entertaining. The course consists of three papers and a participation grade based on daily readings. The readings can take awhile some classes, but other classes instead of readings you'll just have to listen to a few songs and read the lyrics. Although the class was very enjoyable, it was a little frustrating at times because the professor took awhile to get your paper grades back, which was understandable given he had to grade over 30 papers. However, if you do the readings and participate in class, you won't have to worry about your grade. I highly recommend going to office hours with questions about your paper–have him look over your thesis or introduction–and just to talk with a really interesting prof.\"",
            "review 2: \"20F with Clifford Campbell: Ditto on everything the other review said. I was skeptical about taking this class because it only had one review, but it ended up being 100 percent true. Even on Zoom, Prof. Campbell was cracking jokes and making a class about an already interesting topic even more enjoyable. I will say what the other review did not: this class is definitely a layup and a perfect third class. Readings are long, but you can skim them before class and get a better gist when he discusses it in class. Essay topics are about on easy, broad topics that have been or will be discussed in class and are only 1500 words. And if your schedule permits, get to know the guy. Very dynamic speaker and interesting life stories. He's traveled everywhere!\"",
            "review 3: \"20F with Clifford Campbell: Clifford is a baller and such an amazing prof. He's wants to make class fun and interesting. Readings before class then discussion, not much lecture. 2 1500-word papers and 1 2500-word paper plus participation. Really great class and super informative\""
        ]
    },
    "AAAS032.50": {
        "Matthew Richardson": []
    },
    "AAAS032.05": {
        "Matthew Richardson": [],
        "Trica Keaton": []
    },
    "AAAS032.02": {
        "Matthew Richardson": [],
        "Mattie Richardson": []
    },
    "AAAS067.50": {
        "Abigail Neely": []
    }, 
    "AAAS021.50": {
        "Shatema Threadcraft": []
    },
    "AAAS088.21": {
        "Jesse Shipley": [],
        "Keith Walker": [],
        "Vaughn Booker": []
    },
    "AAAS021.75": {
        "Shatema Threadcraft": []
    },
    "AAAS088.19": {
        "Michael Chaney": [
            "review 1: \"21X with Michael Chaney: Pretty simple with this professor, if you're black you get a good grade, if you are not black please do not take this class.\""
        ]
    },
    "AAAS068.20": {
        "Trica Keaton": []
    },
    "AAAS068.10": {
        "Trica Keaton": []
    },
    "AAAS021": {
        "Shatema Threadcraft": []
    },
    "AAAS020": {
        "Shatema Threadcraft": []
    },
    "AAAS088.20": {
        "Francesca Inglese": []
    },
    "AAAS091.03": {
        "Robert Baum": []
    },
    "AAAS081.10": {
        "Chante Mouton Kinyon": []
    },
    "AAAS064": {
        "Trica Keaton": []
    },
    "AAAS091.02": {
        "Shalene Moodie": []
    },
    "AAAS087.12": {
        "Clifford Campbell": [
            "review 1: \"24W with Clifford Campbell: Overall solid class. I actually loved doing the readings, they were honestly so engaging and interesting. Class itself was very simple structure and consistent. No attendance but you do have to participate. He writes down your name every time you say something (you can see him writing it down on his little clipboard at the front) and this is CRUCIAL. He doesn’t really emphasize at the beginning of the class but participation is worth 20% so you kind of have to talk regularly. I got 100% of participation and I spoke once per day and if I missed a day of class I would speak twice the next day. Make sure what you say isn’t too much bs because if he hates it he won’t write it down but pretty much anything is fine. As a prof though he is REALLY frustrating. For one, he hates Black Panther movie and makes sure to tell us every day and he also doesn’t like Beyoncé. There are two papers and I didn’t get the grade for the first one until week 9 so take that as you will. He grades easy but takes points off like crazy for any citation errors. The rubrics are very vague so go to office hours to confirm your formatting is okay. The discussions were mid and I did want to punch a wall like 90% of the time because he clearly doesn’t care that much about his students. He is late to class like very day and he does definitely pick favorites. If you talk and write a mid essay though you will get an A\"",
            "review 2: \"22S with Clifford Campbell: Chill class. Very interesting readings. Assignments were 1 midterm paper, 1 final paper, and an outline.\"",
            "review 3: \"22S with Clifford Campbell: Great course. 10 pages of readings before each class that you need to participate on about once a class, then a 2000 and 3000 midterm and final, respectively. Prof is very engaging, highly recommend. Also an incredibly chill grader, you are virtually guaranteed an A\""
        ],
        "Adedoyin Ogunfeyimi": [],
        "Sean Bloch": []
    },
    "AAAS083.08": {
        "Chelsey Kivland": []
    },
    "AAAS022": {
        "Vaughn Booker": [
            "review 1: \"22W with Vaughn Booker: Very heavy readings; however, I believe you can skim over them every now and then before class and be okay. However, you do want to be prepared when writing your midterm and final essays. For the final you have the option of a take home exam+short essay or a research paper. There are a couple of weekly in-class group discussions and weekly canvas discussion submissions. Pretty manageable, just quite a bit of reading if you're okay with it. Would not recommend taking this class if you're already taking another reading intensive course.\""
        ]
    },
    "AAAS088.18": {
        "Nathalie Batraville": []
    },
    "AAAS083.07": {
        "Alexander Eastman": []
    },
    "AAAS088.16": {
        "Jesse Shipley": [
            "review 1: \"22X with Jesse Shipley: I thought the readings and content were very interesting. Classes were all discussion. The prof never put anyone on the spot, and was not critical of our contributions, but there is a participation grade. The readings are rather long and the final paper is brutal (18 pages / 60% of grade). Front-load the work on the final if you can. Prof shipley is understanding and helpful with questions.\"",
            "review 2: \"22X with Jesse Shipley: Shipley is a great, fun prof. I didn't get the sense that he was entitled or anything like that. He's very knowledgable about the material, and is willing to meet with students outside of class time. There is a good deal of work by way of long readings, but they're interesting. The final, 18 page paper is definitely a grind, but really not that bad as long as you plan to start 2ish weeks in advance.\"",
            "review 3: \"18X with Jesse Shipley: This professor was so obnoxiously full of himself that I wanted to leave after 5 minutes of class. His use of academic jargon completely obscures whatever points he is trying to make, he is teaching a class about race and cannot pronounce Grenada or Puerto Rico, and he took a full hour and 50 minutes of oration to describe the (self-explanatory) syllabus. The content should be taught by someone—anyone—else, though preferably not a pretentious white man.\""
        ]
    },
    "AAAS088.17": {
        "Jesse Shipley": []
    },
    "AAAS088.15": {
        "Treva Ellison": []
    },
    "AAAS088.14": {
        "Francesca Inglese": [
            "review 1: \"17F with Francesca Inglese: If this course is offered, it's a must-take. Great 3rd paired with two other difficult courses or 4th. Doesn't require a lot of work, but would recommend at least skimming readings so you can participate in class. About three relatively short essays for the entire term that won't take too long to do. Great way to get Art and NW\""
        ]
    },
    "AAAS080.10": {
        "Cornel West": [],
        "Esther Rosario": []
    },
    "AAAS068": {
        "Trica Keaton": [
            "review 1: \"20W with Trica Keaton: Professor Keaton has become one of my favorite teachers at Dartmouth. She is super sweet, genuinely cares and is a very approachable professor. The workload isn't much: we had readings and watched films together in class every week (she even got us pizza in some of the weeks!). The course had 3 major assignments: a midterm paper of 5-6 pages on one of the films and a final assignment (group presentation on a film + an individual 5-6 page analysis on the film). She is a super fair grader and the materials are super interesting. Overall, an amazing course with an amazing professor!\""
        ]
    },
    "AAAS063": {
        "Trica Keaton": []
    },
    "AAAS080.09": {
        "Treva Ellison": []
    },
    "AAAS080.08": {
        "Vaughn Booker": []
    },
    "AAAS090.07": {
        "Robert Baum": []
    },
    "AAAS081.07": {
        "Chante Mouton Kinyon": []
    },
    "AAAS087.11": {
        "Laura McPherson": []
    },
    "AAAS087.10": {
        "Francesca Inglese": []
    },
    "AAAS081.06": {
        "Francesca Inglese": []
    },
    "AAAS088.08": {
        "Chelsey Kivland": []
    },
    "AAAS065": {
        "Azeen Khan": []
    },
    "AAAS056": {
        "Ayo Coly": []
    },
    "AAAS087.09": {
        "Jesse Shipley": [
            "review 1: \"23W with Jesse Shipley: This class with Professor Shipley completely changed my experience at this school. He is the first professor in a very long time that has interest in what he teaches, and he helps keep you fully engaged. The assignments aren't hard, there are about 2 short writings that correspond with mini presentations and a final. Being interested in the material makes the experience of this class 10x better. He's pretty chill and knows a lot of famous people which is pretty cool.\"",
            "review 2: \"23W with Jesse Shipley: Incredible class! Professor Shipley is extremely knowledgable and is a terrific teacher. Assignments are there to help you learn - not just for the sake of giving you work. It is primarily discussion based. I feel like I learned a ton and engage with and understand cultural mediums better than before.\""
        ]
    },
    "AAAS088.13": {
        "Shalene Vasquez": []
    },
    "AAAS081.05": {
        "Angela Hernandez": [],
        "Reena Goldthree": []
    },
    "AAAS080.05": {
        "Aimee Bahng": [],
        "Reena Goldthree": [],
        "Shamell Bell": []
    },
    "AAAS007.02": {
        "Reena Goldthree": []
    },
    "AAAS099": {
        "Ayo Coly": [],
        "Jesse Shipley": [],
        "Michael Chaney": []
    },
    "AAAS098": {
        "Ayo Coly": [],
        "Jesse Shipley": [],
        "Michael Chaney": []
    },
    "AAAS097": {
        "Ayo Coly": [],
        "Jesse Shipley": [],
        "Michael Chaney": []
    },
    "AAAS090.02": {
        "Robert Baum": []
    },
    "AAAS090.01": {
        "Lisa Baldez": [
            "review 1: \"22W with Lisa Baldez: Baldez is the epitome of an extraordinary Ivy League professor. Her lectures and discussions are lively. The assigned readings expose students to new, interesting, and brilliant analysis and history. The assignments are constructive on the students' interests. Would highly recommend taking any of her classes.\""
        ]
    },
    "AAAS089": {
        "Ayo Coly": [],
        "Jesse Shipley": [],
        "Michael Chaney": [],
        "Tanya Jones": []
    },
    "AAAS088.12": {
        "Clifford Campbell": [],
        "Keith Walker": []
    },
    "AAAS088.11": {
        "Alysia Garrison": []
    },
    "AAAS087.08": {
        "Ayo Coly": [],
        "Naaborko Sackeyfio-Lenoch": [],
        "Tanya Jones": []
    },
    "AAAS087.07": {
        "Ayo Coly": [],
        "Naaborko Sackeyfio-Lenoch": [],
        "Tanya Jones": []
    },
    "AAAS087.05": {
        "Jeremy Horowitz": []
    },
    "AAAS086.04": {
        "Carlos Cortez Minchillo": []
    },
    "AAAS083.06": {
        "Shalene Moodie": []
    },
    "AAAS082.05": {
        "Michael Chaney": []
    },
    "AAAS082.01": {
        "Randall Balmer": []
    },
    "AAAS081.01": {
        "Shamell Bell": []
    },
    "AAAS080.06": {
        "Darryl Barthe": [],
        "Julia Rabig": [],
        "Matthew Delmont": []
    },
    "AAAS067": {
        "Ayo Coly": [
            "review 1: \"07F with Ayo Coly: Professor Coly is absolutely brilliant. She facilitates discussion like no other professor I've encountered. She really leads us to take over. This course was absolutely incredible and I wish she taught a Masculinities part 2\"",
            "review 2: \"07F with Ayo Coly: This class was very interesting and engaging. It was a small class which was nice and I liked the discussion-based style of the class. As a 2A it didn't feel that long at all. Professor Coly was really good and knows the subject well. The work was manageable and overall the class was really enjoyable.\"",
            "review 3: \"07F with Ayo Coly: Professor Coly is a brilliant scholar and lecturer, and beyond that, one of the best teachers I have ever had. She is so good at facilitating discussions that the 2A hour flew by. She balances her own lectures with really fruitful, interesting class discussions. She does an amazing job of helping each student think through their own opinions and articulate their own ideas, and helped us all build off of each other's ideas. The topic was really interesting, but she made the class. The work was manageable--it's definitely necessary to do all the reading, but it's not too much. Two short papers, one longer final paper, and one presentation. Definitely take this class!\""
        ]
    },
    "AAAS062": {
        "Ifi Amadiume": [
            "review 1: \"05S with Ifi Amadiume: pretty good course. low key. very interesting material.\"",
            "review 2: \"05S with Ifi Amadiume: we read some pretty interesting books. ifi is wonderful and grades pretty well.. we did a lot of presentations of the books we read. the papers reflected the books\""
        ],
        "Clifford Campbell": [],
        "Marvin Chochotte": [],
        "Reena Goldthree": []
    },
    "AAAS061": {
        "Anne Phillips": [],
        "Clifford Campbell": [],
        "Reena Goldthree": []
    },
    "AAAS060": {
        "Yesenia Barragan": []
    },
    "AAAS055": {
        "Ayo Coly": [
            "review 1: \"05W with Ayo Coly: This course was very interesting. I was inspired to take the course because I had never taken a film centered class and the subject was one that I didn't know much about. Prof Coly really is a great lecturer and inspired me to participate in class. It was a class of 6 students and there were about 5-8 movies that we watched. The grade that I recieved was based on 2 movie reviews, 2-5 page papers, a presentation on the class reading, participation, and a final paper 10pgs long. I would recommend anyone who is interested in cinema or African cinema to take this course. There is so much more discussed than the plot of the film, we went into detail about how these films are represented in the West world and how the Western world affects African cinema\"",
            "review 2: \"05F with Ayo Coly: Take this class. Professor Coly is incredibly intelligent and insightful and open. This is by far the best discussion class that I've taken, i feel at home in this class all the time, and even, take that back, ESPECIALLY when we argue.\"",
            "review 3: \"05F with Ayo Coly: Prof Coly is simply wonderful. She's engaging in class and such an intelligent woman. Her lectures always segue nicely into discussions. The films that she chooses are really interesting. There were about four 2-3pg papers and a final 10pg paper in addition to a presentation. Workload is not bad at all. Take this class!\"",
            "review 4: \"05F with Ayo Coly: I love prof Coly, she's awesome. Take a class with her if you get the chance.\""
        ]
    },
    "AAAS054": {
        "Kellen Hoxworth": [],
        "Laura Edmondson": []
    },
    "AAAS053": {
        "Robert Baum": []
    },
    "AAAS052": {
        "George Trumbull": [
            "review 1: \"09S with George Trumbull: This class required a lot of work. The readings were and dense, and Prof. Trumbull expected students to have read all of the material thoroughly before coming to class. He would call on random people during the discussions so you really had to read. The material was really interesting. We covered a lot of information, beginning with the early history of the region and continuing up through the 1990's. The class was broken up into two sections, lecture followed by discussion, with a ten minute break in the middle. This made the 2A format okay. He is a good lecturer, and the discussions were interesting. He is really available to students and he wanted everyone to do well. While there was a ton of work on a weekly basis, but the assessments were not that hard. There was a midterm, a final, and a 5-7 page paper. I loved this class and I would definitely recommend it.\"",
            "review 2: \"09S with George Trumbull: If you're just looking to fulfill a distributive requirement, then I urge you to look elsewhere. Each class period is structured in basically the same way. The first hour is a lecture, and the second hour is discussion (involving either the entire class or small groups). Lectures are clear, organized, and relatively straightforward. Trumbull is an effective lecturer: not exactly inspiring but very knowledgeable. There are plenty of opportunities to ask questions, and he's usually pretty good at answering them. This class involved a lot of work. In fact, the workload was unnecessarily large. The readings were very long, generally tedious, and hardly inspiring. The lectures helped to understand the material, but the discussions were usually pointless, superficial treatments. Trumbull is not an easy grader. Nor is he particularly good at communicating his expectations. In fact, he never seemed to take a very keen interest in his students. If you want to talk to him outside of class, make sure you go to his office hours. Trumbull is terrible at communicating through e-mail, often taking several days to answer questions if he doesn't ignore them altogether. At the end of the term, I can't say that I really learned a great deal. Ultimately, it was an unnecessary use of time and effort that I should have opted out of before it was too late. If you're just looking to fulfill a requirement, look elsewhere. If you're looking for a third class to satisfy your curiosity, I would advise you, once again, to look elsewhere.\""
        ]
    },
    "AAAS051": {
        "Ayo Coly": [
            "review 1: \"23F with Ayo Coly: Super amazing class! A median. Never got anything other than an A on my reading posts and essays. She's also a super sweet person and would check in to see how we were all doing from time to time when she thought the energy was low. Although it was workload heavy in that you had to read quite a few books, no exams took a lot of stress out, and she is a nice grader as long as you speak once or twice every class and can write decently well. Great and easy way to fulfill the NW and LIT requirement.\"",
            "review 2: \"21W with Ayo Coly: Both this class and Professor Coly are excellent! As other reviewers have said, we read approximately one novel each week and spend class time discussing them. Readings could be a lot, but I never found them too overwhelming, and Prof. Coly was very good at working with us if they ever were too much. Great mix of classic African literature and more contemporary books, as well. Our major assignments were three papers, each 5-7 pages, and they were graded very reasonably. Professor Coly is really knowledgeable and kind. She finds a unique way to balance welcoming our ideas with being willing to push back against those she does not agree with. Overall, whether you're an English/AAAS/COLT major, or you just have an interest in the topic, I can't recommend this course enough.\"",
            "review 3: \"18F with Ayo Coly: Coly is phenomenal. She's brilliant and she knows it, but she still usually hears students' ideas out and is honest about whether she agrees or disagrees, thinks it's an original thought or not, etc. I learned a lot from both what she had to teach and just from how she facilitated discussion among us. Talk little in class, listen a lot. I loved most of the books but we were expected to finish one almost every week (between 100 and 600 pgs), so be prepared for a massive amount of reading. You can get away with only having skimmed/sparknoted for class discussions and participation points, but she expects much more thoroughness and originality in essays. Overall a fantastic class with a heavy workload.\"",
            "review 4: \"18F with Ayo Coly: Professor Coly is awesome. Classes are just discussions on the reading, which is usually about one novel a week. Reading can be a lot at times but the books are usually interesting. She likes everyone to participate and sometimes splits the class into small discussion groups so it can be hard to hide. If you do the reading, the discussions are awesome and engaging. The assignments are two five-six page papers, one group presentation, and a final 12-15 page paper. Workload is very manageable, especially because you have the time between the Thursday class and Tuesday class to do most of the work. If you do all the work then you usually have no work between the Tues and Thurs class. Overall, this is a great literature-type class, but also the subject matter really opened my eyes more than a conventional lit class would have. Highly recommend Coly and this course.\"",
            "review 5: \"07F with Ayo Coly: It was a good class, what I expected. Lots of class discussion, good books to read, and interesting papers to write.\"",
            "review 6: \"07F with Ayo Coly: Wonderful prof and very interesting readings\"",
            "review 7: \"07F with Ayo Coly: After a disappointing year of generally lackluster classes, I decided to choose my classes for this term based on professors - luckily Coly lived up to her reviews. Engaging and interesting, she at times is intimidating and is not afraid to tell you you're wrong. Overall, however, great class, interesting books. The class itself is centered around discussion, so be prepared to talk. And have the reading done on time, she told one student to leave the class because they hadn't finished the book yet.\"",
            "review 8: \"07F with Ayo Coly: I absolutely loved the books we read in the class and definitely wasn't expecting to. They were all very engaging and it felt like pleasure reading instead of reading for a class. They definitely made the class bearable. As for the actual class time, I didn't love it. I felt like Ayo was always yelling at us and she seemed to treat us like middle schoolers with her harsh rules and seriousness. I don't think I ever saw her smile in class. Classes were mostly class discussion which was ok though depends on the students in your class, but I wish Ayo had spent a bit more time lecturing on the background of the books since I often felt like knowing more about the history/culture would have helped me understand the book better. The papers were SUCH a drag. There were 3 6-7 page papers on an assigned topic and then a final 15 page paper. I though she was an unnecessarily tough grader and not really a fair one. Luckily the oral presentation and class participation part of the grade will help your grade. Overall, not the worst but not the best either. I'd recommend getting the syllabus and reading the books on your own time but take a different class to fulfill distribs if that's why you're in it.\"",
            "review 9: \"07F with Ayo Coly: Professor Coly did an amazing job all around. The reading list was superb, the lectures (when given, about half the classes I would say and heavier in the beginning of the term) always helped, and she was great at leading discussions. With that said, if you take this class, be prepared to read and write. As an English Major, I found both of these components fairly easy and enjoyable, but I know that some students struggled. There were three assigned topic five-page papers, an oral mini-group (2-3 people) presentation, and one open topic 12-15 page final paper. She did tell most of the class they didn't know how to write after the first paper and that they should go to RWIT for help. Although a little harsh to some, she also gave TONS of hints in class as to what she wanted in the papers. If you aren't a strong writer, don't take this class. Finally, she was pretty strict on attendance, being on time, and having done the readings. However, I think it was pretty fair within our small class atmosphere. It was a matter of respect to her and to other students who did do all the work. In addition, if you are actually sick (I was twice during the term) she's super nice about it and even gave me a pretty long extension on one of the short papers. All in all, if you are willing to do the work and go to class, you will be rewarded with this gem of a class.\"",
            "review 10: \"06W with Ayo Coly: Coly is a fantastic prof. The class format is: u read the books, then u spend all of class time discussing them, usually in relevance to thought-provoking themes which she brings up but sometimes interesting tangents occur. She really gets to know the students in her class, she is very nice and understanding about the necessity of extensions, etc. At the same time, she knows her stuff. great sense of humor too. only problem is she has a 6th sense if u didn't do the reading so at least do some of it. she won't call u out in class bc she's nice like that but she'll get pissed at the class in general if she thinks a lot of ppl r slacking. Perhaps my favorite prof at dartmouth. take her film class too.\"",
            "review 11: \"06W with Ayo Coly: excellent course! excellent prof! not too hard, not too easy! coly is the best! trust me, your time at dartmouth would not be complete without coly's class!!!!!\"",
            "review 12: \"06F with Ayo Coly: Professor Coly is probably the best teacher I have had at Dartmouth. Not only is she incredibly knowledgeable and articulate about the subjects covered, but she really knows how to run a class and facilitate a discussion, helping students articulate their views and interpretations, and validating them as well as challenging them. The reading list was incredibly diverse and I really got something out of every single book -- and didn't expect to love the reading, since I took this class for a Non-Western. Her grading is not too tough, although you MUST do the reading for class as she expects everyone to participate actively in discussion (but it's not intimidating). This class is fantastic and makes you feel that you're getting your tuition's worth!\"",
            "review 13: \"06F with Ayo Coly: Professor Coly is amazing\"",
            "review 14: \"06F with Ayo Coly: Dartmouth is lucky to have Prof. Coly. She is a great facilitator of class discussion; maintains a good balance between discussion (small group and whole class) and lecture. Good variety of novels covered. 3 papers and a term paper. The course is great for any level of experience with Africa or literature.\"",
            "review 15: \"04F with Ayo Coly: This course was the first time, for me, that I enjoyed a discussion class. Prof. Coly chose fascinating readings and did a great job of directing the course of discussions. Great class, and it doesn't overwork you.\""
        ]
    },
    "AAAS050": {
        "Douglas Haynes": [
            "review 1: \"23W with Douglas Haynes: First and foremost, this is a COMPARATIVE HISTORY course. We had cyclical discussions about the environmental devastation of African and Asian countries. I didn’t feel like I could speak to specific, intimate examples of environmental colonialism due to the dense amount of readings. This is NOT a layup, but provides a survey of environmental world history. I took this as AAAS50, expecting a more focused framework to study the degradation of our environment on African and Afro-descendent people. Too reliant on white historians & pre-colonial/colonial scholarship, but fair breadth on Asian (South-Asian) scholars. On the last day of class Haynes played the trailer for Born Free- about a white woman who grew up in Kenya raising lion cubs. Not ONE, like always, African was present in this ancient movie. It was just generic African wildlife and your typical white safari savior. Black people were reduced to employees of the white game ranger, or as a woman attacked by a lion. In the AAAS course (recommend) Idea of Africa we deconstructed the same trailer and critiqued how european entertainment presents Africa. In Hayne’s course, last day of final presentations, a white student presented context on Africa. His very first slide he wrote “Most underdeveloped continent (except Antarctica).” Now HOW do you attend 10 weeks of classes on COLONIALISM & DEVELOPMENT and bring zeerrooo critical analysis as to why that may be? Some students consider this class a layup because papers are spread out, and although you write a total of 4- you aren’t required to note-take or remember anything from lectures/readings.\"",
            "review 2: \"23W with 23w With Douglas Haynes: DEF NOT A LAYUP. There are so many readings, some you can skim but you def have to read when it's your week to write an essay. The coursework includes 2 750 word essays on the readings for whichever week you choose, 6-7 page midterm paper, climate change forum, and a 3000 word final paper. The amount of expected reading is too much. He is very helpful with criticism on how to improve your papers. Not the best lecturer can be all over the place sometimes. Overall the class is a lot much more work then expected\"",
            "review 3: \"22W with Douglas Haynes: Overall, I thought this was a decent class, but that statement comes with quite a few qualifications. First, the lectures are not particularly engaging. I'm not a big history guy so that could have played a part, but most lectures were quite dense and Professor Haynes is not animated like some other professors at Dartmouth are. He knows the subject material incredibly well, but unless you already have an interest in the area the lectures probably won't draw your attention. Second, this class was quite difficult: I averaged about 6.8 hours of homework a week to receive an A, which is a good deal more than other classes I've taken. The two biggest culprits behind this are the volume of reading he assigns and the final paper students have to complete. He assigns more readings than any student -- recognizing the other responsibilities we have -- could reasonably complete in a week. There was one week where he assigned 320+ pages of readings, not all of which was even relevant to the topics we were discussing. The only way to get by with that kind of workload is to skim -- which I think everyone in the class who bothered to look at the readings did -- and this left me feeling like I had a shaky and superficial understanding of the material. If you decide to take this class and the volume of reading has not changed, be ready to skim AND plan out your time/assignments very well. The final paper, a 12 pager on a topic of our choice related to environmental history in Africa or Asia, was also a bit of a doozy. He expects a ton of research behind these papers, and that can be hard to deliver. Start it early in the term if you can! All of this being said, I still found the class to be decent because I did find myself learning quite a bit and the discussions he holds for each module were quite interesting. He's very good at leading a discussion without letting his own opinion dominate the conversation. If you do take this class, just be aware of the volume of reading and the difficulty of some of the assignments. And I would not recommend taking it unless you already have a decent interest in the subject area.\"",
            "review 4: \"09S with Douglas Haynes: This wasn't my first class with Haynes, so I knew he was an abysmal lecturer. However, that's not because he doesn't know his stuff--he does. He's just not that great at being in front of a classroom full of people staring at him. The discussions are really crucial to getting a good grade in the class, so be prepared for them. Definitely less work than 76 (his class on modern india), but similar course style (readings, regular papers, a final, if I remember correctly). Probably the best thing about his classes is how much he's willing to help with writing and how available he is in office hours. (Like, holds office hours on Sundays if you have an assignment due...)\"",
            "review 5: \"08W with Douglas Haynes: Professor Haynes seems dry in his lectures at first, but the class comes alive in the discussion sessions that he facilitates. The small size of the class and diversity of students (as a result of all the cross-listing) makes for a very interesting discussion section. Also, he really cares about the students and your opinion. We had two longish papers - one midterm and one final (about 8 and 12 pages, respectively) and a weekly blog response/short paper. The class is a lot of reading. Some is about soil and painfully boring, but most of it is interesting. You learn a lot and the grading/class isn't hard as long as you put the work into it. I'd take the class again for sure.\""
        ],
        "23w With Douglas Haynes": [
            "review 1: \"23W with 23w With Douglas Haynes: DEF NOT A LAYUP. There are so many readings, some you can skim but you def have to read when it's your week to write an essay. The coursework includes 2 750 word essays on the readings for whichever week you choose, 6-7 page midterm paper, climate change forum, and a 3000 word final paper. The amount of expected reading is too much. He is very helpful with criticism on how to improve your papers. Not the best lecturer can be all over the place sometimes. Overall the class is a lot much more work then expected\""
        ]
    },
    "AAAS046": {
        "Leo Spitzer": [
            "review 1: \"03F with Leo Spitzer: This course was an eye-opening experience. It taught me about the struggle of apartheid, something I knew nothing about before taking the course. Both the lectures and the readings were very interesting. Exams were fair.\"",
            "review 2: \"03F with Leo Spitzer: Initially, I didn't know anything about South Africa, so this class was a good introduction. However, I was much more interested in what happened in 20th century South Africa, but we spent forever talking about earlier events. All of the interesting reading was for the last part too. The midterm was a couple essay questions, which he graded pretty easily. We were given two possible questions for our final exam (in class) and then wrote a long essay on one of them. We also had a 10-12 page research paper. Prof. Spitzer is really nice, but his repeats a lot in lecture and sometimes made the material more boring than it should have been. He's very nice during office hours.\"",
            "review 3: \"03F with Leo Spitzer: Although the general subject matter is interesting, the course went too slowly at times, and class discussion was too politically correct to inspire much thought. The professor was well-intentioned, but he put me and others in the class to sleep on several occasions. He did use interesting films, but almost relied on them too much at times. The Mandela autobiography is essential to read, and its 600+ pages are all worth your time. The main textbook was good, but some of the others (Black Power in South Africa) were poor and not worth your time. The paper was broad enough so you can write on a topic of interest to you, and tests were quite easy if you attend the lectures.\"",
            "review 4: \"03F with Leo Spitzer: Prof. Spitzer knows his stuff, but gets caught up in lecturing for the entire period, and forgetting about his class.\"",
            "review 5: \"03F with Leo Spitzer: I had been to South Africa prior to taking this course, so I was very interested in its history. But even for someone who never plans on going there, it is absolutely worth taking just to learn about what went on during apartheid. Racism and the struggle for equal rights has occured in so many countries throughout the world. Spitzer's course material is really fascinating for anyone who has any interest in the multiple decade long fight by Nelson Mandela and the African Nat'l Congress for democracy in South Africa. He doesn't overload you with essays and reading, but he does expect you to read Mandela's autobiography, which is quite long, but very good. Whatever reading you choose to omit, make sure you don't neglect Mandela's \"Long Walk to Freedom.\"\"",
            "review 6: \"03F with Leo Spitzer: At the beginning of the term, I thought I'd made a mistake. Professor Spitzer obviously knows a lot about the topic, but it seemed like he'd taught the class so many times that he'd forgotten what was interesting. But as soon as we got into the 20th century, both readings and class lectures got significantly better. Not all that much work if you keep up with it. If you need a non-western and you like history classes, this is a pretty good one.\"",
            "review 7: \"03F with Leo Spitzer: I have been looking forward to taking this class since freshman year (it's not offered every year) because of it's extreme contemporary relevance. South Africa has seen such changes in our lifetime that I feel everyone should be aware of its complex history and present-day situation. It's as if you lived in the late 18th century andhad the chance to take a history class on America.\"",
            "review 8: \"03F with Leo Spitzer: I thought Prof. Spitzer's lectures, particularly for the first half of the course, were very good. The lecture was interesting, and moved through a good amount of material. He did a great job keeping the class engaged in what he was teaching.\"",
            "review 9: \"03F with Leo Spitzer: Professor Spitzer took an interesting subject that I was very eager to learn about and managed to suck all the fun out of it and present the material in a boring manner ...thanks prof.\"",
            "review 10: \"03F with Leo Spitzer: Professor Spitzer is VERY knowledgable about South Africa's history. His lectures clearly conveyed this knowledge though they were delivered in a dry, inanimated manner. The readings and the lectures corresponded well and his exams were straight-forward and not tricky. Get started on the paper early so you have time to discuss your ideas with Spitzer. Overall I'd recommend this course, because you'll definitely learn a lot and the subject matter is very interesting.\""
        ],
        "Lindsay F.": [
            "review 1: \"08S with Lindsay F.: Professor Braun is an excellent professor and I would highly recommend this course. The man knows how to teach and he understands that teaching is about what the students learn rather than about what the students can pull out of the readings. He provides thorough study guides for the exams, encourages students to form study groups (which we frequently did), and is available all the time to answer questions. The study guides he prepares allowed me to discuss and debate the exam questions with other students, leading me to a much deeper and longer lasting understanding of the material than in other history courses in which profs simply tell you what to read for the exams.\"",
            "review 2: \"08S with Lindsay F.: This course was definitely one of my favorite courses that I have taken at dartmouth. I am horrible at history so was very nervous coming into the class, but after the first day of listening to South African music (Professor Braun plays south african music before the start of every class) I relaxed and learned so much. I feel that my knowledge of South Africa is extensive after taking this class, and recommend the class (and the prof if he ever returns to dartmouth again) to everybody.\""
        ],
        "Naaborko Sackeyfio-Lenoch": []
    },
    "AAAS045": {
        "Susanne Freidberg": [
            "review 1: \"08W with Susanne Freidberg: the readings were interesting but sitting through the 10A was pretty tough. freidberg clearly knows a lot about the subject but she is not a very good lecturer and she does not guide discussions very well. this course really enriched my world view and i learned a lot of important things although the professor could have done a better job of engaging students.\"",
            "review 2: \"08W with Susanne Freidberg: ...because this course will depress the hell out of you. If you are of European descent, get ready for a major guilt trip. According to Freidberg, the West is pretty much the root of all the problems in the world. The current conflict in Kenya is apparently the fault of white colonials who have been dead for a hundred years, not the people who are holding the guns. Let me be frank. This class takes objectivity, feeds it to a pack of dogs, shoots it with an AK-47, lights it on fire and scatters the ashes to the ends of the earth. Freidberg does not present a balanced version of the facts. Every new concept she introduces, she immediately takes on an opinionated slant that never lets up. We never get to see both sides of the issue. I knew very little about African politics or history before this class, and I am frustrated that the professor refused to present me with a balanced narrative so I could decide what to believe. She constantly impressed her own viewpoint on us with almost no recognition of other ideas. That said, the class is interesting. We got into the nitty-gritty of international politics and development economics, both their history and current events. The class integrates economics, history, and government, so if you have an interest in any of these areas, it should come in handy. Overall, the material is varied and interesting, but like i said, FAR from objective.\"",
            "review 3: \"08W with Susanne Freidberg: This class was interesting and one of the few classes about Africa that Dartmouth offers. The class consisted of a midterm, a research paper, a takehome final and three book commentaries each worth 5% of your overall grade. Personally I found the development aspect much more interesting than the ecology but Freidberg demonstrated that the two topics are intertwined. The class was a bit frustrating because it covered such a wide number of topics for example we spent only one day on famine, one day on HIV/AIDS, one day on tourism etc. Though not always successful, Freidberg did attempt to facilitate discussions and in doing so present a variety of opinions. Overall, the class gives a basic understanding of the variety of development issues plaguing the country of Africa and shows how solutions are far from simple of easy.\"",
            "review 4: \"08W with Susanne Freidberg: I would recommend this class (especially if you are going on the AFSP for enviro. studies). It covers a wide range of material, but does it in a way that is both interesting and insightful. Some of the book 'reports' we had to do felt like busy work--but overall, the assignments and readings she had us do were very helpful. She definitely has her spin on the material--but she is heavily supported by numerous other scholars on this spin (so i don't agree with the other review). She's available outside class--but you have to make a real effort her as she is only here tuesday-thursday most weeks. Good class.\"",
            "review 5: \"08W with Susanne Freidberg: This class was interesting but the lectures were fairly dry and formulaic. I think the class is better if you're already interested in Africa. It seemed that most people in the class were already well versed in economics, ecology, development, Africa (some had already been on the Africa FSP), and I felt that I was at a disadvantage for not having the same knowledge and them.\"",
            "review 6: \"08W with Susanne Freidberg: First of all, \"Prozac\" is definitely correct in saying that this class will depress the hell out of you. But if you're even considering this course what did you expect? Africa has been f***ed over by the Europeans for centuries and there are still plenty of ramifications of this. Most of the readings were interesting, although there were some that were pretty boring. Generally there were two readings a night (20-30 pages ea.) and an occasional NYTimes article or two. I feel the class attempted to cover way to many topics to be truly effective: all of pre-colonialism in one day, two days for colonialism, and then one day on diverse subjects like HIV/AIDS, eco-tourism, structural adjustment, and others. Freidberg is a good lecturer, with her subject material very well-organized, and it is very apparent that she knows a lot about the subject, and has spent much time studying about and in the continent. While she does present somewhat biased views, I agree with one of the other reviews in saying that \"Prozac\" is a little dramatic, and that she is backed up by a lot of evidence to support her biases. I think people in a class like this may get tired of all the despair and tragedy (I mean I did too), but that doesn't mean we can skip over the hard facts of poverty and disease in Africa (with much of it caused by the continuing effects of colonialism and persisting outside involvement of other countries --- not to say this isn't needed). Perhaps it is just the title that may be a little misleading, Africa (obvi), ecology, yea there was some of that, development... sort of. Yes, the course talks about development, however this could lead you to believe that the course is on current reforms for development in the continent. However, when Freidberg says development, she means more the lack of development and the struggles to attain any level of development. Keep this in mind. Overall, I'd say a good course, which allows someone to discuss the continent with at least a broad knowledge of different issues and their historical contexts.\"",
            "review 7: \"05S with Susanne Freidberg: This class was only sort of interesting and ridiculously PC and biased. I wouldn't reccommend it, but I needed it for my FSP.\"",
            "review 8: \"05S with Susanne Freidberg: Very similar to other introduction courses on Africa. If you have taken other courses on Africa and looking for a higher level course this is not for you. If you are intersted in Africa and development it is a very interesting.\"",
            "review 9: \"05S with Susanne Freidberg: The professor is knowledgeable and unafraid to challenge media perceptions of Africa and students' preconceptions. Good class with interesting material, though not super exciting.\"",
            "review 10: \"04S with Susanne Freidberg: Freidberg is not too bad, she knows a lot about her subjects. Be warned that she (probably correctly) presents a pretty pessimistic view about most things. There is a midterm that required studying but was fair and a final paper that was pretty open. The readings were long and necessary for the midterm, but it was nice that most of them were in the online reserve so we didn't have to buy a $100 reader.\"",
            "review 11: \"02S with Susanne Freidberg: I felt that the material was interesting and the professor did a pretty good job of presenting the material in class. It was very difficult to talk to her one on one though. She was sometimes available outside of class, but was unhelpful if you did not understand a concept or idea in class. Her assignments were very open ended and not really addressed as a part of the class.\""
        ]
    },
    "AAAS044": {
        "Sabrina Billings": [
            "review 1: \"18F with Sabrina Billings: Easy class, repetitive lectures, extremely little homework, but there are pop quizzes so you have to do the reading. Final essay instead of exam.\""
        ]
    },
    "AAAS042": {
        "Ifi Amadiume": [
            "review 1: \"01F with Ifi Amadiume: An easy class- interesting materials to read but the lectures are long and tedious.\"",
            "review 2: \"01F with Ifi Amadiume: When I prepared to take a class on the role of Women in African Religions I expected a great class. I didn't expect that we would cover Women and Africa, Africa and Religion, and Women and Religion yet rarely Women, Religion, and Africa. The first half of the course was spent disproving evolution, as a starting point. Furthermore, there was NO inspiration to do any work for the class because the class itself consisted of group presentations which were expected to summarize the reading.\""
        ],
        "Robert Baum": []
    },
    "AAAS040": {
        "Ayo Coly": [
            "review 1: \"23F with Ayo Coly: Take this class!! Professor Coly is an amazing prof and from what I can tell, she really tries to help her students succeed! There are 3 reading per week and a reading note due on each (due Mon, Wed, Friday, respectively). Some weeks fluctuated and changed a bit so we would end up having a bit less work than that. There were 3 essays and a final paper, and on the week of an essay she would cancel classes for you to work on them and/or reach out to her for help (OH). If you do the readings, participate in class, and try to put your best effort into the essays, then you will have no problem receiving a good grade. The actual information was quite interesting and I really loved the topics (gender equality, gender quotas, etc.) If you need your Nonwestern requirement, definitely try and take this class.\"",
            "review 2: \"23F with Ayo Coly: Amazing class. I took it because I am a AAAS and WGSS major and it was the perfect intersection of my interests but I am sure people who were taking it for the distributive requirement still had a great experience in the class. Professor Coly was super straightforward with assignments, we had to write 10 reading notes and 3 papers throughout the term. The reading notes were super short and the readings assigned were pretty engaging. She did a great job of selecting texts from different academic disciplines and this kept things interesting. If you have an interest in gender, politics, and sexuality in Africa then I would 100% recommend.\"",
            "review 3: \"18S with Ayo Coly: This is one of the best classes I have ever taken at Dartmouth! Coly is a wonderful professor very determined so her students succeed! I highly reccomend this course. The reading material is interesting and very manageable and she is a pretty easy grader for the papers. I never wanted to miss a class because our discussions were so interesting!\"",
            "review 4: \"09W with Ayo Coly: So I took this for my CI or some cultural requirement. Whatever. Anywho, if you're looking for a class to get that out of the way, take this. The work was minimal. I think we did 2 short papers, 1 group project, and a final 10-12 page paper. From what I could tell, A's were abundant. The readings were short and not too bad. Not inspiring, but not dull. So Coly is interesting. There's no doubt that she is brilliant and unusually insightful, perspicacious, all that stuff. She's very engaging and the classes were much more like a seminar than anything else. Most of the time, classes were fun and enjoyable. That said, she can be a bit prickly. Case in point: one day a couple of girls in the class made a comment that was a bit un-p.c., but not wholly offensive. I understood where they were coming from and it was easy to see how they could misinterpret what they had read. Coly however, was very offended. She displayed a lack of academic grace that most professors have with students. The next class felt like an inquisition and everything was a bit uneasy for the following week. Dartmouth should be a place where people feel comfortable enough to stretch themselves mentally, and yet I feel like these girls were burnt for doing so. Coly is very helpful and loves to teach and converse with students, but unfortunately she expects little divergence from her own views.\"",
            "review 5: \"05F with Ayo Coly: Professor Coly is amazing!! The reading material was interesting and most of the class was spent in discussions. Definitely a class to take!!\"",
            "review 6: \"05F with Ayo Coly: A good third class. Nice variety in readings.\""
        ]
    },
    "AAAS039.02": {
        "Donald Glasgo": []
    },
    "AAAS035": {
        "J. Martin": [
            "review 1: \"06W with J. Martin: I thought this class had a great reading list. Overall I liked Favor as a lecturer, but he seems to get mixed reactions from students. The papers (2 - 5 pages long) were fairly interesting.\"",
            "review 2: \"06W with J. Martin: Strange is the only way that I can describe Prof. Favor. If given the option to take another class with him, I'd probably pass and just do the reading myself. He tried to make the class interesting, but sometimes failed. He assigned way too much reading, he was one of those profs that behaved as if his class was the only one you were taking and was a very difficult grader. As a non-major, this class was so-so. I wouldn't recommend it to anyone who doesn't need the grade unless you are like me and are fine with getting the NRO and are vaguely or extremely interested in reading the material in a structured environment.\"",
            "review 3: \"06W with J. Martin: Professor Favor is an amazing lecturer who is extremely knowledgeable and articulate. His enthusiasm really sparked my interest in a subject that I had never really thought much about before. The class is mostly lecture-based, but he asks for stduent input at the beginning of each class and is very responsive to students' comments. I always looked forward to going to this class, and Prof. Favor kept me riveted the entire time. It would be great to be able to spend more time on some of the books, but at the same time the class does a great job of exploring a wide range of authors. The books are some of the best I've read, and Professor Favor is one of my favorite profs in almost 3 years at Dartmouth. Take this class!\"",
            "review 4: \"06W with J. Martin: Lots of people think Prof. Favor is weird, and he is. But he's also an amazing professor. Once you get used to his quirky facial expressions, body language, and constant pacing, the class is a blast. He lectures kinda quickly so you gotta pay attention, but he's really good about taking student comments and questions. The material covered everything from 1920's until poetry of 5 years ago. Be prepared for lots of reading, but it's definately worth it\"",
            "review 5: \"06W with J. Martin: Prof. Favor is extremely energetic and meticulously well-prepared for lectures. He's funny, and treats the class as an exploration of learning (citing different critics in every lecture 'just in case we're curious' to read them). Work isn't bad-two 5-page papers and a cumulative final-and he does a great job of making the class accessible to non-majors (of English or AAAS). One of my favorite classes at Dartmouth.\"",
            "review 6: \"06W with J. Martin: I loved this course! The reading syllabus is probably one of the best I've seen as an english major. It really covered everything I could have hoped to read in a modern black american lit course. I also loved favor. He can be very quirky at times and his lectures tend to ramble...sometimes he will go off on ridiculous tangents and it can get hard to listen to because he loves to hear himself talk...however, overall I truly was inspired. The papers were short and fun to write. Be careful of the final. If you keep up with the reading it is a COMPLETELY fair test...so don't get behind on the reading!\"",
            "review 7: \"05S with J. Martin: Most of the books/poems read were interesting, but it's easy to fall behind when you're reading a novel a week. Also, lectures tended to be a bit repetitive and boring -- after the first week most of the class stopped showing up. Papers were fairly easy to write and final exam was even easier, but overall this class was not what I expected/hoped for.\"",
            "review 8: \"05S with J. Martin: The literature is SO worth reading, and because I might not have read it all otherwise, I am not too mad at myself for having taken the class. However, Professor Favor is so disorganized in his lecture and so flighty about actually hitting on a point, or getting somewhere with an analysis that I found myself resenting having to go to class. He's sort of a character and he paces a lot in class, so it's actually not impossible to stay awake in class, but he was also very disconnected to his students, so I don't think he noticed when they skipped. He answers questions, but lacked any real interest in the group dynamic and certainly never bothered learning any names. I suggest reading the books with a friend and then talking about them- you'll get a lot more out of it.\"",
            "review 9: \"05S with J. Martin: the material is pretty interesting sometimes class is a bit of a drag though\"",
            "review 10: \"05S with J. Martin: This class is simply too large, both in terms of scope and class size. The texts we read were very good, but I would have liked to have been able to discuss them some more. I think there should be a course just on African-American poetry. I really enjoyed the poetry in this course, but would have preferred to read more novels by authors like Ishmael Reed or Octavia Butler or James Baldwin, all of whom we did not cover (as novelists).\"",
            "review 11: \"05S with J. Martin: This guy just stands up at the front of the class and talks for the entire time, there is barely any interaction with the students. A lot of the things he talks about are random and don't have much to do with anything he asks for in the essays. He does make some hilarious faces and sometimes the stuff he talks about is rediculous to the point it makes you laugh. He is a smart man, but the lack of actual discussion in class made it very boring and you tend to lose interest in the course. He assigns good books but we have to read them so incredibly quickly its insane!\"",
            "review 12: \"05S with J. Martin: I've heard mixed reviews about Prof. Favor, but I was pleasantly surprised with this class. Favor is very animated, and his quirky enthusiasm makes lectures both interesting and thought-provoking. The reading list for this class is fantastic... if you haven't read Richard Wright, Langston Hughes, or Richard Ellison, take this class! My only complaint about this class is that perhaps it moves too quickly because there is a lot of material to cover... however, the two papers and the final exam allow you flexibility so you can hone in on which texts you understand/like best. I loved this course and would recommend it to all. Black literature is great, and Favor teaches it knowledgably and makes it fun.\"",
            "review 13: \"05S with J. Martin: Not so great lectures. Rarely on target with the reading and the material he covers seem sporadic and random at best. I don't think I ever saw full attendance in this class, and everyone brings their laptops so they can slack off during class\"",
            "review 14: \"05S with J. Martin: Unfortunately the class does not do justice to the readings of the syllabus. The lectures were often boring and did not delve into the issues of the literature specifically but rather surveyed other African American writers and their general writings. This made it very difficult to sit through the lectures.\""
        ],
        "Adam F.": [
            "review 1: \"04S with Adam F.: the course started out great--the prof is young and very enthusiastic about the material, but it slowly degenerated over the course of the term, mostly because the lectures became more and more unenjoyable. professor bradley knows a lot about modern black american literature, but has trouble packaging his ideas coherently in class.\""
        ],
        "Chante Mouton Kinyon": [
            "review 1: \"18S with Chante Mouton Kinyon: Really interesting class. A ton of reading, but only two papers the entire term. Lots of discussions. We had to do blog posts, but they were really easy. I would recommend. The class didn't match up with the bio though - we focused entirely on neo-slave narratives.\""
        ],
        "Joshua Bennett": [
            "review 1: \"20F with Joshua Bennett: Joshua Bennett is one of the best professors at Dartmouth ngl! I've taken 2 classes with him so far and I can't wait to take more classes with him. A fun, cool, knowledgeable professor who makes every class enjoyable and thought-provoking. Please please take any class by him! You'll love it\""
        ],
        "Shalene Vasquez": [
            "review 1: \"07S with Shalene Vasquez: Very interesting material but the papers were a bit much for me...there was literally one due every week (usually a \"close-reading analysis\"). If you don't know what this is (which most of us didn't), she'll have a practice \"exercise\" which is basically another paper which, in this instance, was NOT on the syllabus!! Book list = Native Son, Invisible Man, Praisesong for the widow, Sula, and Blues for Mister Charlie. She took attendance almost everyday so try to go to class. Random \"quizzes\" in class where she gives you a prompt and you basically respond to it in the time allotted-another paper. Take the class if you're interested in the material or enjoy lots of writing, specifically on the topics. I recommend for English, AAAS, or History majors.\""
        ],
        "Shalene Moodie": []
    },
    "AAAS034": {
        "Michael Chaney": [
            "review 1: \"24W with Michael Chaney: Amazing Professor. Truth be told, I took the class for the lit distrib but Chaney was able to make material that I normally wouldn't be the most invested in incredibly interesting and attention capturing. He also genuinely cares for both the content and his students which is very admirable. I doubt I'll be fortunate enough to take another course with Chaney but would happily do so if I had the chance. Workload and grading was pretty fair imo. If you put in effort into your assignments you should be fine. Overall, the content might be more directed toward english and AAAS majors but Chaney more than makes up for this.\"",
            "review 2: \"23W with Michael Chaney: Michael Chaney is an awesome professor. He is clearly very passionate about what he teaches, and it makes lectures engaging and fun. He is also very understanding and patient with students. For two different classes, we had to memorize and recite some lines of literature, and he said nothing when kids blatantly came unprepared and read off their laptops. workload is very light-- a midterm paper, a final paper, and completion of a single optional HW assignment throughout the term, on top of readings which you can get away with not doing super thoroughly. I took this class for the lit distrib, and it was a great decision. Passionate prof, reasonable workload, and interesting topic. Would recommend for the lit distrib or just an interesting class\"",
            "review 3: \"08X with Michael Chaney: This is one of the best classes I've taken at Dartmouth. Professor Chaney is so smart it's inspiring even if it's hard to keep up sometimes. The assignments were fair (three papers in all, I think) and he was committed to giving good comments and feedback if asked. He made a large class feel small and allowed hard material to be discussed comfortably. It was a lot of reading and we whipped through novels pretty quickly, but it was well worth the effort. I really loved this class.\"",
            "review 4: \"06F with Michael Chaney: I absolutely love Professor Chaney. He is so knowledgeable about every discipline and every subject from Socrates to the Simpsons and unassumingly displays his knowledge in his lectures. He is very effective at leading class discussions or just amazing us with his enthusiasm and grasp of the material through his lectures. The readings were very interesting and I learned a lot about Early Black Lit but without his ability to fully engage the class with the course material, it would have been just another class. Finally, the work wasn't that bad...just two papers and one essay.\"",
            "review 5: \"06F with Michael Chaney: Chaney is an excellent prof and knows exactly what he's talking about. Sometimes, the readings and essay assignments were very intimidating...but, go to his office hours and talk to him and he'll ease your fears. He's a very fair grader and makes it his business to get to know his students. That makes the class so much easier. Be prepared to do a lot of heavy reading, as this class is not for the timid. Also, be prepared for truly engaging lectures--they were the reason I even went to class that term...\""
        ],
        "William W.": [
            "review 1: \"06S with William W.: Prof Cook is one of the best profs at Dartmouth. He is incredibly knowledgable about anything even slighly related to the topic. He tends to ramble and get off topic, but the stories of his life are as interesting as the course material. Too bad he retired this year because everybody should be required to take a class with Cook.\"",
            "review 2: \"02S with William W.: English majors be forewarned: this is less an English class and more a history class. It's cross-listed with AAAS, which means that rather than really analyzing the works, we spent more time focusing on historical and political contexts. Many of the works were flat and dull, which was an unfortunate consequence of the situation of African Americans in the 19th century. Don't expect a whole lot out of the material. More importantly, I was disappointed in the professor. Cook is extremely popular, mostly for his sense of humor. And, to be fair, he is funny, and he does explain the material well. The bigger problem was that, in a 110-minute 2A, about 20 minutes were actually spent on material related to the class. The rest of the time Cook went off on tangents that were completely irrelevant, making the class INCREDIBLY boring. In fact, I don't think I've ever taken such a boring class. Cook himself admits this class is a gut. That's not necessarily true, but there isn't a whole lot of work, and you're not really held responsible for doing all the reading. The bigger problem is that this class was disappointing as an English class and because I expected more out of the professor.\"",
            "review 3: \"02S with William W.: cook is a great prof...you learn a lot of things not exactly related to the topic...it's almost a course on culture rather than english quizzes asked questions that made you recall too specific information papers were fair and if you went to class they were not that difficult to do the key is to attend lectures\""
        ]
    },
    "AAAS033": {
        "J. Martin": [
            "review 1: \"10X with J. Martin: Key to getting @ least an A- in the class: Come to class @ least 80% of the time...he doesn't take roll so it doesn't really matter, but you'll want to be there to a) takes notes from his \"lectures\"/discussion. -Favor could seriously talk himself the ENTIRE class period, but he is MADLY informed about the subject matter and is the first prof I've had who will flat out tell you that your interpretation of something is wrong. LOL...I thought it was the coolest thing ever, some ppl were scared after that. -In any case, EXTREMELY light work load. 3 papers and an in-class final. Snagged my A- for the course with NO problem. Didn't buy one book. Read about 30pgs of each book and just used ideas that he harped on in class as the topics on which to write my papers. Just an all-around chill class.\"",
            "review 2: \"09F with J. Martin: This course was very interesting. The readings all had interesting points of view. I personally did not read any of the books in their entirety. I only read around 10% of most of them but was still able to do well, since the class is discussion-style. Whatever important things I did not read about were brought up by other students so I still got all the information I needed. There were 2 short (4-6 page) papers and a final (3 sections: identification, short answer, and essay). I would definitely recommend this class.\""
        ]
    },
    "AAAS031": {
        "Sydne Mahone": [
            "review 1: \"02S with Sydne Mahone: This course offers a good first exposure to the subject material; however, it was lacking in any critical analysis or structure. The layout of the course does not create any form of accountability for the course material.\"",
            "review 2: \"02S with Sydne Mahone: This was one of the best classes I've had thus far at Dartmouth. Each class started with a ritual which aimed to develope a comfort zone so each students could speack their minds. The class was very discussion oriented. It did not skirt some of the real issues facing the African American community, but encountered them head on and allowed students to dialogue openly and honestly about African American drama. Professor Mahone guided the conversations, but mainly allowed for the students to carry the flow of the conversation. She was always willing and eager to meet with students to discuss their ideas or any issues they might were encountering. I truly enjoyed this class and highly recommend it to anyone who is ready to speak their mind and enter a fascinating dialogue on the issues that plague not only the African American community, but the American community as a whole.\"",
            "review 3: \"02S with Sydne Mahone: This was an easy course for those interested in studying black theater.\""
        ],
        "Soyica Colbert": [
            "review 1: \"09F with Soyica Colbert: The plays that we read in this class (Hansberry, Baldwin, Lori-Parks, etc) didn't fall short of my expectations which is a good thing. I really enjoyed the majority of the plays we read. She gives students a chance to write answers to ?s on BB prior to each class. This is the kind of class that if you aren't a lazy person you should do well. Prof. Colbert is an expert on anything to do with blackness, so she's good at facilitating discussion and generating topics from the plays. The bad part of class discussions was she'd just throw out questions and expect people to raise their hands and answer, but sometimes it'd be better b/c we broke up into groups to discuss. There were 2 group presentations or \"sparking\" during the term, which can be nerve-wrecking if ur that kind of person, but otherwise simple if u put the time into them. The 2 dramaturgy papers can catch u off guard if u put off research until the last minute, but if u pick a play u like to write about then they're actually fun to write and that should reflect in your grade. All in all take the class, it's not hard and it's actually interesting.\"",
            "review 2: \"07F with Soyica Colbert: When I signed up for this course I expected it to be very interesting and new. When I first intered the classroom I was excited because of the profs enthuasim and also the plays on the syllabus sounded very interesting. As the class went on, I think we moved too quickly to really talk about the plays that we read. At the beginning of the course we were reading about 2 plays per class. Then Professor Colbert did not discourage free thought and new thinking, however she seems not to really consider your thoughts into the analysis of the play. Overall, I think the class was interesting because of the plays and also the study sessions that the other students put together. I would encourage others to take the class because this was the first time that it was taught and her first time at Dartmouth.\""
        ],
        "Monica Ndounou": [
            "review 1: \"23F with Monica Ndounou: I had such a positive experience in this class. I was a first-timer and had not done any theater before but Professor Ndounou was very supportive and she gave us so many chances to present our monologues and scenes in class before the actual final performance. I felt really supported throughout. She also gave us 3 mental health days during the term and that was really helpful as the term got busier. The readings can be a bit lengthy but nothing too crazy.\""
        ],
        "Chante Mouton Kinyon": []
    },
    "AAAS026": {
        "Benjamin Forest": [
            "review 1: \"04W with Benjamin Forest: This class was really interesting---it helped me learn not only about the history of discrimination and segregation, but I also learned a lot about the legal system. The class requires a couple group projects on hypothetical cases.\"",
            "review 2: \"04F with Benjamin Forest: A very fascinating course. I definitely recommend it. Professor Forest is a really cool guy if you enjoy puns. He's also very intelligent and knowledgeable about the subject. The readings were sometimes tedious, but not too many. I think everyone should take a class like this. If you're afraid to dip it into 'technical' courses on the law, don't worry about that. It's a good introduction to how the government has traditionally dealt with issues of race, rights and geography. Well worth it. The group projects (2) were a bit annoying if you didn't have good group dynamics.\"",
            "review 3: \"04F with Benjamin Forest: This course is a great idea for anyone interested in the Supreme Court's decisions on race over the past 150 years. If you don't mind wading through some pretty inscrutable court opinions and some sightly fluffy theory on geography and race, take it, because Professor Forest is amazing. He's funny (albeit in kind of a cheesy way) and, most importantly, he does an excellent job of clarifying some pretty complex material. He also does a good job of keeping the course mostly non-partisan, especially since affirmative action can be a pretty divisive and controversial issue. Be aware, though, that he assigns a lot more work than the syllabus might initially indicate, not in terms of the reading (which is dense but not lengthy), but in terms of the written assignments. There is a midterm, a final, a short paper, plus two short group papers, two short other papers he calls \"hypotheticals\" on the syllabus, and a couple of case briefs.\"",
            "review 4: \"04F with Benjamin Forest: I took this course based on a friend's reccomendation. She was right. This is one of my favorite classes at dartmouth. The class focuses on a combination of social science literature about segregation and supreme court cases on segregation and affirmative action. The combination of the two definately gave me a new perspective on the entire debate. For the course work, there are two group projects and a paper at the end. Nothing is overly long, but they do require thought. All the assignments deal with making legal arguments, which I found to be my favorite part of the course. Prof. Forest was an effective lecturer. Although his lectures often ran long and did not cover the material he said it would, he covered all the vital material and did it in both a fun and structured format. Tests were very fair, though they forced you to know a good deal of the reading and lectures. Take this course. You will like it\"",
            "review 5: \"04F with Benjamin Forest: This was a great course and I definitely got more out of it than I expected. I only happened to take it because I needed a third course and it sounded slightly interesting, plus it had the benefit of filling a distrib. and my friend was taking it too :) There was a LOT of required rdng and I admit I didn’t do it all. You can get away with skimming some readings because they're just simply repetitive, but other things must be read with a fine tooth comb. I think I enjoyed the court cases we read and the lectures most of all in this course, both were just really fascinating. In the first half of the course there was so much information, (albeit interesting) we were lucky that we sorta knew and were prompted to what readings and points were more pertinent to the exams. I can't really complain about the writing for this course, the case briefs and other stuff follow a certain format and it was fun to have to adhere my writing to a set format and just do what felt like filling in the blanks. I do have to say that all of the written assigments and group helped prepare me for exams, and i'm very satisfied with my final grade. I suggest not taking this course if you want an easy A and if you do take it, definetely make sure to be part of a study group before exams.\"",
            "review 6: \"04F with Benjamin Forest: This course is a great introduction to the legal system. The readings are quite time consuming because they're wordy and repetitive court opinions. At first it takes a while to get used to legal jargon. After the first few Supreme Court decisions you read though, you'll get the hang of what's going on and the rest of the readings are easier. For each class, you're usually required to read two supreme court opinions and write up your own brief so as to be prepared for Prof Forest's \"cold calling.\" The group projects were fun because it allowed us to get to know the class better and bring a little variety to the routine 2 hr lectures. The exams require memorizing your notes and court opinions. Forest is an OK professor, the reading can be extensive at times, but I came out learning a lot more about the 14th Amendment and it's implications for race and rights.\"",
            "review 7: \"04F with Benjamin Forest: The course is almost entirely constitutional law pertaining to segregation and affirmative action. Great for pre-law students.\"",
            "review 8: \"04F with Benjamin Forest: The class material was interesting. For the most part, the readings were enjoyable, but extensive. The tons of reading was the only downside to this class, and reading is necessary to get a good grade. Professor Forest was a good lecturer, and he was knowledgeable about the subject. He was also flexible and available for meeting outside of the class.\"",
            "review 9: \"04F with Benjamin Forest: this is no easy class. there is A LOT of reading, and you are graded mainly on essays. with that said, it is a very good course for those interested in learning more about affirmative action and segregation. there are some high points during the term when you do group projects. the lectures suck however. this is mainly because it is a 10A, so u want to fall a sleep. but you should attend most of them if you want a good grade. I wouldnt recommend this for freshman fall, and the Prof will tell you the same thing on the first day of class. but if you are interested in the material, take the course because you will be pleased with what you learn.\"",
            "review 10: \"04F with Benjamin Forest: People see my binder of only the onlien readings and are overwhelmed, however dont let Prof. Forest scare you off the first day. The readings are easy to plow through if you sit down and do them and require little review since so many of them review each other (court cases use old court cases as precedent). The class covers the broad issues of geography and the law very effectively. Group projects are fun and a good break in regular routine. However, there are weekly assignments- this isnt a class you can slack off in. Prof. Forest inspires great interest in legal geography and was probably the most rewarding class I have taken at Dartmouth.\"",
            "review 11: \"04F with Benjamin Forest: Prof Forest is one of those profs that doesn't seem to understand that we all have other classes with homework in addition to his own. He gave a lot of readings and work, which was a bit overwhelming, especially at the end of the term. Work includes multiple case readings, writing a brief for each one, two exams, two papers, and two group projects. And it is important to do the readings for class b/c he calls on people to answer questions. Despite the workload, Prof Forest is a great lecturer (minus the HORRIBLE jokes) and explains things very clearly. The subject was also very interesting, and if you have any interest in law, i highly recommend it.\"",
            "review 12: \"04F with Benjamin Forest: This is my favorite class I've ever taken at Dartmouth...even though I've only taken three. Nonetheless, the class was very interesting and incredibly timely. The ORC description is rather confusing, this class is simply: The role of the equal protection clause of the Fourteenth Amendment in Supreme Court cases dealing with segregation and affirmative action. There are two books, ones pretty good, and one is absolutely awful, but you really don't need to read it, just get a few key points out of it. Otherwise, we read about 12 articles and 12 Supreme Court cases. I'd highly recommend this class to anyone interested in geography, race relations, or simply current events. In particular, I thought the second half of the term wass particularly interesting. Prof. Forest is a rather tough grader but curves everyone's grade up at the end of the term, so don't worry too much about your grades if you don't do too well. Highly recommended!\"",
            "review 13: \"04F with Benjamin Forest: Course was a lot of readin and writing, but I learned a lot.\"",
            "review 14: \"04F with Benjamin Forest: I took this class for two reasons -- I needed to satisfy some distribs, and it sounded interesting. I have long thought segregation is wrong (as does everyone else). This class showed how prevalent segregation remains to be -- I guess I had never thought of it in those terms before -- and how this segregation is not just a result of personal preferences. It also showed that whites like to be around blacks in much smaller proportions than blacks would like, creating a dynamic instability, so that when blacks move into a neighborhood whites start to move out, causing ultimately all-black neighborhoods and extension of the ghetto life that blacks seem consigned to live in. Before I took the class, I was steadfastly against affirmative action (how can you end discrimination by discriminating?), and thought the class would be a good forum to share my views. Now, I'm less sure. We talked about two ways of looking at the fight to end discrimination: ending causes of discrimination (e.g. laws, policies, etc.), and ending effects of discrimination, by manually helping minorities. The first kind of action is more appealing, because it does not discriminate against whites, nor against blacks (at least in theory). But it cannot catch the myriads of small acts of (possibly unconscious) discrimination that occur all the time. For that, affirmative action -- unfair as it might be -- is also useful. So it's a tough call whether affirmative action makes sense. We talked about these issues with regard particularly to the laws that have come up to support people's convictions one way or the other, and the geographies that have affected the creation and interpretation of the laws. In the course of this class, we read many court cases, a few books, and several articles, relating to both the issues and how they have been treated under the law. All of this was good and interesting. The only objection I would make is that Benjamin Forest grades in a kind of scary way; I still have not found a pattern to it. On an exam, I got 8/10 on a reading I hadn't done, and 14/20 on another because I had read it and put too much information. On a paper, he accused me of \"technically plagiarizing\"; I still have not figured out why. I did not cite any source, because I thought it to be common knowledge. This was a very serious accusation to make against me, and he of course took of many points for it. So, take this course if you want your brain to be challenged and expanded, and you want to see the law in action. But take it with a grain of salt: there is a TON of reading to do, and if you're obsessed with your GPA you might reconsider taking it.\"",
            "review 15: \"02X with Benjamin Forest: There was a lot of reading that was repetitive and thus costly in terms of buying text books. However, the final project is excellent. You'll have fun working on it.\"",
            "review 16: \"02X with Benjamin Forest: The material in this course is interesting and will change the way you look at American Society. Readings include a few books and about a dozen significant court cases. Classes tended to be a regurgitation of the homework readings and were therefore not to interesting. Prof Forest is not great at catalyzing discussion or responding to questions. We had a great group project with a hypthetical court case. The class was broken into different groups, each representing a party that was to brief the court. This was a great experience!\"",
            "review 17: \"02X with Benjamin Forest: Sometimes the lectures weren't the most exciting, but the material was really neat. If you have any interest in law school, this is a good class to take to see how you like reading and discussing cases. I enjoyed the class, the reading, and the hypothetical case we did, though it always felt like we didn't have adequate time to discuss things in class.\"",
            "review 18: \"02X with Benjamin Forest: This class was ALOT of reading; and not fairy tales-- supreme court opinions. but the material WAS very interesting, and if you have the time to put towards it, this is a very rewarding class. Forest is a GOOD prof that really knows what he's doing, even if he makes some really stupid jokes. He expects alot out of students, but doesn't seem to grade that hard. And he is very understanding if you need an extension or extra help. I feel like I know absolutely everything now about the courts and the status and future of affirmative action. A very timely course.\""
        ],
        "Rich Blint": [
            "review 1: \"24W with Rich Blint: Blint is certainly a character and a nice man. That does not make him a great professor. He was incredibly unorganized and unclear in his expectations for the class. He would tell us to have a certain novel read by a certain day in class, and then when that day came he would ask how many people had read it, only a handful would raise their hands and he would not lecture on/discuss it since he wanted to \"avoid spoilers\" for the novels. These novels have been out for 30-40 years and I'm sure people would actually read them if he enforced the timeline he creates but no, you read an entire novel in the course of five days and then get told you didn't have to (this happened every single time a novel was introduced, so eventually I learned, but still). We also didn't complete the syllabus laid out, we completely skipped Tar Baby and The Source of Our Self-Regard despite spending plenty of time repeating the same few buzzwords the prof liked to hear. I stg if I hear about how Morrison is \"interested in a historical maturity and moral adulthood\" one more time. The work outside of readings was minimal. There was a midterm made of 3, 2-3 page papers that was graded incredibly loosely, and a final \"research\" paper of 8-10 pages. I say \"research\" in quotes since we were only required to cite three sources. Is this class a Layup? Yes, the prof essentially said day one that if you participated in class, and wrote the midterm and final, you would get an A. Is it what I was hoping for? No. It was painfully easy, and a victim of what I dub the 80/20 rule (80% of things being said in discussion are made by 20% of the people in class). Highly recommend taking a different class on Toni Morrison (there are multiple) and taking it with Moodie.\""
        ],
        "Soyica Colbert": [
            "review 1: \"09S with Soyica Colbert: A lot of reading, the articles were horrendously boring and abstract but challenged me to think in a way I had never thought before. Pretty much, if you do the reading you'll get an A, if you don't do the reading but still can slip in a few comments here and there, visit her in office hours, and do your two presentations well, you'll get a B+. And Prof. Colbert is very easy on the eyes\""
        ],
        "Shalene Moodie": []
    },
    "AAAS025": {
        "Deborah King": [
            "review 1: \"18W with Deborah King: Professor King is a very disorganized Professor, but she is the most understanding Professor I've met. However, although her lectures do not go through most of the text, she grades on the text. She may seem as if she is an easy grader, but she IS NOT. I found her to be a hard grader, but that was because I didn't do most of the readings. Go to office hours she helps to outline your papers and tells you what readings to discuss. Her in-class exams ask for specifics so make sure you know your stuff. Overall an interesting class but I made the mistake of not doing the readings do not make the same mistake.\"",
            "review 2: \"11W with Deborah King: Prof. King is very disorganized we spent so much time` on one material we never got to finish. All my excitement for the class diminished after the first few weeks. The midterm covered materials she said was going to be on the exam but everyone basically stopped doing her work and readings. If you want a chill class I guess you can take this but I was particularly annoyed at her laziness so I wasn't thrilled about not doing anything because I felt it was a waste of tuition and time.\"",
            "review 3: \"11W with Deborah King: Professor Kings gets off topic a lot, and we spent a fair amount of time on one subject. Not as much discussion as I would have liked but ok.\"",
            "review 4: \"08W with Deborah King: This class was amazing! I learned a great deal about representations of black women in society, both historically and in contemporary culture. Professor King gives great lectures but most importantly she asks interesting questions that make you really think about the subject matter. A few of the topics we covered were slavery, the workforce, the church, sexual politics, hip hop culture and they were all fascinating...definitely take this class, its worth it!\"",
            "review 5: \"08W with Deborah King: king is very inspiring and attentive to students in and out of class. very interesting discussions and readings.\"",
            "review 6: \"08W with Deborah King: Professor King succeeded in providing a historical and sociological survey of Black womanhood. She is a good professor and is incredibly responsive to students. During finals period made herself extremely available for students. Readings for first half of class are necessary, but afterwards-- start your research paper. Most of the class discussions were based on personal experiences and readings were comepletely irrelevant. Very ironic that black women mainly composed the class's majority. At times students in the minority students seemed intimidated to contribute and once or twice when they added a unique diverse perspective received disdainful looks. Class (rocky 002) was rather segregated. But what do you expect, it's dartmouth. Overall, fairly easy class, enlightening, but if you've studied this stuff already, its just redundant. Professor King is very helpful in office hours.\"",
            "review 7: \"05W with Deborah King: King knows her stuff, the readings are where you will get most out of this class though. King is pretty laid back.\"",
            "review 8: \"04W with Deborah King: This class was very interesting. It puts a lot of things about Black Womanhood and Womanhood in general into perspective. The work load is relaxed. The exams were too long and rushed. The papers were graded rather ctitically. Just make it a point to let King get to know you by volunteering in class and going to x-hours. It will help your grade a lot. You also need to be mindful of the fact that King knows her stuff but she's very unorganized. Overall, not a bad class.\""
        ]
    },
    "AAAS024": {
        "Darryl Barthe": [],
        "Derrick White": [],
        "Shamell Bell": []
    },
    "AAAS023": {
        "Judith A.": [
            "review 1: \"05F with Judith A.: Despite the terrible reviews I decided to give this class a chance. It is incredibly rich and interesting material. However, it attempts to cover too much in too short a time (the histories of 3 island from the 15th century to the present). The reading can oftentimes be overwhelming so be wary about taking this class in conjunction with other reading intensive classes. Prof. Byfield wasn't a terrible prof but she wasn't great either. Just average.\"",
            "review 2: \"05F with Judith A.: The class was ok... Profs lectures were not the greatest...too much material in a short period of time.\"",
            "review 3: \"05F with Judith A.: I took this class for the subject matter and while what we covered was interesting, I don't feel like we covered all that we could have. It seemed like for 8 weeks of the term all we disucssed was slavery (and while I agree it's part of the subject matter...we could have spent some more time learning about the smaller islands---which we never even touched). However, my biggest problem with the class was the way she treated some of the students. It felt like highschool. Don't even think about bringing a laptop to class because she'll either a) kick you out of class if she suspects you're checking blitz or b) ask to see your computer after class to see if you were taking notes (both of which she did). Frankly, if people don't respect the class enough to pay attention, that's their loss but they shouldn't be treated like 9th graders\"",
            "review 4: \"05F with Judith A.: I took the class knowing very little about the Caribbean and was happy that she chose to concentrate on three of the larger islands - Jamaica, Cuba, and Haiti. We had three 4 page papers based on the reading - readings you had to do to earn decent grades. Some people used just internet sources, of which she was fully aware. The final research paper (10 pages) though could be about any island. While Byfield tends to drone during lectures, the readings she assigned were very interesting. In class, she can be on a warpath- calling people out for sleeping, kicking people out of class if they're not paying close attention, etc. However, she seems to be much better in office hours. I took this course as a requirement for the major and surprised myself with actually liking the material and learning quite a bit.\"",
            "review 5: \"02W with Judith A.: This class started out promising--small number of students, captivating lecturer/prof who leads amazing discussion sections... By the half-way point, it seemed like there was a thinly veiled disgust between the prof and some of the students, who appeared to be taking it strictly for their NW distrib. Do not do this. It is a HARD and CHALLENGING class. (One of the most difficult I've taken here.) It tries to cover so much material--focussing on Haiti, Cuba, and Jamaica from pre-Columbus to now--a very big chunk, too big. I would say that this course needs restructuring before I would recommend to anyone but the most caribbean-lovers out there.\"",
            "review 6: \"02W with Judith A.: Prof. Byfield managed to take a fascinating subject, history of the Caribbean, and a class I decided to take purely out of interest - and make it a complete bore. Her lectures border on unbearable, her responsiveness to students opinions is often a simple, \"no,\" and her actions during one discussion section, selectively dismissing students she didn't like, was unacceptable. The readings were long but fair, the tests (essay-questions due a week later) were also a good measurement of your knowledge of the subject. The spacing of lectures should be adjusted, in my opinion, to allow more time to be spent on recent developments (last 60 years). Overall - this class had a lot of potential, but - purely because of Byfield's horrible job as a teacher - the class was not stimulating, not interresting, and even became - for those of a certain gender and appearance - a hostile, unfriendly, and uncomfortable environment.\"",
            "review 7: \"02W with Judith A.: Prof. Byfield made great readings and potentially very interesting material into one of my most negative academic experiences ever.\""
        ],
        "Derrick White": []
    },
    "AAAS019": {
        "George Trumbull": [
            "review 1: \"09F with George Trumbull: I loved this class. There was a lot of reading, but Professor Trumbull is fantastic. Highly recommended.\"",
            "review 2: \"08F with George Trumbull: This class was pretty sweet- lots of reading but interesting stuff. Lectures are a bit on the dense side but that's a good thing- prof knows his stuff.\"",
            "review 3: \"08F with George Trumbull: Prof. Trumbull knows his stuff. He knows everything about everything even possibly related to his subject matter, plus he structures a very interesting course about things that are fascinating to know and talk about, but that you would otherwise never think about. He's young, which can cause some hitches, but he's on his way to being one of the best profs you can have.\"",
            "review 4: \"08F with George Trumbull: The class was very interesting. Most of the time the readings were as well. Professor Trumbull is really passionate about his work but he's lecture's aren't that great...he talks to fast which makes it hard to take notes. Lots of reading too. If you want an intersting class and dont mind doing some reading a good course!\"",
            "review 5: \"08F with George Trumbull: Challenging, but learned a ton. Trumbull really cares about his students and he knows his stuff.\""
        ],
        "Cirri M.": [
            "review 1: \"06S with Cirri M.: This course was unlike any other course I have taken at Dartmouth...but definitely worth taking if you have the time. I took this course as a fourth course because the subject matter was interesting and I had heard great things about the professor. The class itself was simple--watch movies, discuss them, and then write about them. While the class could take up a lot of your time (because you have to watch all those movies in Jones)...I honestly never watched movies outside of class and only did the reading to be able to write a three-page response to it each week. Professor Nottage may seem a bit eccentric--and intimidating at first...but she is definitely a good person to get to know. She may pick on people, and she may be a hard grader, but once you get on her good side, she will take care of you. You just need to prove yourself to her--she doesn't like bullshit! If you the time, I would recommend taking the course...\""
        ],
        "Clifford Campbell": [
            "review 1: \"19F with Clifford Campbell: This was a pretty interesting class, but very informal and lax. Prof. Campbell is a nice guy but his lectures occasionally lack direction and a point, he seems to just be winging it as we go along, and that can sometimes make for some pretty boring classes. The readings as well are long and very dry, and 80% of them really aren't necessary for any assessments. As for assessments, there are three papers, a \"Map Quiz\", and a 20% participation grade. The first two papers are easy to write but are extremely boring. He basically wants you to recap the book you read and his lectures on it with no additional information. The final paper is written on a topic you choose and therefore is a much more enjoyable experience. His grading on papers is not too bad, but very unpredictable. The map quiz is something straight out of middle school where you basically memorize all African countries and some natural features and just regurgitate it on a little quiz. All in all, I'd say this class is pretty much a layup and Campbell is a cool guy, but the academic content is lacking.\""
        ],
        "Naaborko Sackeyfio-Lenoch": [],
        "Sean Bloch": []
    },
    "AAAS018.03": {
        "Robert Baum": [
            "review 1: \"20W with Robert Baum: Prof. is great and the workload is super manageable. Baum is awesome and really nice. He's always available to help out and is really understanding. The class is interesting and not too difficult\""
        ]
    },
    "AAAS018": {
        "Alexander I.": [
            "review 1: \"08W with Alexander I.: professor bortolot is really responsive to students. Once i missed class and went to his office hours and he spent a whole hour talking to me and helping me catch up. The material is also really interesting and new. The readings weren't that exciting (partly bc there aren't many good readings on african art out there) but i didn't really do the readings, i just reviewed the powerpoints and still got an A.\"",
            "review 2: \"08W with Alexander I.: Professor bortolot was very nice and an interesting lecturer. he was also an easy grader and the tests were representative of the materials covered. This was a very easy class.\""
        ],
        "Ifi Amadiume": [
            "review 1: \"04X with Ifi Amadiume: Nice prof, but a little moody. Go to class 'cause she takes attendance!!\""
        ],
        "Judith A.": [
            "review 1: \"02F with Judith A.: This class is great if you want to become informed about African history. Each week you focus on a different African country. Grading consists of 4 4 page papers and a 15 page research paper. The research paper can be somewhat nightmarish. Prof Byfield is an interesting lecturer and is extremely knowledgable on this subject. However, be forewarned that you'll probably hear every class how women are under/misrepresented in historical accounts.\""
        ]
    },
    "AAAS016": {
        "Beatriz Pastor": [
            "review 1: \"07W with Beatriz Pastor: this was a terrible course. the course description is deceiving! it was not at all what i expected. i did not learn one thing.. it was all common sense and knowledge i had from kindergarten. professor franconi in particular was extremely tangential, and his accent is so thick its hard to even understand him. this course was not at all what it was supposed to be about and the information is very dry. grading is ambiguous, although it is easy to get a good overall grade. not worth the pain though; stay away at all costs.\"",
            "review 2: \"07W with Beatriz Pastor: the course is REALLY interseting, and the profs are hilarious, especially franconi. both of them are great people and interact well together as profs. The only problem was that franconi's english isn't the greatest, so someitmes it was hard to decpher what exactly eh was trying to convey during lectures. he ahd a tendency to ramble as well. pastor gave great lectures and brought up a lot of intersting points. she was also really into class participation, and by the first week of classes knew mostpeople's names in the class which was pretty impressive I thought. I didn't think there would be htat much work in the course, but there is if you try to do all the reading and the papers! there was a TON of reading - you could get by without doing all of it tho. also, there were 3 papers, a pretty hard midterm (4 essay questions ansered in one hour) and a 10 page final paper. if you're good at BSing though, you should be fine. oh also the grading of the papers was sometimes confusing because the two profs would switch back and forth with whose papers they graded, and they each graded differently. all in all, good and intersting class...but more work than i had expected\"",
            "review 3: \"07W with Beatriz Pastor: This course was really great, but both profs have very different teaching styles. Franconi doesn't speak english very well, so he tries not to talk much in class and shows videos and posts really useful links on blackboard (USE THEM!). Both profs are very understanding and responsive to questions in class. I loved this class and would totally recommend it!\"",
            "review 4: \"07W with Beatriz Pastor: Professor Pastor and Pastor Franconi are wonderful professors. They're very entertaining and energetic, they know their material VERY well, the material is very interesting and engaging...overall I would give this course and the professors an A+.\"",
            "review 5: \"07W with Beatriz Pastor: THE best class I've taken thus far at Dartmouth. i took it to fulfill a distrib and I'm so glad I picked it! Funniest profs ever and they prepare you well for exams-we got the exam questions before the exam date! Final paper was great and really interesting b/c we got to pick our own topic. Sometimes their grading of the little papers was a little confusing, but not too bad. Everyone did well in this class.\"",
            "review 6: \"07W with Beatriz Pastor: holy crap-- these profs. are so engaging and funny, and they really like discussing readings in depth-- you take a lot out of it. There's a lot of movies too, so be prepared for them. Both could have done a better job making accomodations for disabilities, so be ready to push hard on that if need be. I would highly recommend this course-- very interesting and easy enough.\"",
            "review 7: \"07W with Beatriz Pastor: This course is pretty ridiculous. It's taught by two professors from Latin America. All they do the entire term is dwell on the victimization of natives in Latin America by the Europeans. We hardly study current day Latin America, and when we do, its as Latin America being a victim of whatever. You don't really learn much in this course, and it isn't for anyone who doesn't want to feel sorry for Latin Americans for a term. The Professors are actually pretty good, both are interesting and Franconi is very funny, although this is mostly because he can hardly speak English. They assign a TON of reading and movies to watch for the course. I hardly did any of them, which hurt me some, but really not too bad.\"",
            "review 8: \"05W with Beatriz Pastor: This is a really great class! Make sure to take it with Pastor because she is the absolute best part of the class! She engages you like no other profesor.\"",
            "review 9: \"05W with Beatriz Pastor: Overall this class was interesting, but the different professors had different styles. Pastor's lectures were more organized than Franconi's, but Franconi showed so much enthusiasm for the topic! While the papers were not difficult, sometimes the grading of them was hard to figure out. This class was a good one, but the lecture styles of the two profs may not be for everyone.\"",
            "review 10: \"05W with Beatriz Pastor: the class was very interesting as an overview of latin america. the readings were well chosen and enjoyable. prof. pastor is a good lecturer although she likes to think everything has an underlying meaning. all the things in books are symbolic of something for her which can get a little annoying after a while. she also doesnt reply back to blitzes at all. i blitzed her about 4 times throughout the term without response or even an acknowlegement in class. rodolfo is a sweetheart. his lectures are pretty much based on movies which he shows during all of his lectures but he really tries his hardest to get his points across to the class.\"",
            "review 11: \"05W with Beatriz Pastor: i was thinking whether or not i wanted to minor in lacs before entering this course. now that i have taken it, i am sure of that. both professors were EXCELLENT. pastor gives great lectures and franconi has an ideal sense of humor...the combination of both complementing eachc other created a fantastic class. the readings were phenomenal, or atleast i thought so. the papers were very easy, not exceeding 2 pages in length. the final paper was also very doable. although it ranged from about 10-12 pages, once i was writing it, i realized that i had so much to say. thus, writing so much was not a problem. i HIGHLY reccommend this class when these 2 professors are lecturing. they make an amazing team!\""
        ],
        "Israel Reyes": [
            "review 1: \"06S with Israel Reyes: This course is a great introduction to Latin America in general--literature, political and social thought, society. Reyes' lectures are interesting and made me look at the material in a completely different way. This is one the best classes I've taken at Dartmouth so far. A great class, not a lot of work, and you get a lot out of it.\"",
            "review 2: \"06S with Israel Reyes: Very easy grader, interesting material. Required attendance, but about 20% of classes were cancelled. Very ideal class for senior spring.\"",
            "review 3: \"06S with Israel Reyes: Prof. Reyes is a very good prof. His lectures are very good...and help you to undewrstand the past and modern situation in Latin America.....there is usually a quiz every 2 weeks on the readings...they are pretty straightforward...and the readings are not heard to understand at all...we were \"required to read 6 books\" but if you dont read them....it will NOT AFFECT YOU AT ALL.... HE DOES TAKE ATTENDANCE SO WATCH OUT!! AND LIKES PARTICIAPATION AND PEOPLE THAT SPEAK UP!! SO SAY SOMETHING!!! HIGHLY RECOMMEND REYES! AWESOME PROF..VERY ACCESSIBLE LIKES TO TALK TO STUDENTS!! but his classes are mostly lecture based...so they may get a little boring....BUT STILL TAKE THIS CLASS ESPECIALLY IF U ARE LACS MAJOR OR MINOR\"",
            "review 4: \"06S with Israel Reyes: This was a pretty easy class, but there was a lot of reading. There are quizes which are just on readings for that day, but if you haven't done the readings, it can really hurt you when it comes time for the midterm and final. The tests are fairly easy, but you have to have done the reading, and paying attention in class really helps. Professor Reyes is great, but it always took forever to get back to my questions. He was helpful when I was finally able to set up a meeting time, but he seems very busy outside of class. Take this class...it's great.\""
        ],
        "Keith Walker": [
            "review 1: \"08W with Keith Walker: I took this course to fulfill my LIT-NW requirement. Walker is a very effective lecture and chose excellent readings for the course. Bueno is very passionate about the subject, but his lectures are sometimes hard to understand as English is not first language. You do not need to know French or Spanish to keep up in the course. Paper topics were not difficult and asked you to discuss the major themes of the course. Both Bueno and Walker are reasonable graders and keep you engaged during lectures.\"",
            "review 2: \"08W with Keith Walker: This was not my first course with Professor Bueno, but it was with Professor Walker. Bueno generally gives more effective lectures in Spanish literature classes i have taken, but i have a ton of respect for the man and like what he generally has to say so even the lecture based format was alright for me with him. In his upper-level spanish courses he runs the class about 50% discussion, and so with this class with a little of that. Walker on the other hand, despite his high command of the english language, did not give especially convincing or effective lectures. I was confused by some of his points (ie: \"So this symbolizes ____, of course.\") and realized quickly that he was not running a discussion class but presenting essentially his thesis about whatever the readings were for that day. This lecture based format was a nightmare...how boring to have a 10A where you just sit there and a professor tells you what you already thought of when you were doing the reading the night before!! that provided sufficient disincentive to do the reading! My advice: if you have to take this class, skim readings for 30 minutes before class, and take really good notes, and then if you have to do a paper on them read them thoroughly later. Otherwise, take an upper level LACS class which are absolutely amazing and the reason i am a major.\"",
            "review 3: \"08W with Keith Walker: This class is pretty good. You get two great professors in a class of maybe 15 people. If you want to get alot out of a Dartmouth class take this! The course description is pretty accurate and if you're interested in it the class is well taught and fun. I'm a non-major and I learned alot from this class. Oh and I have to say, grading is great in this class. finish your work on time, go to class, talk with the Professors and you'll be golden!\""
        ],
        "Andre Pagliarini": [],
        "Sebastian Diaz": []
    },
    "AAAS015": {
        "Judith A.": [
            "review 1: \"06F with Judith A.: Byfield is very knowledgeable, but some of the readings were less than inspiring, which is especially unfortunate since there are a lot of them. Classes are a mix of lecture and discussion, and graded based on two take home exams and a final paper.\"",
            "review 2: \"06F with Judith A.: She's a solid prof, but a pretty difficult grader. Difficult meaning she forces you to really analyze the readings to write the papers (a whopping 3 midterm papers and a final paper) in a limited amount of time (at least we get the weekend). But I enjoyed the class a lot. The discussions were fine since the class was small (I think I would have rather had a bigger class for more viewpoints) and she's available outside of class if you want to get further in depth.\"",
            "review 3: \"06F with Judith A.: byfield is good. material is questionable.\"",
            "review 4: \"05W with Judith A.: Prof. Byfield is great; she's so nice and gets you very interested in the class. However, I would reccommend taking a class with her on a smaller topic, the problem with this class is that there is just so much to know and learn and understand in 10 weeks. I still don't feel like I have a great grasp on the material, because almost everyone comes in knowing next to nothing on African history and you are expected to be able to synthesize the material and come up with themes. The good thing about the class is that every assignment (5 papers, 3 that are 4-5 pages, 2 that are 2 pages) is not worth that much so there isn't a lot of pressure. If you are taking relatively easy classes, then I would say take it, but be ready to work.\"",
            "review 5: \"05W with Judith A.: This course has a bunch of pointless, fairly easy, yet time-consuming assignments like commentaries on performances and a newspaper project due the same day as the final essay. The weekly reading is actually not that much, but the projects were a pain. Also, it's really important to answer essay questions EXACTLY and completely. She's a very particular grader, even on 4 page essays.\"",
            "review 6: \"05W with Judith A.: If i could I would give her an A+ She is so nice and extremely intelligent. She really knows her stuff and brings life to the material. I would recommend this class to all history majors and non-majors alike. It is (like all history classes) a lot of work, and there is at least 200 pages of reading a week, but it is so worth it.\"",
            "review 7: \"05W with Judith A.: byfield is really but a hard grader who doesn't tell you what she is looking for\"",
            "review 8: \"02W with Judith A.: I had never studied any African History before in my life. This class made all the unfamiliar names, dates and places really interesting. Professor Byfield's lectures were engaging and relevant to readings and papers. The readings were really great, and the discussions we had on them helped to important parts of the course known. I definitely recommend this course to History majors, but also to anyone who just wants to learn about something that might have seen so unknown previously. A great way to fulfill your NW World Culture requirement!\""
        ],
        "Clifford Campbell": [
            "review 1: \"23S with Clifford Campbell: This class is bizarre. There are two short essays and one longer final essay. The discussions are purely around course readings, and there is barely any \"lecture.\" Prof. Campbell is very knowledgeable and funny, and a significant portion of your grade is participation, which is measured by jotting your name down each time you speak in class. Overall, I learned from this class because the readings were interesting, and many classmates had interesting things to say. Though, if you want substantial feedback on your work (especially writing), this is not the place to receive that.\""
        ],
        "Lindsay F.": [
            "review 1: \"08W with Lindsay F.: I really liked this course. Professor Braun is a visiting professor. He is pretty awkward honestly but extremely well-meaning and an awesome lecturer. I really enjoyed going to class and hardly ever looked at the clock. He makes beautiful powerpoints which he posts, but you will not understand very much without going to class. About every week or week-and-a-half we have a discussion session, which was divided into two groups, and during which we discuss the major themes of the readings in terms of theoretical questions he gives us ahead of time. The night before we had to write a short paper on the major ideas from the unit, which was really not a big deal but was sometimes hard to remember. It is not necessary to do all of the reading, but without skimming it you will have almost nothing to talk about, and he does note down who speaks in discussions. There was a written midterm based on the readings provided, and a 12-15 page final research paper, which he made us start well in advance. Lastly, we had a final for which he gave us a thorough study sheet, so nothing unexpected showed up. Professor Braun was a relatively easy grader and always wanted students to come talk to him at office hours about the class or anything else. Overall, I really enjoyed the class (it was like hearing a bunch of stories) and I would definitely like to take more courses about Africa or with this professor.\""
        ],
        "Naaborko Sackeyfio": [
            "review 1: \"09S with Naaborko Sackeyfio: I was really disappointed by this class as it was NOT engaging, interesting or informative. For readings, Sackeyfio chose dense chapters taken out of books and gave no context for the material. We then spent over an hour going over boring, superficial discussion questions that Sackeyfio distributed. Much of the time, Sackeyfio's lectures simply outlined the readings and lacked any real depth or analysis. The class was barely any work, however, as it only consisted of two take-home exams (that were just 6-7 page papers) and a research paper. For some reason, Sackeyfio assigned the final take home exam and research paper to be due within a week of each other which made the last week of term a bit more stressful. Bottom line, this class was extremely easy but also extremely painful and uninformative.\""
        ],
        "Jeremy Dell": [],
        "Naaborko Sackeyfio-Lenoch": []
    },
    "AAAS014": {
        "Judith A.": [
            "review 1: \"05F with Judith A.: This course was approached really well. We learned about a lot of different societies in Pre-Colonial African History and instead of taking repetitive tests and quizzes about each society, our work was focused on in-depth discussions of the readings and on four papers (two for the midterm and two for the final). Thus I was left with a broad sense of connection across the subject instead of with a random assortment of facts that I have garnered from history classes prior to this one. Professor Byfield led discussions very well, however, I found her lectures not overly useful.\"",
            "review 2: \"05F with Judith A.: Learning about Africa in 10 weeks = lots of work. A lot of it is interesting and Byfield makes sure you read through the discussions (though you can sit and optionally stare around, but she can call on people randomnly). Her lectures were pretty good and were better than reading the 80-100 pages she assigned (though some readings were awesome). It's a history course so I did expect that much reading, but it gets to you in week 6. However, the midterm papers are horrendous. You get barely five days to write a 10 page paper (2 five page papers, and there are 2 midterms), and she's a very particular grader. EXTREMELY so. THIS CANNOT BE EMPHASIZED ENOUGH - BE ANAL. Questions are easy, though. Plus a group project at the end with a 5-7 paper for each individual. Byfield makes you work but it's worth it. You definitely don't come out dumber about Africa.\"",
            "review 3: \"05F with Judith A.: The readings and films were very interesting and were a pleasure to read. However, Byfield's lectures were simple summaries of readings which made it almost pointless to fully read the material or impossible to enjoy sitting in lecture. The midterms were absolutely terrible, we were given 2 5page papers due in 3 days and they were graded very meticulously. so only if you are highly interested, take this class\"",
            "review 4: \"02F with Judith A.: Byfield is a fabulous discussion leader and runs a fantastic survery. She brings a balance of theoretical and historical methods to bear on an often overly politicized subject. Highly recommended.\""
        ],
        "Naaborko Sackeyfio": [
            "review 1: \"08F with Naaborko Sackeyfio: This course was generally easy, but not very informative. It was a poorly organized survey course, which led to all of the civilizations studied becoming blurred together. The class was not interesting or engaging, though I hope the prof. will improve upon it in the future, since this was her first term here.\"",
            "review 2: \"08F with Naaborko Sackeyfio: Sackeyfio is a first time prof and needs to learn how to teach. The course is so easy it's unbelievable. For some strange and vaguely explained reason, she chose to have us study pre-colonial African history through film. Only papers we wrote all term were three 2-page movie reviews, analyzing the arguments the films make about African history. This was the least rigorous, least scholarly, and least engaging course I have taken at Dartmouth. The subject matter on its own is fascinating, but find another way to learn pre-colonial African history.\"",
            "review 3: \"08F with Naaborko Sackeyfio: Unfortunately, because of the large task of discussing thousands of years of history of the entire continent of Africa, the course falls short. Sackeyfio needs to work on communicating the material more effectively and giving more sound evidence for the points that she argues. As a really nice woman who attempts to encourage class discussion and multiple viewpoints, Sackeyfio does have the potential to be a very good professor and lecturer. So I do hope and believe that she can improve the course. In terms of work, this course is incredibly easy. The midterm and final exams are both take home, with a number of short answer and essay questions to choose from. There were three two page reaction papers to the films we watched in class. A participation grade is also factored in.\""
        ],
        "Lindsay F.": [
            "review 1: \"07F with Lindsay F.: This class was manageable and I did end up learning alot but the lectures were too general and ineffective.\""
        ],
        "Jeremy Dell": [],
        "Naaborko Sackeyfio-Lenoch": []
    },
    "AAAS013": {
        "Cori Tucker-Price": [],
        "Derrick White": []
    },
    "AAAS012": {
        "Celia E.": [
            "review 1: \"09S with Celia E.: Naylor assigned ridiculous amounts of reading every night; granted the readings were actually pretty interesting. It seemed like Naylor was a lecture professor trying to teach a discussion class, so she would talk for like 45 minutes and then randomly ask for input after she pretty much said everything there is to be said on the subject, and then after anyone made a comment, instead of allowing others to comment on the other student, she would start talking again and say literally everything there is to be said on the topic. There were a lot of really awkward silences that were almost embarrassing. She also has a very strict late policy on her papers, i.e. if you turn in a paper a day late you drop from an A to a B, 2 days late you start with a C, and so on; and its completely non-negotiable save for a medical issue. However she wasn't actually that hard of a grader. Overall I would recommend the course based on how interesting the subject matter is, but be forewarned that it is a shit load of reading and discussions are going to prof-dominated and awkward; and if you turn in anything late you're going to fail\"",
            "review 2: \"08W with Celia E.: Professor is very intelligent but lazy. Gave way too much reading, but did not really care if you had actually read it. Class went slowly, without much of a chronology. Comments on papers were excellent.\"",
            "review 3: \"08W with Celia E.: The information was interesting, but there was a lot of reading that usually said the same things. Class moved slowly and there was not much participation.\"",
            "review 4: \"08W with Celia E.: Prof Naylor is a wonderful professor. She assigned a lot of reading but you could get away without doing all of it. There were two midterm papers and a 12 page final research paper and attendance is part of your grade.\"",
            "review 5: \"05W with Celia E.: Professor Naylor was the best thing about the course. She was well educated on the material and was able to answer questions thoughtfully and thoroughly. However, there was a lot of reading and it was obvious that most people didn't do most of it. The readings were a mixture of interesting and not so interesting. Overall, I recommend the prof and the course, but the prof more strongly.\"",
            "review 6: \"03F with Celia E.: The Prof works very hard, and does a GREAT JOB giving a very rounded overview of Black history up until the Civil War. No matter how much your high school went into Black history, this class will help you get ALL perspectives and class discussions tend to be really interesting, especially when everyone gets involved. This class is very much whatever YOU want to get out of it. If you don't do the reading, you're wasting your time. The class is almost completely discussion based and there is a lot of reading that's assigned. The Prof is great at mediating the discussions and also spends a lot of time on writing you turn in, giving back tons of feedback. She's very dedicated. I really enjoyed this class.\""
        ],
        "Darryl Barthe": [
            "review 1: \"23W with Darryl Barthe: The worst class I have taken in college. Daryll is engaging but does not understand the workload he is creating. His feedback is often open ended and unclear so it is difficult to do well on the next assignments. Would not at all recommend this class.\"",
            "review 2: \"21F with Darryl Barthe: This class was probably the most informative and interesting class I have taken at Dartmouth so far. Barthe is a genius and is highly informed on all things related to slavery and African studies. He is also an amazing lecturer - he made an hour class feel like 25 mins. His lectures are a mix of storytelling, watching videos, analyzing pictures and some class discussion. I never felt bored. The only downside to the class is the heavy reading and essays. We read about 4-5 full sized books (historical, informative genres). After about week 4, the class started to pick up very quickly and we went from reading a book in 2.5 weeks to reading it in 1 week. In addition, we had two 500-750 word essays due every week based on the book we had read the week prior. But, the books are all very interesting and detailed. Each essay asked us to use the context of the book to analyze a contemporary and primary source within that time period. Researching and writing on these topics became a little tiring, just based on how much there was to do, but you were actually learning really prominent and insightful things about race and slavery. The good thing though is that there is no late penalty in the class, so all of the essays could be turned in way past the due date if not able to be finished on time without any penalty. So, I cant discount it. Barthe is also SUPER specific about how he wants these essays done - essentially less is more. He tried to steer the class less from intellectual, wordy writing and towards direct, historical writing. Overall, this class isn't necessarily a lay-up but you will leave feeling like you actually learned something and like you can make historical connections. Highly recommend.\"",
            "review 3: \"21F with Darryl Barthe: AMAZING PROFESSOR!!!! Darryl is by far one of the most amazing lecturers I've ever had; he's both engaging and entertaining. His class is structured in a way that you move through the class both chronologically and thematically, which helps tremendously with understanding. The coursework is demanding (8 papers in 10 wks and about 4 books). However, I read the first two books and skimmed the rest. He doesn't even expect you to read the entire book just the intro and conclusion and skim the chapters for main points. If you attend lectures, Darryl provides you with enough material to write a paper. There are daily quizzes, but they are less about the book and more about concepts. He will give you a question and you have about 5 minutes to answer. For example, he asked us once to describe a social construct. Attendance is not mandatory; if you miss a quiz, Darryl just drops it in the end. I wouldn't recommend skipping though if you want to do well in the class. This isn't a lay-up, but it is a super interesting class with an amazing prof. TAKE! TAKE! TAKE!\""
        ],
        "Craig S.": [
            "review 1: \"03W with Craig S.: Everyone should take this course as an introduction to African-American Studies. Professor Wilder is extremely articulate and knowledgable about early African-American history. He assigns great readings, and one really becomes familiar with the historiography of the period.\""
        ],
        "Julia Rabig": [],
        "Rashauna Johnson": []
    },
    "AAAS011": {
        "Clifford Campbell": [
            "review 1: \"21F with Clifford Campbell: Campbell is a pretty awesome professor. As the other reviews say, he'll tell a lot of jokes in class discussion to keep things lively and moving, and he'll prompt debates to keep everyone engaged. Grades are made up of two midterm essays each 1500 words, one final essay of 2500 words, a map quiz where you name every country on the continent, and class participation. He's a tough but fair grader (ex: on the map quiz, it's The Gambia, not just Gambia). For class participation, he wants you to say something every class period, and he'll say \"it doesn't matter what you say, just so long as you're participating.\" His goal is to keep students present in the discussion, but he also allows laptops in class so it can be easy to get distracted. He really enjoys having students in office hours and requires at least one meeting to discuss your final paper topic. I spent most of my time having a casual conversation with him, and he gave me some good advice while I was there. There are no lectures; it's 100% discussion based on the readings. He takes forever to return papers though, so don't expect speedy feedback. I'm not a big history person, but I enjoyed the class well enough and I definitely consider it a layup if you don't mind 30-45 minutes of reading before each class.\"",
            "review 2: \"19S with Clifford Campbell: This class was sick. Campbell is the man. He cracks jokes the entire class but also teaches some really cool stuff. Class is 100% discussion based on the previous nights readings. Three essays of 1500, 1500, and 2500 words plus a map quiz are the only grades. Would definitely recommend.\"",
            "review 3: \"19F with Clifford Campbell: Great class, great prof. Going to class and participating is big part of grade. Very interesting and definitely worth taking.\"",
            "review 4: \"19F with Clifford Campbell: 10/10 would recommend this class. Participation is a big part, at least make sure he remembers your name\""
        ],
        "Judith A.": [
            "review 1: \"05S with Judith A.: Prof. Byfield one of the worst professors I've had during my 4 years at Dartmouth. The lectures were boring and they never related to each other. Even though this class was easy, it's so boring it's not worth taking!\"",
            "review 2: \"05S with Judith A.: Attendance in the class is required, even though you are never tested on anything said in the lectures or asked to put it in your papers. The grades on the papers, as well as their comments, were usually pretty arbitrary (the worse the paper I turned in, the better the grade). The lectures can be interesting, but she doesn't cover the majority of Africa and you can never really differentiate what it actually is you're learning about.\"",
            "review 3: \"05S with Judith A.: yeah, i guess by the other reviews some people thought this course sucked..i thought it was okay...byfield is really nice, most of the readings were pretty interesting, and lectures were okay this class is not a lot of work, and the papers are not hard, as long as you figure out what byfield wants (which can be kind of arbitrary at times) not a terrible way to get a distibutive and learn some about African history and culture\""
        ],
        "Ifi Amadiume": [
            "review 1: \"06S with Ifi Amadiume: okay so the class is one of those classes that sounds so impressive on paper but it's just not a fun class to take, scratch that it's straight up boring. the prof., is a nice person but she is unable to command attention and respect in her own class so it just falls apart. on top of that there are these presentations that are just pointless and kind of boring, the discussions are sometimes interesting but most of the times they are just boring. Bring your comps to class\"",
            "review 2: \"03S with Ifi Amadiume: This class was a little boring and it often seemed as if I could't really follow the class, because it's hard to follow a boring class. If you can write well, you will do well in this class. If you go to class when attendance is taken, you will do well in this class. There were no exams.\""
        ],
        "Jesse Shipley": [],
        "Robert Baum": [],
        "Sean Bloch": []
    },
    "AAAS010": {
        "J. Martin": [
            "review 1: \"05F with J. Martin: class is ok...his lectures are ok....he basically says what are on his quizes and main ideas...however goes on tangents sometimes...but cool...interesting reading\"",
            "review 2: \"05F with J. Martin: Prof Favor is very...unique. He's animated in class (which will keep you awake) and even as a person of color I learned A LOT in this class. There's a lot of reading but it's worth taking anyway because you learn about the problems of race in America, representation and about the inner workings of American society. If you're not going to take this class at least read \"Black Looks: Race and Representation\" by Bell Hooks. We learned through different medias. We watched Chris Rock and Da Ali G. , afterwards I had a new found respect for Ali G. He graduated from Cambridge and knows what he's doing with the show. TAKE the CLASS!!!!\"",
            "review 3: \"05F with J. Martin: Prof Favor is horrible at leading class discussions. He just stands in front of class and talks for the entire hour. The material is interesting but made horribly dull by the lack of student-professor interaction. The two papers are easy enough and fairly short but the quizzes make the class feel like high school all over again.\"",
            "review 4: \"05F with J. Martin: The last few classes became a drawn out version of a lecture that the professor has given in the past. Prof. Favor also has the habit of dropping the names of other professors and mentioning that they are good friends. Overall, though, good intro class. Just two short papers, some easy quizes, and a final exam.\"",
            "review 5: \"05F with J. Martin: This class is excellent, as an African-American student I learned so much about African American history as well as people of Africa decent living throughout the Diaspora. Its a very manageable class, three quizes, two papers, and a final. Favor grades fairly. Favor is a great professor if his classes engage him--meaning that the classes that were the best were those when the students constantly engaged professor Favor with comments and questions. I would definitely take this class again.\"",
            "review 6: \"03S with J. Martin: I eagerly anticipated this course. It did not disappoint me. Professor Favor loves his work, and he shows it. His lectures are lively. The origin of black studies is covered. Slave narratives, Black Nationalism, cultural identity, and other themes are touched upon as well. This was a good introductory course, especially for someone without a background in African-American history/studies.\""
        ],
        "Clifford Campbell": [
            "review 1: \"21S with Clifford Campbell: Professor Campbell is honestly one of the best professors I've ever had at Dartmouth. He genuinely cares a lot about his students, and has the most warm and friendly personality--I'm kind of sad I took this class online, because he would have been an even better prof in person. All of the readings and papers for this class were really interesting/rewarding, I definitely feel like my eyes were opened a bit to history that is often discarded in favor of the master narrative. Only complaint was the structure of online class--Prof. Campbell basically would ask us all to talk about the reading for the day, which didn't promote discussion between peers, just a lot of hands raised with individual insights. Of course it was interesting to hear what my classmates thought about the reading, but I would have enjoyed a little more discussion. Basically your grade is composed of 2 1500 word papers and a 2500 word final paper, as well as participation and a short outline for the final paper. The first two essays were kind of boring, but the final paper is anything interesting to you, so I really enjoyed writing that. Prof. Campbell is a very fair and lenient grader, but will definitely mark you down if you do Chicago formatting wrong! Highly recommend this class.\"",
            "review 2: \"19F with Clifford Campbell: The course involved a fair amount of reading but you didn't necessarily have to do it all to get participation credit. The essays were interesting and he was an easy grader. His lectures were very interesting at the beginning and got repetitive towards the end.\""
        ],
        "Adam F.": [
            "review 1: \"04S with Adam F.: The material was very interesting although never very in depth due to the classes function as a survey of many topics. The readings were great and the prof was both fascinating and engaging. Prof made the course.\"",
            "review 2: \"04S with Adam F.: Bradley is an interesting professor and he definitely knows his stuff. He really made the class. The material was interesting. The workload wasn't too bad, either. Overall, good class.\""
        ],
        "Soyica Colbert": [
            "review 1: \"09F with Soyica Colbert: Colbert is very young (late twenties) and does not have a professorial air about her at all. You notice her shifty eyes and awkward, arrogant tone the first day and wonder what she's doing teaching at Dartmouth... later you realize she's very smart and articulate but has major attitude and could care less about actually teaching. Because she's an English prof, this is an English class. You don't learn about historical events or contextualize any of the material, you just read and analyze literature. The readings are very standard, seemingly plucked from a greatest hits in black history list (Douglass, Baldwin, Hughes, Morrison). Every class is discussion about the texts and Colbert provides very little direction, instead sitting there looking like she'd rather be somewhere else. All in all a very scattered and strange class. Attendance is important, and grades are entirely based on two exams. Studying for the exams felt like high school -- sparknotes is your friend again.\"",
            "review 2: \"09F with Soyica Colbert: This was the class that made me want to major in AAAS. The readings were interesting, the class had a very interesting discussion about the reading and the material's connection to the present day. Professor Colbert is a fair grader and even provided opportunity for extra credit. It is probably not necessary to read all of the texts, but they are all great, so you will want to. Reading and going to class pretty much ensures a good grade in the class - very little studying required for the exams. TAKE THIS CLASS.\""
        ],
        "Trica Keaton": [
            "review 1: \"23W with Trica Keaton: Good class! Prof Keaton uses a multi-media approach, with lots of movies, art, photography, and guest lecturers. I'd never taken a class like it before but it was great! I learned so much. However, her grading is weird. She doesn't want to read interesting essays. She wants to know you read the material, so you need to CITE THE TEXTBOOK in your essays.\"",
            "review 2: \"23W with Trica Keaton: This class is definitely a layup, but be warned that Keaton does not care how good of a writer you are. Cite as many of the in-class readings/textbooks as you can, and repeat the themes mentioned in class, and you've earned an A. I was shocked to see that Keaton gave me a D on my midterm, despite it being one of the better papers I'd written at Dartmouth, all because I was missing one of the sources she wanted us to cite. As friendly as Keaton can be in class, she can be fairly unpleasant outside of class if she thinks you don't care about the material, so I had to devote countless extra hours to optional revisions in order to drag my grade back up. Also, Keaton seems to grade her assignments with no regard for the essay prompt, so make sure to follow whatever she said in class because the syllabus information is wrong.\""
        ],
        "Jesse Shipley": [
            "review 1: \"16F with Jesse Shipley: This class was a LOT of reading, but also really interesting and he is an easy grader. Jesse is passionate and has some crazy interesting connections and stories - great class discussions etc. Take it if you're prepared to skim on some reading, and want a super fascinating class\""
        ],
        "Michael Chaney": [
            "review 1: \"08W with Michael Chaney: I thought the course was gonna give a broad overview and the African-American people, their history and culture. But it turned out to be more like a study of the study of African-Americans. Chaney is wicked smart. He made lots of references that only the smart cookies (not me!) in the class knew, like to Black intellecutals and essays, and taught complicated theories, which he was willing to clarify if we asked. When I understood what we were talking about, I learned a lot of interesting things. Several of the readings were really tough to get through and not very comprehensible, but were illuminated in class. It definitely helps to have some background in AfAm studies to better follow and participate in Chaney's lessons.\""
        ],
        "Shalene Moodie": [],
        "Shalene Vasquez": []
    },
    "AAAS007": {
        "Lindsay F.": [
            "review 1: \"08W with Lindsay F.: I personally am not that interested by the topic, but it seemed like other people were. I think the Prof is great and really enthusiastic and good at making us see connections. The readings were diverse, although often too long considering other classes. The class covered a wide variety of topics. I recommend it.\"",
            "review 2: \"08W with Lindsay F.: the professor was uninspiring and was easily influenced by the students. he would probably be better in a lecture course rather than a seminar because he knows so much information he is just not great at interacting with students.\"",
            "review 3: \"08W with Lindsay F.: Never having studied African history, the material covered in the course was completely new to me, but not quite what I expected. The readings were too lengthy at times and kind of dry, but a majority of them were very engaging and diverse. Professor Braun, although a bit eager to please, is very down-to-earth, respectful, and accessible. He is always willing to meet with students outside of class and discuss class assignments.\""
        ],
        "Ayo Coly": [
            "review 1: \"07W with Ayo Coly: This class definitely had a lot of reading to do. Some of the books chosen were great reads, while some were less than spectacular. However, Professor Coly is really passionate about this subject and gives great lectures. If you take good notes and are responsive to the points she makes, you will be fine in this class. However, be ready to do the readings because she always wants to make sure that everyone does them, to some people in the class' dislike.\"",
            "review 2: \"07W with Ayo Coly: The pace of this course is a little hectic. It starts off ridiculously slow and finishes like a storm. The material is pretty interesting and Professor Coly is great. If you are at all interested in the course description and don't mind reading, I would strongly recommend this class as a seminar.\""
        ],
        "William W.": [
            "review 1: \"05S with William W.: The 10A got a little long every day, but Cook gave us a break, and kept class interesting. Very knowledgeable teacher. His ideas on what Christianity and the Bible say are sometimes a a little off-base, but rarely in critical matters\"",
            "review 2: \"05S with William W.: So I took this course for the distribs-CI and LIT. Although I really don't like English classes, this wasn't all that bad. See Cook is a great prof. He just goes off talking about stuff during class and seems to know everything about literature. If you can, take a class with him.\""
        ],
        "Darryl Barthé": [
            "review 1: \"23S with Darryl Barthé: I took Race, Nation, and Ethnicity as my first-year seminar with Darryl Barthé. The material is super eye-opening and interesting, but the professor is the worst educator I have ever met in my life -- my worst academic experience at Dartmouth. He cold calls on people and then shoots them down for their opinions. He chooses a couple of favorite students and to the rest is outright rude. He is also very harsh in criticism/grading but does not give any constructive feedback on how to improve. His grading comments were very condescending and he is very difficult to approach. He does not respond to emails ever. We had to write essays every week on top of the larger assignments. I do not recommend this professor at all, he should not be teaching here.\""
        ],
        "Ifi Amadiume": [
            "review 1: \"01F with Ifi Amadiume: Professor Amadiume is an incredibly sweet and intelligent woman. She was born in Nigeria, has lived through the Biafran War--is a storehouse of knowledge about Africa, past and present. Yet the seminar was a great disappointment. The course was structured around a list of novels by Chinua Achebe and two African women authors. Though Professor Amadiume assigned two or three of us to give a presentation on a book or a section of a book each class period, she made the reading optional for the rest of the class. (Nine students total.) The result: no one save a few people read the optional novels, and Professor Amadiume encouraged the presenting group to spend most of its time recounting the book's plot! When the group did raise questions for discussion, no one had anything to talk about because no one had had read the book, and the few students who did read didn't want to monopolize the discussion! When we could have been having intelligent discussions--and we did have a few great and heated ones, though not when talking about the novels--our minds (okay...my mind) was going numb. And I am indeed a culprit; I recounted many a chapter of plot summary. The title of the seminar was \"Power, Corruption, Resistance in Film and Writings of Contemporary Africa.\" I expected us to watch and discuss lots of films, but we only watched three feature length films (and two documentaries--about Africa's history with colonialism and Nigeria's current situation). The films were good, but we barely discussed them! I'd have liked Amadiume to show a whole lot more feature-length films and make discussion about them a priority. We barely discussed the three films; when we did it was during the next class, when the film was no longer fresh in our minds. My third contention is the amount of writing required. I'm pretty sure that professors for freshmen seminars are supposed assign four papers, miniumum (or something around that). Not counting a one-page paper we wrote for her to gauge our writing ability, we wrote a five-page paper and a 10-page final paper. I definitely wanted to write more--if only to keep my brain active between the week-long periods of plot summaries. I was pretty ignorant about Africa coming into the class, and I did learn a lot about Africa--the dynamic between the leaders and the people, the politics, the corruption--from the films we watched, the books I read, and, of course, from Amadiume's discussions. Yet it had so much more potential! The verdict? Take this seminar at your own risk!\""
        ]
    }
}