{
    "AMES055.04": {
        "Diederik Vandewalle": []
    },
    "AMES041.19": {
        "Tarek El-Ariss": []
    },
    "AMES041.18": {
        "Tarek El-Ariss": []
    },
    "AMES007.03": {
        "Clare Gillis": []
    },
    "AMES041.15": {
        "Andrew Simon": []
    },
    "AMES043.09": {
        "Dennis Washburn": []
    },
    "AMES041.20": {
        "Chad Elias": [],
        "Diederik Vandewalle": []
    },
    "AMES041.17": {
        "Tarek El-Ariss": []
    },
    "AMES042.17": {
        "Nikhil Rao": []
    },
    "AMES041.16": {
        "Andrew Simon": []
    },
    "AMES042.15": {
        "Nikhil Rao": [
            "review 1: \"17F with Nikhil Rao: This is the type of class and the type of professor you come to Dartmouth to have. Rao's incredibly friendly. He is not at all the type to shoot people down, but also pushes you to bring forth reasoned opinions. My class only had 3 students, so we often met at Umpleby's and enjoyed a close and rigorous interaction with the the teacher and the texts. There's quite a bit of reading, but Rao is considerate on that regard, as well as essay submission. The class will expose you to the complexity of the Indian society that is divided by religion, caste, gender, etc; but, Rao helps you digest and comprehend a world truly unlike our own.\""
        ]
    },
    "AMES042.16": {
        "Nikhil Rao": []
    },
    "AMES042.14": {
        "Nikhil Rao": []
    },
    "AMES041.14": {
        "Daniel Rubinstein": []
    },
    "AMES007.02": {
        "David Rezvani": [
            "review 1: \"18W with David Rezvani: Do not take this class unless you have absolutely no choice. Workload: a fair amount of reading. You don't have to read all the reading to be able to participate in class, but you definitely need prior knowledge of Asian current events. You are assigned 2 750-word reaction papers that are worth 5% for each draft. This process is repetitive and Rezvani doesn't give any helpful feedback. You have a 12-page paper due at the end of the term: 1st draft is for peer review right around 2nd mid-terms, 2nd draft is worth 10%, final draft is worth 35%. This put a lot of pressure on me because this paper was worth so much. You also have to meet with Rezvani a couple of times to discuss your paper topic and those meetings are far from helpful. Class: this is a heavily discussion based class. You will get picked on to voice your opinions as opposed to volunteering. Rezvani also tallies how many times you talk in class to give you your participation grade. Unless you are really interested in Asian current events, you most likely won't find class discussion topics fun. Syllabus: You get a syllabus in the beginning of the term and you are expected to finish all assignments before the deadline (Obviously), but Rezvani will never talk about these assignments unless someone asks in class.\""
        ]
    },
    "AMES040.04": {
        "David Ehrlich": []
    },
    "AMES021.12": {
        "Sunglim Kim": []
    },
    "AMES040.09": {
        "Theodore Levin": []
    },
    "AMES041.13": {
        "Nadav Samin": []
    },
    "AMES040.05": {
        "Zahra Ayubi": []
    },
    "AMES091.02": {
        "Diederik Vandewalle": []
    },
    "AMES091.01": {
        "Allen Hockley": []
    },
    "AMES091": {
        "David C.": [
            "review 1: \"05W with David C.: Prof Kang is just about as bad as it gets. He is arrogant and terrible at leading discussions. As this was a senior seminar, much of the class was supposed to be discussion. Yet he cut off every class early, would ask confusing questions and then point the blame on us for not wanting to discuss. Discussions would actually go better until he intervened, at which point he would say something that no one would understand or did not require a reply. His attitude eventually lead to no one wanting to talk. He was also short and curt in office hours, even if you visit once or twice with good questions. He also played clear favorites. He is a self-centered prof that is too impressed with himself to even care about students. In all my years here I have never had a prof that I thought should never teach again (and would probably be happier for it.) If you take a course with him, he will defintely not care about you unless to harass you about being absent and how this will negatively affect your grade. I normally have an excellent reletionship with profs and have had no problem getting numerous recommendations, but I could not wait to be done with Kang. The first few classes appeared to be fine, even inspired, but you quickly realize what he is really about. Just stay away\"",
            "review 2: \"05W with David C.: I want to review this course from my perspective, ones of an AMES major, but I almost feel bad for Prof Kang in that it wasn't really his fault a middle eastern studies major was shoved into his internatinoal relations/east asia course. I think mostly this is the fault of the AMES department for allowing all of its middle eastern professors to go on sabbatical concurrently. That being said, Kang was incredibly dismissive to my opinions and thoughts, even when he specifically asked my opinion. He is laid back and relaxed, almost trying a little too hard to be cool. But whether its genuine or not, i felt it was a bit unprofessional at times. He wasn't available out of class becuase he never really told us when his office hours are. I read the other review that is currently posted and it was pretty harsh. I tend to agree, but I would like to say that I'm sure Professor Kang would be fine for people who are 1) interested in international relations, 2) interested in East Asia, 3) not personally offended by his rude behavior, 4) have a background in economics. Becuase I am really none of these categories, I would say, if you are forced to take this class, as I was, it'll be alright, it just didn't culminate any experience I've had at Dartmouth. Professor Kang, for his credit, though, is very knowledgable about what he does and is probably inspiring to those whose interests align.\"",
            "review 3: \"05W with David C.: I was forced to take this class to complete a minor that had nothing to do with the course material. While this was not Professor Kang's fault, I felt he made the entire experience worse with his dismissive and unprofessional attitude.\""
        ],
        "Justin Rudelson": [
            "review 1: \"08W with Justin Rudelson: this course was very different from any other course i have taken here- it only met once a week for 3 hours on wednesday night and had very disjointed material that was kind of all over the place. but over all it was interesting and not that difficult- i wish there had been less time spent on student presentations though as they pretty much took up the entire course\"",
            "review 2: \"08W with Justin Rudelson: Professor Rudelson is so fun and so enthusiastic about the subject of the class. We even went to Lake Placid's Olympic Museum (yea field trip!). This is probably the easiest seminar you could take. One page reflection paper each week on any of the material for the week (movie!) and group presentation one of those weeks. And don't let the 3 hour class time (wed night 7-10) scare you. Time flies when you're having fun.\"",
            "review 3: \"08W with Justin Rudelson: Prof Rudelson is really awesome. He's very passionate and responds to students outside classroom. (yes there's a field trip to Lake Placid) The bad thing is, because the course is the culminating experience of AMES, it tries to combine East Asian studies with Middle Eastern studies, which is somewhat disorganized. The good thing is Prof Rudelson makes the theme \"sports\" and \"nationalism\" quite interesting to students on both \"sides\".\""
        ],
        "Diederik Vandewalle": [
            "review 1: \"07W with Diederik Vandewalle: The material was interesting and Professor Vandewalle gave effective lectures, but somehow I still feel that there was something missing. There was a lot of uncertainty in the course material. The readings were incredibly dull. Still, the class is good for gaining a broad understanding of the issues developing countries face.\""
        ]
    },
    "AMES087": {
        "Allen Hockley": [],
        "Dennis Washburn": [],
        "Jonathan Smolin": []
    },
    "AMES086": {
        "Allen Hockley": [],
        "Dennis Washburn": [],
        "Jonathan Smolin": []
    },
    "AMES085": {
        "Allen Hockley": [],
        "Dennis Washburn": [],
        "Jonathan Smolin": []
    },
    "AMES055.02": {
        "A. Kevin Reinhart": []
    },
    "AMES054": {
        "A. Kevin": [
            "review 1: \"06S with A. Kevin: So how this class worked is that we had two teachers (who were both excellent by the way) who were provided by the American Language Center who taught us Moroccan Arabic. We were split into two classes (those who had taken Arabic before and those who hadn't - it is slightly to your advantage to have taken Arabic before) and every week the professors switched between the classes. This is a flat out language class but also a culture class. I had fun.\""
        ],
        "A. Kevin Reinhart": [],
        "Diederik Vandewalle": []
    },
    "AMES053": {
        "A. Kevin Reinhart": [],
        "Diederik Vandewalle": []
    },
    "AMES045": {
        "Theodore Levin": []
    },
    "AMES043.10": {
        "Wei Yu Tan": []
    },
    "AMES043.04": {
        "Yusaku Horiuchi": []
    },
    "AMES043.03": {
        "Dennis Washburn": []
    },
    "AMES042.12": {
        "Theodore Levin": []
    },
    "AMES041.10": {
        "Chad Elias": []
    },
    "AMES041.06": {
        "Clare Gillis": [
            "review 1: \"17F with Clare Gillis: This was a really, really, really interesting class, taught by an expert. Like, there is no disputing the fact that Professor Gillis is like an encyclopedia of MENA cultural, historical, and political information. You will learn a lot in this class. I might say that this class quickly evolved from \"Reporting the Arab Spring\" into \"Middle Eastern Politics 101\", but I suppose you kind of need a solid basis in MENA politics to understand the Arab Spring. But you won't get a good grade--Gillis is a HARD grader, and like the previous poster said, is pretty disorganized. There is a lot of reading, although with a few minor exceptions I would say that all of it is super interesting and thought-provoking. Overall, take this class, learn something, and be satisfied with the B+ you will inevitably earn.\"",
            "review 2: \"17F with Clare Gillis: Prof. Gillis is an phenomenally interesting person. She has lived a good part of her life in the Middle East, reporting on the ground. She tells amazing stories. For example, she was captured on the front lines of the Libyan revolution by Qaddafi's soldiers, imprisoned for several months with Jim Foley, the journalist who was horrifically beheaded by ISIS in 2014. She received a copy of Animal Farm and a strange letter directly from Qaddafi himself, and she was one of the first journalists to report Qaddafi's death. Her class was intimate and open to discussion, and the articles she suggested helped me learn a lot. The subject material is really engrossing. She requires Canvas posts for most readings, which are a bit annoying (you have to do them the day before class), but make the discussion quite a bit better as they force you to analyze the reading. Even if you're not an AMES major, these issues are important to understanding the modern world, and few have as much of a powerful and realistic grasp of the Arab Spring as Clare. However, she is also very disorganized. We roughly followed the syllabus, but we did not receive it until the 3rd week of the term. She also cancelled one of our papers the day before it was due. The due date for the final paper wasn't clear, which actually hurt my grade slightly, although she was very flexible and gave extensions if you needed them. You have to be prepared for some uncertainty. Overall: a bit of a layup, just do the readings and write your papers on interesting topics. Make meaningful comments in class. Be prepared for disorganization. In some ways, you decide how much work you have to do; you can choose to do the readings you want. Professor Gillis is dope and highly recommended. Plus, it's a NW and INT distrib!\""
        ]
    },
    "AMES040.08": {
        "Lewis Glinert": []
    },
    "AMES040.07": {
        "Lewis Glinert": []
    },
    "AMES040.06": {
        "Allen Hockley": []
    },
    "AMES040.01": {
        "Woon-Ping Chin": []
    },
    "AMES030": {
        "Theodore Levin": []
    },
    "AMES029": {
        "Christopher MacEvitt": [],
        "Diederik Vandewalle": [],
        "Veronika Fuechtner": []
    },
    "AMES028": {
        "Christopher MacEvitt": [],
        "Diederik Vandewalle": [],
        "Veronika Fuechtner": []
    },
    "AMES027": {
        "Christopher MacEvitt": [],
        "Diederik Vandewalle": [],
        "Veronika Fuechtner": []
    },
    "AMES026": {
        "Kenneth Bauer": []
    },
    "AMES024": {
        "Woon-Ping Chin": []
    },
    "AMES021.11": {
        "Sunglim Kim": []
    },
    "AMES021.10": {
        "Jung Ja Choi": []
    },
    "AMES021.07": {
        "Sunglim Kim": []
    },
    "AMES021.05": {
        "Soyoung Suh": []
    },
    "AMES021.04": {
        "Soyoung Suh": []
    },
    "AMES021.03": {
        "Sunglim Kim": []
    },
    "AMES019": {
        "Mary Green": [
            "review 1: \"04F with Mary Green: This is a very interesting course with lots of homework. The prof often assumes you have a backgroundn in Islam and the North African region. Many dropped out for this reason. I learned a lot from this class, but was often stressed with how much work was required of me.\"",
            "review 2: \"04F with Mary Green: The books we read are great and the small class size is also wonderful, but in class we usually didn't talk about anything. If you're looking for an easy class to take, its great.\"",
            "review 3: \"04F with Mary Green: prof nearly ruins the class but material was good and learned a lot\"",
            "review 4: \"04F with Mary Green: This course had potential to be very interesting. The books and articles we had to read were insightful and poignant, but the professor completely sucked any possible life out of this class. She not only went off on unrelated, boring tangents during class, but I found her to be very judgemental of many students. She chose clear favorites and her grading was subjective and arbitrary. I found myself dreading this class every time we had to meet because I disliked the professor so much. I wouldn't argue against this class, necessarily, but more against Professor Green in general.\""
        ]
    },
    "AMES018": {
        "Jody Diamond": [
            "review 1: \"09S with Jody Diamond: This was supposed to be a history and culture of Indonesia course. It wasn't. It was more like a class in gamelan than anything else, but it wasn't a class in gamelan either. It seemed to be a course that no one was interested in-- not the professor and not the students-- and that no one was taking seriously-- again, neither the professor nor the students. It seemed to be crowded with seniors looking for an easy A who, the few times they appeared in class, did nothing (course related, though there was plenty of disruptive activity) and knew nothing. The ostensible requirements for the course were difficult to discover, as there was no syllabus ever given out. As the end of the course approached, assignments were suddenly introduced. One was to participate in a concert (this we did know about from the beginning) and to write about what we had learned from this experience. There were no guidelines given for this paper, and I shudder to think what some of my fellow 'participants' wrote judging from their preparation for and behavior during the 'concert'. We were also told, as the end of term approached, to write a paper on a book that we had never read or discussed and that was not in the bookstore. Again, no guidelines were offered for the writing of the paper. Since I had learned nothing about Indonesia during the course of the term and had known nothing about Indonesia before enrolling-- which was one reason I had signed up-- it was not easy for me to write the paper on an intensely dull book that demanded extensive knowledge of Indonesian culture and politics. However, none of this really mattered as we never received grades for our papers, comments on our papers or any indication that anyone had ever read our papers. I hope my classmates all got the grades they were hoping for. I assume that they did. I did not get what I was hoping for, which was some knowledge of a fascinating culture. I know that, sadly, this review will encourage many people to take this course. Wow. If this is why you came to Dartmouth, I feel sorry for you.\"",
            "review 2: \"08S with Jody Diamond: i don't know what i did in this class, it's great though\"",
            "review 3: \"07S with Jody Diamond: Take this class if you know whats good for you. Learn Gamelan! Take it as a fourth in the spring and you won't regret it.\"",
            "review 4: \"06S with Jody Diamond: i've taken some guts at dartmouth.. and they dont compare to this. i cant think of any class, besides maybe music 51, where you would sit in a circle outside and do some chanting and hand motions once a week, and then play the indonesian gamelan instead of having class once a week as well. go to class, do the very easy and sometimes enjoyable homeworks on time, and talk to jody a few times and you will definitely do well. some (probably.. 2 or 3) people got stressed wondering what kind of grade they would get, since she doesnt really give you an idea of how you are doing. also, know that she's VERY flexible in terms of work if you, or the whole class, talk to her. if you dont get in through bannerstudent, go to class anyways and talk to her about getting in. a definite must-take class if it's your senior spring and you need something that wont interfere with your pong time.\"",
            "review 5: \"06S with Jody Diamond: This class is very easy and a bit of a joke. The least work I have ever done for a class at Dartmouth. Prof Diamond is very nice and helpful in the weekly gamelan sessions, but she really doesn't lecture in class. Furthermore, she never really responds to blitz so if there is a change in your schedule, or if you are having problems with anything, you have to talk to her. That being said, she is very flexible.\"",
            "review 6: \"06S with Jody Diamond: if you can get in it. it\\'s great\"",
            "review 7: \"04S with Jody Diamond: This class is really easy, no tests no papers, lots of fun.\"",
            "review 8: \"04F with Jody Diamond: I do not think \"professor\" Diamond is playing with a full Gamelon.\"",
            "review 9: \"04F with Jody Diamond: The gamelan is like an Indonesian orchestra and was so fun to play the instruments and the concert at the end was enjoyable.\"",
            "review 10: \"04F with Jody Diamond: this class rocks...so fun and awesome. Professor diamond is so nice.\"",
            "review 11: \"04F with Jody Diamond: this class is great. the proff is quirky. it's fun and there is barely any work. you just play instruments and make up skits. it's like a fun break in between your other classes.\"",
            "review 12: \"04F with Jody Diamond: Professor Diamond is the sweetest prof I've ever had! Take her class!\"",
            "review 13: \"04F with Jody Diamond: The professor is so nice and flexible about assignments/tests. Once a week, instead of regular class, we learned to play instruments. The class was a lot of fun and not much work. Also, it is a non-western.\"",
            "review 14: \"04F with Jody Diamond: Prof. Diamond made class extremely interesting. Very hands on class. Not a lot of work but learn a ton. Highly recommend this one.\""
        ]
    },
    "AMES017": {
        "Lewis Glinert": [
            "review 1: \"07S with Lewis Glinert: Professor Glinert is an extremely knowledgeable man who expects a lot of his students. Though I found his tests to be difficult, I believe that his papers (he focused on how well we could write on a given topic, rather than having us devise our own theses) greatly improved my writing. Definitely inspired an interest in this subject. Glinert is a wonderful professor who genuinely cares. Everyone should take a class with him.\"",
            "review 2: \"07S with Lewis Glinert: I kind of expected this class to focus more on culture and less on hebrew's linguistic history. that got a little boring at times. The culture stuff was really interesting though, and I'm considering taking Hebrew now. now a word about the quizzes- they're brutal. he says that they cover the \"general ideas\" hah......no. I guess the details he asked for were things that were helpful to one's understanding of the topic, but they were still details. He's a fair grader for the papers, but you do have to really know what you're talking about. It's a good class, and it makes you think. I think this class also made me a better writer.\"",
            "review 3: \"07S with Lewis Glinert: There was a lot of reading but it was really interesting, and all the papers were based directly from the reading we did for the class.\"",
            "review 4: \"07S with Lewis Glinert: Professor Glinert is a very bright man who is extremely knowledgeable about jewish history/israeli history/hebrew culture. He is an expert in this field. There are just the right number of assignments--a few papers and a few quizzes--that adequately test your knowledge of the material. If you have any interest in Hebrew/Israeli culture and history, and want a great prof, this is a great course.\"",
            "review 5: \"06S with Lewis Glinert: very interesting material and professor glinert is amazingly knowledgeable on the subject. he can basically talk for hours on any question you have so if youre really interested in something, go to office hours. the papers are interesting and based on good readings. the class does require a bit of work, but not much more than an average lit class, i would imagine.\"",
            "review 6: \"06S with Lewis Glinert: Glinert is an interesting Professor who is extremely knowledgable about the subject matter. Would be an interesting class to take for all who are interested in the history of the Hebrew Language and how it became the spoken language of Israel\"",
            "review 7: \"05S with Lewis Glinert: Glinert is incredibly knowledgable, the course was interesting, and the quizzes and short essays were fairly assigned and graded. I'd highly recommend taking classes with him if you're interested in Jewish Studies or Hebrew.\"",
            "review 8: \"04S with Lewis Glinert: Very interesting, and Glinert is really cool.\""
        ]
    },
    "AMES015": {
        "A. Kevin": [
            "review 1: \"09X with A. Kevin: I found the material really interesting, I'm a gov major and knowing about Islam is really pertinent to studying international relations -- this helped me understand where people from that part of the world are coming from. Reinhart thinks he's the shit, but once you get over that -- he really knows what he's talking about and if he doesn't know, he'll say so. His biases are also really obvious, which makes it easier to take what he's saying with a grain of salt and recognize that.\"",
            "review 2: \"09X with A. Kevin: Professor Reinhart will teach you a lot and clearly knows his stuff but he's SO arrogant that sometimes I just wanted to slap him. If you're going just for the TMV, it's a lot of work for it, but if you're interested in Islam you should take this class.\"",
            "review 3: \"09X with A. Kevin: theres one midterm paper and one final paper (both only 1600 words) and one 1000 word assignment during the span of the class the best part of this class is the attendance is 50% of your grade..so if you need an easy class with not a lot of work..take thissss...he gives B's on basically all the papers...and then if you go to class everyday you'll get a B+/A- in the class...and literally you dont ahve to do ANY work besides the 3 papers..there's reading every night, but totally not necessary to do great class if youre lookin for an easy one\"",
            "review 4: \"09X with A. Kevin: Don't expect this class to raise your self-esteem. As long as you're secure in your own personal worth I DEFINITELY recommend taking this class because it is INCREDIBLY eye opening and gives you so much more of a grasp on the context behind current Islamic movements as well as the breadth of perspectives and ideas that different Muslims in different places have. It's really really huge in giving you a much more informed worldview and you'll learn a lot of really fascinating information. That being said, the professor you will have to learn to deal with. Don't take anything he says or does personally, although it can be hard because sometimes he can be a huge jerk. He's REALLY SMART but sort of shows that off in really annoying ways where he'll make some comment that's clearly nothing more than mental masturbation for his own pleasure of proving how smart and knowledgeable he is. If you're not bothered by his personality however, you'll get really good information out of the course. It's completely shifted my worldview. Oh, also be prepared to do a TON of reading, essays (the midterm and final are take homes with 2 essay each that essentially ask you to synthesize everything you've read up to that point...hardly a joke) and you have to write a lecture which is supposed to be cover the current literature on a given subject and rival the professor's lecture that the prof gives in class. Basically a TON of work and another opportunity for the prof to make you feel bad about yourself. Nonetheless, if you come out the other side, it's a super important, huge class that TOTALLY relates to all sorts of current events now. You also read statements from Osama bin Laden which is SWEET.\"",
            "review 5: \"09X with A. Kevin: The course was interesting. The Prof assigns a LOT of reading and his papers require that you pretty much understand it all. Some people can find this annoying, bu it actually does help learn the material and gain an appreciation for the subject matter.\"",
            "review 6: \"08S with A. Kevin: This class was less interesting and harder than I wanted and expected it to be. Reinhart is cool, but he can be a jerk in class, blowing people off because he thinks they're questions are stupid or getting too upset over people arriving late to class. I didn't do most of the readings, which wasn't much of a problem because you can usually tell which ones will be on the exams. I would say it's too much work to take the class just for the tmv.\"",
            "review 7: \"08S with A. Kevin: Interesting material, but Reinhart's nasty attitude is class can be distracting. Exam grading rather arbitrary.\"",
            "review 8: \"08S with A. Kevin: Even if you have absolutely no experience with religion classes, you should definitely take this course! Professor Reinhart is so great, and definitely commands respect while still seeming down-to-earth and funny during his lectures. The material is super-interesting and definitely relevant to today's world. I mean, in what other class could you have a textbook made up of the open letters of Osama bin Laden? Such a fascinating course, reasonable quizzes and papers, as long as you attend all the lectures. Definitely one worth taking!\""
        ],
        "Jody Diamond": [
            "review 1: \"02F with Jody Diamond: Professor Diamond is a wonderful teacher! She helps you learn and the class is very interesting and fun. It was so nice to have this class...I looked forward to it every time! TAKE THIS CLASS IF YOU CAN!\"",
            "review 2: \"02F with Jody Diamond: Boring and vague would sum it up - there's only so much of xylophone playing one can do. And where were the bits about the Hindu epics? Jody is never available outside of class - she schedules rehearsal times and shows up late, or doesn't show up. Her blitz responses are days late!\"",
            "review 3: \"02F with Jody Diamond: if you show up, show interest, and simply do the few assignments (i'm talking maybe once a week but we only had 4) then you'll get an A... sometimes the 2 hours seems really long and monotonous but it's not at all an intense class. you'll learn more than you think. diamond is really dedicated to the material but NEVER gets assignments back to you so its impossible to predict your grade and that's frustrating. other than that, it fulfils some random distribs and you'll get out of it what you put into it.\"",
            "review 4: \"01F with Jody Diamond: Anyone considering taking Music 8 or another course from Professor Diamond should not go into it expecting a structured curriculum. At first frustrated by it, I eventually grew accustomed to the varying pace and relatively low intensity of the course. It is a 10A, and for the whole 2 hours, we would play music, listen to stories, practice shadow puppetry, etc. without a break. The time flew by. This course has a few reading materials, although they are not as necessary as the reading for many other D. courses. The music is taught in the oral tradition, meaning that we learned the music by playing it and memorizing our parts. If we received sheet music, it was often not until we had already been taught the song. It taught us to learn in an entirely new way. This class was marvelous. It was a great break from the monotony of lectures, readings and homework. It taught me patience and to pause once in a while in the frantic Dartmouth pace of life. I recommend it to anyone who has or does not have experience with music- anyone can play!\"",
            "review 5: \"01F with Jody Diamond: It's an extremely easy course which you can either get a lot out of or slide by without doing any work. If you're looking for an easy, interesting ART distrib, this is it.\"",
            "review 6: \"01F with Jody Diamond: You can breeze through this course if you put your mind to it, but you can also gain a new understanding of music and puppetry and have a great time!! You never know what to expect in the basement of the Asian Studies Center. Be ready to enter the world of shadows and gongs - and leave your shoes at the door!\""
        ],
        "A. Kevin Reinhart": []
    },
    "AMES013": {
        "Dennis Washburn": [
            "review 1: \"06S with Dennis Washburn: There were two profs. Dorsey is awful, his lectures are boring and his readings are long and unnecessary. Washburn's lectures are somewhat engaging and his readings are much more concise. Good course to get rid of LIT and NW distribs\"",
            "review 2: \"06S with Dennis Washburn: Washburn seems easy. But I think Dorsey did a lot of the grading. Both Washburn and Dorsey are boring lecturers. The class assigns a ton of readings, which you really don't necessarily have to read carefully. Just be aware of what the readings are about. GO TO THE REVIEW SESSIONS.\"",
            "review 3: \"06S with Dennis Washburn: Course should be retitled 'Intro to Boring Japanese Literature.' Sounds cool, and the first couple days are interesting with discussion of Japanese hip-hop. Then the course gets to its real focus and the rest of the term is spent reading old, boring, Japanese literature, all of which must be closely attended to for there to be any chance of you doing well on the exams. Exams are hard - median/mean on the first one was in the 60's. If you don't like doing tons of not-that-interesting reading, don't take this course.\"",
            "review 4: \"05S with Dennis Washburn: Good class. Washburn has some interesting things to say about Japanese culture. Hes a good lecturer. Some of the readings are boring, and there is a lot of reading, but overall I enjoyed the class. I wouldn't have taken if if I didn't need it for the LSA+, but even if I didn't need it it was a good call.\"",
            "review 5: \"05S with Dennis Washburn: there was no way that all the reading could've been accomplished unless you were only taking 2 courses. there's a lot of reading and its ridiculously long. however, you only need to do about a fourth of it and he lets you know what fourth you have to do. if you do all the reading, this course is really tough. if you read only what you needed to read, this course is very easy going.\"",
            "review 6: \"05S with Dennis Washburn: we studied japanese hip hop, methods of suicide, and other interesting topics. also watched kurosawa films and just had a great time. fun prof\"",
            "review 7: \"05S with Dennis Washburn: Professor Washburn is a very interesting guy and he loves Japan. The class was really interesting, even though I came in with no expectations. It's a really cool class and Washburn is a really chill guy...TAKE IT if you need non-western or lit distribs.\"",
            "review 8: \"02S with Dennis Washburn: The course is a supe rintro to the japanese culture. I knew nothing on the subject and I learnt a lot. it's a ton of work though so beware!\"",
            "review 9: \"02S with Dennis Washburn: Great course, lots of interesting readings and material. However, the workload was way too much. There were nights when we had to read an entire novel. Also the class could have been a little more interesting, people were literally falling asleep and snoring in the class.\"",
            "review 10: \"02S with Dennis Washburn: The class was abnormally large this term. I felt that if the class was split into two or more smaller sections it could have been handled better. This was attempted with x-hour discussion sections, but they did not help very much.\"",
            "review 11: \"02S with Dennis Washburn: This course ostensibly had a firm outline and direction to it, with discrete units laid out on the syllabus. But Washburn's lectures were meandering, too loosely structured and littered with theoretical questions for which he had not laid the proper groundwork. I'll give him the benefit of the doubt and chalk it up to a much larger-than-expected class size.\""
        ],
        "James Dorsey": [
            "review 1: \"08S with James Dorsey: As my first culture/history class at Dartmouth, this was a great intro. I was a bit dismayed to learn that I would need to take JAPN 10 in the spring in order to go on the LSA+ (which, along with Japanese [Language] 3 and freshman seminar, left no room for anything else), but in the end, the class was interesting, enjoyable, and a welcome respite from what, for me, would have necessarily been another math course. Let me preface my actual review by explaining one especially relevant point (in my mind anyway). It is likely that around 20 members of the class will be language students going on the LSA+, while the other 10-15 students are not. As a member of the former group it was a bit harder to see, but there was definitely somewhat of a split between these groups, at least in the sense that the language students all already knew each other, and most already knew Professor Dorsey. The language students were also able to pick up on some details of the lectures (involving kanji and Japanese words) that at least slightly enriched the experience. This is not to say that anybody ever looked explicitly uncomfortable, or that an understanding of the language was at all necessary. Anyway... The class covers Japanese history from pre-history (aka: when Japan was merely the geographic area presently known as Japan) until modern times, although due to time contraints, relatively little time is spent on modern culture/history. But the history doesn't seem to be the focus. Rather, it is the cultural and literary aspects of the different time periods that receive the most attention. There tended to be an article or two to read for every class (with about 4 full-length books spread out over the course) which ranged from classic poetry to feminist philosophy to modern manga. Needless to say, everyone I talked to admitted to shirking on the readings from time to time, which (being a goody-goody) shocked me. But honestly- they're the only real work for the class, and they are by no means presented in excess. Several movie screenings were also \"required,\" although these were hardly a burden as every movie was more than worthwhile (Princess Mononoke, Seven Samurai, Lost in Translation, etc.). The two short midterms (that focused on the literature) were more than fair. I admittedly studied very little, but aced them just as a result of coming to class and paying attention every day. The single group project was no big time-sink (just a narrated powerpoint on a topic not elaborated on in class), although it could become tricky if it were the case that no one in the group had any technical prowess. The final paper is a bit of a wild card, as it can be on any [relevant] topic you want, as long as you can relate it to key themes of the course with an actual thesis. I wrote mine on a modern day anime, for example (haven't received grades yet though- I might have failed terribly). I really have no complaints about Dorsey as a professor. His lectures were well-presented and interesting. He was always open to question and discussion-type comments during class, and was more than accessible outside of class. His knowledge and appreciation of the subject is clear, and keeps the class moving. In short: -Enjoyable, interesting material (in the form of frequent readings and movies) -Little real \"work\" -Two fair tests, one small project, one final paper In you have to take this for the LSA+, well then you have to take it... If you're going for an AMES minor, or just want to fulfill NWculture (or something), and have any sort of interest in Japan, this class is worthwhile. It's no big time committment, but you'll still learn a lot.\"",
            "review 2: \"07S with James Dorsey: This course is really fun to take as an introduction cultural class. The mid-terms mainly involve some ID question (give you some names and have you write a short passage about its importance in Japanese Cutlure), so if go to class and take notes. You will be glad to have taken the course with Dorsey sensei because he is a such a passionate yet fun-loving scholar in Japanese Department. Go to his office hour, talk to him about anything you think about the class or Japan and you will know how cool he is.\"",
            "review 3: \"07S with James Dorsey: I really, really liked this class. We had some theoretical-type readings that weren't everybody's cup of tea, some mandatory movie screenings in the evenings, and a random group project that involved doing a study guide for the rest of the class, but there was a final essay instead of a final exam. The prof was really lenient on what things we could write about. The lectures were really interesting, especially with this prof, and I found the class discussions thought-provoking. The only not-really-cool thing was that the class was so large and the people who were taking Japanese and the people who weren't mostly self-segregated, but that doesn't really impinge on the quality of the class itself.\"",
            "review 4: \"04S with James Dorsey: ok first, dont' take this class if you're not going to japan in the summer. prof dorsey teaches japanese language class and recognizes the ones in his classes...so when there are exams...for a short paragraph answer you get maybe 14/20 and you dont' even know why...and what a 20/20 answer is? we had short papers..maybe 6-7 \"reaction essays\" and again for these, you don't know why you got a B+ when your friend who takes japanese gets an A...so yeah..don't take this course if you don't have to cuz it's hard to get an A.\"",
            "review 5: \"04S with James Dorsey: very interesting\"",
            "review 6: \"04S with James Dorsey: The class itself was interesting. However, I was expecting mainly a course on modern Japan, and got a history/historical culture course - which is fine, I just wish the ORC made that more clear. Overall, it was really interesting - I've always been interested in Japan and this gave me a nice background in how it got to be where it is now. The course gets particularly interesting when it gets to early twentieth century Japan, Dorsey's specialty. Dorsey, good natured as he is, unfortunately seemed to stumble through lectures sometimes. He could use a bit of preparation; but I've definitely had worse professors (and a few better ones). Another complaint I have is one typical of the Asian courses I've taken thus far - the professor and the Asian-language speaking students develop a kinship and all laugh at subtle things that us native US-borns can't get - simple characters adorning the powerpoints that the prof doesn't bother translating. It's understandable, and I don't blame anyone for it - I just wish Dorsey would bother to translate everything. I think he sometimes forgets that not everyone can read/speak Japanese. Overall, my other major concern was that the majority of the course looked at Japanese literature through different lenses - two main ones being Marxism and feminism. Feminism - whatever, it just seemed a bit out of place, but Dorsey likes his gender theory. Marxism was just ridiculous. At times it was treated as if it hadn't been disproven by 70 years of Soviet history. But other than that, the course was enjoyable, and I would recommend it, particularly if you are taking it like I am for a NW.\"",
            "review 7: \"04S with James Dorsey: seems unlikely that it is possible to really cover 3000 years of history in 10 weeks. I probably would have learned more had I done all the reading (was my fourth course, I was planning to go to Japan, wanted a sense of its history). THere were some interesting bits, some sort of tedious bits. Lectures were sometimes frustrating because they oversimplified complicated issues (cultural relativism, the idea of the 'collective mind', for example). It is a good, broad survey though, if that's what you want.\"",
            "review 8: \"04S with James Dorsey: the course material was interesting but you really didnt need to do the reading i felt like i wasted my money the lectures were basically just a re-interation of the reading which made me not do the reading (because it was pointless and a waste of time) but then the tests were killer... even if i HAD done the reading Dorsey is a very unfair grader so i guess if you have to take this class, choose a different prof, or make sure youre taking Japanese language with Dorsey He seems to favor his Japanese language students and give them better grades\"",
            "review 9: \"04S with James Dorsey: The prof is one of the best\"",
            "review 10: \"04S with James Dorsey: I thought this class would be interesting look at japanese culture which was the case for the first week. Then the calss became mostly a lit class reading medieval poetry and the Prof. sort of rambled through his presentations, and wasnt sure of some stuff.\"",
            "review 11: \"03S with James Dorsey: The only problem was with 30 students, it was kind of hard to set it up seminar-style as I thought it would be. I felt like it was mainly the same few people that spoke in class the most. There were a lot of readings, but they generally weren't difficult. Three papers and two quizzes, all of which covered the material taught pretty well. If you are at all interested in Japan, this is a good class to take.\""
        ],
        "Sachi Schmidt-Hori": []
    },
    "AMES012": {
        "Susan Blader": [
            "review 1: \"09W with Susan Blader: Chinese 10/AMES 12 has the enormous task of introducing students to Chinese culture, language, history, philosophy, art, and literature. Itâ€™s simply too much material for one course. The readings are brutal, and some very uninteresting, but they do appear on the final and midterm. Before each test, our class found that the best method of studying all the material was to divide up the study guide amongst the class and piece it together. Study the guide and youâ€™ll do fine.\"",
            "review 2: \"09W with Susan Blader: Professor Blader is a wonderful teacher who inspires interest for her subject. She is very devoted to the study of China and her class is a fascinating introduction to the country. She always makes herself very available to her students and, every week, she also cooks noodles for her students at the Chinese Language house. All in all, I would really recommend taking this class to someone who is interested in China and does not know very much about it.\"",
            "review 3: \"09W with Susan Blader: After reading about this class on SA, I expected it to involve a lot of reading, dull memorization, and test preparation. However, I was totally wrong. During the first week of class, I felt readings were tough and kind of boring. In the second and third week of class, the professorâ€™s enthusiasm made me become fascinated by Chinese literature and history. After that, homework readings became much easier and more interesting for me, and I started to enjoy the class greatly. I think people are referring to classes like this one when they say Dartmouth has awesome classes.\"",
            "review 4: \"08W with Susan Blader: Professor Blader is an amazing professor who taught me so much about 4000 years of Chinese culture and tradition in just 9 weeks. The readings are really extensive but she always goes over them in class, so don't worry about outlining your readings unless you're a major overachiever just skim through them and take careful notes in class. For the midterm and final, just study the study guide REALLY well and you'll be fine. There's nothing unexpected on the midterm and most of the final, although the final was waaaay too hard and ALOT harder than the mid term. And definitely go to noodle hour, I wish my schedule let me go to more.\"",
            "review 5: \"08W with Susan Blader: im very impatient with people who dont put in the minimal effort and complain about the course incessantly. that's ignorant this is easily the best course ive ever taken here. interesting readings, great lectures, and stimulating discussions. and, of course, the class jeopardy before midterm/final is, like, the shit. take this class. tell your friends to take it. dont graduate without having taken this class.\"",
            "review 6: \"08W with Susan Blader: This class is pretty interesting. The reading materials are a little dry in the beginning, but when we move on from poetry to short stories, the readings become a lot more fun to read. Definitely keep up with the work and listen to the Professor in class. Half the stuff on the midterm and final, or rather almost all of it, were covered in class.\"",
            "review 7: \"08W with Susan Blader: prof. blader can sometimes seem a bit unorganized (we spent 25 minutes getting into groups for one class) but the lectures start making a little more sense after you get by the first part of the class. there are far too many readings and not all of them are on the tests, which is kind of a pain. just make sure you pay attention in class, where she talks about all the stuff you will really need to know. the readings for the second half become a bit more interesting. to be fair, it is pretty difficult to fit 4000 years of history into one class. be warned, the class is about literature, while the tests are about literature and history. you have to read the history textbook on your own and know dates and stuff for the tests that you don't need for class. the days right before the tests won't be fun unless you read the history beforehand.\"",
            "review 8: \"08W with Susan Blader: Too much history to cover in such a short amount of time. On top of that, the class is poorly taught and impossible to follow. No structure. Your grade is arbitrary.\"",
            "review 9: \"08W with Susan Blader: Disclaimer: I'm not being ignorant or lazy - I did all of the work and got an A. This class is unfocused and unstructured. Do not take this class if you can help it. Every hour was absolutely torturous and wasted.\"",
            "review 10: \"08W with Susan Blader: The purpose of this class is to serve as an intro to Chinese culture, but Blader wants it to be more of a intro to Chinese literature, and assigns most readings with passenges from Chinese poetry and literature in addition to readings about history. As a result, most of the class was devoted to literature and not enough to actual history; I don't think we even talked about the Han Dynasty. This would be a great class if it was more organized and focused on only Chinese culture with a few, well-selected excerpts of literature rather than anywhere from 40 to 100 pages of it every class. Most of the people in the class are going on the FSP; if you can, take a different Chinese culture class as it can serve in lieu (though for the major I think you need this class). The class does get better after the mid-term and when you enter the 20th century, but this is only because there is less literature in this time period so she was forced to pay attention to historical issues. Make sure you get in a good discussion group though I'm not even sure if Blader graded the so-called group work we did. At times, it feels like you need a transcript of what she says in class because she will put test you on stuff she says. The readings are not essential; just skim them. Be warned, she also uses every x-Hour. To be true, I did learn more about Chinese culture, but only because she pounded a few concepts over and over again like filal piety and Confucianism; this class could have been something so much more. The guest lecturers are pretty good, especially Rudelson's on Depression. This course does fulfill two distribs. Overall, however, a frustrating, uninspiring course, but one you can get an \"A\" in if you study.\"",
            "review 11: \"08W with Susan Blader: Only take this class if you need to for the fsp, otherwise, skip it. The class is a huge bore. Too much reading that no one ever does.\"",
            "review 12: \"08W with Susan Blader: Most people took this class because it is mandatory for the Beijing FSP. Know that this class is taught through LITERATURE. You don't need to know Chinese, but it helps a lot if you do. There's A LOT of assigned readings, but all the important stuff Prof. Blader goes over in class. Only take this if you have to. It felt like a history course that focused on Chinese literature. Dates to remember, people to know, it's all here. A good thing about the course is that Prof. Blader is sympathetic when it comes to exams. Just make sure you hone your memorization skills before taking this class.\"",
            "review 13: \"08W with Susan Blader: First off, really nail down what is on the review sheets for the midterm and final. Of course, you theoretically should go to classes, which I wish I did more. Unfortunately, I didn't, but considering my final grade, as long as you have a gist of what the prof wants, you can do pretty well on the final. Study for the jeopardy game -- she gives extra credit on the midterm and final if you win with your team. To be fair, 4000 years of history is a lot to cover in nine weeks. The prof really focuses on literature, and her lectures are mostly based around that. Keep in mind that her exams aren't solely focused around the literature -- she contributes a lot of her input and thought into the significance of the literature, and she WILL test you on that. There are a lot of other technical issues the prof introduces in class that you won't be aware of just by reading the material. The readings are usually easy but long. They tend to get more interesting as you emerge from the BCE era. Don't read too carefully -- just skim over the material since the prof will go over them in class anyway. Anyway, like 90% of the class, I groaned and complained about the class when taking it, but you do walk away with something. I feel that I have more of a grasp on the Chinese culture through its literature. Regardless, I am extremely glad that I am over and done with this class.\"",
            "review 14: \"08W with Susan Blader: take this class only for the FSP, you can bring other work to class to do as she drones on. if you do the readings occasionally it helps when you cram for the midterm and final, both are long and boring. i doubt she reads them all.\"",
            "review 15: \"07W with Susan Blader: If you want to do well in this class, make sure you read whatever she talks about in class. Blader gives a very good review sheet before each test. If you study everything on the list thoroughly, you'll get an A. There are no surprises. Blader also gives lots of bonus points before and on the test. For some years, the median grade for the class was A. The median for my class was A-, but only because everyone was so lazy and never bothered doing the readings until the last minute. Take notes on the stories you read, and form study groups. Make sure you know the context of the stories you read (era, author, style).\"",
            "review 16: \"07W with Susan Blader: I had to take this as a prereq for the FSP - it was the worst class I've taken at Dartmouth & possibly ever. If you have to take it - sorry. If not - DON'T TAKE IT.\"",
            "review 17: \"07W with Susan Blader: This class truly defines the term \"ridiculous.\" The lectures are incoherent, scatterbrained, and BORING. Taking notes in class is near impossible simply due to the sheer discontinuity of the lectures. It's not really an \"introduction to Chinese culture\" so much as a crash-course in random Chinese literature spanning 3000 years. There is an absurd amount of nightly reading that absolutely no one in class fully completes. The tests are fill in the blank and short-answer, the former of which is extremely unfair, as they generally ask for knowledge never covered in class or in the readings. This is quite possibly one of the worst lectures courses you can take at Dartmouth. Only enroll if you have to for your Major or for the Beijing FSP.\"",
            "review 18: \"07W with Susan Blader: This course is interesting, but expect a TON of reading. The tests will follow that material too. At least the lectures were helpful. Expect emails for delicious noodles!\"",
            "review 19: \"07W with Susan Blader: prof blader's a nice lady, but she isn't a great teacher. she thinks the material is so fantastically engaging that she can drone on and we'll be at the edge of our seats. sadly, it's not true. the depth of the course (or lack thereof) reminded me of a ninth grade history course... just straight memorization, no analysis, covering far too much in far too little time. i'm not really sure what type of course this is... clearly prof. blader wants it to be a lit course (hence the distrib), but it shouldn't be and, in many ways, is not. i'd say more than 90% of the kids were taking the class to go to beijing (as another noted, a nice little racket prof. blader, one of the ranking chinese profs, is running), so the class should prep you for what you need to know to appreciate/understand/operate within China... the macro culture ideas, the differences between chinese and western approaches to things (the medicine lecturer was very good), a brief understanding of the narrative of china, and so on. instead it tries to be too much and ends up being superficial and useless.\"",
            "review 20: \"07W with Susan Blader: This professor's lectures were scattered and confusing. She covers so much history and jumps back and forth. She didn't even fully establish the 13 Classics, which we had to memorize for the test. She blitzed out right before we took the midterm. I felt so bad for all the kids who didn't know any Chinese because the names of everything were very confusing. We would have some discussions, and any opinion she didn't agree with, she wouldn't listen to, or just dismiss what the person said. Any effort to argue a different viewpoint was quickly shot down. I think the biggest problem with this class is that she garners very little respect from her students. And rightfully so. I've never met someone so scatterbrained and...incapable? All in all, don't take this class. Don't be a major if you don't have to. I was forced into this class by my parents, and I figured that it gave me 2 obscure credits anyways.\"",
            "review 21: \"07W with Susan Blader: Blader isn't an effective lecturer, and she assigns too much reading. It's really difficult to catch up on the reading once you fall behind. She uses all the x-hours and she assigns reading for every x-hour. It's not easy to go to class 4 times a week and be responsible for at least a 1-2+ hour chunk of reading each night. Definitely try to go to most of the class sessions and pay attention to material that she repeats. That material will usually be on the exam. Overall, I would not have taken this class if I didn't need to take it to go on the FSP.\"",
            "review 22: \"07W with Susan Blader: Don't take it if you don't have to. I took it because I wanted to go to Beijing- probably 90 percent of the people in our class were. but if you do take it, i don't think it's too hard to get an A if you put in a reasonable amount of work. you get two distribs at once, so it's nice. The readings were interesting, but waayyy too much... If you don't have any background in Chinese, it may be a little difficult, but Blader is lenient for those who don't know any Chinese. The midterm exam was a shock for most people around me.. you have to read the readings and know the dates. But when you do know them, she doesn't grade too harshly.\"",
            "review 23: \"07W with Susan Blader: Blader's lectures wind and ramble and circle around the topic. Very ineffective. Also she assigns a ridiculous amount of reading. The subject is very interesting, but far too broad for any class, especially with a lecturer like Blair. The extra credit on the final was \"Give a description of the evolution of Chinese culture from 1600 BC to modern day.\" That said, Blair is nice enough and wants you to do well. Getting to know her does not hurt at all, if you have to take this class.\"",
            "review 24: \"07W with Susan Blader: it's basically an overview of 4000 years of chinese history in 9 weeks, so be prepared for a lot of reading. but in the end, when you reflect back, you'll be amazed at how much you have learned if you do all the readings -the class is what you make of it. the lectures can be a bit disjointed and there are about 3 guest lecturers. the midterm and finals are pretty easy given that you do the readings. prof blader is extremely nice and she'll always be willing to help you out if you are confused about her lectures\"",
            "review 25: \"07W with Susan Blader: This class absolutely sucks. The material (or at least the way it's presented) is mind-numbingly boring and the professor just rambles on and on. Do not take this unless you have to. Sure, it's probably an easy A but only if you manage to stay awake during class and do the readings, which was pretty much near impossible for me.\"",
            "review 26: \"07W with Susan Blader: I'll try to be fair and say that Blader is a genuinely nice person... or she can be if she wants to. Her lectures if you want to call them that, are all over the place and trying to take notes can be a feat in itself. thats why most students started bringing their laptop to class after the first couple of weeks for blitz etc. although this is a chinese culture class, you'll be studying mostly chinese literature and some history because thats what she considers chinese culture to be about. all in all, this class was not hard, but then again, i think i was on her favorites list.\"",
            "review 27: \"06W with Susan Blader: Professor Blader got into her field because she enjoys reading chinese stories and poems. She knows very little about chinese history, culture or geography. She does not understand the context of the literature she teaches about, so in her lectures she either says stuff that is obvious, incorrect, or frivolous. She is far more interested in the pretty descriptions in poems and the plot lines of her favorite stories than she is in actual chinese culture. Even if she decided to teach about chinese culture she wouldn't be able to, because of her tenuous grasp on anything outside the topic areas of literature and story telling. She thinks she's really smart though.\"",
            "review 28: \"04W with Susan Blader: first off, i had to take this class for my minor, so i had no choice. but if YOU have a choice, DON'T TAKE IT. i slept everyday in class (when i did go) because i was bored to tears. blader is an extremely boring prof and gives the most uninspiring, disorganized, confusing, and directionless lectures ever. she assigns an insane amount of reading (usually 70-100 pages for each class--that's 4 times a week) and most of the time, they won't even be discussed in class. the exams are easy if you memorize everything from her study guide. i did next to no reading and ended up with a B+ (median was an A), but the pain of having to sit through that class is not worth it.\"",
            "review 29: \"03W with Susan Blader: bad lecturer. skips all over the place. unorganized and confusing. assessments are mostly fill-ins. if you don't get one, you might not get the rest for the entire paragraph or two. interesting topic, but she made it boring. too much reading. reading that seems irrelevant. she says see has cut down on the required reading from previous years, but unless she cuts more, it's a lot.\"",
            "review 30: \"02W with Susan Blader: Professor Blader is a horrible lecturer. In class, she often rambles on with what seems like nothing very important to say. More often than not, there is no organization to her lectures and thus were very ineffective, making the mandatory 4 days of class (mandatory x-hour) seem extraordinarily unnecessary. Plus, the readings she assigned, especially in the beginning of the term, were often completely unrelated to what we would \"talk\" about in class. Although she reduced the amount of reading from the last time the class was given, there is still an unnecessarily large amount. The only saving grace of the class is the large amount of guest lecturers (often one per week), who actually provide the students with some useful information.\"",
            "review 31: \"02W with Susan Blader: More of an introduction to Chinese poetry and storytelling---that's it. Prof had little to say---repeated herself and called in guest lectures every week. Midterm asked for petty dates rather than providing a springboard to show what we had learned. Too many students with backgrounds in Chinese taking an intro.\"",
            "review 32: \"02W with Susan Blader: Although the course has great potential to be interesting, the lectures are incoherant and tend to be quite boring. The course lacks structure.\"",
            "review 33: \"02W with Susan Blader: The reading was overwhelming at times. Moreover, the videos required were too long and of poor quality (you watch them on the network). HOwever, the material is easy to digest, the tests are fair, if you study and know some facts/details. Prof. Blader is a nice lady, though her lectures are often repetitive (and do not cover the text, so read).\"",
            "review 34: \"02W with Susan Blader: This was a horrible course. I took it because I was told it was fairly easy and it was also a LIT and NW. Turns out it was pretty easy, I only had to suffer through some of the worst lectures I've ever had in my entire life. The material for this course wasn't that bad. Chinese history and literature is actually really interesting. Attending class wouldn't have told you that though. Professor Blader just wasn't clear and effective in her lectures. On the plus side, she is a nice lady. We read an insane amount of reading only to be given fill in the blanks on the exams. I haven't taken a fill in the blank exam since the 3rd grade (OK, EARS2), but this was just pitiful. The guest lectureres were even worse. Actually there was one professor from the art dept, who teaches Monuments of Asian Art (I forgot his name), who was very interesting, but other than that just terrible. High point, watching Farewell My Concubine. I really felt cheated doing most of the reading which was upwards of 100 pages a night, only to take these terrible exams, that really had nothing to do with the material. Do yourself a favor, save 3,000, go to Videostop rent that and pick up Ebrey's Illustrated History of China.\""
        ],
        "Sarah Allan": [
            "review 1: \"05S with Sarah Allan: The class may have been good had we not only read ancient chinese poetry. take this class if you need it for the fsp. don't take it for the LIT distrib. avoid allan in this class if you can at all costs\"",
            "review 2: \"05S with Sarah Allan: Bad class. Lecturing is not of a high standard. One visiting prof spend the whole of one lecture reading from a piece of paper. Course is based mainly on the readings and chinese literature which the professor likes to read in class. Particularly boring, although some of the material could be extremely interesting if taught better.\"",
            "review 3: \"05S with Sarah Allan: If you enjoy Tang poetry readings, this is the class for you. While I could appreciate the necessity of the material, the readings given in this class were overall unenjoyable. Allan may as well have not lectured because half the time I couldn't hear a word she said, and the other half she was just reading from a book. Also, be warned, this class is really on Chinese Lit.--not Chinese Culture.\"",
            "review 4: \"05S with Sarah Allan: The course had the potential to be really good, but Prof. Allan makes the subject so boring. She's very accomplished and is very knowledgeable, but she doesn't give effective lectures. Her lectures are often very disorganized, and overall she just doesn't present the material in a clear manner. She doesn't use powerpoints or outlines so that also makes it harder to understand her lectures. Also, I felt there was too much emphasis on history from way long ago - tracing back to prehistoric times - and not enough (hardly any!) on more recent and relevant history that would give us a better idea of the political, cultural, and social environment in China today.\"",
            "review 5: \"05S with Sarah Allan: The course, though titled \"Chinese Culture\" is focused largely on literature. Professor Allan's lectures were often chaotic, seeming more like a stream of consciousness of Chinese history than a coherent, organized lecture. However, the reading itself is quite interesting, and the class is not terribly difficult so long as you do the reading.\"",
            "review 6: \"05S with Sarah Allan: Prof. Allan is apparently an expert in the field, but is an awful lecturer. Her lectures are often unorganized and uninspiring- she lacks the force of personality to hold one's interest. In addition, her voice seems to be pitched at the exact tone to induce sleep.. the readings were interesting, some good prose works mixed in there. this course required a lot of memorization- dates, especially- which i found to be rather tedious.\"",
            "review 7: \"05S with Sarah Allan: I had to take this in order to go on the Beijing FSP, but if it wasn't required, i would've dropped it like it was HOT!! Prof Allan is so boring. The entire class was composed of reading ancient Chinese literature. I didn't feel like i learned anything cultural (history, music, ANYTHING), just pure literature. Don't take this class with Allan. If you have no choice, then i suggest reading some of the material during break just to stay afloat.\"",
            "review 8: \"05S with Sarah Allan: The class is really boring, but needed to take it for the China FSP. This was the first time Prof. Allen taught a big lecture class, so she didn't seem to know what to do. It's hard to hear her, and she writes really softly on the board so it's hard to see. However, she's an incredibly easy grader, as long as you do some work.\"",
            "review 9: \"05S with Sarah Allan: This is definately one of the classes you take only because you have to. About the only thing i got out of this course is an additional hour of sleep each day.\"",
            "review 10: \"05S with Sarah Allan: it's a culture course not a poetry course, but the prof doesnt seem to know that\"",
            "review 11: \"05S with Sarah Allan: The material is interesting, but the lectures are terrible. Prof. Allan will bore you to tears, and the lectures just go around in circles. The tests are really hard, study up if you take this: know names, titles of all poems, and dates they were written.\"",
            "review 12: \"05S with Sarah Allan: My first gripe was the choice of professor. This course was originally supposed to be taught by Prof. Crispin Williams, DAMELL (Chinese). Unfortunately, he was unable to teach the course, so Prof. Sarah Allan, DAMELL (Chinese), took over. Professor Allan is a very accomplished professor and a great person, but this was not the right type of course for her to teach. The class was very large (50+ students showed up on a regular basis) and the format was lecture-based. Unfortunately, Prof. Allan is not a very good lecturer for students taking an intro Chinese culture course. The course is a prereq for the DAMELL (Chinese) major and the Beijing FSP, so I have a feeling that many people were taking it not because they were interested in the thousands of years of Chinese culture, but because they HAD to. Although she had very good insight into the topics covered, Professor Allan would be more appropriate for advanced students (or students who actually care about two thousand year old Chinese poems). I'm a freshmen DAMELL(Chinese)/AMES double major, and this was my first course with her. I hear from upperclassman that she's an excellent professor in a smaller, discussion-based seminar course. Hopefully next year she won't be teaching this course. My other main gripe with this course was the testing. There was a mid term and a final, and two quizzes. The quizzes were easy fill in the blank, short answer fact recalls, but the midterm and final were another story. Basically the test had unidentified excertpts from the hundreds of poems we read during the course, and we had to identify the author, title, and dynasty. It was ridiculous. The poems are really boring. They all revolve around imagery of mountains and trees and other wilderness images. THEY ALL WERE THE SAME!!! If you take this course, be preprared for a lot of boring readings that you'll need to be able to identify on tests!\"",
            "review 13: \"05S with Sarah Allan: The readings are on the long side. The tests and pop quizzes ask for either small details or sheer facts, dates, and names...no testing for understanding, yet designed in such a way where you need to do the reading. The teacher is the worst lecturer I've ever had. I don't even think what she was saying up there was coherent, as she would slowly drift in and out of different and subjects and back and forth in time. This sway, combined with her soft, monotone voice, was a pretty powerful soporific to say the least. *This is Allan's first time teachiing the course.\"",
            "review 14: \"05S with Sarah Allan: Sarah Allan was extremely boring, did not use the microphone, and gave ineffective lectures. I had to take this for my China FSP, otherwise if she teaches it again AVOID. I hear that she is much better with smaller groups though. (Chinese 10 was a large class ~ 85 students I think) Oh, and the readings can be really boring and hard to understand (translated from Chinese) Again, I hope she is better with smaller groups... The fact that the final is 60% of your grade is quite intimidating\"",
            "review 15: \"05S with Sarah Allan: Professor Allan is the single most uninspiring, slow, bad professor I have ever met. I don't even know why she is teaching at Dartmouth. The class was slow, the readings mostly boring. Don't take this class with her. I would get her to leave Dartmouth any day if I had a say in it.\"",
            "review 16: \"05S with Sarah Allan: this is a 100% literature class. and we never wrote a damn thing. it tested all wrong.\"",
            "review 17: \"05S with Sarah Allan: this was the most painful class I ever went to. The teacher was absolutely horrible at maintaining the interest of the students. She took an exciting topic such as chinese history, and destroyed it. The problem is she looked at chinese culture through classical chinese texts. nice idea, but no one wants to spend a term looking at classical texts with wierd translations. It doesn't make sense. I realize that's her specialty, but she was not at all sympathetic to the fact that we were in pain the whole time, bored out of our minds. If anyone else teachers it, take it with them.\"",
            "review 18: \"05S with Sarah Allan: Terrible professor--in all of her years at Dartmouth, this was Allen's first lecture class (and she's tenured, also, what's up with that). Terrible lecturer, she was too lazy to stand up near the microphone so she sat down in a chair and droned on about something, you could never tell even though I sat in the front row. Other times she just read from the book. There's plenty of other ways to avoid this class, even if you're doing the FSP/majoring/minoring in Chinese. Take other courses, avoid this prof because she's absolutely terrible and needs to go back to designing costumes.\"",
            "review 19: \"05S with Sarah Allan: Dr. Allan, normally a doctor associated with seminar classes, receives her first class with an enrollment greater than ten and shows appreciable and demonstrative anxiousness, but still pulls off a great job. Examinations have nit-picky requirements (i.e., identifying authors, titles, and dynasties of literature for which you see excerpts--it's like Art History slide-memorization, but she is an extremely understanding and lenient grader given the broad expanse of competencies in the class. It was unfortunately too big--there were too many lazy students who \"encouraged\" her to give us lectures on study skills (i.e. one has to take notes during lecture and not just sit and look like idiots) but otherwise she did wonderfully. One thing I did find odd was the TA, who more often represented a ribbon-clerk for her (This TA, and not the professor, administered the midterm), wasn't helpful at all--but then again, we didn't even know his name. I do recommend the class, but consider yourself a lost cause if you don't spend a considerable time absorbing weekly readings or taking notes during lectures.\"",
            "review 20: \"05S with Sarah Allan: I would only take this class if you have to (ie major, minor or fsp). It's obvious that Sarah Allan knows what she's talking about, but she does a poor job relaying the information. Her lectures are often confusing and disjointed. She sees the class as a literature class with history reading to back it up, so you have a lot to read and a lot of it can be boring. On top of this, the midterm and final were hard, you had to memorize a lot of poems and stories and then identify obscure passages.\"",
            "review 21: \"05S with Sarah Allan: really boring lectures that you dont have to go to unless she gives a quiz (really rare) tests pretty easy if you actually do the reading.\"",
            "review 22: \"05S with Sarah Allan: One of the easiest classes I've ever taken.\""
        ],
        "Allen Hockley": [],
        "Levi Gibbs": []
    },
    "AMES011": {
        "David C.": [
            "review 1: \"08W with David C.: two different profs with different lecture styles made it hard to find the important points, but overall not a difficult class.\"",
            "review 2: \"08W with David C.: I will be honest, I only glanced twice at this course because it covered the CI distrib that I needed, and I'm sure this was true for a large proportion of the class. However, this class sparked an interest I'd never before had in Korea; the material was just _fascinating_. Prof. Kang kept joking about how we all must have been asleep that early in the morning because we were so quiet, but I never had trouble staying awake in this class. So, this is one of the classes where attendance is part of your grade. There's page-long weekly response papers; you can basically go off on whatever tangent you feel like as long as it's based on the readings. (A tip about the responses: Ignore what the syllabus says to do. If you want consistent check-pluses, synthesize your own unconventional--i.e., crazy--idea and back it up with details from the readings.) The single midterm was in class, and the profs didn't give extra time (but apparently conciseness counts for more than style), but the take-home final is an essay. We had two short-answer (1000-word) questions. Expect to spend a lot of time doing the readings, though. This was the first time these profs have taught the course and I know Prof. Hanscom is soloing next time, so it's still being fine-tuned, but one thing I found really annoying was the difficulty of getting the professors to make their powerpoints available on Blackboard. Copyright issues about photos taken from the internet or something. (Hello? Whatever happened to \"fair use\"?) So take good notes. On the other hand, the course revolved around concepts instead of details so I suppose it's not really necessary...\"",
            "review 3: \"08W with David C.: I'm really happy I took this class. The profs were great, and the subject was so interesting. A great way to get your CI and be introduced to a new culture.\"",
            "review 4: \"05W with David C.: This class tackled a big topic- I thought it did a good job surveying a lot of time periods and topic areas. It was team taught which was actually neat b/c the two professors' areas of expertise are very different. That said the class treated you like you were in second grade- they took attendance every class and if you miss more than 2 your grade drops down a full letter. I also found that Kang could be rather cocky and dismissive on occasion. Kim is very nice and excited to be teaching.\"",
            "review 5: \"05W with David C.: Interesting class overall. I learned a lot about Korea. Prof. Kim is really interesting and she motivates the students to discuss the reading although at times, it's impossible to start a discussion with 50 people in a lecutre hall kind of place. Prof. Kang is interesting and seems to know the materials really well.\"",
            "review 6: \"05W with David C.: This class gave a good overview of Korea - but be sure to be interested in the subject or else you will not have a good time. Professor Kim is very fun - very effective lecturer and responsive to students. Professor Kang is an engaging lecturer but what he says isn't really \"note-taking material\" - you need to do the readings in order to do well on his part of the test.\"",
            "review 7: \"05W with David C.: Anyone interested in Korea and/or East Asia should take this. Kang and Kim made a good duo and they were very engaging lecturers. They're slides weren't all that helpful, but the lectures and assigned readings together were very comprehensive.\"",
            "review 8: \"05W with David C.: This class was pretty good. While there is a lot of reading assigned, looking back,there was a lot of reading I could have skipped and still been fine. Prof. Kim lectures on culture, and while her lectures can sometimes seem basic, she is really enthusiastic and it makes up for it. Prof. Kang is a better lecturer, but he did not lecture as much. It's a good way to learn about the culture and there is not much work (1 midterm, 2 final essays each 4 pages), but they are sticklers for attendence.\"",
            "review 9: \"05W with David C.: Out of the two professors, I liked Prof Kim better. She seemed to care more about the class than Prof Kang. While she came to all of Kang's classes, Kang came to like none of Kim's classes. Also, Kim knew our first, last, and even middle names a few weeks into the class while even at the end of the term, prof Kang didnt know the names of over half the people in the class. I could say a lot more but since the class probably won't be taught by two professors next time, Ill just talk more about the class. Overall, there was very little work. Just 1 midterm which were 6 short in class essays (30% of the grade) and a take-home final which was 2, 1000 word, essays (40% of the grade). Participation (15%) and attendance (15%) were also factored into the grade. I'm not really sure how they graded participation because it was almost impossible to participate for Kang's lectures. I'm also not very sure how kang and Kim graded their essays, although they gave a rubric, the disparity between the amount of points they gave was huge.(Kim more, Kang less) Overall, I would say that the class dealt with many interesting and eclectic issues like Korean media, economy, government, history, getting married, education etc. Personally I would have rather seen fewer topics and a greater focus but that's just me.\"",
            "review 10: \"05W with David C.: its a VERY GENERAL class on korea, it covers so much that theres not really time to get in depth but its very good at giving a general overview. professor kang is excellent in his govy/econ portion of the class, and prof kim (this was her first Dartmouth class) was pretty ok in the humanties and arts portion. the midterm was unexpectedly harsh. readings were pretty easy and not that much, very do able. sometimes the class favored native koreans but it didnt really hurt nonkoreans. id recommend it\"",
            "review 11: \"05W with David C.: prof kang was horrible, was never in class, and only showed irrelevant pictures during his lectures. prof kim was amazing.\""
        ],
        "Christopher P.": [
            "review 1: \"09F with Christopher P.: there is just one midterm and a final there are response papers every took week on the material covered in class but they're only a page long and are the easiest things ever i loveddddd hanscom, he was ridiculously energetic and he loves korea ALOT. there is a ton of reading...i ended up not doing the reading during the class and crammed it all in the nights before the tests. it worked out alright.\"",
            "review 2: \"09F with Christopher P.: Easy 3rd class, the material was very interesting and the Prof had very good lectures and powerpoints. Take the course! Only a midterm, a final, and about 4 one page double spaced papers on the readings\"",
            "review 3: \"08F with Christopher P.: The course material was interesting. Hanscom is a decent teacher. The work is totally manageable, and it's easy to get a good grade as long as you show up to class and do the homework.\"",
            "review 4: \"08F with Christopher P.: if you're looking for that third class to take, this one is for you. it covers a ci and a soc, and to top it off, professor hanscom is a funny professor with very fair expectations. you just need to go to class, and do a weekly assignment based on the readings (either a response paper or discussion questions). there's only one midterm and one final.\""
        ],
        "Ji-Eun Lee": [
            "review 1: \"06W with Ji-Eun Lee: only went to the first class. never did the readings. drew comics during the exams and pulled a flat A. if you are looking to take two classes but get credit for three, take this class.\"",
            "review 2: \"06W with Ji-Eun Lee: In all honesty, take this class. You may be asking yourself why you would ever want to take a course in Korean studies if you aren't of Korean heritage or want to learn the language, and the answer is simple; EASY A. Honestly, you never have to go to class, and in a small class of 10-15 kids to begin with, only about 4-5 went each time. Its basically a dying class, and the teacher has given up on actually teaching, so we only had a mid term and a final, both of which took about 15 minutes to complete. If you are an under-achiever, welcome to heaven.\""
        ],
        "Min S.": [
            "review 1: \"07S with Min S.: but she's a visiting prof that's not going to be here anymore....so......bloop to that\""
        ],
        "Soyoung Suh": [
            "review 1: \"13F with Soyoung Suh: Course: The first half of the course was taught by Professor Suh, the second half by Professor Kim. The first half focused a lot on ancient Korea and the development of Korea, but since the prof's specialty is art history we ended up learning a lot about ancient Korean art...Yes, the historical aspects were just like a normal history class but a lot of students were annoyed at having to study art as well. First half grades are based on two quizzes, non-cumulative, and they're really straightforward if you just memorize the historic and artistic facts. Also you need to watch a couple movies and write responses to them, but these are super easy. Oh, there's a group presentation as well, which is easy. Second half was more about modern Korea, from 19th-20th centuries, and I found it a lot more interesting. Every week there are keywords from the readings, and the entire final is based on just these keywords. Sounds easy, but there are A LOT of keywords that stack up so it was a pain to memorize them all, so I would recommend not cramming until the last minute. Just know the keywords for the exam and you'll be fine. Also part of the final were two take home essays, 1000 words each, which were pretty straightforward. Professor: The professors are nice, except you might have trouble understanding them a bit because they have thick Korean accents. Professor Kim raises a lot of philosophical questions which can provide interesting class discussions, but I wasn't too passionate about the whole course. Workload: There are some readings for Professor Soh, none of which you have to do. You don't need to read Professor Kim's readings either, but the keywords are from the readings so you might as well skim through them to understand the context of the words.\""
        ],
        "Sunglim Kim": [
            "review 1: \"16W with Sunglim Kim: CONS: have to attend lectures, participation grade; tests are entirely memorization; lot of archaeology and art; PROS: if you do well on the tests, you'll get an A, and with only a few hours of studying; first half involves writing three very easy papers; second half involves writing five similarly easy response papers on readings; readings are optional other than for the five you choose to write response papers on; can have computer out all class and focus out while prof shows videos of kpop or students give presentations on the economic effects of league of legends.\""
        ]
    },
    "AMES010": {
        "Gil Raz": [
            "review 1: \"07W with Gil Raz: This is a great course if you are willing to put in the effort and complete the readings. The readings are mostly primary sources, so you'll learn to how to critically analyze ancient documents. Professor Raz is interesting and the class is fun, but it's much more interesting (and easy) if you do the reading. We had to write two short papers, and we had a midterm and a take-home final of three 2-page essays.\"",
            "review 2: \"07W with Gil Raz: This is a good class, and not particularly hard to do well... as long as you go to class and do the readings. There is a good amount of reading but not overwhelming (around 20p for every class). Gil Raz is a really nice guy and an interesting lecturer. This class fulfills some nice distribs. You probably won't regret taking it.\"",
            "review 3: \"07W with Gil Raz: But i did learn a lot I wish the lectures were on a more interesting subject Class was very managable but almost nobody participated in discussions which made everything really boring. expect to be on blitz the entire class\"",
            "review 4: \"07W with Gil Raz: While the ORC description may lead you to think that this is an interesting course to take, I recommend you buy the books for this course at Wheelock and read them on your own time. The interest that I have in this subject could not overcome the enormous amount of frustration with having Raz as a prof. He doesn't enunciate or project in class, and his lectures are all over the place. The level of disorganization shows in that the titles of his lectures don't match with the syllabus. Often, the lecture slides do not help you understand the main points of the day because they are mostly copy/pasted text from the readings, pictures, and questions about the main ideas. If you do end up having to take this course, make sure you edit/label and date the lecture slides yourself and take very clear, careful notes of everything that comes out of his mouth. The professor is opinionated about the subject, and he's one of those profs who think that his course takes precedence over anything else in your life. (He will e-mail you extra readings at 10 PM of the day before.) The exams and paper assignments may seem unclear at first. This is because they test not your analytical skills but memory - specifically, your ability to memorization his opinions. Assignments from this prof generally read something like this: \"In class, I said _____. Do you agree? Please write about why you agree. And mention ___, ____, and ___.\"\"",
            "review 5: \"07W with Gil Raz: Thanks to this course, my interest for anything Chinese has been augmented!! I feel that this course truly analyzes the mindset of the Chinese populace by way of its religion. So, for those who are looking for a Chinese 10 alternative, you should take this course instead!! This course has a somewhat straightforward midterm and two essays. The final consisted of three 2-3 page essays. I was shocked by how many essays we had to do, but the questions were relatively easy and fun to do!\"",
            "review 6: \"07W with Gil Raz: Raz is great and very helpful. I recommend this course.\"",
            "review 7: \"07W with Gil Raz: Take this class only if you absolutely have to. The professor is very strange and at times difficult to follow. The two papers and written midterm are fairly straightforward and easily graded, but I'm not sure sitting through Raz's boring lectures was worth the easy grade. If I could do it over again, I would not take this class.\"",
            "review 8: \"07W with Gil Raz: Raz organizes his lectures well and basically reads off his powerpoints. The exam and papers were graded pretty fairly.\"",
            "review 9: \"07W with Gil Raz: Gil Raz can't teach to save his life. Please don't take this course.\""
        ]
    },
    "AMES009": {
        "Reiko Ohnuma": []
    },
    "AMES008": {
        "A. Kevin": [
            "review 1: \"08X with A. Kevin: Exams and papers are graded harshly, with very negative comments. But information is very interesting.\"",
            "review 2: \"07W with A. Kevin: This course had a lot of reading and it was impossible to catch up after falling behind! The prof was really into the subject though and all the lectures were really interesting and well organized. It is essential that you attend every class! Also, take Intro to Christianity first, or have a good solid understanding of that religion before taking this!\"",
            "review 3: \"07W with A. Kevin: This was my first religion class at Dartmouth, and while it wasn't great, I'll probably end up taking some more. Reinhart is quite an interesting professor. He's extremely knowledgeable on the subject, and you get the sense that he really has been there and done that. He knows everything about this stuff. However, he's really arrogant and detached from the students. He calls us his \"peers,\" but with the way he responds to questions in class and to students' ideas, we're treated more like grade-school children. He's not receptive at all to students' ideas if they differ from his own, and sometimes scoffs at students' failed attempts to make sense of the material. I'm sure there are better religion professors to learn this stuff from. That said, the material is really interesting although a bit dry at times. I really feel like I have a solid understanding of the fundamentals of Islam... its early history, the different sources of scripture, the Sunni/Shia split, prayer and ritual, the 5 pillars, Sufism, and so on. The workload is weird: two take-home exams in the form of papers and a \"text study,\" which is the biggest part of the grade. We only spent one class talking about what a \"text study\" was, and so most of the papers, in Reinhart's opinion, weren't actually text studies... very frustrating. There are also two half-hour quizzes with IDs and short essays. \"half-hour\" really means 25 minutes for a quiz that needs an hour to be done well. very frustrating. Overall, certainly not the best Intro to Islam I could have imagined. It's a pretty passive straight lecture class with an arrogant professor and a lot of reading that's not really connected to the lectures. You could probably get by just skimming the readings for names and dates and then reading the pieces that the papers are based on.\"",
            "review 4: \"07W with A. Kevin: Prof. Reinhart is kind of a hard grader and is interpersonal skills are pisspoor on top of that. He's really into the material but presents one-sided views to everything.\"",
            "review 5: \"07W with A. Kevin: What you've heard about Reinhart is true - he is unbelievably arrogant and often rude to his students. That said, his lectures were extremely interesting and helpful. He clearly knows a lot about this subject. If you pay attention and keep up with the reading, you will do fine. He wasn't as unapproachable in office hours as in class, oddly enough.\"",
            "review 6: \"07W with A. Kevin: While this wasn't the most painful class I definitely had a hard time being motivated to learn the material. The lectures were pretty boring, but in the end I learned a lot about the misconceptions of Islam embedded in western culture.\""
        ],
        "A. Kevin Reinhart": []
    },
    "AMES005": {
        "Nadav Samin": []
    },
    "AMES004": {
        "Diana Abouali": [
            "review 1: \"09X with Diana Abouali: This course should be cross listed in history. She gives many readings, most of them are not necessary. The final was an essay test in which we were given the questions ahead of time. Not too bad, easy class, most of the time too slow.\"",
            "review 2: \"09X with Diana Abouali: this is by far the worst class i've ever taken at dartmouth with the worst professor i've ever had here. let's go through some points: 1) she lectures from her notes on paper! i'm sorry, but i'm investing way too much money into my education for a 'professor' to lecture off of her notes. she has a tendency to forget what she is saying, look around awkwardly, and then look at her notes to try to pick up from where she left off. 2) the tests are arbitrarily graded! if you're a non-major and know little about arabic culture/history, i don't suggest taking this course. she expects you to synthesize thousands of years of information when many non-majors are focused on putting the historical pieces together. perhaps if she organized her lectures effectively, the majority of students would not feel lost as to what was going on between certain time periods. she gives the questions out before the exam, but it's still unreasonable to expect students with no background in the subject to make sense of the material if she is an ineffective lecturer. 3) she didn't grade our exams until AFTER the drop deadline! i think that speaks to her commitment to teaching. don't you think? 4) she is a HARD grader! yes, she is a hard grader. what is a hard grader? a hard grader is someone who is EXTREMELY picky with the foreign words you use (um, i didn't take arabic.. sorry), or the terms you present. i've had professors in other courses who are supposedly hard graders, but at least they are fair... if you work hard and write well, you will get an A-. i'm sorry, that's not the case with this professor. 5) she went over time in class frequently. 6) she assigns an unreasonable amount of reading for her class, many of which are entirely unnecessary. okay, i've heard many readings for other classes... but at least they're relevant to helping me understand the material. this reading, on the other hand, was pretty useless - neither the readers nor her lectures established the concepts we needed to remember. 7) non-majors and people with no knowledge of the subject are at a severe disadvantage. she seems to favor those students who do have a background in the class, since they're just building on old material. you, mr/mrs non major who only needs a distrib, are screwed searching the internet for a way to make sense of it all. so my point is don't take this course if you want an easy A/A-. if you're at dartmouth simply to 'learn' or something intellectual like that, i don't suggest taking it either - you won't get much from it. NRO it. you'll realize you've made the right choice after her first lecture... good luck!!!\"",
            "review 3: \"09X with Diana Abouali: Trust me. This class is alright. I took this class randomly as a non-major, and I had no problems. As long as you show up to class and take good notes, you should be fine. The workload wasn't bad at all, and I got away without doing some of the assigned readings. Professor Abouali was extremely nice and very helpful. I thought her lectures were fine. She highlighted all the important points you needed to know. I visited her during office hours before the midterm and the final to make sure I knew what she wanted in my essays. She gave me straightforward advice and helped me answer the questions I had problems with. The midterm was short answer ID and an essay, and the final was all essay. The person that wrote the long review needs to chill. I took this class expecting it to be fairly easy and interesting, and the class turned out to be exactly what I thought it was going to be.\"",
            "review 4: \"08S with Diana Abouali: Didn't do the readings and still did really well. She assigns lots of reading, and it's interesting, but I didn't have the time and you don't need to do it that often. Diana was really bad about getting our papers back to us, but she didn't expect the class to be as big as it was. She's an easy grader, and just wants people to learn more about the Middle East. If you don't know much about the Middle East, THIS IS THE CLASS TO TAKE. It's easy, interesting, and will broaden your global perspective x20million.\""
        ],
        "Jonathan Smolin": [
            "review 1: \"15S with Jonathan Smolin: Professor Smolin is one of my favorite professors at Dartmouth. He assigns a solid amount of reading but it is split about 50/50 between a dense history called \"The Arabs\" and a bunch of pretty cool translated Arabic novels. You can totally get by with just skimming the history and paying attention in class and the other readings are really enjoyable and the assignments aren't bad. Would definitely recommend.\""
        ],
        "Ezzedine Fishere": []
    }
}