{
    "ASCL061.10": {
        "James Dorsey": [
            "review 1: \"24W with James Dorsey: An all around fantastic class. Professor Dorsey has to be one of the best profs I've ever had at this school and one of the kindest people I've ever met. He does his best to make sure the mat sessions are accessible and enjoyable for everyone, and the focus really is on trying your best. The in class sessions have really interesting readings, and all of the essays were legitimately enjoyable to write. Absolutely take this class if you're able to, it's a wonderful use of your time!\"",
            "review 2: \"23X with James Dorsey: Great course! So fun, Dorsey is wonderful and is a layup. We had 3 essays (the first two were basically graded pass fail), a few easy presentations and a final project. Highly recommend during sophomore summer\"",
            "review 3: \"22X with James Dorsey: Quite literally the best class I have taken at Dartmouth. We have 2 mat sessions and 2 class sessions a week (so yes x-hour is always used), but they are honestly so fun. The mat sessions consist of a warmup, then learning different aikido techniques and trying them with different partners. It's super chill and you don't have to be good at any of it or experienced, as long as you try and learn. For the classroom sessions we usually just talked about the readings, which were sometimes a little long but pretty interesting and not too hard to understand. We had a lot of guest speakers/guest sensei's which also made the class really enjoyable. Would absolutely recommend you take this!\"",
            "review 4: \"22X with James Dorsey: This was a great sophomore summer class! This was the first time ever that this class was offered, so there were definitely some rough patches and inconsistencies between the syllabus and what we actually did. Overall, the mat sessions were really fun and interesting and the lectures were a bit dry, but also thought-provoking. Dorsey geared the aikido techniques toward all different skill levels so everyone felt comfortable. The mat sessions were very low-pressure and low-stakes, and even the Enbukai (final demonstration) which was technically our final was chill and fun. This class is 100% a layup. No need to do any of the readings, but honestly most of them were really interesting! Guest lecturers/demonstrators were awesome and probably my favorite part of the class. Dorsey was really into getting our feedback about the class so he can tweak things and make the class better for the next time he offers it. 10/10 would recommend!\"",
            "review 5: \"22X with James Dorsey: Take. This. Class. It literally cured my depression. I <3 james \"jim\" dorsey ! Probably only 2 of the 20 readings were necessary, and it's clear what those readings are. Basically PE but an actual class credit.\""
        ]
    },
    "ASCL060.30": {
        "Qiong Xie": [
            "review 1: \"22X with Qiong Xie: Would recommend taking this class! Professor Xie is an incredibly compassionate, enthusiastic, gentle, and knowledgeable professor. I learned so much about Korean literature and history, specifically about Korea's relationship with other Asian powers such as China and Japan through colonialism and other sources of influence. She made classes interesting through a mix of her lecturing, student presentations, and class discussions and she frequently challenges us to engage with the material in deeper, more thoughtful ways. She also speaks Korean, Chinese, and Japanese (and makes all sorts of cool connections) and frequently invited guest lecturers to come and speak to us. As an Asian-American, I was personally really interested in learning more about Korean literature and history and this course touches really interesting aspects of the Korean War and the modern K-wave. The readings and discussion posts for class are very manageable (maybe 2 hours per assignment) and we also got to watch K-dramas and analyze Parasite! This was my favorite course I took this term!\""
        ]
    },
    "ASCL064.15": {
        "Erqi Cheng": []
    },
    "ASCL051.06": {
        "Sara Swenson": []
    },
    "ASCL007.03": {
        "Sujin Eom": [
            "review 1: \"23W with Sujin Eom: Super intellectually engaging course. As previous reviews have stated, fairly easy courseload- although the readings to get overbearing at times. However, reading all the readings is not necessary for the in-class daily discussion posts (skimming is plenty.) Not much to say outside of what reviews above have stated. Take this class if you can. As long as you put in minimum effort you'll be happy with your grade.\"",
            "review 2: \"22W with Sujin Eom: I greatly enjoyed taking ASCL 07.03 with professor Sujin Eom. She is very chill and readily there to help students. We were graded based on in-class discussion post everyday, 2 discussion leader presentations, 3 short essays (max 2pg), and a final paper (max 12pg). In-class discussion post is graded based on completion, discussion leader presentation is also based on completion, and everyone got 100 for their final paper. This suggests how lenient grader professor Eom is. However, she is a stickler in terms of deadline and she grades final paper proposal (10% of your grade) pretty harshly. The lectures interconnect Asian diaspora and Asian American experience with Asian art and architecture, which I found very interesting and engaging. We write discussion post in the beginning of the class for 20 minutes, professor Eom lectures for 30 minutes, then we do class discussion for the remaining of the class. TLDR: take it if you're looking for layup-ish FYS.\"",
            "review 3: \"22W with Sujin Eom: I loved this class so much! There were sometimes quite a few readings, but I was able to skim them really well because there was a discussion post during the first few minutes of class every day, which wasn't too bad. She's a very light grader in my opinion and I personally think I have horrendous writing. It's a pretty light class especially because I really enjoyed the material, and a lot of the topics were very interesting. There were three short essays and one long research paper, which I honestly had so much fun writing. I really love her and she's a great professor, so take this class if you can!\"",
            "review 4: \"22W with Sujin Eom: this class was SO interesting and i learned so much! eom is not an excellent lecturer but she is so smart and so willing to help you. definitely recommend if you’re interested in art history or want to dip your toes into ascl. ditto what other ppl have said about her vis a vis grading and assignments. she would send out one students weekly paper anonymously as an example piece which was a huge confidence booster to ppl chosen.\""
        ]
    },
    "ASCL051.05": {
        "Sara Swenson": [
            "review 1: \"22W with Sara Swenson: I was very scared going into this class, as I was taking it just for the TMV/NW distribs and had no familiarity with the topic, but it turned out to be a great experience. there are daily assignments to ensure you do the readings for class but they are very low stakes and you get to work on them with a small group. I really appreciated being set up in small groups because I otherwise would have likely never spoken to those around me. some of the readings were a little dense and hard to comprehend but some of them were very interesting. She also worked to bring in guest speakers and I truly learned a lot of new information. the papers werent bad, pretty short although the first one was a little difficult to come up with an idea for given that it was only 2 weeks into the class. very manageable work load, interesting topics, great prof, would recommend.\""
        ]
    },
    "ASCL070.23": {
        "Sujin Eom": [
            "review 1: \"22F with Sujin Eom: She is super nice. The class is pretty chill - one take home midterm and a final paper which is super open-ended. There's a fair amount of reading for each class but as long as you skim it, you'll be in good shape. Highly recommend if you need a NW distrib!\"",
            "review 2: \"22F with Sujin Eom: Sujin Eom is so sweet and a very helpful professor. I would definitely recommend this class-- I've always been interested in Asian American history, but this class is pretty unique in that it has a very transnational focus and doesn't just center around America, so you end up with a much more big-picture view on issues like immigration, colonialism, and race. The readings can be pretty dense, but they are mostly interesting and Prof Eom goes over the main points from the readings in class anyway. I also liked that there is a student-led discussion segment almost every class and felt like I had some pretty good discussions when people were actually engaged with the material. Grading is chill, just short discussion posts for every class, a take home midterm, and a research paper/ final project at the end. The research paper took a while for me to get through (10-12 pages), but you can kind of pick whatever topic you want and don't even have to do a traditional paper if you have a creative project or something else in mind. Overall I learned a lot and would definitely recommend if you're interested in Asian or Asian American Studies.\""
        ]
    },
    "ASCL064.13": {
        "Pamela Crossley": []
    },
    "ASCL054.08": {
        "Douglas Haynes": [],
        "Elizabeth Lhost": []
    },
    "ASCL054.07": {
        "Douglas Haynes": []
    },
    "ASCL070.22": {
        "Edward Miller": [
            "review 1: \"20F with Edward Miller: Took this as a layup but it turned out to be my hardest course of the term. That said, the course and co-learning project were really interesting and well designed. I wouldn't recommend this as a layup but if you're interested in Vietnam then you should definitely take the course.\""
        ]
    },
    "ASCL054.10": {
        "Elizabeth Lhost": []
    },
    "ASCL061.09": {
        "Wen Xing": []
    },
    "ASCL069.23": {
        "Steven Ericson": []
    },
    "ASCL064.14": {
        "Soyoung Suh": [
            "review 1: \"20X with Soyoung Suh: Seemingly interesting topic - was excited to study the marginalized in a different context - but presented in a dry manner that alienated most. Discussion was frustrating - focused more on the white perception of the marginalized rather than centering marginalized voices. Time consuming class, lots of papers. There are easier and more interesting ways to round out your history major, and if you want to study the marginalized, I recommend actually trying the HIST/AAAS crosslist courses (Campbell is great). Readings tedious, with overly demanding reading load.\""
        ]
    },
    "ASCL061.08": {
        "Emily Simpson": [
            "review 1: \"20S with Emily Simpson: Note: 20S was pass/fail and online. Overall a pretty enjoyable class! Mainly took this to fulfill my TMV since it was pass/fail and ended up enjoying it a decent amount. Material - starts off pretty basic (i.e. basic tenets of Buddhism) and works up to actually looking at the role of Buddhism in relation to the Korean/Japanese states throughout history. We had readings due pretty much every class period, roughly 20-50 pages per class but pretty manageable. Prof. Simpson also posted a weekly 20-30 minute lecture that was pretty easy to follow and quite informative. There were a couple readings I found super dry, but for the most part I found myself actually enjoying most of the readings. Assignments - five \"thinkpieces\" due throughout the term - 500 words, and she made most of them optional towards the end of the term. We also had three major \"papers\" of 1000 words each - one comparative, one deep dive into Korea or Japan, and one on a modern depiction of Buddhism in anime or film. Pretty easy, but Simpson insisted on each being \"visually interesting\" as well - for most people, that just meant putting a couple images throughout their papers. Every Friday we would also do group work with (assigned groups) - generally took no more than 30 minutes to an hour an a half. We also had one live class discussion each week, but as usual we ended up having the same 5-7 people talking for the whole time - participation wasn't as stressful because of the whole pass/fail. Professor - I thought Simpson was super great and very understanding! She's clearly super passionate and knowledgeable about Buddhism and it made the class more interesting. I was definitely a little intimidated going into the class (not a TMV person at all) but overall I found the class pretty interesting!\""
        ]
    },
    "ASCL061.07": {
        "Emily Simpson": [
            "review 1: \"22S with Emily Simpson: Prof Emm was great and this class was enjoyable. Fascinating material about Shinto, even for those with no knowledge or background in Shinto. Class is broken up by 3 large projects and weekly submitted comments about the readings.. Some material is fairly dense but it's easy to stay engaged in discussion. Prof Emm gives really good feedback on work and you know why you got points off on assignments. She is also available for help and for questions all the time. Would highly recommend the class if you are interested, need the distribs, or any other reason really.\""
        ]
    },
    "ASCL062.13": {
        "Sunglim Kim": []
    },
    "ASCL051.04": {
        "Gregory Seton": []
    },
    "ASCL070.21": {
        "Pankhuree Dube": []
    },
    "ASCL070.20": {
        "Gregory Seton": []
    },
    "ASCL061.06": {
        "Emily Simpson": [
            "review 1: \"20X with Emily Simpson: She's a really sweet prof and reasonable at grading. Also this was an interesting class to take! Would recommend as an additional ASCL class for ur load. Mainly readings, discussion based classes, and a mini group presentation every Friday or so.\""
        ]
    },
    "ASCL080.08": {
        "Steven Ericson": [
            "review 1: \"23W with Steven Ericson: Ericson was so so sweet! Also for a senior seminar, it was not a lot of work at all. I'm glad I took this as my senior seminar. Obviously, you still have to write the twenty page paper at the end of the term, but to be honest, it really isn't that bad, and you can pick any topic you like. You really don't have to do the readings in this class, since he goes over them in class and it's mostly lecture based.\""
        ],
        "Connor Mills": []
    },
    "ASCL064.12": {
        "Steven Ericson": [
            "review 1: \"23W with Steven Ericson: Took this as the final class for the ASCL minor and couldn't have loved it more. Ericson gives great lectures and genuinely seems to love teaching about this topic. There is a fair mix of discussion sessions in class and a midterm and research paper/project. Definitely take this class if you are an ASCL major/minor, or just want to learn more about postwar Japan. 10/10 Amazing course.\"",
            "review 2: \"23W with Steven Ericson: I took this class purely out of interest as I'm not a history or ASCL major, but had a great experience. Ericson is quite passionate in his lectures, and the discussions were low-pressure environments that were relevant to the midterm and final exam essay questions. The workload wasn't terrible for the most part, though having 2 essays on a closed-note midterm was stressful and I procrastinated a lot on my research paper. Ericson is super sweet and kind prof and honestly that's what made the class the most enjoyable.\""
        ],
        "Connor Mills": []
    },
    "ASCL064.11": {
        "Connor Mills": [
            "review 1: \"22S with Connor Mills: Really enjoyed this class. Mills takes student feedback seriously and was willing to change parts of the course structure if we wanted to. Lectures were long but he provides lecture outlines, slides on Canvas, and lecture recordings that help for reviewing the material. Grading was based on 2 short (750 word) primary document essays, 1 longer (1500 word) book review, weekly Canvas posts, participation, midterm, and final. Midterm and final were ID terms based on highlighted terms in the lecture outlines.\""
        ],
        "Steven Ericson": []
    },
    "ASCL064.09": {
        "Erqi Cheng": [],
        "Pamela Crossley": []
    },
    "ASCL064.08": {
        "Erqi Cheng": []
    },
    "ASCL062.12": {
        "Allen Hockley": []
    },
    "ASCL062.10": {
        "Allen Hockley": [
            "review 1: \"22F with Allen Hockley: I LOVE ALLEN HOCKLEY SO VERY MUCH! Easily my favorite professor at Dartmouth. This will be my third course with him, and I couldn't be happier. He's *gasp* a real human being who actually cares about his students. But in all seriousness... this class is easy, but you get out of it what you put into it. The class is composed of reading responses (due before each class starts), a midterm (3 pages), a research paper (4 pages... or was it 6?), and a final (3-4 pages). You can put as much or as little effort into these and do well in his class either way. Professor Hockley's lectures cover all the necessary material to get a good grade in the class, but if you do his readings and actively write his assignments, you really really will learn something in this class. In sum: Low stress, interesting material, high reward. TAKE IT!\"",
            "review 2: \"21F with Allen Hockley: Hockley is one of the best professors I've had at Dartmouth. His lectures are heavily image based powerpoints and he explains all of the art and architecture from the readings. I found his lecture style quite interesting and engaging. The work consists of a canvas discussion before every class, a midterm paper (4 pgs), a short research paper (3-4 pgs), and a final paper ( same format as midterm). I won't say that the class is a layup since it can seem like a lot of reading before each class, but I am super interested in the material and the class felt like a breeze. Definitely recommend this class with Hockley if you are interested in Japanese Architecture ( Buddhist and Shinto) as well as the related art :)\"",
            "review 3: \"21F with Allen Hockley: Hockley is by far the WORST and LAZIEST professor I have ever had at Dartmouth. This is class is not good to learn nor as a layup. All the prompts for the midterm, research paper, and final are the most boring and low-effort questions a teacher could possibly ask. I (and everyone else in the class I knew) almost died of boredom while writing all of them. The slides he uses are recycled from random other events he has spoken at and they are 99% percent images, meaning if you miss something while taking notes there is no going back to learn anything for the midterm and final. The slides are not helpful at all and his lectures are all completely monotone and he just skips between buildings and paintings too quickly and without any depth, meaning you don't learn anything complex enough to be meaningful. He is super inaccessible with no set office hours and never answers emails. Usually took three attempts to get him to answer a basic question. The readings for discussion posts are all super bland and long (though you quickly realize he never reads any of them since he is not invested in teaching at all so you can bullshit). Bad class. Awful prof. Find a better layup.\"",
            "review 4: \"21F with Allen Hockley: Despite the perspective of the negative 21F review (likely a first year student), I found Prof. Hockley's ASCL 62.10 class very interesting with a very fair workload and clear guidelines for success. It can be characterized a layup, but one that will you give you a useful primer on Japanese religion and the basics of religious art and architecture. A myriad of prevailing themes added nuance to the class, such as the continuity of religious architecture over time and the evolution of sacred art and architecture to meet the needs of a modern society. Not only were lectures highly visually engaging but Hockley was clearly passionate, knowledgeable, and friendly, often offering interesting tangents about his own experiences and compelling examples connected to the course. Highly recommend this course if you have any interest in Asian history, religion, or art and architecture.\""
        ]
    },
    "ASCL061.02": {
        "Gregory Seton": []
    },
    "ASCL001.01": {
        "Allen Hockley And Sujin Eom": [
            "review 1: \"21F with Allen Hockley And Sujin Eom: This class is definitely difficult but pretty interesting. Basically gives a background on the history, colonial development, and modern-day urban issues of cities in East, South, and Southeast Asia, including in China, Korea, Japan, India, Indonesia, and Malaysia. Somewhat of a heavy reading load and you have to write a 500+ word discussion post on each day's reading before class, but I found all of the readings pretty interesting and relevant to the lectures. Class had a midterm (basically just two short essays on topics graded by Hockley and Eom individually), a final project proposal (figure out your topic way in advance!), a 4-minute presentation on that same topic, and an 8-12 page final research paper on that topic due at the end of finals period. You also have to lead a discussion group twice in the class, but this is pretty easy - basically just prepare some questions on the reading to talk about in class. Hockley and Eom are fair graders in my opinion but the cutoff for an A is pretty high (96%). Not too hard to do well if you're engaged in class and willing to put in the work on your research project. I found the lectures very interesting, especially the guest speakers that talked to the class either by Zoom or in-person. Overall a good introduction to the ASCL department.\"",
            "review 2: \"21F with Allen Hockley And Sujin Eom: Hockley is so so boring and lazy as a professor and not even a nice grader to make up for it. If you want to take an ASCL or ART class, take it with anyone else.\"",
            "review 3: \"21F with Allen Hockley And Sujin Eom: 500 word responses were due each 2A period on top of a two-essay midterm, paper proposal, presentation, and final paper. I thought that the lectures could be a little dry and long, so you really should have an established interest in the region if you're taking this class. The responses mandate doing the readings and took about an hour or two to do before class. I did very well in the class, and I think that Eom liking me had a large roll to play in it. Think hard about your research question because it can make or break you. They were very honest with students who they thought had bad project ideas. Overall, a solid class but don't take it as a layup -- grading is tough and there is a LOT of busy work. If you have experience living in the region, are really interested in Urban Asia, or an an ASCL major/minor, would recommend.\"",
            "review 4: \"21F with Allen Hockley And Sujin Eom: As far as I'm aware, this is a requirement for the ASCL major, but I might recommend this class if you're just interested in asia or urban geography. It was a challenge throughout, and I wouldn't call it a layup. There are 500+ word reading responses due every class; the writing is more manageable than it seems, but a few of the readings felt a bit drawn out and unnecessary. Thankfully, these are basically completion grades, as the tests are considerably harder. The midterm is two essays; Hockley seems like a fair grader but Eom was a bit harsh. The final is a 10-12 page research paper with a research proposal (instructions/guidelines for this were unclear and confusing) and presentation. As for the paper and presentation, Hockley's office hours were extremely helpful in making the project the best it could be. Make sure you have a plan for your project far in advance, choose a topic that you're actually interested in, and be prepared to spend a lot of time on research and the paper itself. I learned a lot but probably wouldn't recommend this on your first term.\"",
            "review 5: \"20W with Allen Hockley And Sujin Eom: The class was interesting, but I felt the grading was unnecessarily hard. Eom is a relentless grader -- the median was an A- and this was probably the hardest I've ever had to work for a grade like that. The only reason I managed to scrape by was because of participation points. However, I love Dr. Hockley and he was super helpful and friendly (not a nice grader though). I had great discussions with Hockley during office hours when I was trying to get my grade up, but when I went to Eom's OH she pretty much told me I was screwed... Hockley is the OG tho. Overall a good class, 8/10.\"",
            "review 6: \"20F with Allen Hockley And Sujin Eom: Any class with Hockley is boring and meh. honestly, I never attended classes and you can get by with skimming the readings, but the class is painfully a;kdf if you aren't interested in the topic. I would not recommend as a layup. other ascl classes are so much more interesting and fun.\""
        ],
        "Sujin Eom": [
            "review 1: \"24W with Sujin Eom: This class? not it. I read the description and said \"wow this is it!\" No it wasn't. Eom's teaching style can best be described as sporadic, and she jumps around constantly between topics and cities. There's no cohesive messages to take away from this class, and even the individual \"case studies\" that we looked into were very surface level and didn't actually teach you much. She had an odd tendency to talk about cemeteries and death, and the instructions and prompt for the final paper are very strange. It took me longer to figure out wtf she wanted based on the instructions than it did to actually write my final essay, which was 7 pages. She's a nice person, but unfortunately just not good at teaching you anything. It is pretty easy though, so there's that.\"",
            "review 2: \"24W with Sujin Eom: Chill class and definitely a layup, but you have to be interested in the topic, which is sort of niche. If you're an ASCL major taking it for the requirement, just get ready for a mildly interesting class with a good amount of busy work. The big thing for this class is that there are 500-word discussion posts due twice a week on two readings each, so that takes a good amount of time. Other than that, she intentionally makes the quizzes super straightforward, and there's a final paper which can be fun if you pick a topic you like.\"",
            "review 3: \"21F with Allen Hockley And Sujin Eom: Hockley is so so boring and lazy as a professor and not even a nice grader to make up for it. If you want to take an ASCL or ART class, take it with anyone else.\"",
            "review 4: \"21F with Allen Hockley And Sujin Eom: As far as I'm aware, this is a requirement for the ASCL major, but I might recommend this class if you're just interested in asia or urban geography. It was a challenge throughout, and I wouldn't call it a layup. There are 500+ word reading responses due every class; the writing is more manageable than it seems, but a few of the readings felt a bit drawn out and unnecessary. Thankfully, these are basically completion grades, as the tests are considerably harder. The midterm is two essays; Hockley seems like a fair grader but Eom was a bit harsh. The final is a 10-12 page research paper with a research proposal (instructions/guidelines for this were unclear and confusing) and presentation. As for the paper and presentation, Hockley's office hours were extremely helpful in making the project the best it could be. Make sure you have a plan for your project far in advance, choose a topic that you're actually interested in, and be prepared to spend a lot of time on research and the paper itself. I learned a lot but probably wouldn't recommend this on your first term.\"",
            "review 5: \"21F with Allen Hockley And Sujin Eom: 500 word responses were due each 2A period on top of a two-essay midterm, paper proposal, presentation, and final paper. I thought that the lectures could be a little dry and long, so you really should have an established interest in the region if you're taking this class. The responses mandate doing the readings and took about an hour or two to do before class. I did very well in the class, and I think that Eom liking me had a large roll to play in it. Think hard about your research question because it can make or break you. They were very honest with students who they thought had bad project ideas. Overall, a solid class but don't take it as a layup -- grading is tough and there is a LOT of busy work. If you have experience living in the region, are really interested in Urban Asia, or an an ASCL major/minor, would recommend.\"",
            "review 6: \"21F with Allen Hockley And Sujin Eom: This class is definitely difficult but pretty interesting. Basically gives a background on the history, colonial development, and modern-day urban issues of cities in East, South, and Southeast Asia, including in China, Korea, Japan, India, Indonesia, and Malaysia. Somewhat of a heavy reading load and you have to write a 500+ word discussion post on each day's reading before class, but I found all of the readings pretty interesting and relevant to the lectures. Class had a midterm (basically just two short essays on topics graded by Hockley and Eom individually), a final project proposal (figure out your topic way in advance!), a 4-minute presentation on that same topic, and an 8-12 page final research paper on that topic due at the end of finals period. You also have to lead a discussion group twice in the class, but this is pretty easy - basically just prepare some questions on the reading to talk about in class. Hockley and Eom are fair graders in my opinion but the cutoff for an A is pretty high (96%). Not too hard to do well if you're engaged in class and willing to put in the work on your research project. I found the lectures very interesting, especially the guest speakers that talked to the class either by Zoom or in-person. Overall a good introduction to the ASCL department.\"",
            "review 7: \"20W with Allen Hockley And Sujin Eom: The class was interesting, but I felt the grading was unnecessarily hard. Eom is a relentless grader -- the median was an A- and this was probably the hardest I've ever had to work for a grade like that. The only reason I managed to scrape by was because of participation points. However, I love Dr. Hockley and he was super helpful and friendly (not a nice grader though). I had great discussions with Hockley during office hours when I was trying to get my grade up, but when I went to Eom's OH she pretty much told me I was screwed... Hockley is the OG tho. Overall a good class, 8/10.\"",
            "review 8: \"20F with Allen Hockley And Sujin Eom: Any class with Hockley is boring and meh. honestly, I never attended classes and you can get by with skimming the readings, but the class is painfully a;kdf if you aren't interested in the topic. I would not recommend as a layup. other ascl classes are so much more interesting and fun.\""
        ],
        "Allen Hockley": []
    },
    "ASCL054.09": {
        "Edward Miller": []
    },
    "ASCL061.05": {
        "Emily Simpson": []
    },
    "ASCL051.03": {
        "Reiko Ohnuma": [
            "review 1: \"23W with Reiko Ohnuma: This is the same class as REL018, so look at those reviews too! Anyways: this class was my favorite of the term. There are two final papers and two exams, which can be easily aced if you consistently take detailed notes during lectures. The median grade for the papers was an A-. Similarly, the median grade for the exams was an A. While the readings are engaging, they are not tested on. Overall, put in a moderate amount of effort and you'll be successful.\""
        ]
    },
    "ASCL069.22": {
        "Ezra Toback": []
    },
    "ASCL091": {
        "Allen Hockley": []
    },
    "ASCL080.07": {
        "Edward Miller": []
    },
    "ASCL070.18": {
        "James Dorsey": [
            "review 1: \"23X with James Dorsey: Low workload, mostly busywork. The prof is a chill guy. That being said, this is one of the most mind-numbingly boring classes I've ever taken at Dartmouth.\"",
            "review 2: \"22X with James Dorsey: Chill class and kind professor. Coursework was just annotation assignments based on the class reading, few short essays (like 2 pages), a group presentation (where you just make the slideshow and there's no need to present), and a final essay (5 pages). Very easy and lenient with grading/deadlines and usually ended lectures early. You also get to skip any 2 annotation assignments and any 2 short essays which made it easy and flexible to one's own schedule. A lot of this class was definitely centered around music, so I would definitely recommend for anyone interested in American or Japanese music of the 60s.\"",
            "review 3: \"22X with James Dorsey: Take it. it is petty light. Heavy on readings but I literally bs-ed it all. some annotations but it's easy to bs them. A few short essays + final paper + final group presentation. It is honestly super chill. he was also really nice and understanding. TAKE IT. we love James\"",
            "review 4: \"22X with James Dorsey: Great guy, very chill class. Interesting if you're into social movements and youth culture of America and Japan in the 60s; thought it would be boring, but actually pretty interesting at times. Will do v well if you do the work.\"",
            "review 5: \"22X with James Dorsey: I liked this class a lot! It was especially great during the summer because of the immense flexibility Professor Dorsey offered with assignments, allowing you to complete only a subset of them so you could step away when your other classes got intense. You definitely get out what you put in learning-wise, but assignments were mostly graded kindly. A 10A in the summer is never amazing but this class made it worth it. Professor Dorsey is fun and connected well with our class, and the guest lecture was pretty cool too.\""
        ]
    },
    "ASCL070.17": {
        "Aparna Parikh": [
            "review 1: \"19S with Aparna Parikh: The class was great. No exams, light weekly readings (70 or so pgs), and fun and easily graded projects. The content was very interesting, and Parikh led the discussions very well. Parikh was very easy to talk to and an awesome grader. She is very organized and willing to help. Plus, no X-Hours!! I would 100% recommend Prof. Parikh and this class to anyone.\""
        ]
    },
    "ASCL060.92": {
        "James Dorsey": []
    },
    "ASCL054.06": {
        "Pankhuree Dube": []
    },
    "ASCL090": {
        "Allen Hockley": []
    },
    "ASCL089": {
        "Allen Hockley": []
    },
    "ASCL064.05": {
        "Soyoung Suh": [
            "review 1: \"22W with Soyoung Suh: Super interesting class and Prof Suh is the absolute sweetest. She grades assignments really easily, but there is a huge amount of work before each class. If you actually do all the readings for the discussion posts before class (which I did because I was a freshman and didn't know any better), it's probably ~5 hours of reading before each class (so 15 hours a week). The readings are all super interesting, but it's definitely a time commitment.\"",
            "review 2: \"21W with Soyoung Suh: Fantastic Prof and very interesting material, but this class is by no means a lay-up. She is a fair, if not generous, grader, as long as you keep current with the enormous amount of day-to-day work you are asked to do. The midterm consists of TWO separate 5-page take-home essays which you have 4-5 days to complete (I found the midterm more challenging than the final.) The final is a 10-15 page research paper as well as a 5-page take-home essay, but she provides significantly more time to complete the final assignment Professor Suh does the midterms. If you are interested in Asian history this class provides a great introduction. Again I cannot emphasize enough how well thought out this class is—10/10 would recommend.\"",
            "review 3: \"21W with Soyoung Suh: Although this class is very reading and film heavy, it is a good introduction to 20th century Korean culture. The classes were usually divided into half lecture and half discussion, with the occasional guest speaker. Again, I cannot emphasize how reading heavy this class is - be prepared to devote time and effort (along with good speed reading skills) to get you through the week. However, the discussions that came from said readings were really insightful. There are two midterm papers that you have to write, along with a research paper and a final paper, and as long as you follow the readings/core concepts you'll be fine. Prof. Suh is also pretty flexible when it comes to things and teaches the class well.\""
        ]
    },
    "ASCL054.05": {
        "Pankhuree Dube": []
    },
    "ASCL007.02": {
        "David Rezvani": [
            "review 1: \"20W with David Rezvani: If you are viewing this review, it is likely that you are considering taking this class. In my experience, Conflict & Cooperation in Asia is an extremely interesting topic, and Professor Rezvani does a good job of really examining the multifaceted nature of the region. You view various perspectives about debates regarding Hong Kong's autonomy, Kashmir’s independence, China’s growing power in Asia, Russia’s fall from global prominence, Russia-China relations, Japan’s current role in Asia, China-Japan relations, Taiwan, and much more. The readings are interesting and the in-class discussions are also enjoyable. Regarding whether or not to take the class, I would say take it, but take it because you are interested in the content, because while Prof. Rezvani is a nice guy, he is not the most captivating lecturer (not that he isn’t good, just isn’t great). To you, dear reader, who may choose to take this class, I request one favor — while you are enjoying the class, please pay attention to how many times Professor Rezvani uses the phrase “food for thought”, or how much he emphasizes the value of “counter arguments.” You will be amazed. Lastly, you will be tasked to write a few essays within this class, and in my experience, the best way to excel within these essays is to really emphasize the counter-arguments against your claim, and refute them. This class is not an insignificant time commitment, so don’t expect it to be super lenient as far as work goes. If you are looking for a layup, look elsewhere. With that said, it’s not too large of a time commitment, and it is fairly rewarding.\"",
            "review 2: \"20W with David Rezvani: If you are looking for an easier straightforward seminar, this is not the class for you. As your friends enjoy their seminars, you will be stuck sifting through the scholarly literature for your twelve page final essay. I liked Rezvani, but the course was not good. I would never recommend the class to anyone that isn't planning on writing scholarly literature.\"",
            "review 3: \"20W with David Rezvani: Awesome experience. The previous review said Rezvani's classes weren't that captivating -- I strongly disagree. His voice is amazing and his video choice is excellent. You'd have a hard time falling asleep in his class even if you tried. That said, this is not a layup -- he's a strict grader, assigns loads of reading, and is generally demanding. If you want an A, skim the readings, speak a few times per class, and make sure that your writing begins with a \"visceral\" hook and emphasizes counterargument refutation.\"",
            "review 4: \"18S with David Rezvani: Definitely one of the best classes I've taken at Dartmouth. Take the class if you're interested in international relations or Asia! The debate in the class is very intense and fun. You have to prepare for every class though, because Professor Rezvani will call on you if you're not talking. However, the material is super practical and relevant - if you just skim world news everyday and know what's happening to international politics, you'll be fine.\""
        ]
    },
    "ASCL080.06": {
        "Wen Xing": []
    },
    "ASCL080.04": {
        "Hua-Yuan Mowry": []
    },
    "ASCL080.01": {
        "Allen Hockley": []
    },
    "ASCL070.16": {
        "Steven Ericson": [
            "review 1: \"19F with Steven Ericson: Great lay-up. Plus you get to sample Japanese food in class so what's not to like. In terms of content, some of the guest lectures could be dull, but it's not super necessary to pay attention in class, especially after the midterm. There's a canvas reading response every class, a midterm, and a final paper, so it's very little work overall. If you go to office hours, that'll be helpful for studying for the midterm, since he'll give you hints as to what direction the prompt will go in. Overall good class.\""
        ]
    },
    "ASCL070.12": {
        "Qiong Xie": [
            "review 1: \"23S with Qiong Xie: Absolutely loved this class. Very engaging discussions and interesting course content. There is a final paper, weekly canvas discussion posts, and a mid-term group presentation. Professor Xie is a wonderful person.\"",
            "review 2: \"22S with Qiong Xie: Professor Xie is incredibly nice and understanding. She is smart and engaging, and I like that she pushes students to think beyond the texts, make connections, improve their arguments, and engage with each other in some of the best discussions I have had at Dartmouth. Even though this class covers 6 borderlands in 9 weeks, I feel like I learned a lot and read great literature. There can be lots of reading, but most of it is incredibly interesting (and she takes students feedback very seriously when selecting which readings to assign the next term). Grading is fair if not generous. Would absolutely recommend this class.\"",
            "review 3: \"22F with Qiong Xie: Professor Xie is great. She is so knowledgeable about the topics and also is so open to hearing students thoughts. It is very clear that she really values discussion and listens to her students. The content of this class is really interesting and engaging and I really enjoyed the materials she had us read/watch/listen to. Definitely not too much work, but wouldn't necessarily categorize it as a layup. Was weekly discussion posts + readings and then an essay or video essay at the end. Would definitely recommend this class.\""
        ]
    },
    "ASCL070.10": {
        "Theodore Levin": []
    },
    "ASCL070.07": {
        "Woon-ping Chin": [
            "review 1: \"21S with Woon-ping Chin: Awesome class! WP is so nice and the content is both easy and interesting. I would absolutely recommend taking this class if you can get in! Best art credit ever.\"",
            "review 2: \"21S with Woon-ping Chin: Woon-Ping was the best! She is such a sweet and passionate lady. She's a bit technologically challenged so it can be hard to reach her via email but you can also talk to her in class. WP was super flexible with deadlines and always had such high praise for our work. Great layup!\"",
            "review 3: \"19S with Woon-ping Chin: Literally the greatest class in the world. She has office hours at Pine and will buy you drinks if you are over 21. Workload is light and the material is interesting enough. Take this class! The only thing is that she does take attendance seriously, so you will need to actually show up.\""
        ],
        "Woon-Ping Chin": []
    },
    "ASCL070.02": {
        "Sunglim Kim": [
            "review 1: \"24S with Sunglim Kim: She is so sweet, Lowkey not the biggest layup ever just because there are discussion posts + 3 tests but if you just put in some work you will do well.\"",
            "review 2: \"21W with Sunglim Kim: Ugh loved this class. super easy (bullshittable) course work. No tests, essays, or major assignments. Instead we had to post a paragraph synopsis for each assigned reading the night before each class. 3 6 minute presentations throughout the course that can be done on so many things (people did asian food, musical artists, immigrant family members, themselves, etc) and then a few multiple choice question quizzes only for accountability that are open notes. Sweet sweet prof that 1)really cares about students 2)pronounces everyone's name in the cutest ways. It's not a real art history class in my opinion; definitely more of an intro to asian culture/history class. best ART distrib layup for sure\"",
            "review 3: \"20S with Sunglim Kim: She's actually the sweetest prof ever. Would totally recommend to anyone just wanting to get their ART cred out of the way. Class mainly consists of presentations, discussions, and accountability quizzes. Format might change given that this was taken as online class, but still I would take the class for either the prof or the credit. :)\""
        ]
    },
    "ASCL067.01": {
        "Yusaku Horiuchi": []
    },
    "ASCL064.04": {
        "Soyoung Suh": []
    },
    "ASCL064.03": {
        "Soyoung Suh": []
    },
    "ASCL062.08": {
        "Sunglim Kim": []
    },
    "ASCL062.06": {
        "Sunglim Kim": [
            "review 1: \"23W with Sunglim Kim: This class is not a layup. Prof. Kim is indeed one of the nicest professors I've had at Dartmouth. But the class is very time consuming. The movies are great and we watch them in class so don't expect to be watching a movie at 1 am. However, the readings average 100 to 150 pages per week. They're dire, time consuming, and contain several references to Korean terminology which is very tough to memorize if you don't speak Korean. There's a midterm and a final which both ask extremely specific questions about the readings that you would never remember. Overall, even though Prof. Kim is very nice and the movies are often entertaining, it is very time consuming and the midterms and finals can be very challenging.\"",
            "review 2: \"23W with Sunglim Kim: Mixed feelings about this course. Yes, it's somewhat of a layup, but the exams are actually pretty difficult. Anyone who has zero understanding of Korean culture may find numerous parts of this class confusing. Prof. Kim lacks clarity in her instructions, causing the students to be stressed very often too. If you want to watch chill movies every week but be given quite a bit of work, take this class.\"",
            "review 3: \"21S with Sunglim Kim: Sunglim Kim is genuinely one of the most wholesome and kind professors I’ve had at Dartmouth. Most assignments are graded as completion, except for biweekly quizzes (which are open note and quite easy) and one research-based presentation on an aspect of Korean culture/history. No previous knowledge of Korea or the Korean language is required. Highly recommended layup that satisfies both nw and soc distribs.\"",
            "review 4: \"21S with Sunglim Kim: Pretty good class. The films are great: they're popular, culturally relevant Korean films instead of art-house ones. This course at times felt like more of a history class, and we'd have 50 pages of dense material to read a week. You also need to take good notes on these readings and on your classmates' movie presentations, because the biweekly quizzes based on them are deceptively hard. However, if you do well on the quizzes, you'll do well in the course, and the assignments beyond that are easy. I think this course will also be wayy better in person when you can watch the films together and do in-person discussions. So, while not the easiest layup, I'd still characterize it as a layup, and if you take this class with a friend or two, it'll be really enjoyable as well.\""
        ]
    },
    "ASCL062.02": {
        "Levi Gibbs": []
    },
    "ASCL062.01": {
        "Wen Xing": [
            "review 1: \"20X with Wen Xing: Huge layup. I am generally AWFUL at drawing and painting, but somehow pulled out a solid grade in this course. I pretty much did 0 work outside of class except grinding for the midterm and final a couple days before they were due. I did each homework assignment 30 mins before class started once per week. Do a practice run for both the midterm and final and go to his office hours and ask for feedback. He's kind of brutal, but it will help you get a sense of what he's looking for and will help you with your technique. You don't need to do the readings, but the content of the course is pretty interesting and the readings are like 5 pages long. Final essay took me an hour in total.\"",
            "review 2: \"20W with Wen Xing: This course seems enjoyable as a layup class, but once you apply grades it becomes stressful. Professor Xing is actually pretty strict and critical about how good your calligraphy is, so I wouldn't recommend this class if you're looking for an easy layup class for a good grade.\"",
            "review 3: \"20W with Wen Xing: NOT A LAYUP!!!!! Everyone thinks it is because all you have to do is write two characters for the midterm and four characters and a short essay for the final, but Prof. Xing is a harsh grader. He is very particular and you have to practice A LOT in order to produce a somewhat acceptable piece. Also, I found Xing's criticism pretty rude and annoying at times. Sure calligraphy is fun to do and cool to learn about, but do not expect this grade to be an easy GPA booster.\"",
            "review 4: \"19X with Wen Xing: Midterm project + final project. No exams. You don't have to do the readings. There are weekly homework assignments but they are super easy. The prof seems intimidating at first but isn't that bad. His lectures are dry but you literally don't have to pay attention because you're never tested on the material. All you have to do is produce 2 characters for the midterm and 4 for the final with a short video explaining it. If you have a steady hand you will be fine and this will literally be the easiest class you will ever take at Dartmouth.\""
        ]
    },
    "ASCL060.93": {
        "James Dorsey": []
    },
    "ASCL060.25": {
        "James Dorsey": []
    },
    "ASCL060.24": {
        "James Dorsey": [
            "review 1: \"19X with James Dorsey: Professor Dorsey is the best! Good amount of reading that can be long but the HW's are easy. Great and interesting class and a great way to balance out a tough schedule.\""
        ]
    },
    "ASCL060.22": {
        "Sachi Schmidt-hori": [
            "review 1: \"20S with Sachi Schmidt-hori: Worst class and professor I’ve had at Dartmouth so far. Hori sensei lacks respect for her students and says whatever she wants. I would definitely not take her class again.\"",
            "review 2: \"20S with Sachi Schmidt-hori: tl;dr WORST PROF EVER, not reflective of the ASCL department, passive aggressive and cares too much about herself to care for the wellbeing of her students I have been dying to write a review for this professor ever since taking her class. She is hands down the most PASSIVE AGGRESSIVE teacher I have ever met (and trust me, I’ve had my fair share of bad teachers). Maybe it’s difficult to gauge her intentions because of the online curriculum, but I really can’t find any other justifications for what she says. She appears to be welcoming, and uses a lot of emojis and colloquial language, until she starts critiquing your efforts (and I don’t mean efforts like I skimmed the readings and commented, but efforts as in I annotated the reading and made a comment based on my analysis). Some examples of her day to day aggressiveness: “Does this mean anything to you? Am I just beating the dead horse here?” “Also, I have stated many times…” “Have you read everyone else's comments and my responses? Please take this assignment more seriously.“ (Her words, not mine.) She posts these publicly and her targets have been multiple students. I learned early not to say anything remotely negative about Japanese literature because she translates that to you not having read the course material and will publicly shit on you. Say anything negative about any character within the stories you read, and she will spin it as ignorance and pro-America nationalism. She has created an environment where you cannot create controversy and need to praise/regurgitate something she previously said to pass. She clearly knows her material but she’s not qualified to be a professor. If you’re genuinely interested in the commentary and critiques involved with literature, run away, and if you’re looking for a layup, run away still because she does not care about personal circumstances and gives a lot of unnecessary work.\"",
            "review 3: \"20S with Sachi Schmidt-hori: She probably knows her topic very well but not too qualified to teach. Take it with a grain of salt but she is not interested in her students' success. It's like you are always talking to a wall. She has no clear expectations and guidelines. And yeah she is more aggressive towards guys for some reason. Not sure why though. She likes to talk about politics and throw trash into current president and American foreign policy in general. My mistake was signing up for this class in the first place. But may be it's just me. No it's not lol\""
        ],
        "Sachi Schmidt-Hori": []
    },
    "ASCL060.21": {
        "Sachi Schmidt-hori": [
            "review 1: \"20W with Sachi Schmidt-hori: Hori sensei appears to be sweet but she doesn't genuinely care about her students. Her choice of articles for the class comes only from the library. Her expectations are unclear. I wouldn't take another class with her again. She appeared to be bored discussing the assigned readings and forced students to work on their own in groups. Nah folks had no idea where to start because secondary texts are dense and boring. Hori sensei has no guidelines, office hours or respect for students. We had an x-hour which she didn't attend due to a meeting. She made us watch a video from youtube. Not taking another ASCL class.\"",
            "review 2: \"20F with Sachi Schmidt-hori: Worst professor I've encountered at Dartmouth. She will berate you and discredit your intellect if you say anything negative about the texts. She has a fixed mindset and is not open to constructive dialogue.\"",
            "review 3: \"20F with Sachi Schmidt-hori: Truly amazing class. I usually don't write reviews here, but this class was really enjoyable and engaging in the remote format. As a pre-med student, I found this class perspective-changing and influential to how I view topics around gender, sexuality, corporeality, and race; would recommend to those curious to learn more about Japan and society.\""
        ],
        "Sachi Schmidt-Hori": []
    },
    "ASCL060.20": {
        "Sachi Schmidt-hori": [
            "review 1: \"22S with Sachi Schmidt-hori: She got tenure so that's why she completely different this term from the other terms. She's rude, condescending, and racially/ethnically insensitive with is ironic for the class she teaches. If you disagree with her opinions, she grades you poorly. She picks favorites which is the greatest determinant of your grade. Some of the readings were interesting but I would not recommend this class.\"",
            "review 2: \"22S with Sachi Schmidt-hori: This term Hori really wanted students to take her class seriously, and it really showed in the way she graded and how insensitive she could be towards students who disagreed with her. She had specific opinions and could be rude in class to students who didn't exactly agree with her. I found her instructions for the midterm to be really vague but her expectations turned out to be really specific, which made grading feel inconsistent. I felt that she had clear favorites in the class, and her favoritism would really show in how she graded. The feedback I received from her would often not just be negative but would have a rude and needlessly mean tone. At the beginning of the class, I really enjoyed her as a professor and found her to be engaging and funny, and I thought the course content was interesting. As the class went on, however, I found myself not enjoying the class experience at all due to the teaching experience, and I personally wouldn't recommend the class.\"",
            "review 3: \"22S with Sachi Schmidt-hori: Despite the median grade and other reviews, this class was not always a pleasant experience. The content was interesting and important but the professor was biased towards and against specific students. She sometimes would cut a student off or be disrespectful towards them. Instructions and expectations for essays were also unclear. Your experience in this class will likely be determined by her initial impressions of you.\"",
            "review 4: \"22S with Sachi Schmidt-hori: Avoid this class, even if you are an ASCL major. The topics are interesting, but Hori sensei can be very disrespectful and vindictive. If you end up in this class, try your best to never disagree with her. Grading is all over the place, but the closer you are to her opinions the better you will do.\"",
            "review 5: \"21F with Sachi Schmidt-hori: Professor Hori is awesome! As and ASCL major, this is one of the more enjoyable classes I've taken. She is fun, gives good feedback, and has really great content to teach. It was much more linguistics based than I anticipated, and I was surprised at how much of the content was new for me, especially given that I'm a senior. The readings are a bit time consuming, and you actually have to do them because she cold-calls in class and requires summaries/responses for each paper. However, she is a nice grader and you will be well-rewarded for your work. It's not an Arabian Nights style layup, but it was very manageable and I think most people did very well. There are 2 essays instead of exams, and they are very fair. They incorporate the papers read in class, lectures, and other outside research. Again, very doable. I would definitely recommend this class to anybody who is looking to learn a lot in a stress-free environment :)\"",
            "review 6: \"21F with Sachi Schmidt-hori: I really liked this class! Hori Sensei is really nice and knows a lot about this. The class really made me challenge the ways I think about English and Chinese/Japanese/Korean languages, which is something I think was really nice and important to get out of it. I sometimes felt like I was in over my head with the readings, but she didn't expect us to read the super dense stuff super deeply. The readings are about 20-40 pages per class, which sounds scary (at least to STEM major me) but it goes really fast and you can skim and be totally fine. There's a short canvas post summarizing and responding to the readings before each class. The whole reading and canvas post thing takes about 1-2 hours to do, plus a midterm and final paper (4 and 6 pages each?). I'd say its on the edge of being a layup: you have to put some work into it, but it wasn't that hard while still being engaging and interesting. Would recommend and would take another class with Hori Sensei.\"",
            "review 7: \"21F with Sachi Schmidt-hori: I really liked this course! I believe if I was an upperclassmen I would 100% call this class a layup but since this was my first term and I was still getting my bearings I wouldn't call it a complete layup. We had 2 readings totaling around 40 pages with summaries and responses due three times a week for each class. It took me about me about 2 and half hours to complete the entire assignment. I learned a lot about East Asian culture that I probably would've never learned otherwise. Professor Schmidt-Hori is so funny and I will try and take another course with her.\"",
            "review 8: \"21F with Sachi Schmidt-hori: I loved this class! And this is coming from a CS guy, but Hori-Sensei is such a sweetheart and inserts her own life into the class! The class format is as it says in the other reviews, but one thing to mention is that the class is a complete layup because Hori-Sensei is quite frankly the most generous grader there is (our average midterm essay grade was a 98%). As long as you pay attention, this is a great way to knock out distribs and meet an amazing human being!\"",
            "review 9: \"20W with Sachi Schmidt-hori: Hori sensei appears to be sweet but she doesn't genuinely care about her students. Her choice of articles for the class comes only from the library. Her expectations are unclear. I wouldn't take another class with her again. She appeared to be bored discussing the assigned readings and forced students to work on their own in groups. Nah folks had no idea where to start because secondary texts are dense and boring. Hori sensei has no guidelines, office hours or respect for students. We had an x-hour which she didn't attend due to a meeting. She made us watch a video from youtube. Not taking another ASCL class.\"",
            "review 10: \"20F with Sachi Schmidt-hori: Hori Sensei is SUCH a sweetheart. Do NOT let the other course reviews scare you. She is so kind and encouraging, and the class is the perfect combination of easy and interesting. I learned so much from Hori Sensei about Asian languages and reevaluated much of my own thinking about the English language. Take this course -- it will not disappoint you and is a great way to get your TMV!\""
        ],
        "Sachi Schmidt-Hori": []
    },
    "ASCL060.07": {
        "Wen Xing": []
    },
    "ASCL060.04": {
        "Qiong Xie": []
    },
    "ASCL060.03": {
        "Qiong Xie": [
            "review 1: \"20S with Qiong Xie: Prof. Xie was very sweet. Not too much work during 20S: we were only expected to post short discussions twice a week. No paper or exams. Some knowledge in the traditional Chinese culture and Chinese history would be preferred though.\""
        ]
    },
    "ASCL059.03": {
        "Diederik Vandewalle": [],
        "Faith Beasley": []
    },
    "ASCL059.02": {
        "Diederik Vandewalle": []
    },
    "ASCL059.01": {
        "Diederik Vandewalle": []
    },
    "ASCL055.01": {
        "Kenneth Bauer": []
    },
    "ASCL054.04": {
        "Pankhuree Dube": []
    },
    "ASCL051.01": {
        "Reiko Ohnuma": []
    },
    "ASCL010.03": {
        "Sachi Schmidt-hori": [
            "review 1: \"24S with Sachi Schmidt-hori: I took this class just as a distributive requirement and it was so interesting! Sensei Hori is certainly a character, but I actually learned a lot from her and gained knowledge on a subject I had no prior ideas about. There are nightly readings but not too long (for the most part), and 300-word responses every time. We also have 4 quizzes that are pretty easy as long as you study the specific topics she tells you to. Classes are a mix of lecture and small-group discussion every day. She definitely expects some knowledge of Japanese language and culture going in, no matter what the syllabus says, but without that I just leaned into not knowing and it was fine. Super rogue class but also very easy to do well in.\"",
            "review 2: \"23S with Sachi Schmidt-hori And Dennis Washburn: Hori sensei is extremely knowledgeable in her field, and always brought new perspectives to the class. Professor Washburn was a great lecturer, he always made sure that the students' opinions were heard. We used all x-hours, but the workload is very manageable and I had a lot of fun in the class. If you want to learn about Japanese classics this is the course.\"",
            "review 3: \"22S with Sachi Schmidt-hori: Other reviews have stressed how awful Hori is and how much work she gives in this class. It's true that the work seems like a lot--she assigns 250-300 word \"summaries\" every class on each of the 50-80 page readings, and there are multiple readings for some days. At the beginning, it can feel quite overwhelming. And she actually *does* read every student's summaries and will take points off for inaccurate writing (at least for the first half of the class until the midterm). However, Hori-sensei is a compassionate teacher and she has made it very clear multiple times that you are supposed to grapple with the work and not understand it at first. She will always allow students to redo summaries if they just ask her first. At the beginning of the class, Hori will explain how a student should be analyzing and understanding the texts assigned in class. DO NOT underestimate this explanation. Once you learn to view the assigned readings through the specific critical lens that she discusses early on, class discussions and summaries become a cakewalk. And there are only two real \"assignments\" in this class--the midterm and the final. Arguably the only really challenging one was the final, which is an essay with incredibly specific guidelines. Hori is also an incredibly engaging prof. Most students probably heard what she had to say in class and decided they didn't understand it and that she was bad at teaching. It's true that certain concepts could be difficult to truly understand, but she always responds to emails with in-depth explanations and will talk to students about things after class and during office hours. Not to mention Washburn, the co-teacher, is an excellent resource and understands that Hori isn't always the easiest to get. Class discussions can be fun too if you allow them to be fun--a lot of the texts are really nutty or controversial, which can be interesting to talk about. Not as bad of a course as people make it out to be, but can be stressful at times. Overall I'm happy with what I got out of it and I think I learned a lot.\"",
            "review 4: \"22F with Sachi Schmidt-hori: Ok, do not take this class with Sachi holy sh*t. I never had a class that was as unorganized and stressful as this one. WORST EXPERIENCE AT DARTMOUTH SO FAR! Hori might be good at gender studies, but she even struggled to get her ideas across. She is also VERY VERY harsh and even mean when it comes to grading. If you read a little bit of the assigned readings, you would learn nothing new in her lectures. The class discussion was just a waste of time as people try to bs their thoughts out of the readings. Professor Washburn, who co-teaches this class, was great but still could not save this class from Hori's ravage. For each class, you get ~50 pages of reading or 3 hours of film watching, then write a summary/response to it. She gave little guidance in the first half of the term and everyone just ended up writing 3 1000-word essays per week. The midterm and the final essays are not long, but it would be miserable to write if you are not interested in the intersection of literature and gender studies. (The midterm, where you and another student create a letter exchange between a man and one of his lovers, was just ridiculous and useless.) Did I learn something from this class? Yes, a little. But it was definitely not worth the time and effort I put into this class. To those who want to take the Japanese LSA, try to take another Japan-related class and ask for a waiver of this class if Hori continues to teach it.\"",
            "review 5: \"20S with Sachi Schmidt-hori: 🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤮🤮🤮🤮🤮🤮🤮🤮🤮definitely would not take this class, but hey, maybe it’s different with in-person instruction. Worst professor I’ve had at Dartmouth so far, but I guess I never had a negative experience until this one.\"",
            "review 6: \"20S with Sachi Schmidt-hori: Worst class I've ever taken at Dartmouth. Worst prof---so stubborn and offensive. Don't take this class if you want to have a good time.\"",
            "review 7: \"20S with Sachi Schmidt-hori: I would take your intro to Japanese culture with different prof if I could. She assumes that everybody knows what she is talking about and doesn't clearly explain ideas.\""
        ],
        "Allen Hockley": [
            "review 1: \"19S with Allen Hockley: This was one of the easiest classes I have ever taken at Dartmouth. Hockley's lectures were usually pretty interesting once you get past his tiring voice. He kinda sounds like he's talking himself to sleep, but the material is pretty cool. I took notes every now and then but you don't really need to. Homework was short discussion posts for readings, and you could breeze through those pretty quickly. Sometimes I would only spend about 5 minutes on them and be done. Got graded on three different 2-3 page papers and they were 15 pts each. The prompts were straightforward and you could just skim through the old readings to find evidence and stuff. Final was just writing two more of those 2-3 page papers with your choice between a few culminating prompts. I highly recommend this class if you're looking for minimal work and a really friendly professor.\""
        ],
        "Sachi Schmidt-hori And Dennis Washburn": [
            "review 1: \"23S with Sachi Schmidt-hori And Dennis Washburn: Hori sensei is extremely knowledgeable in her field, and always brought new perspectives to the class. Professor Washburn was a great lecturer, he always made sure that the students' opinions were heard. We used all x-hours, but the workload is very manageable and I had a lot of fun in the class. If you want to learn about Japanese classics this is the course.\""
        ],
        "Dennis Washburn": [],
        "Sachi Schmidt-Hori": []
    },
    "ASCL010.02": {
        "Soyoung Suh": [
            "review 1: \"21F with Soyoung Suh And Sunglim Kim: NOT A LAYUP -- the first half of the term with Professor Suh was not too bad (lots of reading and Canvas discussions but she's super sweet and not too harsh about work handed in a couple hours late); midterm was two essays which were graded easily. BUT the second half with Professor Kim was brutal -- I would estimate 5 hours of work before every class if you actually did all the readings and answered questions thoroughly. Her midterm was tough, but she was generous with grading (spelling was not taken int account, fairly forgiving). Overall, an interesting class and some of the readings were particularly fascinating, but definitely not a class I would take just to fulfill a distrib.\"",
            "review 2: \"20F with Soyoung Suh: I was really excited for the course prior to starting class, but it wasn't really what I expected it to be in terms of how engaging/interesting the class was. Don't get me wrong, I am still deeply curious about Korean culture and all but the first half of the term with Professor Suh was not it. The readings were somewhat dense (sometimes 20+ pages) and she required you to answer discussion questions on Canvas along with them. The class was purely lecture but it wasn't as engaging as I expected. The midterm was also 2 essays and/or a research paper of a topic of your choosing.\"",
            "review 3: \"19F with Soyoung Suh: Class overall was not terrible in terms of readings and work. However, Prof. Suh has designed it so that the exams and essays are all given at the same time - meaning nearly all the work in the class takes place over two weeks. This was annoying. Not a hard class, but the Prof. was not particularly good at communicating her expectations and due dates. I'd try to take it with a different Prof. if possible.\""
        ],
        "Soyoung Suh And Sunglim Kim": [
            "review 1: \"21F with Soyoung Suh And Sunglim Kim: NOT A LAYUP -- the first half of the term with Professor Suh was not too bad (lots of reading and Canvas discussions but she's super sweet and not too harsh about work handed in a couple hours late); midterm was two essays which were graded easily. BUT the second half with Professor Kim was brutal -- I would estimate 5 hours of work before every class if you actually did all the readings and answered questions thoroughly. Her midterm was tough, but she was generous with grading (spelling was not taken int account, fairly forgiving). Overall, an interesting class and some of the readings were particularly fascinating, but definitely not a class I would take just to fulfill a distrib.\""
        ],
        "Sunglim Kim": [
            "review 1: \"21F with Soyoung Suh And Sunglim Kim: NOT A LAYUP -- the first half of the term with Professor Suh was not too bad (lots of reading and Canvas discussions but she's super sweet and not too harsh about work handed in a couple hours late); midterm was two essays which were graded easily. BUT the second half with Professor Kim was brutal -- I would estimate 5 hours of work before every class if you actually did all the readings and answered questions thoroughly. Her midterm was tough, but she was generous with grading (spelling was not taken int account, fairly forgiving). Overall, an interesting class and some of the readings were particularly fascinating, but definitely not a class I would take just to fulfill a distrib.\"",
            "review 2: \"19W with Sunglim Kim: Easy class. Interesting readings and learn a lot about Korean history. Very low stress and not too much work.\""
        ],
        "Sujin Eom": []
    },
    "ASCL010.01": {
        "Miya Xie & Levi Gibbs": [
            "review 1: \"24S with Miya Xie & Ao Wang: huge layup. the group final project at the end was kind of annoying. almost everything was graded on completion. kind of sad because i had actually hoped to learn more but didn't because of the structure and the lack of care from students. the profs are both super sweet though\"",
            "review 2: \"23S with Miya Xie & Levi Gibbs: Super easy class, maybe one of the biggest layups I've taken. Syllabus says the professors don't take attendance, so out of a class of 52 registered students, only 10-20 would regularly show up to class. Lots of guest lectures which was nice, but the lectures tended to be very dry. 50% of your grade is completion-based Canvas discussion posts answering easy questions about the readings. The other 50% is split between a midterm and final book review where you find a scholarly book of your choice and write a 5-7 page review of it. You basically just have to include the things the assignment sheet mentions and you'll get an A on it. Overall, if you need a layup this is a great option. It's a shame the class is so boring because the content is interesting and could be taught in a much more engaging way.\"",
            "review 3: \"23S with Miya Xie & Levi Gibbs: Massive layup. Take it if you need a layup but don't take it if you have any interest in the topic since this class is extremely boring.\"",
            "review 4: \"23S with Miya Xie & Levi Gibbs: Huge layup. Levi was a terrible lecturer which I think contributed to my dislike of this class. After two mind-numbingly boring lectures of him reading from the slides, I did not show up to class for the rest of the term and still ended up with an A. Shame because I think the content could have been interesting.\""
        ],
        "Allen Hockley & Levi Gibbs": [
            "review 1: \"19F with Allen Hockley & Levi Gibbs: This class has been a layup in the past but the format has changed to be super challenging. Your grade is basically made up of 5 fifteen minute quizzes that are on SUCH specific parts of the reading. Go to office hours and they will help you out big time.\"",
            "review 2: \"19F with Allen Hockley & Levi Gibbs: Individually each professor is great, together the class is unnecessarily stressful. 15 minute quizzes that count for 15% of your grade on microspecific names/ideas you either caught or didn't. At some point, no one in the class answered a question correctly because the material was that specific. Did the profs care? Absolutely not. The material can be interesting but the fact that everything was condensed into quizzes of unreasonable times just made the class toxic. Failing any individual quiz sets you up for failing the class, and Gibbs' only advice is for you to get 100% on the rest of the quizzes to save your grade. Readings were also on many scholarly articles that had little to no relevance on the course lecture. Wouldn't recommend this course unless you're applying to the Chinese LSA+ (in which case you're forced to take this course). If you have to take this class and need extra help, don't waste your time with Gibbs, just go to Hockley.\""
        ],
        "Qiong Xie & Levi Gibbs": [
            "review 1: \"22S with Qiong Xie & Levi Gibbs: Ridiculously easy class but also the most boring class of my life. This was a prereq for the Beijing LSA. They also told us the LSA was cancelled on the last day of add/drop for this class, so that made me particularly angry. I rarely did the readings, and the final project was super easy to grind out. If you need an easy distrib, maybe not a terrible choice, but I don't think I learned anything from this class. Note that this was an online class when I took it.\"",
            "review 2: \"21S with Qiong Xie & Levi Gibbs: Very light workload. Just discussion posts per week, and a final project that you get to choose yourself. Interesting material, even as a Chinese person myself. Note: Online\""
        ],
        "Miya Xie & Ao Wang": [
            "review 1: \"24S with Miya Xie & Ao Wang: huge layup. the group final project at the end was kind of annoying. almost everything was graded on completion. kind of sad because i had actually hoped to learn more but didn't because of the structure and the lack of care from students. the profs are both super sweet though\"",
            "review 2: \"23S with Miya Xie & Levi Gibbs: Super easy class, maybe one of the biggest layups I've taken. Syllabus says the professors don't take attendance, so out of a class of 52 registered students, only 10-20 would regularly show up to class. Lots of guest lectures which was nice, but the lectures tended to be very dry. 50% of your grade is completion-based Canvas discussion posts answering easy questions about the readings. The other 50% is split between a midterm and final book review where you find a scholarly book of your choice and write a 5-7 page review of it. You basically just have to include the things the assignment sheet mentions and you'll get an A on it. Overall, if you need a layup this is a great option. It's a shame the class is so boring because the content is interesting and could be taught in a much more engaging way.\"",
            "review 3: \"23S with Miya Xie & Levi Gibbs: Massive layup. Take it if you need a layup but don't take it if you have any interest in the topic since this class is extremely boring.\"",
            "review 4: \"23S with Miya Xie & Levi Gibbs: Huge layup. Levi was a terrible lecturer which I think contributed to my dislike of this class. After two mind-numbingly boring lectures of him reading from the slides, I did not show up to class for the rest of the term and still ended up with an A. Shame because I think the content could have been interesting.\""
        ],
        "Allen Hockley": [],
        "Levi Gibbs": [],
        "Qiong Xie": []
    },
    "ASCL080.05": {
        "Levi Gibbs": []
    },
    "ASCL070.09": {
        "Theodore Levin": []
    },
    "ASCL070.01": {
        "Allen Hockley": [
            "review 1: \"21W with Allen Hockley: Professor Hockley clearly has a passion for this material and his lecture style shows. He is very engaging and answers any questions during lecture. While there is a reading and discussion post per class, this can be written in 15-30 minutes easily. The midterm and take home final are all open book essays so the class does have some work, but if you enjoy the material it will come easily. Definitely recommend him if you want to delve into ASCL.\"",
            "review 2: \"20F with Allen Hockley: Hockley is by far the WORST and LAZIEST professor I have ever had at Dartmouth. Awful prof who puts no effort in assignments and will not teach you anything or be enjoyable to have.\""
        ]
    },
    "ASCL061.01": {
        "Gil Raz": []
    },
    "ASCL060.05": {
        "Levi Gibbs": [
            "review 1: \"24S with Levi Gibbs: The layup of all layups. The grading is the same as in past years and everyone gets a full grade on every assignment if you turn it in on time. Gibbs is a chiller, I couldn't recommend him enough. The lectures were not super engaging, but also not horrible. The readings are super fun to do, you essentially just read sad Chinese love stories. Take this class if you can!\"",
            "review 2: \"24S with Levi Gibbs: You def won’t be concerned about getting an A in this class… the syllabus seems harsh but it’s all talk. In reality, this class is very chill and you just need to get something on the paper to get an A. Discussion posts every class on the readings, 2 2-3 page response papers, 2 in class presentations with partner on a reading, final 10-12 page essay. Sounds like a lot of work but I promise if you bullshit you’ll do just as well as anyone else. Also the readings are fun!\"",
            "review 3: \"22F with Levi Gibbs: The best way to describe this class is \"The Art of Bullshitting\". Gibbs is a boring lecturer but he's a G tho! (Plus free A.... class essays were scored on a scale of 15. The class high? 15/15. Class median? 15/15. Class low? Also 15/15. Wow!)\"",
            "review 4: \"21F with Levi Gibbs: Overall really nice and chill class! There was a 10-12 page final paper, 2 shorter papers, and weekly discussion posts. Readings can be long but are really interesting. The in-class discussions were always enjoyable. Would recommend this class for LIT and NW distributives.\"",
            "review 5: \"20F with Levi Gibbs: Great class! There were 2 short response papers that were 2-3 pages long, weekly discussion posts, and a final 10-12 page paper. Really enjoyed the discussions, always felt like I could talk about my own takeaways and analyses. The final reading was a really long book, but the topics were interesting and intuitive.\""
        ]
    },
    "ASCL054.01": {
        "Nikhil Rao": []
    },
    "ASCL011.04": {
        "Douglas Haynes": [],
        "Nikhil Rao": [],
        "Pankhuree Dube": []
    }
}