{
    "CHIN040.04": {
        "Lei Yan": []
    },
    "CHIN040.03": {
        "Alan Li": []
    },
    "CHIN049": {
        "Allen Hockley": []
    },
    "CHIN045.01": {
        "Wen Xing": []
    },
    "CHIN063.03": {
        "Timothy Pulju": []
    },
    "CHIN062.04": {
        "Qiong Xie": []
    },
    "CHIN082": {
        "Wen Xing": []
    },
    "CHIN081": {
        "Hua-Yuan Mowry": []
    },
    "CHIN063.06": {
        "Hua-Yuan Mowry": []
    },
    "CHIN063.02": {
        "Levi Gibbs": []
    },
    "CHIN062.01": {
        "Wen Xing": [
            "review 1: \"20W with Wen Xing: This course seems enjoyable as a layup class, but once you apply grades it becomes stressful. Professor Xing is actually pretty strict and critical about how good your calligraphy is, so I wouldn't recommend this class if you're looking for an easy layup class for a good grade.\""
        ]
    },
    "CHIN061.02": {
        "Levi Gibbs": [
            "review 1: \"16S with Levi Gibbs: I highly recommend this class or any class with Levi Gibbs. No knowledge of Chinese language or culture necessary for this class. He is not only an incredible professor, but also a good person who caters to his students and is fair and understanding.\""
        ]
    },
    "CHIN059": {
        "James Dorsey": [],
        "Jonathan Smolin": []
    },
    "CHIN054": {
        "Wen Xing": []
    },
    "CHIN053": {
        "Sarah Allan": []
    },
    "CHIN051": {
        "Hua-Yuan Mowry": [],
        "Sarah Allan": [],
        "Wen Xing": []
    },
    "CHIN044.04": {
        "Hua-Yuan Mowry": []
    },
    "CHIN043": {
        "Alan Li": [],
        "Fenru Shi": [],
        "Hesheng Zhang": [],
        "Qiong Xie": []
    },
    "CHIN042": {
        "Hesheng Zhang": [
            "review 1: \"15F with Hesheng Zhang: Zhang is a visiting prof, but he is a great professor. Learned a lot, he's very chill, the workload is fine (a biweekly test, a weekly dictation, some homework, and two short reports) and the median is an A. Would recommend.\""
        ],
        "Fenru Shi": [],
        "Shengyu Li": [],
        "Wen Xing": [],
        "Yanxin Bu": []
    },
    "CHIN041": {
        "Fenru Shi": [],
        "Hesheng Zhang": [],
        "Shengyu Li": [],
        "Wen Xing": [],
        "Yanxin Bu": []
    },
    "CHIN033": {
        "Hesheng Zhang": [
            "review 1: \"17S with Hesheng Zhang: Loved this class! Super interesting readings, and Zhang lao shi is honestly amazing. He really goes above and beyond to act out and explain things, which makes it a pretty fun class to be in. If you dont stay caught up he WILL keep calling on you in class, and honestly, be grateful. Because you need an understanding of the readings and grammar to succeed. Overall an excellent class, dont be afraid to volunteer because effort and willingness to try goes a long way.\""
        ],
        "Fenru Shi": [],
        "Shengyu Li": [],
        "Shucheng Zhang": [],
        "Yanxin Bu": []
    },
    "CHIN032": {
        "Yanxin Bu": [
            "review 1: \"12W with Yanxin Bu: Course: The problem with all of the upper level Chinese courses, is that the Professor changes every year (It depends on who comes from BNU). Prepare to do a lot of writing. It felt like a repeat of Chinese 22/23, but with a different textbook and slightly more difficult vocab. Professor: She was nice, but grading was subjective and depended a lot on how well you knew her. She didn't really take your previous background into account, or she would hold it against you. Workload: Prepare for a fair amount of work, unless you already speak Chinese. If you are...why are you taking this class?\""
        ],
        "Fenru Shi": [],
        "Hesheng Zhang": [],
        "Levi Gibbs": [],
        "Shengyu Li": [],
        "Shucheng Zhang": [],
        "Wen Xing": []
    },
    "CHIN031": {
        "Lv Yuhui": [
            "review 1: \"22F with Lv Yuhui: I loved this class, the visiting prof from Shifan was the chillest chiller I have ever met. She actually did not care if you were 40 minutes late or anything. The pace is very reasonable and\""
        ],
        "Shengyu Li": [
            "review 1: \"19F with Shengyu Li: The difficulty level of this class depends pretty much entirely on how strong your foundation in Mandarin vocab/grammar/reading is (this tends to be the case with foreign language classes). The workload is very consistent (about 40 minutes per day) and is directly related to what you learn in class. Quiz every Thursday, test every other Friday, oral presentation every other Friday, essay due every week. As long as you do your work and do it correctly (which shouldn't be too hard), you should have a good time in this class. It's not meant to be difficult. Professor Li is an absolute legend (hilarious, chill, super nice guy, very accommodating).\""
        ],
        "Fenru Shi": [],
        "Hesheng Zhang": [],
        "Levi Gibbs": [],
        "Shucheng Zhang": [],
        "Wen Xing": [],
        "Yanxin Bu": []
    },
    "CHIN023": {
        "Lei Yan": [
            "review 1: \"22S with Lei Yan: Everyday in this class I got actively worse at chinese. Lei Yan is a very nice woman but as a teacher I found her methods didn't help me. She just had us spend time repeating super long-winded sentences that none of us could memorize, and we would just spend the whole class mumbling. Also, she doesn't often correct our pronunciation or give us much personalized instruction. She also tends to spend way too long pointing out obscure errors we made in front of the whole class- she makes a list of wrong answers and shares them with the class each test and homework assignment. Half of the time the sentences aren't technically wrong they just are \"too formal for the situation\". Maam maybe you should tell us ahead of time what is formal and not. Also we are expected to turn in homework prior to learning the material and the textbook doesn't explain anything either. She doesn't actually explain what the grammar means and my drill instructor is the only one teaching me. Also, yeah. we still have drill.\"",
            "review 2: \"22S with Lei Yan: Definitely a lot chiller than Chinese 22: there is only one lesson per week, instead of three every 2 weeks. Yan Laoshi is very nice and approachable, but I wish more of class was conducted in Chinese because we're definitely at a level where we can understand most of what would be said in a classroom context. The class is pretty manageable-- vocab quiz and a short worksheet every week, and a test every two weeks. I wish we had more conversational practice though. This class still has drill, one-on-one style with an emphasis on practicing grammar and conversation, which I found helpful to brush up on speaking since we don't have much opportunity to do conversation in class.\"",
            "review 3: \"21W with Lei Yan: I absolutely love Yan Laoshi. She obviously wants students to learn and be passionate about Chinese. Doing the class over Zoom was a bit difficult, though. It moves pretty quickly, and you cover 15 lessons in 9 weeks (winter term). You basically have daily homework, whether it's in-class quizzes, homework, or exercises. You're constantly working in the class, which is good for language, but it is definitely fast-paced with little opportunity for breaks.\""
        ],
        "Alan Li": [],
        "Fenru Shi": [],
        "Hesheng Zhang": [],
        "Hua-Yuan Mowry": [],
        "Levi Gibbs": [],
        "Shengyu Li": [],
        "Wen Xing": [],
        "Yanxin Bu": [],
        "Zenghong Chen": []
    },
    "CHIN022": {
        "Shucheng Zhang": [
            "review 1: \"23W with Shucheng Zhang: Class was pretty boring but Zhang Laoshi is super nice. Homework did not take long, but you have to teach yourself the grammar each night by looking at the files on canvas because he doesn't get to everything in class. There is something due every day, but Zhang Laoshi is very understanding and doesn't take off any points for handing things in late. He also will let you make up a quiz if you missed it, even if you don't give an excuse. Very nice grader. No final and midterm was great. Drill was annoying.\"",
            "review 2: \"23F with Shucheng Zhang: Professor Zhang was amazing. Despite me being fluent in Chinese (i grew up speaking Chinese), I think this class should be a free A for anybody. This class definitely requires work but if you put it in you will get an A. Complete the homework and mostly study for the weekly vocab quizzes and the tests are super easy. THERE IS NO FINAL! Zhang Lao Shi is also super kind, engaging, and understanding. If you can't make class for any reason just let him know - he responds super quickly via email. The final skit is just super laid back - just make him laugh!\"",
            "review 3: \"22F with Shucheng Zhang: I was forced to take this class because I wasn't eligible to take CHIN 4, so I went into it pretty discouraged as I was already worried about the pace and workload of CHIN 4. Like any Chinese class at Dartmouth this will take up a lot of your time. The class met everyday in the 9S spot in addition to drill twice a week. Prof Zhang covered roughly 2.5 chapters each week, so there were two vocab quizzes (20-30 characters) + two homework assignments due weekly. There were 4-5 chapter tests every two weeks. You really need to stay on top of the work in this class. That being said, this class was the most helpful and efficient class in improving my Chinese skills. Prof Zhang is also the best Chinese professor I've ever had. Not only is he an engaging prof, but he is also the most understanding.\"",
            "review 4: \"22F with Shucheng Zhang: Exactly what the other review said. Zhang is an amazing and caring prof, but the workload of this class is pretty brutal. You never get a break, as there is always something due.\""
        ],
        "Zenghong Chen": [
            "review 1: \"21W with Zenghong Chen: Not really a layup but the workload is manageable if you have some sort of reasonable previous Chinese background. Content is relatively easy, you just need to dedicate time each day (like any language) to do well. She is very helpful and honestly one of the sweetest people I've met. Would recommend getting your LIT distrib w/ this class\""
        ],
        "Alan Li": [],
        "Fenru Shi": [],
        "Hesheng Zhang": [],
        "Lei Yan": [],
        "Levi Gibbs": [],
        "Shengyu Li": [],
        "Wen Xing": [],
        "Yanxin Bu": []
    },
    "CHIN011": {
        "Alan Li": [],
        "Levi Gibbs": [],
        "Wen Xing": []
    },
    "CHIN010": {
        "Allen Hockley": [
            "review 1: \"19F with Allen Hockley: Would not recommend this class as a layup unless the method of testing is changed. The current way of assessment is 15 point questions on 3-5 lectures which makes it difficult to know what is being tested or not. Other than that, interesting class to take on Chinese culture with white men teaching it lol\""
        ],
        "Susan Blader": [
            "review 1: \"11W with Susan Blader: Course: The readings, the lectures, and the test have nothing to do with each other. The reputation definitely lived up to the hype. On the plus side, I did learn something about Chinese culture. Professor: Get on her good side, meaning talk in class, and you're guaranteed an A Workload: Mostly reading and busywork. Not too much\""
        ],
        "Levi Gibbs": []
    },
    "CHIN004": {
        "Alan Li": [
            "review 1: \"23F with Alan Li: Median was an A. All in all, the most work I've ever put into a class at Dartmouth. For some reason, they thought it was a good idea to combine Chinese 1, 2 and 3 but I'll take one term of language over 3. Lectures were clear and very useful. Professor Li is evidently very passionate about what he teaches and if you pay attention in class, you will do fine with grammar on the exams. Schedule was Monday vocab pinyin test, wednesday character dictation, and Friday was the test. As previous reviews said, ton of characters to memorize each week. Final was not hard as long as you knew all/most of the characters.\"",
            "review 2: \"23F with Alan Li: Came into this class as a native speaker (but could not read or write besides some very simple things). This class was a definitely a lot of work since I had to memorize the vocab and characters (we learned ~750 vocab terms by the end, around 80 a week), along with learning/fixing grammar. People with some decent Chinese speaking background definitely have a big advantage because Li Laoshi speaks a lot of Chinese in class, but I would say because traditional characters are sometimes hard to memorize and my language memory isn't too good, I had to spend a couple hours the day before each class preparing for quizzes/dictation, homework and weekly exams. What I will say is taking this class is definitely a good choice for native speakers who don't know enough characters for Chinese 2 but feel like Chinese 1 might be too slow since a lot of that intuition is already there. I also like how drill was 2x each week, at really convenient times, and in smaller/chill groups so it really wasn't a hassle. Li Laoshi is also super funny and a great professor, and I learned a lot from his explanations and comments on Chinese!\"",
            "review 3: \"22F with Alan Li: I had a great experience with 李老師's CHIN4. I'd previously taken 3 years of high school Chinese and 3 years of middle school Chinese and hadn't gained as much from either as I could have due to boring classes and not being taught tones... I feel like I learned more in this term alone than in all my previous classes. Professor Li was engaging, energetic, personable, and genuinely super funny. If you plan on taking the class, you will learn a lot, but be prepared to spend a lot of time on it. I found that the assignments (memorizing characters, doing translations for homeworks, etc.) weren't terribly difficult but took a lot of time, so keep that in mind if you plan on taking other classes with high workloads.\"",
            "review 4: \"22F with Alan Li: Favorite Dartmouth class so far. Prof Li is amazing. He is funny and extremely intelligent. He really teaches you why things are the way they are, rather than just having you memorize grammar and characters. Learned more with him than I did in all of high school. I didn't know any traditional characters before this class, so that was definitely new and somewhat annoying, but it didn't make the class any harder. The assignments are quick and easy, and so are the tests. It's a lot of characters to memorize each night, but it is very manageable. Li even allows you to test out of drill! The concepts are all very basic. You pretty much start from the very beginning, so anyone who has taken Chinese will do well. I would definitely recommend this class to anyone who places into it. Very worthwhile.\"",
            "review 5: \"22F with Alan Li: Not a bad class if you are super passionate about Chinese (or are a native/fluent speaker). But if you are just trying to complete your language requirement in the easiest way possible, you are probably better off taking Chinese 1-3. This class requires an extreme amount of effort studying and memorizing characters in order to succeed. It also uses traditional characters which are probably new to a lot of students, including those who took Chinese in high school. Li is a super nice guy, is pretty laid back, and is an interesting lecturer, but the course material is a lot so think long and hard before committing to this class - and if you do take it, try to make sure this is your most rigorous class that term.\"",
            "review 6: \"21W with Alan Li: This class is not a layup! Alan Li is a great professor but goes super fast through the materials and class can often get really boring. Homework at the start of the week is fine (usually just memorizing vocab and doing audio recordings), however, at the end of the week, some assignments take 2+ hours. Additionally, we have weekly tests on Friday which can take up to 3 hours. I would not take this class if you already have another hefty class.\"",
            "review 7: \"21F with Alan Li: This class is really all about how much experience you have with Chinese. You'll quickly realize that this is a layup for those who are fluent/near fluent speakers, and more of a struggle for people who don't know Chinese grammar well. That said, Li is an amazing professor and knows both Chinese and linguistics really well - the class moves fast, but he still manages to share many tricks for remembering patterns and grammatical rules in the language. Main thing about this class is that it moves really quickly even for Dartmouth - you'll have a quiz basically every day and a test every Friday, so spend a lot of time practicing the traditional characters and going over the grammar points he puts up in slides.\"",
            "review 8: \"21F with Alan Li: I was super annoyed when I found out we had to learn traditional characters for this class, but despite that, I had a really positive experience in Chinese 4. Professor Li is hilarious while still doing an amazing job explaining grammar concepts. I came in with a pretty strong background in Chinese, but even I came out learning so many new things about the language. I found the workload manageable, but I only really studied writing characters. If you have a weak background in Chinese, I think this class would be pretty overwhelming. We had quizzes pretty much everyday and a test every Friday, so the workload is consistent but very fast paced.\"",
            "review 9: \"21F with Alan Li: This class is hard but 100% worth it. Prof Li is an outstanding professor–easily the best Chinese professor I've ever had. If you took mandarin in high school and you place into Chin 4, I would 100% recommend this class.\"",
            "review 10: \"20F with Alan Li: I was almost scared away from taking this class by people who said the workload was very challenging, but I think your experience will vary heavily based on your Chinese background. If you speak at home and do not already know how to read or write, you will probably find this course pretty difficult because you'll have to learn a ton of characters. Additionally, people who know simplified only will also be annoyed that it's in traditional. However, if you have some Chinese background from high school, it's definitely a manageable class because the vocab is pretty basic and you will probably know the vast majority of it already. My high school chinese program wasn't great and I was still decently prepared. Prof Li is very sweet and clearly knowledgeable about Chinese from a linguistics perspective which I found pretty cool. Pretty moderate workload, mostly reading aloud and worksheets, and a short test every Friday. I'd definitely recommend to students who already know some Chinese and want to get a language requirement or move ahead in the major or minor.\"",
            "review 11: \"20F with Alan Li: This class was challenging. I was one of the only people that couldn't speak the language fluently. If you can speak mandarin (and write in traditional) take the class but if you have been learning it on and off, it is a challenge. Traditional is also a pain if you have learnt simplified your entire life. If you want to bang out the language rec in one term, then it might be worth the hell this class is.\"",
            "review 12: \"18F with Alan Li: Great prof. Funny sense of humor and understanding about late homework. Genuinely wants you to improve in Chinese. The class is a lot of memorizing work, but as long as you do it you have complete control of getting a good grade.\"",
            "review 13: \"18F with Alan Li: This course is NOT a layup. There's daily quizzes where you have to learn about thirty characters a day and then there's a cumulative test every Friday. Also, the course is in traditional which can be a total pain in the ass. Regardless of the amount of work this class is, you want Li Lao Shi as your prof. Li Lao Shi is really funny and a good teacher. He explains the grammar really well and also shows you how the traditional characters kind of look like pictographs. Do not take another heavy workload course while you are taking Chinese 4.\"",
            "review 14: \"18F with Alan Li: Definitely not a layup. Daily quizzes and a weekly test make for a demanding course for anyone without a SOLID background in Chinese. I honestly only recommend this class to students who have passed the AP Chinese exam and want a refresher or barely missed out on testing out, because if you don't already know the material, you will get a poor grade.\"",
            "review 15: \"17F with Alan Li: Professor Li is the best - he's super engaging and really good at teaching to both native-speakers and beginners. As someone with minimal Chinese background, I found this class to be extremely difficult but super rewarding. There is a 40-word quiz every day, homework twice a week, and a test every Friday. Manageable, but be prepared for long nights if you are not already proficient in the language.\"",
            "review 16: \"17F with Alan Li: Somehow Professor Li makes waking up at the crack of dawn, after you were up studying 40 characters and pinyin for the daily quiz, a ton of fun. His linguistic background makes the class engaging, and his jokes (along with a spicy textbook storyline) make it enjoyable.\"",
            "review 17: \"17F with Alan Li: He is an amazing and fun professor. Makes waking up so early in the morning worth it. Make sure to memorize both the pinyin and characters though; everything is fair game.\"",
            "review 18: \"16F with Alan Li: Class was what you'd expect any Chinese class to be like—a lot of memorization every night (up to 40 characters a night) with daily quizzes (either writing sentences or vocab) and weekly tests, along with one midterm and one final. The tests and quizzes were very standard and fair--if you memorized the words, you were fine. Memorization took up a lot of time, and this was definitely not a layup in terms of workload, simply because of the amount of time it took to memorize everything (depending on how much Chinese you knew beforehand. I came in not knowing how to write/read at all but am a native speaker). Prof Li definitely made the class enjoyable, however, and I definitely recommend this if you want to learn more Chinese, because you do leave the class having learned a ton!\"",
            "review 19: \"16F with Alan Li: I love Prof Li, he's such an engaging guy and makes the almost intolerable number of characters you have to memorize seem almost manageable. Great guy, hard class, especially if you come in not knowing a lick of how to read/write Chinese.\""
        ],
        "Zenghong Chen": [
            "review 1: \"20F with Zenghong Chen: Not really a layup but the workload is manageable if you have some sort of reasonable previous Chinese background. Content is relatively easy, you just need to dedicate time each day (like any language) to do well. She is very helpful and honestly one of the sweetest people I've met. Would recommend getting your language requirement out of the way w/ this class.\"",
            "review 2: \"20F with Zenghong Chen: agree with all the other reviews about CHIN4 prof is SO nice but you def need to put in the work to do well in this class, especially memorizing those super complex traditional characters... would call this a \"medium\" course (but that's just imo; if you come in with a good amount of previous knowledge, you should be good) so would recommend pairing it with two other medium courses or a hard + easy course missed out on being in person for this class cuz for the last class, we supposedly eat dumplings and for the mid-autumn festival everyone eats mooncakes (not sure if it's just the class or the whole Chinese dept tho but still p cool and wholesome)\"",
            "review 3: \"20F with Zenghong Chen: Chin 4 was my favorite class this term! It's intense since we cover what other schools cover in 30 weeks in 10, and the transition to traditional characters might be a bit rough at first (I had to rewrite 欢 as 歡 several times during the first few weeks). Since Chin 4 was remote this year, we didn't have drills and only had quizzes twice a week. Daily homework takes about 30-45 minutes (4 times a week, not including time to study for tests/quizzes). Prof Chen is very caring and attends to each student carefully. It's a shame that I didn't get to see her in the physical classroom!\"",
            "review 4: \"19F with Zenghong Chen: All of the previous reviews are entirely accurate. As someone who was able to speak but was illiterate in the language, you will have to grind your ass off to memorize 30+ characters a lesson in order to have a decent grade on your daily quizzes. The workload of this class far outpaces both of my other classes this term, and much of your free time will be spent learning/reviewing for daily quizzes and weekly tests. If you have the option, try taking the class with Prof. Li since his grading seems to be a little more lenient than Prof. Chen's (based on students in his class). Overall, it's a good way to get your language requirement out of the way.\"",
            "review 5: \"18F with Zenghong Chen: Very nice professor. If you are signing up for this class without a very solid Chinese background, be prepared for a ton of work and memorization. This will be your hardest class of the term. There is a quiz every class and a test every Friday.\"",
            "review 6: \"18F with Zenghong Chen: I LOVE Prof Chen. She's the sweetest, most motherly prof ever and honestly makes the class worth it. Like the other class, there's a quiz every day except she only quizzes you on five random characters from the chapter and five random pinyin and a test every Friday. She's really lenient with turning in HW, just get it done tho. This class is a lot of time commitment. As a person with a chinese background (but I'm illiterate and didn't know any characters) the class was a little challenging but totally manageable. Don't take it if you want to take another hefty intro class along with it.\"",
            "review 7: \"13F with Zenghong Chen: Chen LaoShi is the sweetest and so amazing. This is a hard class though because you are learning a whole year of Chinese in one term. You also have to learn the traditional characters and that can be difficult if you are not already familiar with them. The class is a good mix of people who have been speaking Chinese their whole lives and people who took 4 years of Chinese in high school. You have to put a lot of work in but if you try really hard, you will most likely get an A-.\""
        ],
        "Shucheng Zhang": []
    },
    "CHIN003": {
        "Justin Rudelson": [
            "review 1: \"08S with Justin Rudelson: Rudelson is hilarious and loads of fun. He definitely has a more balanced approach to assignments than Blader. The final skit is extremely fun to produce. My only complaint might be that we probably didn't spend enough time on the simplified characters and just whizzed through them.\"",
            "review 2: \"07S with Justin Rudelson: Rudelson makes this class. By the third term, Chinese class is definitely dragging since the weekly schedule never changes. However, Rudelson is awesome. I have never laughed so hard. His only weakness is that he glosses over grammar points that can play a big role on tests but I would definitely sacrifice that to take a class with professor Rudelson. I strongly recommend this class.\"",
            "review 3: \"07S with Justin Rudelson: Professor Rudelson is funny and interesting. Chinese 3 is not hard after you go through Chinese 1 and 2.\"",
            "review 4: \"07S with Justin Rudelson: Seriously. Why? You've taken Chin 1 and 2. You know what to expect. Rudelson (Lu Laoshi) is great and entertaining. Although I never had Blader, I hear he's much, much better than she is.\"",
            "review 5: \"07S with Justin Rudelson: the class was hard and required alot of constant tedious work, but it had results and the prof, rudelson, really motivates you through it. hes a really great prof who cares about his students and is always out to help the students as opposed to some other classes when you feel the prof maybe out to get you. if your taking lvl 1 chinese def go with rudelson!\"",
            "review 6: \"07S with Justin Rudelson: Chinese is a tough language to learn, but Prof Rudelson is absolutely fantastic at what he does. I would highly recommend anyone interested in taking Chinese to take his class!\"",
            "review 7: \"06S with Justin Rudelson: If you're in this class, you've probably already taken 1 and 2. Same routine, workload is about the same but goes faster because you're used to it now. Rudelson is quirky and not a very effective teacher, but class is still fun and interesting.\""
        ],
        "Hua-yuan L.": [
            "review 1: \"05S with Hua-yuan L.: Prof. Mowry's a good teacher - she explains things well and she's very sweet. She also sometimes gives anecdotes about past experiences which are always fun to listen to. Lots of work as usual, but after taking Chinese 1 and 2 you'll be used to it.\"",
            "review 2: \"05S with Hua-yuan L.: After two terms of Prof. Williams, the workload and stress levels seemed much more managable. After two terms of Chinese, this class was rather boring, and the textbook was certainly not inspiring in any ways. The FSP to China next term was the only thing that kept me going.\"",
            "review 3: \"05S with Hua-yuan L.: Its the same as Chin 2. drill, hw, and conversation. Beware of Mowry though--she's like a ticking time bomb that you can trip over at the oddest opportunities. She pretends to be this nice grandmother person, but in reality can be quite harsh and mean (try talking to her during office hours). Always be on your guard around her, you never know when she will throw a curveball at you.\"",
            "review 4: \"05S with Hua-yuan L.: she has good stories same as any other chinese language classes i think. shes one of the better chinese profs\"",
            "review 5: \"04S with Hua-yuan L.: Chinese 3...after 2 terms, you're pretty much used to the whole language lab, drill, conversation thing...nothing new...\"",
            "review 6: \"02S with Hua-yuan L.: This class was the culmination of two terms of Chinese. I was very impressed with the way Prof. Mowry allowed us more freedom in determing our own methods of learning the material, with fewer adamant requirements than the previous Chinese classes I have taken at Dartmouth. Good class, good prof, overall a good time.\""
        ],
        "Crispin L.": [
            "review 1: \"05S with Crispin L.: The class is great. Prof. Williams is excellent in the classroom teaching the materials. Chinese 3 is easier than Chinese 2 for certain. If you've already taken Chinese 2 you need to take this, it is worth the time and effort to solidify your Chinese.\"",
            "review 2: \"05S with Crispin L.: Good prof, effective teaching style, can be a little intimidating especially in class i hear he's leaving to teach somewhere else though, so this review might be irrelevant\"",
            "review 3: \"05S with Crispin L.: After suffering through three terms of intense Chinese language instruction, I can safely say it has been completely worth it. Chinese culture and history is very interesting, and the key to understanding it all is through the language. I plan to be a DAMELL/Chinese major, and the skills I've learned in the Chinese 1-2-3 sequence will be invaluable. Although it sounds wishy-washy, the Chinese department is like a big family. The professors have been so willing to devote extra time to helping me learn the language and talk about other college experiences that they can almost be viewed as surrogate parents. The intense learning experience has brought me closer to my classmates, creating relationships that will only become stronger after the Beijing FSP. All in all, Chinese class has required an absurd amount of sometimes tedious work, but it has been well worth it. If you are at all interested in Chinese language, or are looking for a rigorous academic challenge, I strongly recommend first year Chinese.\"",
            "review 4: \"02S with Crispin L.: Chinese is a great language, but Crispin Williams just required too much work of his students this term. it was impossible to keep up if you had any kind of life outside of chinese, or if you weren't already a native speaker.\""
        ],
        "Alan Li": [
            "review 1: \"23S with Alan Li: LiLaoShi is a great teacher. class is hard though, may be difficult for those that don't have a chinese background. Not a layup but if you work hard you'll probs get an A\"",
            "review 2: \"21S with Alan Li: Basically going to just second the other review - Li Laoshi is the best, class was similar in structure to Chinese 1 and 2 except for learning simplified characters at the end\"",
            "review 3: \"16W with Alan Li: Li Lao Shi is the man. Take any class with him. Genuinely the nicest prof at Dartmouth. He's a great teacher and is an amazing person. Professor Li is truly one of a kind. I haven't had too many professors who were both nice people and not too harsh at grading.\""
        ],
        "Susan Blader": [
            "review 1: \"08S with Susan Blader: chinese 3 is similar to 1 and 2, but the workload eases a little, especially now that we're used to the weekly routine. the dialogues are longer and more painful to memorize, but the grammar points are fewer and easier to learn. blader's section is different from rudelson's in a few ways: 1. she doesn't \"believe\" in not having midterms or finals. unlike the students in rudelson's sections, we had to take a midterm and a final. they weren't too bad, but added unnecessary stress to an already busy time. 2. she didn't make us revise the textbook skits like rudelson did, which was nice. she also didn't make us do a video project for our final skit. instead, we did an in-class skit, as usual. this reduced some of the workload, but i heard the video project was pretty fun. 3. speaking of fun, the lectures could seriously use some. she habitually goes over the allotted 50 minutes per day, taking up to 35 minutes of extra time. this is especially true on tuesdays and thursdays, when she knows we don't have any other class after 10:50 until noon. in fact, she established a \"x-hour\" after class on thursdays. sometimes, at 10:48ish, she would wonder aloud what time it was, check her watch, declare that there's still some time left, and then take 30 minutes \"wrap up.\" during this extra time, we read (and memorized and recited) her favorite poems (chinese 10 reprise) and listened to her wonder (out loud) why we were doing so poorly on the tests.\""
        ],
        "Hesheng Zhang": [],
        "Lei Yan": [],
        "Levi Gibbs": []
    },
    "CHIN002": {
        "Justin Rudelson": [
            "review 1: \"09W with Justin Rudelson: Chinese 2 is identical to Chinese 1. Same textbook, same format, etc. By second term, I became accustomed to the work input. The tests are no harder, but mind the final. Itâ€™s rather brutal. Keep reviewing vocabulary from the first term and youâ€™ll be fine.\"",
            "review 2: \"08W with Justin Rudelson: rudelson is a very engaging and energetic professor. Every single day he was excited about teaching chinese. He is also very down to earth and approachable.\"",
            "review 3: \"08W with Justin Rudelson: not too much different from chin 1. prof is always funny and energetic. he has class everyday at 8am, and was teaching three classes this term, so this is no small feat. it's a good thing most of the grammar is still pretty straightforward, and self-study is viable, because he can't explain many of the grammar concepts. when you ask him a question, he'll explain it in a way that seems plausible for one example but is contradicted in other examples from the textbook and workbook. he can't verbalize the grammar in a way that makes sense. maybe he should be teaching his specialty, anthropology, and not first year chinese language. you're much better off studying from the textbook, or better yet--a native speaker. drill instructors are hit or miss. my instructor might as well have been tone-deaf. though effusive and personable, the AT had totally wrong tones--so wrong that even i (first year student) noticed they were different from the tones that the prof, the textbook, and native speakers seem to use. to think qualified, native speakers got rejected in favor of this AT is absolutely appalling. there should be a way to give anonymous feedback, so that students dont ever have to pay (through their tuition) for bogus instructors. conversation drill was better, but again, it depends on your AT and your conversation partners.\"",
            "review 4: \"08W with Justin Rudelson: Rudelson is a great prof. Even though it's 9 in the morning he still manages to be energetic, and I have always gotten a good laugh from each class. Blader might be a better explainer of grammar points, but Rudelson definitely trumps her in everything else.\"",
            "review 5: \"08W with Justin Rudelson: If you've had Rudelson already, you know what to expect. If you've had Blader, Rudelson *might* be more your cup of tea. His lectures are hilarious, and the workload is probably slightly less than Blader's. (Especially when it comes to the skits.) It's ultimately dependent on your own preference - if you felt bored in Blader's class, you'll probably prefer Rudelson with his quirky personality. He actually makes waking up for class at 8am fun.\"",
            "review 6: \"08W with Justin Rudelson: Learning Chinese is tough.. what do you expect? Rudelson is funny and really really hilarious. He makes me laugh everyday in the morning. But not really good at explaining grammar points...! But you willl do fine on the exam if you study enough.\"",
            "review 7: \"07W with Justin Rudelson: you will have fun with Rudelson but he doesn't teach well. This class is mostly self-teach. I attended class everyday but I'm sure that even if I didn't, I wouldn't have learned the material any better.\"",
            "review 8: \"07W with Justin Rudelson: you took chinese 1, you know what you're getting, course-wise. as for the prof, i can't say how he compares, because i've had him both terms. what i can say is that he's engaging and entertaining, but the learning really has to be done outside of the classroom. it's completely up to you how well you do in this class, and almost all of it is time put in.\"",
            "review 9: \"07W with Justin Rudelson: Rudelson makes class really fun, but you will learn the topic by yourself, outside of class.\"",
            "review 10: \"07W with Justin Rudelson: Of all the languages, Chinese is one of the toughest to learn. But I feel that after the first term is over, learning Chinese gets easier and it's really worth the effort. Bottom line: If you really want to take Chinese, choose Rudelson over Blader.\"",
            "review 11: \"07W with Justin Rudelson: This is just like chinese 1, only harder. As one of the few non majors or FSP goers in the class, I became increasingly frusterated with the amount of time required for outside of class projects, homework, etc. But still chinese is a fascinating language and actually speaking it is fun. The two hour busy work book assignment every weds, not so much. But then again, those who took chinese 1 know what they are getting into\"",
            "review 12: \"06W with Justin Rudelson: If you made it through Chinese 1, you're used to all of the homework and pretty much know how things are done. As long as you study for all of the quizzes and review the vocab, you should be fine.\""
        ],
        "Crispin L.": [
            "review 1: \"05W with Crispin L.: williams is organized and explains things well. he's not intimidating once you get used to him. and he's not intimidating just to be mean - it's only cause he really wants you to learn and try hard and do well. and plus he has a sense of humor. overall the class is pretty similar to chinese 1. definitely choose williams over blader if you want a prof who's organized and who's an effective teacher and who will challenge you. choose blader if you want a more relaxed class.\"",
            "review 2: \"05W with Crispin L.: I had Blader last term, and although Blader speaks a lot more Chinese in class and exposes you to the language, she doesn't explain the grammar as well as Williams does. Williams is a lot more structured and I would say you learn better in his class (especially the confusing grammar points). He can seem to be quite strict at times, but still has a sense of humor.\"",
            "review 3: \"05W with Crispin L.: After Chin 1, you're pretty much used to the whole routine, so it does feel easier than Chin 1. However, there are a lot more words you learn that rely on combinations of simpler characters rather than new ones, which makes it somewhat to remember all the vocab. If you've taken Chin 1 and are trying to decide whether to continue or not, I'll say stick to it. You'll find Chin 2 to be much simpler than Chin 1. Prof Williams is a good prof and teaches well. However, he could be slightly less intimidating. Also, were he a little less mechanical, he could inspire in his students some interst in Chinese culture, which is essential to motivating students remain interested in learning the langauge.\"",
            "review 4: \"05W with Crispin L.: williams really is an excellent prof so if you can put away the dislike youre sure to form for him you'll learn a lot. he's not very nice in class but in office hours even if youre on his bad side he's really friendly. they upped the amount of work we need to do to prepare for class. dialogues are longer, and theres even an extra 1/2 hour evening conversation class once a week!\"",
            "review 5: \"05W with Crispin L.: Of all the chinese profs i think williams is the one that you'll REALLY REALLY learn chinese from. He can be strict sometimes, and a bit of an ass during dialogue and stuff, but you'll get the material. i recommend him\"",
            "review 6: \"05W with Crispin L.: Its the same as Fall quarter, equally insane amount of work. Except this quarter they added a conversation drill, in addition to the rest. quite annoying to try to remember, but useful. would have been better to have that for thursday drills instead, instead of having a completely seperate session. I'm sick of Wei Laoshi picking on me all the time. Its weird because he's really nice when you see him during office hours but then he says these really harsh comments during class. He's a great prof, though, especially in explaining all the grammar. I'm trying my luck with Mowry, since she's so nice. Again, though, I would pick Wei Laoshi over Bai Laoshi in a heartbeat. She taught our class for a few days, and it was a complete waste of time.\"",
            "review 7: \"03W with Crispin L.: Williams's Chinese class was the best structured language class I have ever had (and I really like languages). He understands where each individual's problems lie and work with the students to help fix problems in grammar and pronounciation. His focus is mainly on the grammar, and this provides a really structured class that makes me wish he would teach the Chinese 01 classes. He knows how much his students can handle and will push them to reach their full potential. In that way, the class is a lot of work (all of which he checks), but it's worth it for your Chinese.\"",
            "review 8: \"02W with Crispin L.: After having Professor Williams this term, I realized how important the quality of the professor is in relation to the success of the class. Professor Williams is a great lecturer, and the small class and easy working environment really helped me grasp the material. While there is a lot of work outside of class, most of the time it's worth the effort. Great class to take if you're interested in the Chinese language.\"",
            "review 9: \"02W with Crispin L.: This class is extremely demanding of your time out of class so be forewarned. In addition to class 5 days/wk and drill 4 times, there is a conversation 1/2 hour and two language lab sessions per week as well. While the homework and assignments are not difficult, there is a ton of memorizing that needs to be done for each week. This class can also be frustrating because of all of the freshman who have already taken Chinese in high school, the Chinese students with a good ear, and the Japanese students who already know a lot of the characters. Nevertheless, I believe that the Chinese department offers the best language program at the school thanks to the Princeton textbook, and the diligence of the professors in assigning (and checking) work each week. Take it if you really want to learn Chinese. Don't take it as an easy way to fill your language requirement!\""
        ],
        "Susan Blader": [
            "review 1: \"07W with Susan Blader: Term 2 of First-Year Chinese continues the same pattern of gridsheets, note cards, quiz, workbook, dialogue, and test that you've become accustomed too. More grammar is thrown at you this term, which makes the content, overall, a notch tougher. Blader is a pretty good prof who thankfully devotes a lot of time going over grammar. Although classes aren't particularly exciting, you can tell she loves the material as well as students who try hard in and outside of class. She definitely keeps you on your toes in class by asking questions to individual students at random.\"",
            "review 2: \"07W with Susan Blader: Same exact thing as Chinese 1. Just keep going on. Blader goes over grammar much more than Rudelson, which is very helpful. She doesn't make the class as fun as Rudelson, but she is at least as good a teacher. Very available, I stayed after after class a few times when I had questions.\"",
            "review 3: \"06W with Susan Blader: Chinese is tough, no doubt about it. But if you survived Chinese 1, you'll be alright. it's a good class to take if you're looking for a challenge, but i wouldn't load up on other work-intensive courses at the same time.\"",
            "review 4: \"05W with Susan Blader: Good class, same song second verse of CHIN 001. more advanced so after only 1 term of chinese it is harder, but gets easier once you get used to the work load.\"",
            "review 5: \"05W with Susan Blader: When I signed up for Chinese 1 in the Fall, I was unprepared for the amount of work and the dedication Chinese would require. Now that I have completed the second term of the Chinese 1-2-3 sequence, I understand why the class is so rigorous. Chinese is a very different language from English, and as such, it requires more of outside-of-class work to learn the material. It is easy to spend 15 hours per week studying, and still feel like one is not doing enough work. Unlike some courses, one cannot leave Chinese to the last minute--the professors stress doing Chinese every day. Expect to memorize lengthy dialogues and take indepth quizzes every week. Although it is a lot of work, Chinese is a very rewarding and fascinating language. All of the necessary hardwork is worth it!\"",
            "review 6: \"05W with Susan Blader: More work than most if not all of the other classes I've taken at Dartmouth, but if you want to learn a language as tough as Chinese, then you are gonna have to work hard.\""
        ],
        "Alan Li": [
            "review 1: \"22W with Alan Li: Insanely great and funny teacher. Can't go wrong with Yan and Li- they are both empathetic and awesome. I learned a little more from Li, but he is a harder grader.\"",
            "review 2: \"22W with Alan Li: Chinese 2 with Prof. Li was definitely a considerable step up from Chinese 1. The workload increases substantially and the tests are much harder. Much of the difficulty comes from the amount of characters Prof. Li expected you to be able to remember, which I thought was a bit excessive. However, Prof. Li is super cool and made every class fun and interesting. He is truly a great guy and I would definitely recommend taking Chinese 2 with him. You learn a ton of material and the class feels very rewarding.\"",
            "review 3: \"21W with Alan Li: Li Laoshi is lowkey the best. He's generally super chill and funny but also does a great job at explaining grammar, origins of characters, helpful anecdotes, etc. His class focused a lot on pronunciation and tones which I liked and I feel like my pronunciation got a lot better over the course of the term. I also thought the workload was fairly easy and the lesson structures are the same each week so you know what to expect.\"",
            "review 4: \"20W with Alan Li: Alan Li is great. He's super engaging and a funny guy. Even though Chinese is early, you definitely want to be awake for his class. He makes you generally interested in the vocab and always gives interesting background info on how and why the characters were chosen for each word. It's super interesting and always a good time. Chinese is one of those interactive classes that you typically make quite a few friends in since you're always talking to each other. Overall, great class and great prof.\""
        ],
        "Lei Yan": [
            "review 1: \"20W with Lei Yan: Nice and empathetic teacher. She understands that it's winter and we're all very tired coming into class, or if we even do come to class. Try to stay on track with the fixed schedule. It's exactly the same schedule as her fall class. It's winter and it will be hard to go to class. Try your best to go. You will learn a lot of Chinese, and I recommend reviewing some imperative material from Chinese 1 and try to review as you go along the term. Again, she's super nice and understanding. Highly recommend!\""
        ],
        "Hua-Yuan Mowry": []
    },
    "CHIN001": {
        "Lei Yan": [
            "review 1: \"22F with Lei Yan: Good but super hard class... Do not take this class if you have a bad visual memory. You have to memorize on average around 40 (traditional) characters per week. These characters are MAD complicated. If you're like me, this class will be the hardest class you've had to take by far. That being said, if you DO think that you have a good visual memory, or you've already taken some Chinese before, this course will probably not be too bad (still definitely not a layup though). Yan Laoshi is super duper nice. The class was fun. Chinese is cool. The only real problem with the class is the shear amount of brute force memorization that goes into it.\"",
            "review 2: \"22F with Lei Yan: Yan Laoshi is awesome! But headsup, this class definitely is not a layup. I knew some Chinese going in—this'll be really helpful if you do too. The homeworks can take a bit but they're all completion. Would really recommend still!\"",
            "review 3: \"21F with Lei Yan: yan laoshi is so so sweet. she was exceptionally lenient in terms of making up missed quizzes or dialogue recitations, even if you just missed it because you slept in. this class was a lot of work, i spent several hours memorizing characters, and it was also every morning, which got tiring by the end of the term. but overall great class and chinese is a super cool language!\"",
            "review 4: \"21F with Lei Yan: I literally loved Yan Laoshi (thats how we referred to her in class) and she was super duper accommodating. I honestly think that's the biggest factor in why I improved in the class. You can tell that she genuinely cares about her students learning the language, and she understands that it's an early class. That being said, the class if not a layup. We learn a chapter a week, and the pace of the class is very fast. You will definitely need to make time for this class since you basically have to do work for it every day. Although the online homework doesn't take too long (probably 30mins to an hour), the hardest part is probably learning the characters. Since everything is in traditional, I felt that learning how to write the characters definitely took longer than it needed to. You also have to do memorization work on the weekends because vocab quizzes are every monday. I definitely struggled through the work, but I learned a lot. This was my first time taking any sort of Chinese class so for people that have some experience it will probably be easier.\"",
            "review 5: \"21F with Lei Yan: Yan Laoshi is a very empathetic prof. I always remember the first day of class she showed us a photo of her her two young boys and husband and the beaming smile she had on her face. That set the tone for a really doable term as she is very understanding and approachable. Each week follows the same pattern, which can get monotonous, but it is helpful because it helps you plan ahead and easily time manage with other courses; see other reviews for what that weekly schedule entails. I would agree that is is a lot of work and definitely not a layup, *especially* if you have never studies Chinese before. If this is going to be your first experience with Chinese, make sure you can dedicate enough time to it the term you take it because she is a great prof and you should make the most of it. I would like to mention, though, something that not many other reviews did and that is the native or advanced speakers in the class. Even though it is Chinese 1, there were still students in the class that had obvious experience with the language and were able to keep up with Yan Laoshi's cold calls and teaching style. However, others who were first getting introduced to the language, struggled at times (probably mostly due to Zoom-it sucked) and slowed class down a bit. However, class is over in less than an hour and then you're free!\"",
            "review 6: \"20F with Lei Yan: Although the remote format wasn't ideal, I learned a lot and I liked the structure of the class. Yan Laoshi is a really nice and understanding professor. The memorization of characters every week is a lot of work, but the talking out loud in class and the 1 on 1 drill is very helpful. Overall great class.\"",
            "review 7: \"19F with Lei Yan: Great professor, super understanding and kind. Stuck to a very strict schedule each week. Monday character quiz, Tuesday review, Wednesday memorize dialogue quiz, Thursday sentence quiz and homework packet due, and Friday cumulative test. It is a lot of work but I genuine enjoy being in the class and the structure forces you to study almost everyday thus ensuring you are learning. I would highly recommend if you have some previous experience with Chinese but the course will be extremely difficult if you have not.\"",
            "review 8: \"19F with Lei Yan: Yan Laoshi is super fun and extremely understanding of students in the morning. She may not seem that she is as tired as we are, but later in the term it kind of shows. Even if she's not actually, it feels kind of nice knowing we are all suffering together (I think that sounds nice, I guess). Class IS on a strict schedule, but you become acclimated to it. Please have some background in Mandarin before coming in. Learn pinyin, learn basic stroke order, and listen to some Mandarin regularly before coming in. You don't have to have good or even understandable tones. You'll work on that A LOT in class and drill.\"",
            "review 9: \"19F with Lei Yan: Yan Laoshi is the best. She's super sweet, kind, and is always willing to help you in any way possible in order for you to improve your Chinese language skills. Chinese 1 is definitely a lot of work (at least more than I thought it was going to be), however, the payoff is huge. Those who didn't know any Chinese were able to read, write, and speak relatively well by the end of the term. Would highly encourage taking the class with Yan Laoshi if interested!\"",
            "review 10: \"19F with Lei Yan: Yan Laoshi is literally the best. She is so helpful, very kind and understanding, and if you put in the work, you end up learning a lot. The drill instructors are also fantastic!\""
        ],
        "Alan Li": [],
        "Hua-Yuan Mowry": []
    }
}