{
    "COGS007.01": {
        "Marie-Christine Nizzi": []
    },
    "COGS050.06": {
        "Samantha Wray": []
    },
    "COGS050.05": {
        "Samantha Wray": []
    },
    "COGS081": {
        "Adina Roskies": [],
        "Jonathan Phillips": [],
        "Marie-Christine Nizzi": [],
        "Samantha Wray": []
    },
    "COGS011.04": {
        "James Haxby": [],
        "Maria Gobbini": []
    },
    "COGS011.03": {
        "David Plunkett And Jonathan Phillips": [
            "review 1: \"20F with David Plunkett And Jonathan Phillips: While the class was super interesting, it is excruciating if you’re not not into philosophy like me. This is basically Philosophy of cognitive science with an emphasis on argument and rhetoric. Like it was less science and WAY MORE philosophy than I was expecting. The class only met on Mondays for 3 hours and we had weekly papers on readings so it wasn’t difficult in terms of workload, and the Profs are real lenient graders. In terms of personal enjoyment tho, really know what your interests are before you sign up. Especially since the final is a research paper where you have to argument a claim (lenient grading tho, but it’s still a stressful brain workout.) The profs are sweethearts tho, like in the geeky, endearing way.\""
        ],
        "David Plunkett": [],
        "Jonathan Phillips": []
    },
    "COGS050.04": {
        "William Ratoff": [
            "review 1: \"20S with William Ratoff: This class is pretty similar in material to Phil35, Theory of Mind. The syllabus is a good review of the recent writings in theory of consciousness, from Chalmers and philosophy to more neuroscience-oriented readings. The course had three papers which were pretty open to what you wanted to write about. If you aren't pretty interested in either philosophy, cogsci, or neuro, then these readings will be pretty tedious for you and the class might not be worth your while. But for those who are interested in one or all of these things, it's a good opportunity to see what's currently going on in philosophy-oriented cogsci work. Solid 7/10 for me. I will say that Prof. Ratoff did the best at adapting to the online format of all my profs so far.\""
        ]
    },
    "COGS025": {
        "Erik Nelson": [
            "review 1: \"23W with Erik Nelson: Overall: I thought it was a great class. I am pretty deep into the cogs major already, so a lot of the material seemed like review. That being said, I do feel like I still learned a lot and the class was very engaging. Definitely take this class with Nelson (I strategically waited until Roskies wasn't teaching so that I wouldn't want to pass away from her bs). Workload: There were around 8 weekly quizzes based off of the readings and lecture slides. They weren't terrible at all and I was able to answer the questions accurately just by skimming the readings. Also, the lowest quiz grade was dropped. There were around 9 in-class activities that ranged from short writing prompts to small-group discussions on the material (mostly to encourage attendance). As for papers, there were 3: 750 word exposition, 1,500 word exposition and application essay, and a 2,000 word paper on a topic of your choosing (as well as a 500 word outline of the last paper). Professor: Professor Nelson is such a kind, compassionate prof. Nelson offered extensions on papers with no questions asked and gave us a soft deadline for the final paper. All around great person, and pretty funny too.\"",
            "review 2: \"23W with Erik Nelson: Nelson’s great and the class is interesting. I only took it because it is required for the COGS major, and I’m not that interested in philosophy. Despite that I really enjoyed the class. Nelson gives leeway on writing assignments so you can pick something that appeals to you\""
        ],
        "Adina Roskies": [
            "review 1: \"22W with Adina Roskies: This class is a lot of reading, and the material is really dense. She structures the course so that you do 1 presentation a term (on one of the readings), 1 short response paper (~500 words), 1 short paper (4-6 pages), 1 final paper (length depending on whether it is a group project or not), and a couple of quizzes/miscellaneous assignments. I have taken other classes with her before and have done very well but did not do well on the papers in this class (also not a philosophy person, so that might contribute). She does not give good feedback on papers so it is hard to know how to fix your work. I would only request this class if it is required for your major because the material is trivial and irrelevant.\""
        ],
        "Jonathan Phillips": [
            "review 1: \"20W with Jonathan Phillips: This class had a lot of dense and technical readings which made them much more boring that some other classes I had taken in the philosophy department. It's definitely geared towards the \"cognitive science\" side and not the \"philosophy\" side. That being said, I disagreed with nearly every major reading presented and I still did well in the class. Professor Phillips is a very fair grader and gives good feedback, and though the class is a good amount of work he knows what he's talking about and is always accessible if you need help, clarification, or just need to talk about your essay topic.\""
        ]
    },
    "COGS050.01": {
        "Adina Roskies": [],
        "Matthijs van der Meer": []
    },
    "COGS080": {
        "Jonathan Phillips": [
            "review 1: \"23F with Jonathan Phillips: Fairly easy class, if you're a cogs major this course is required but workload is not high and I'm fairly confident the default grade is an A. Course content is also extremely interesting, probably one of the most interesting courses taken at Dartmouth since you cover such a wide range of topics from different fields.\"",
            "review 2: \"20F with Jonathan Phillips: This class was super easy and interesting too. We had a different topic/researcher each week. Every Tuesday we would watch presentations from a group in the class on that week's topic, and Thursday the researcher would come for questions (Thursday class usually ended early). We had to do two group presentations, two 4-page papers on topics of our choosing, and a final paper of 12 pages. Jonathan is a super chill and understanding prof. Got an A without doing much work\""
        ],
        "Adina Roskies": [
            "review 1: \"21F with Adina Roskies: Honestly, I came into this class expecting Roskies to be really strict, especially with grading, but I actually had a pretty good time. Weekly readings were manageable, you need to do a presentation for one of the weeks' readings and two response papers. There were also two take-home quizzes but they weren't that difficult at all. It wasn't the class I most looked forward to every day, but it could have been way worse as a COGS major who needed to take the course.\""
        ],
        "Samantha Wray": [
            "review 1: \"22F with Samantha Wray: This class is actually really cool and a pretty chill way to wrap up a COGS major! Basically every week a researcher from a different sub-field of COGS would come in and teach us about their research-- we get assigned readings (which you can skim tbh) and someone presents on them on Monday, on Tuesday x-hour the researcher comes and lectures about their work, and on Wednesday you get to have a Q&A with them not only about material but also their career and academia life, etc. In classic COGS fashion there are 3 short response papers and a big final paper. Professor Wray is really nice, chill, and really supportive of all students.\""
        ],
        "Marie-Christine Nizzi": []
    },
    "COGS001": {
        "Adina Roskies And Jonathan Phillips": [
            "review 1: \"22S with Adina Roskies And Jonathan Phillips: I loved this class and think everyone should take it. There are a lot of different topics and some are more interesting than others, but overall it’s a very interesting class. It’s not exactly a layup but not a difficult class either. There was one very very annoying student in my class who almost ruined by experience, but everything besides him was great about this class. So long as you do not get an annoying try hard in your class you will love it\"",
            "review 2: \"22S with Adina Roskies And Jonathan Phillips: I have very mixed feelings about this course. I took this course wanting to be a COGS major, and I still do. It covers a lot of interesting topics about the mind, perception, cognition, AI, morality and free will, etc. The profs are nice people, but I have to say that they should improve their teaching skills or change their teaching styles. They confused me more than they enlightened me most of the time. Jonathan speaks quite fast and Adina uses weird long complex sentences that are totally unnecessary, and they just did a bad job at explaining things. The readings are long, dense, and incredibly hard to process, so I gave up on the readings. I found the exams quite hard: the median was a B- for the mid-term. General comment: interesting contents but they made the experience terrible.\"",
            "review 3: \"22S with Adina Roskies And Jonathan Phillips: DO NOT TAKE IT IF YOU ARE NOT PLANNING ON A COGS MAJOR! It's not worth the time and effort if you just thought you would be interested in cog sci. Adina is the worst--both grading and lecturing. Jonathan is better but he always talks too fast. Two papers and two midterms (all closed-book, in-person) the whole term, and the median was always a B- to B. I was hoping to be cogs major, and I did put the most effort into this class this term, but the overall experience just sort of destroyed my interest. Barely survived\"",
            "review 4: \"21S with Adina Roskies And Jonathan Phillips: I was thinking of doing a COGS major going into this class... NEVER AGAIN. The lectures were often very dry (I will say Jonathan's lectures were much better than Adina's) and we jumped from topic to topic really quickly without getting into much of the science part of cognitive science. I hated how it was so theoretical (it could be this or this... no one knows). Adina graded all three of my papers and I the comments were so unhelpful, basically said \"good job, but that's all wrong.\" The midterm and final were impossibly difficult and time consuming (some students spent upwards of 12 hours). I barely got the median grade but there's no way I could have done better because Adina and Jonathan never put in the time to tell us what they were looking for. The readings are useless for the class but some are interesting if you have some extra time. This class wrecked my confidence and just left me more confused than I started.\"",
            "review 5: \"21S with Adina Roskies And Jonathan Phillips: Fascinating class! I had never taken a social science class before this and I'm not planning on majoring in it, so this was a nice broad intro to a lot of different topics and fields of study. There were a lot of readings at times, but most of them were pretty interesting, and they were mostly used as examples of the concepts being covered (I ended up skimming many of them and being ok). The lectures were very fast at times, but very interesting, and it was cool to hear both professors' perspectives on topics being debated in the field. There's one lecture on each topic, which is good as an overview and points you towards other classes to take if you want to go more in-depth. Sometimes it felt more like philosophy than science, like for the papers - make sure you know how to write a good argumentative essay. Grades were based on the 3 papers (relating to a topic that interested you, and you would present topics in small groups beforehand for feedback), a midterm and final (these were open note since we were online, but they made the questions more confusing to make up for it... the curve saved us all), and attendance/participation. The TA, Catherine Holland, was so nice and gave helpful feedback on paper topics. Overall, I learned a lot and really enjoyed this class, would definitely recommend!\"",
            "review 6: \"21S with Adina Roskies And Jonathan Phillips: Trash class. Lectures were really dense, and moved so quickly that there was no depth whatsoever. Also will say Jonathan's lectures were better than Adina's, although the material in both were simply not great. This field is just emerging - at least, that's what they said - so many concepts were up for debate. Yet it seemed that when Adina graded my papers, everything I said was wrong. Quizzes/exams were so hard (average was incredibly low, like in the 60s) and revolved around trash multiple choice questions with vague answers, where it seemed like multiple answers could be correct. Yet (in this just emerging field where there isn't always a \"correct\" theory), there was no option for appealing/explaining your answer. Multiple choice was trash, just want to say again. The exams were also designed to be incredibly HARD, and quizzed us on the most minute of details. Like others have said, the readings are useless, and are really long - you have to work really hard to skim and try to distill ideas if you don't want to sink all your time into these readings. This class has steered me away from a major in cognitive science. There's too much breadth, and not nearly enough depth in lecture, and so its hard to go in depth on the essays when you really don't know what's going on. It's really cool that this field is interdisciplinary, its really not cool that we spend one or two lectures on each discipline and move on. AI was one lecture, perception was another, etc. If you found something interesting, well too bad, we're already moving on. Trash, cannot emphasize enough.\""
        ],
        "Jonathan Phillips": [
            "review 1: \"23S with Jonathan Phillips And Dave Kraemer: Solid class. If you study and do the readings you can do well. Paper assignments were not as hard as your standard essay, as long as you showed some thought they marked relatively reasonably.\"",
            "review 2: \"23S with Jonathan Phillips And Dave Kraemer: I don't get why some people didn't like this class. Personally, I thought it was way better than PSYC 001 and 006. This has got to be one of the most fascinating courses I've taken here. The grading is pretty straightforward too – just two midterms, two papers, and your participation is taken into account. But honestly, it's extremely doable. (Median around B+/A- for papers, etc).\"",
            "review 3: \"23S with Jonathan Phillips And Dave Kraemer: Loved the class - super interesting and covered a really broad range of topics. If you're looking to go in depth in certain subjects, this course probably isn't for you as it gives a broad overview of cognitive science in general. The workload was minimal - most of your grade consisted of two essays, a midterm, and a final exam, with the two exams being with less than the essays. Def recommend even if you're just wondering about cognitive science. Also, Kraemer and Phillips are the best!\"",
            "review 4: \"23S with Jonathan Phillips And Dave Kraemer: I LOVED THIS CLASS SO MUCH. Made me want to major in COGS and my favorite class I have taken at Dartmouth so far. Honestly not that much work just listen to the lectures and take good notes. The essays are graded semi harshly so definitely go to office hours.\"",
            "review 5: \"23F with Jonathan Phillips And Samantha Wray: I loved this class. There are weekly quizzes which i actually appreciated because it made sure you understood the content which can be confusing. All of the quizzes were group so that can be good or bad depending on if you leech onto people or if you are the prepared one. The midterm and final were hard but you are able to study the content easily. There are reading for every class but I didn't do them unless they looked interesting. They also lowkey didnt really come up that much on the midterm and final only a little in class. The papers are graded hard so watch out. Overall not easy but if you put in effort you are fine.\"",
            "review 6: \"22S with Adina Roskies And Jonathan Phillips: I loved this class and think everyone should take it. There are a lot of different topics and some are more interesting than others, but overall it’s a very interesting class. It’s not exactly a layup but not a difficult class either. There was one very very annoying student in my class who almost ruined by experience, but everything besides him was great about this class. So long as you do not get an annoying try hard in your class you will love it\"",
            "review 7: \"22S with Adina Roskies And Jonathan Phillips: I have very mixed feelings about this course. I took this course wanting to be a COGS major, and I still do. It covers a lot of interesting topics about the mind, perception, cognition, AI, morality and free will, etc. The profs are nice people, but I have to say that they should improve their teaching skills or change their teaching styles. They confused me more than they enlightened me most of the time. Jonathan speaks quite fast and Adina uses weird long complex sentences that are totally unnecessary, and they just did a bad job at explaining things. The readings are long, dense, and incredibly hard to process, so I gave up on the readings. I found the exams quite hard: the median was a B- for the mid-term. General comment: interesting contents but they made the experience terrible.\"",
            "review 8: \"22S with Adina Roskies And Jonathan Phillips: DO NOT TAKE IT IF YOU ARE NOT PLANNING ON A COGS MAJOR! It's not worth the time and effort if you just thought you would be interested in cog sci. Adina is the worst--both grading and lecturing. Jonathan is better but he always talks too fast. Two papers and two midterms (all closed-book, in-person) the whole term, and the median was always a B- to B. I was hoping to be cogs major, and I did put the most effort into this class this term, but the overall experience just sort of destroyed my interest. Barely survived\"",
            "review 9: \"21S with Adina Roskies And Jonathan Phillips: Trash class. Lectures were really dense, and moved so quickly that there was no depth whatsoever. Also will say Jonathan's lectures were better than Adina's, although the material in both were simply not great. This field is just emerging - at least, that's what they said - so many concepts were up for debate. Yet it seemed that when Adina graded my papers, everything I said was wrong. Quizzes/exams were so hard (average was incredibly low, like in the 60s) and revolved around trash multiple choice questions with vague answers, where it seemed like multiple answers could be correct. Yet (in this just emerging field where there isn't always a \"correct\" theory), there was no option for appealing/explaining your answer. Multiple choice was trash, just want to say again. The exams were also designed to be incredibly HARD, and quizzed us on the most minute of details. Like others have said, the readings are useless, and are really long - you have to work really hard to skim and try to distill ideas if you don't want to sink all your time into these readings. This class has steered me away from a major in cognitive science. There's too much breadth, and not nearly enough depth in lecture, and so its hard to go in depth on the essays when you really don't know what's going on. It's really cool that this field is interdisciplinary, its really not cool that we spend one or two lectures on each discipline and move on. AI was one lecture, perception was another, etc. If you found something interesting, well too bad, we're already moving on. Trash, cannot emphasize enough.\"",
            "review 10: \"21S with Adina Roskies And Jonathan Phillips: I was thinking of doing a COGS major going into this class... NEVER AGAIN. The lectures were often very dry (I will say Jonathan's lectures were much better than Adina's) and we jumped from topic to topic really quickly without getting into much of the science part of cognitive science. I hated how it was so theoretical (it could be this or this... no one knows). Adina graded all three of my papers and I the comments were so unhelpful, basically said \"good job, but that's all wrong.\" The midterm and final were impossibly difficult and time consuming (some students spent upwards of 12 hours). I barely got the median grade but there's no way I could have done better because Adina and Jonathan never put in the time to tell us what they were looking for. The readings are useless for the class but some are interesting if you have some extra time. This class wrecked my confidence and just left me more confused than I started.\"",
            "review 11: \"21S with Adina Roskies And Jonathan Phillips: Fascinating class! I had never taken a social science class before this and I'm not planning on majoring in it, so this was a nice broad intro to a lot of different topics and fields of study. There were a lot of readings at times, but most of them were pretty interesting, and they were mostly used as examples of the concepts being covered (I ended up skimming many of them and being ok). The lectures were very fast at times, but very interesting, and it was cool to hear both professors' perspectives on topics being debated in the field. There's one lecture on each topic, which is good as an overview and points you towards other classes to take if you want to go more in-depth. Sometimes it felt more like philosophy than science, like for the papers - make sure you know how to write a good argumentative essay. Grades were based on the 3 papers (relating to a topic that interested you, and you would present topics in small groups beforehand for feedback), a midterm and final (these were open note since we were online, but they made the questions more confusing to make up for it... the curve saved us all), and attendance/participation. The TA, Catherine Holland, was so nice and gave helpful feedback on paper topics. Overall, I learned a lot and really enjoyed this class, would definitely recommend!\"",
            "review 12: \"20S with Jonathan Phillips: This class was amazing. Super fun. It's basically a quick intro to everything cognitive science: from the basis of cooperation to AI to free will to consciousness. You spend 1 lecture per topic. For the intellectually curious who tend to get bored on focusing on very specific things: this is the class for you. Great for everyone, even if you're not a cogs major. Introduces you to tons of things and what different fields look like right now (linguistics, CS, neuro, etc). What the history of the field was, what they were concerned with and what they're concerned with now. It also introduces you to tons of really cool experiments that have been done that you can cite throughout your Dartmouth career and irl. Great class to take if you want to figure out what you want to do. AWESOME. I'd heard when Prof. Roskies taught this class, people hated it. Prof. Phillips is GREAT at explaining things. He's very young, energetic and willing to help. He also is very up-to-date with new studies and AI and what's going on in the world. Take this class with him if you can. One of the best classes I've taken at Dartmouth so far. Take it, take it, take it. You will not regret it. Barely any work, tbh. Just readings before class (they're usually not that long and always SUPER interesting and easy to read), class discussion (online it was just a post about the lecture/readings and 2 comments on your peers' posts) and 3 presentations (about each of your papers, super chill, you just talk about what you're thinking of doing and your peers and prof/TA gives u feedback) and a week after the presentation you hand in that paper (so, also 3 papers total). Very very very manageable.\"",
            "review 13: \"20S with Jonathan Phillips: John Philips and Adam Bear are the homies. I could tell this class was supposed to be more memorization heavy, but they did a REALLY good job of using SLACK and vids and modifying the readings to cool easy to digest articles that drive home the information. They’re pretty accommodating given the pandemic and other stuff going on, so if you reach out it’s not bad. The three essays were nerveracking if you take it seriously but as I realized he was grabbing on effort and interest it became way easier to just rite about the topics that interest you. Although there IS A LOT of topics, some that bore me, others didn’t, and the overlap with Psych 1, ENGS, and Socy were weirdly apparent\"",
            "review 14: \"20S with Jonathan Phillips: I would highly highly recommend this class!! In the online format we were assessed based on 3 ~1000 word papers on any topic of our choosing. Commentary wasn't offered, but it wasn't hard to write a passing paper. Catherine Holland (the TA) was extremely helpful outside of class and a joy to work with! And above all, the class introduced many topics that were super interesting & helped me hone in on a focus for my major.\"",
            "review 15: \"20S with Jonathan Phillips: This is not an easy course, but it's so worth it. The course ranges over a lot of topics from several different disciplines, from linguistics to psychology to neuroscience to philosophy to computer science. If you're thinking of being a cogsci major, it's likely that one of these sub-topics will really strike something in you and help you discover a new passion. (And if you don't like one of the topics, it'll be over soon!) In the remote term we were assessed through three papers, as well as daily discussion posts graded for completeness. Unfortunately Prof. Phillips didn't give much commentary on the papers, but you could schedule a one-on-one meeting with him to discuss your work. He was really accessible for office hours throughout the term. He's a pretty great lecture and an all-around nice guy. Such an interesting class and a good use of my time.\"",
            "review 16: \"20S with Jonathan Phillips: I totally agree with the other reviewers. This class covered a bunch of different topics -- from how we learn languages to AI to free will. Both Jonathan and Adam, the other lecturer were amazing and lectures were always really interesting. Would highly, highly recommend to everyone! Also because this class covers such a wide range of topics -- linguistics, philosophy, neuroscience, computer science -- it's really cool to see how everyone responds to the different topics based on their interests.\"",
            "review 17: \"20S with Jonathan Phillips: This was probably my favorite class of this P/F term, if not my entire freshman year. The other reviewer did a really good job of summarizing this class. The topics were all super interesting (although there is some overlap with PSYC 1 and PSYC 6) and the readings were not necessary to do well in the class by any means. I only did the readings that seemed interesting to me or didn't seem to take a long time to finish. The three papers were supposed to be about 1000 words long but we could pretty much write about whatever we wanted. We also had three presentations about our paper's topic to get feedback from others about how to improve our papers before we turned them in which I found helpful. I would 100% recommend this class with prof Jonathan to anyone, regardless of their major.\""
        ],
        "Jonathan Phillips And Dave Kraemer": [
            "review 1: \"23S with Jonathan Phillips And Dave Kraemer: I LOVED THIS CLASS SO MUCH. Made me want to major in COGS and my favorite class I have taken at Dartmouth so far. Honestly not that much work just listen to the lectures and take good notes. The essays are graded semi harshly so definitely go to office hours.\"",
            "review 2: \"23S with Jonathan Phillips And Dave Kraemer: Loved the class - super interesting and covered a really broad range of topics. If you're looking to go in depth in certain subjects, this course probably isn't for you as it gives a broad overview of cognitive science in general. The workload was minimal - most of your grade consisted of two essays, a midterm, and a final exam, with the two exams being with less than the essays. Def recommend even if you're just wondering about cognitive science. Also, Kraemer and Phillips are the best!\"",
            "review 3: \"23S with Jonathan Phillips And Dave Kraemer: I don't get why some people didn't like this class. Personally, I thought it was way better than PSYC 001 and 006. This has got to be one of the most fascinating courses I've taken here. The grading is pretty straightforward too – just two midterms, two papers, and your participation is taken into account. But honestly, it's extremely doable. (Median around B+/A- for papers, etc).\"",
            "review 4: \"23S with Jonathan Phillips And Dave Kraemer: Solid class. If you study and do the readings you can do well. Paper assignments were not as hard as your standard essay, as long as you showed some thought they marked relatively reasonably.\""
        ],
        "Adina Roskies": [
            "review 1: \"22S with Adina Roskies And Jonathan Phillips: DO NOT TAKE IT IF YOU ARE NOT PLANNING ON A COGS MAJOR! It's not worth the time and effort if you just thought you would be interested in cog sci. Adina is the worst--both grading and lecturing. Jonathan is better but he always talks too fast. Two papers and two midterms (all closed-book, in-person) the whole term, and the median was always a B- to B. I was hoping to be cogs major, and I did put the most effort into this class this term, but the overall experience just sort of destroyed my interest. Barely survived\"",
            "review 2: \"22S with Adina Roskies And Jonathan Phillips: I have very mixed feelings about this course. I took this course wanting to be a COGS major, and I still do. It covers a lot of interesting topics about the mind, perception, cognition, AI, morality and free will, etc. The profs are nice people, but I have to say that they should improve their teaching skills or change their teaching styles. They confused me more than they enlightened me most of the time. Jonathan speaks quite fast and Adina uses weird long complex sentences that are totally unnecessary, and they just did a bad job at explaining things. The readings are long, dense, and incredibly hard to process, so I gave up on the readings. I found the exams quite hard: the median was a B- for the mid-term. General comment: interesting contents but they made the experience terrible.\"",
            "review 3: \"22S with Adina Roskies And Jonathan Phillips: I loved this class and think everyone should take it. There are a lot of different topics and some are more interesting than others, but overall it’s a very interesting class. It’s not exactly a layup but not a difficult class either. There was one very very annoying student in my class who almost ruined by experience, but everything besides him was great about this class. So long as you do not get an annoying try hard in your class you will love it\"",
            "review 4: \"21S with Adina Roskies And Jonathan Phillips: Trash class. Lectures were really dense, and moved so quickly that there was no depth whatsoever. Also will say Jonathan's lectures were better than Adina's, although the material in both were simply not great. This field is just emerging - at least, that's what they said - so many concepts were up for debate. Yet it seemed that when Adina graded my papers, everything I said was wrong. Quizzes/exams were so hard (average was incredibly low, like in the 60s) and revolved around trash multiple choice questions with vague answers, where it seemed like multiple answers could be correct. Yet (in this just emerging field where there isn't always a \"correct\" theory), there was no option for appealing/explaining your answer. Multiple choice was trash, just want to say again. The exams were also designed to be incredibly HARD, and quizzed us on the most minute of details. Like others have said, the readings are useless, and are really long - you have to work really hard to skim and try to distill ideas if you don't want to sink all your time into these readings. This class has steered me away from a major in cognitive science. There's too much breadth, and not nearly enough depth in lecture, and so its hard to go in depth on the essays when you really don't know what's going on. It's really cool that this field is interdisciplinary, its really not cool that we spend one or two lectures on each discipline and move on. AI was one lecture, perception was another, etc. If you found something interesting, well too bad, we're already moving on. Trash, cannot emphasize enough.\"",
            "review 5: \"21S with Adina Roskies And Jonathan Phillips: I was thinking of doing a COGS major going into this class... NEVER AGAIN. The lectures were often very dry (I will say Jonathan's lectures were much better than Adina's) and we jumped from topic to topic really quickly without getting into much of the science part of cognitive science. I hated how it was so theoretical (it could be this or this... no one knows). Adina graded all three of my papers and I the comments were so unhelpful, basically said \"good job, but that's all wrong.\" The midterm and final were impossibly difficult and time consuming (some students spent upwards of 12 hours). I barely got the median grade but there's no way I could have done better because Adina and Jonathan never put in the time to tell us what they were looking for. The readings are useless for the class but some are interesting if you have some extra time. This class wrecked my confidence and just left me more confused than I started.\"",
            "review 6: \"21S with Adina Roskies And Jonathan Phillips: Fascinating class! I had never taken a social science class before this and I'm not planning on majoring in it, so this was a nice broad intro to a lot of different topics and fields of study. There were a lot of readings at times, but most of them were pretty interesting, and they were mostly used as examples of the concepts being covered (I ended up skimming many of them and being ok). The lectures were very fast at times, but very interesting, and it was cool to hear both professors' perspectives on topics being debated in the field. There's one lecture on each topic, which is good as an overview and points you towards other classes to take if you want to go more in-depth. Sometimes it felt more like philosophy than science, like for the papers - make sure you know how to write a good argumentative essay. Grades were based on the 3 papers (relating to a topic that interested you, and you would present topics in small groups beforehand for feedback), a midterm and final (these were open note since we were online, but they made the questions more confusing to make up for it... the curve saved us all), and attendance/participation. The TA, Catherine Holland, was so nice and gave helpful feedback on paper topics. Overall, I learned a lot and really enjoyed this class, would definitely recommend!\"",
            "review 7: \"19S with Adina Roskies: This class is a CRAZY amount of material. Each lecture could be its own class. Its really stressful to study for exams given how much content there is, but the exams tend to not be TOO specific. Roskies is kind of a hardo on response papers. Advice: really focus on a philosophical, well-structured layout and be concise. She is a philosopher and carries that heavily into this course. This course is definitely not a layup, but its not hard to get in the B range. I did find Roskies to be a super nice prof and she brought her really cute giant dog to class everyday. Professor Phillips co-taught this class, and his lectures were definitely easier to follow. I think he would probably be an easier grader, though he never graded one of my papers .\"",
            "review 8: \"18S with Adina Roskies: Despite her glowing credentials, it is impossible to describe Professor Roskies as anything but unhelpful, incompetent at teaching, and frustrating. She constantly assigns 30-60 page readings per class, and in her own words, \"You shouldn't memorize it, but you should know exactly what it is saying\". I attended her office hours to ask her how she structured her tests and which areas she would focus most on, and she replied, “A little bit of true and false, multiple choice, fill in the blank, and short answer. You need to be prepared for everything”. Possibly the most unhelpful reply I’ve received throughout my time at Dartmouth. Professor Roskies makes no attempt to help her students succeed. She does not provide a textbook, clear notes, practice tests, or study guides. She grades essays harshly, but she does not provide clear commentary on how to fix it. Asking her to explain her comments simply causes more confusion and does not allow room for improvement. Her tests can range from anything from any reading of her choice, her vague powerpoint slides, or anything she happens to mention in class. She is available for office hours, but those are nothing short of useless, as she is incapable of explaining any of her lectures coherently. In addition, Professor Roskies constantly interrupts and argues with her guest/co-professor, further confusing her students and preventing them from understanding the point of the lecture. I was interested in majoring in Cognitive Science prior to taking this course, and I left the term having lost all interest. Unless you truly enjoy the field of Cognitive Science and plan on becoming a major, do not take this course. Professor Roskies is an example of an extremely well-qualified researcher who has no business teaching students. Cog Sci I is a waste of the 36 courses you will take at Dartmouth.\""
        ],
        "Jonathan Phillips And Samantha Wray": [
            "review 1: \"23F with Jonathan Phillips And Samantha Wray: I loved this class. There are weekly quizzes which i actually appreciated because it made sure you understood the content which can be confusing. All of the quizzes were group so that can be good or bad depending on if you leech onto people or if you are the prepared one. The midterm and final were hard but you are able to study the content easily. There are reading for every class but I didn't do them unless they looked interesting. They also lowkey didnt really come up that much on the midterm and final only a little in class. The papers are graded hard so watch out. Overall not easy but if you put in effort you are fine.\""
        ],
        "Andrew Connolly": [],
        "Shaun Nichols": []
    },
    "COGS021": {
        "Richard Granger": []
    },
    "COGS087": {
        "Adina Roskies": [],
        "David Kraemer": [],
        "Lindsay Whaley": []
    },
    "COGS086": {
        "Adina Roskies": [],
        "Lindsay Whaley": []
    },
    "COGS085": {
        "Adina Roskies": [],
        "David Kraemer": [],
        "Lindsay Whaley": []
    },
    "COGS044": {
        "Devin Balkcom": [
            "review 1: \"07W with Devin Balkcom: I enjoyed this class. There were no exams, only the weekly problem sets / projects. The material was actually a bit more boring than I had hoped for, but Devin cares about his students and tried his best to make it interesting.\"",
            "review 2: \"05W with Devin Balkcom: It's really interesting and a good survey course on AI. The prof was really good too.\""
        ],
        "Zack J.": [
            "review 1: \"02W with Zack J.: I found the course material very interesting, and Prof. Butler was great at explaining it in a clear and engaging manner. One of the best parts of the course was the weekly programming assignment. The assignments ranged from writing game-playing code to planning motion for a (virtual) robot and animating it along the path. They took some time but were very helpful in learning the material and very enjoyable for a CS major who likes programming!\"",
            "review 2: \"02W with Zack J.: This was one of the most interesting classes I've encountered in the CS department. Professor Butler, is by far the best professor I've had at Dartmouth. Highlights of the course: -Prof. Butler is eager and enthusiastic about the subject matter which makes it interesting and reachable for the students. -Prof. Butler is very available for questioning both in and out of class and has a genuine interest in helping the students learn the material. -The class uses so much previously unused knowledge that is required for the major - which I found to be helpful in cementing some fundamentals. -The assignments are rather fun and interesting and definitely aren't too hard - but they do help you learn the material so you feel very prepared going into the exams. I loved Computer Science 44. Professor Butler, is actually not a faculty member of the CompSci department - he is a post-doc researcher in the robotics lab... But, he should be offered a tenured faculty position based on his performance as a professor in CS44.\""
        ],
        "Stephen P.": [
            "review 1: \"04W with Stephen P.: Artificial Intelligence in and of itself is an interesting discipline at the forefront of science. A lot of the class projects were exceedingly interesting as well. But unfortunately, the professor's lectures were so unorganized and dull that I quickly lost interest in the class. The professor's handwriting was sloppy and he failed to explicate important concepts, making it difficult for students to understand the material. Although Prof. Linder was a fun person and a nice friend, he was not the most impressive professor I've had in the CS department. So there, the class would have been a lot more interesting had I had another professor.\""
        ],
        "Alberto Quattrini Li": []
    },
    "COGS026": {
        "James Moor": [],
        "William Ratoff": []
    },
    "COGS011.01": {
        "Adina Roskies": []
    },
    "COGS002": {
        "William Kelley": [
            "review 1: \"09S with William Kelley: Unless you have an unhealthy obsession with multiple choice questions try to avoid this class. Kelley tries to liven up the class by throwing in a joke every 5 minutes but if you've taken Psych1 with him you've already heard each one and thus won't be so impressed. His lectures aren't effective and unless you read the book, his slides are of little help since they're all just extensions to his jokes. It's really hard to tell what's important to Kelley because of his teaching style and he'll surprise you on the exams when you realize that some concepts he barely touched on are the focus of the test. I took his class even after reading his negative reviews because I was interested in the subject; not worth it.\"",
            "review 2: \"09S with William Kelley: I only took this because I had to take either this, psych 21 or psych 26 for my major and I heard this was the easiest of the three. Tests are multiple choice but the questions can be tricky. Lectures can be pretty dull if you're not into the subject matter, but you really should go anyways because of his \"stuff points\" policy. Basically what it means is that if you go to all of the classes (or just get lucky and don't miss a day where he gives a \"stuff point\") that you will boost your final grade a bit.\"",
            "review 3: \"08S with William Kelley: Objectively speaking, Professor Kelley was one of the worst professors I've had at Dartmouth, but not in a way that you would expect. First, he is a VERY engaging and funny lecturer, and class goes by very quickly. He tends to explain things rather well in class. Unfortunately, this is pretty much where the good points end. Some of his videos are funny but completely pointless, and some of this time would be better spent going over concepts before the test. The His lectures are terribly imbalanced, oversimplifying certain concepts while overemphasizing others. When the exams come around, certain \"easy\" concepts that seemed almost stupidly obvious become difficult due to the confusing way he asks questions. On the final, I truly walked out of the room not having ANY idea of how well I did, even though I studied pretty thoroughly. The TA was terrible, she Wikipedia'd the questions I had when I went into office hours, meaning that she didn't really know the material. Professor Kelley also was not present on two separate occasions when I tried to go to office hours. For some, this class is very easy, but for others, even some that succeed in other Psych classes, it is a struggle. This is very indicative of the randomness and almost pointlessness of the class. It was a necessary evil for me as a major, but if you can avoid taking it, you should. If you are looking for an easy class workwise (there is no outside work) but don't care about the grade, this class could be enjoyable.\"",
            "review 4: \"08S with William Kelley: This class was all right, but I wouldn't recommend taking it if you've already taken or plan to take Perception - a lot of the material was the same. Prof. Kelley does a lot to make his lectures interesting, like making videos and playing Hannah Montana Wii.\"",
            "review 5: \"08S with William Kelley: This is an okay class. I found the material extremely interesting, and the lectures were entertaining. The tests, however, were VERY poorly written. Professor Kelley's idea of a \"tough question\" is one where you can't understand what he's trying to ask. He gives you a review sheet before each test, which is mostly helpful, but I think the tests were a lot harder than the review sheets would have you believe. Also, in the review session for the final it seemed like Professor Kelley didn't know any of the material. I feel like I'm saying this pretty objectively; I did really well in the class and still felt like the tests were pretty unfair and that the class left something to be desired. In summary, the positives of the class are the interesting material and the light workload. The negatives are that Professor Kelley can be really irritating (not to mention lazy) and I don't think you have very much control over your grade.\"",
            "review 6: \"08S with William Kelley: You can sleep through the class, look at the slides, never read the book, and ace the class. His lectures are extremely repetitive and he spends about 30 minutes of a class reviewing the previous class. Everything he taught is common knowledge and each class I felt like I was throwing away $300. He bored me to death, tried too hard to be funny, but the class is very very very easy. 2 midterms, 1 final, all multiple choice. It's a breeze.\"",
            "review 7: \"08S with William Kelley: lectures are almost always interesting and entertaining, and are worth going to, especially because you often get part of your grade from being in class (and a few extra credit points). multiple choice tests.\"",
            "review 8: \"08S with William Kelley: Kelley gives great lectures. You get stuff points for going to class, but I found that I really wanted to go because I enjoyed class. He presents the material in interesting ways and really knows his stuff. The tests really aren't too bad. He gives you a pretty in-depth review sheet beforehand and you need to know most of the stuff on that and be able to take it one step further.\"",
            "review 9: \"08S with William Kelley: Kelley does his best to make this huge lecture class be more fun -- with incentives like \"stuff points\" and ridiculous youtube tangents to make people want to come to class. He's entertaining and makes a lot of jokes, makes the classes mostly enjoyable... but if you're here for the content, you might get frustrated. The course moves very slowly and I felt like I didn't learn that much. Unfortunately, it's required for the cog sci major despite its overlap with psyc 1 and many other psyc classes. But nevertheless, it's a good, easy introduction to a lot of interesting issues if you're interested in brain science or anything to do with the mind. grading is just based on 3 exams and some extra incentive points for attending class. readings are pretty optional.\"",
            "review 10: \"07S with William Kelley: Everyone said that this course was \"the greatest in the department\" and \"Prof. Kelley is so awesome!\" but that is all a lie. This is actually one of the worst classes I've taken at Dartmouth. He frequently spends entire lectures doing dumb things to fill time because he has not found information to teach us and class gets our early frequently because of this. Additionally he test questions are meant to be very tricky, and many people had problems with this. He is also a jerk, both by mass email to the course, and to individual students in office hours (so I've heard).\"",
            "review 11: \"07S with William Kelley: This class is a lot of fun. The tests are multiple choice, so they aren't too bad. And Professor Kelley's lectures are hilarious. You will laugh so much and learn the most random things. Its hard to feel bored or fall asleep. Overall, if you're looking for a third class or a way to fulfill the SOC distrib, this is a good choice!\"",
            "review 12: \"07S with William Kelley: This class is really freakin' cool, and Professor Kelley is really funny in class which makes the time go by quickly.\"",
            "review 13: \"07S with William Kelley: I'd never taken a psych class prior to this one. I didn't read the book. I did sudoku and crossword puzzles in class all the time and stopped paying attention after the second mid-term. It was my 4th class and I NRO-ed it but it was my easiest class. The material can be interesting and isn't too hard, and neither are the multiple choice tests BUT the grading is what gets you. 92.5% to get an A this term. If you take this class, I suggest you go to all the classes. The difference between an A and an A- is 2.5% and 10% of your grade comes from stuff points, which are pretty much like random attendance checks since you get full credit for completing the task (i.e. writing something down on a piece of paper). He also provides a review sheet telling you what to study for the exams. It makes life easier.\"",
            "review 14: \"07S with William Kelley: Prof. Kelley is really something else. He incorporates humor and off-the-wall examples to explain cognitive concepts. If nothing else, going to class is worth a good laugh or two and you generally learn some important cognitive concepts on the side. Seriously though, while his methods may be slightly unorthodox, I definitely appreciated his light-hearted approach to the material. Most questions on the 3 multiple-choice exams come from his lectures/slides, and the questions tend to be fair while some are a bit tricky. Overall, this class is worth taking, whether Psych. major or not.\"",
            "review 15: \"07S with William Kelley: Professor Kelley is extremly humorous and will occasioanlly insert humor into his lectures and slides. Cognition reminded me too much of Psych 1, where we would have to read and memorize and take the exams. Again, they are all scantron, so if you don't do well with those, I'd study extra hard.\"",
            "review 16: \"07S with William Kelley: the course was very interesting and i felt like i learned a lot since it was my first course however, professor kelley is very, very lazy. he did not respond to any of my blitzes and refused to change his lectures and exams from last year even though he changed the cognition book that he assigned readings in\"",
            "review 17: \"07S with William Kelley: Good class, fun prof. Not much content, but that's to be expected from a lecture class.\"",
            "review 18: \"07S with William Kelley: kelley is one of the best professors in the psych department, maybe even at dartmouth. he really knows what he is talking about, is absolutely hilarious, and keeps a class of 100+ students engaged for the hour in its entirety. the exams are TOUGH and you zoom through the material in class, but everything you learn is really interesting. one of those classes where once youre done with it, you see examples of what you learned in real life and think back to the lecture. really great class, but if youre not great at exam-taking, definitely NRO it.\"",
            "review 19: \"07S with William Kelley: In the first lecture for this course I was caught by Kelley's presence and thought that he would make the class engaging. However, although Kelley was funny, it got old fast. His lectures, while entertaining, had a lot of flash but didn't actually impart very much information. I often found myself thinking that class was a complete waste of time. You have to go to class however because of \"stuff\" points which are basically random points that are given out throughout the term to students who are present in class. Kelley was generally a cool guy but the subject itself was horribly boring. A positive for the course is that it really is not a lot of work at all. as long as you pay a minimal amount of attention, do the review sheets and read through the text book (he doesn't test much from the book), you should do fine. If you are looking for a light 3rd course and don't mind being bored, this is a good choice.\"",
            "review 20: \"07S with William Kelley: my only qualm about this class is that professor kelley doesn't seem to respect his students. at the end of the term he has this \"grade grubbing\" policy where you must post your grade publicly and try to prove why you deserve a better grade instead of actually meeting with students to discuss it. I understand that he did this so that hoards of students wouldn't dispute their grades, but honestly, what kind of a professor does that? otherwise, the class is fun.\"",
            "review 21: \"07S with William Kelley: His lectures reflected only a small portion of the book, which is fine since the tests were basically based on lectures, but I felt like i didn't learn anything. He uses a lot of the same lectures he used in Psych 1 and spends 20 minutes going over the same point. Useless class...\"",
            "review 22: \"07S with William Kelley: Kelley is probably the most useless professor I've had at this school He skims important and difficult material and instead spends entire lectures on stuff my 10 year old sister could easily pick up The worst part is that on tests, he tests you on stuff that you have never seen before, even if you've attended a lot of his lectures- many of the questions are poorly worded and the fact that they are multiple choice makes it worse studying you're ass off may not be enough in this class- by the way, don't cry at the end if you have like a 79.5 or 89.5- he may not round up but the school will\"",
            "review 23: \"07S with William Kelley: The textbook is completely worthless and the tests are very difficult. Kelley's lectures are sometimes funny though...\"",
            "review 24: \"07S with William Kelley: Kelley's lectures were very entertaining. His tests are brutally hard multiple choice. He's also a pretty insensitive professor, and takes a stance to 'not reply to blitzes from students' which is very unhelpful when you want to know what you should do to prepare for expected missed classes.\"",
            "review 25: \"06S with William Kelley: Easy. Funny lectures.\"",
            "review 26: \"06S with William Kelley: This is a pretty interesting class. Large lecture style on pretty relevant stuff. I'd recommend it, only thing was I thought it was going to be an easy pushover class... but the multiple exams make it more difficult to get the A... its certainly an easy average class though. Worth taking.\"",
            "review 27: \"06S with William Kelley: Really interesting material. Prof makes it fun. I'd definitely recommend it.\"",
            "review 28: \"06S with William Kelley: This is a strange class. Whether you like it or not depends on if you enjoy multiple choice tests and don't mind crazy lectures that are often disorganized and feature random stuff that has nothing to do with the topic at hand (yet are highly entertaining). With that in mind, here's some more detailed info. The Good: 1) The lectures are never dull. Kelley always has video clips, random games, or demos ready for your enjoyment. People don't typically fall asleep in this class because the lectures are enjoyable (and because class is at 2). 2) Lots of canceled class. This is great if it's your senior spring (like it was for me). Kelley must have canceled at least 5 classes (although one wasn't his fault because his hypnotist never showed). 3) Easy tests. If you're good at multiple choice this class is not difficult. You just have to take decent notes, actually read the text book, and use the study guide that comes with the book. If you're willing to put the time in to study and are generally good at figuring out what goes on multiple choice tests, then you'll do really well. If you did badly in Psych 1 you'll likely do badly in this also. 4) Interesting material. I know a lot of the reviews say the material is boring, but I didn't think so. I mean it's psychology so most of it is common sense, but there's still some good info to be had. 5) Light work load. The work just consists of reading from a textbook, about a chapter every other class or so. The reading is easy and short (about 20-25 pages per chapter). The Bad: 1) Disorganized lectures. It seemed like sometimes Kelley would just forget to organize his slides the night before or something, because there were quite a few lectures where he'd skip over stuff or not know what was coming next and have to just try to fake it. 2) Crazy demos/movies. Kelley will often show these completely random movies (e.g., \"Psychology Hunter\", \"Leeroy Jenkins\") that take up about 5 minutes of class but have nothing to do with anything. He'll even admit to it afterwards (or else come up with some lame justification, like he did with the Leeroy Jenkins movie). And even the ones that do have a point just go on too long (e.g., \"Star Wars Kid\"). Ok yeah they're funny, and they make the lectures fun, but there's too many of them, they're too random, and they go on too long. It's like he doesn't respect the material to want to teach it to us, so he throws in these movies he makes to show off how funny he is. There's a fine line between using multimedia to really enhance a class (e.g., Jay Hull) and just going overboard with it (e.g., Bill Kelley). Then again, I'll likely never forget functional fixedness because of that Star Wars Kid movie, so maybe there's a method to the insanity. 3) Lots of canceled class. Yes I know I listed this as a positive. Canceled class can be good. But when you're paying $40k a year, you expect to get your money's worth. And frankly, I don't feel like I did with this class. Yeah, it's great to have a day off every now and then. But when you have a class canceled pretty much every week, then something's wrong. There was so much cancellation that Kelley wasn't able to lecture on one of the chapters in the book, even though it still appeared on the final. And there were times when he just rushed through stuff so he could get through everything he needed. That's really not an effective way to teach. So there you have it. Would I recommend taking this class? I'd have to say yes. It's entertaining if nothing else. But don't be surprised if you get frustrated at times when it just seems like Kelley refuses to stay on topic. Sometimes I get the feeling he knows we're not going to remember any of this stuff anyway so he just doesn't care. But I'm probably wrong.\"",
            "review 29: \"06S with William Kelley: Kelley is extremely arrogant and doesn't have the time of day for students outside of what can be described as his \"performances\" during lectures. He is more interested in being funny or cool during class than actually conveying the material. He even made a video of himself attempting to be funny and showed it to the class. With any other teacher this would have been endearing, however, he is so arrogant that it just makes you like him even less. As for the tests, everything is multiple choice. Don't expect to learn anything particularily interesting or worthwhile in this class - it's about average as classes go.\"",
            "review 30: \"06S with William Kelley: The material was interesting and Prof. Kelley is a great lecturer. Unfortunately, since there were about 120 students in the class, the tests were entirely multiple choice and Prof. Kelley wasn't able to get to know any of the students. If you're interested in the material then it's definitley a good class to take, but if not then there are better ways to spend your time. I certainly enjoyed it tho- but definitely take it with friends.\"",
            "review 31: \"06S with William Kelley: I'm sure cognition is actually a very interesting subject, but Prof Kelley was one of the worst I've had at Dartmouth. He made the simple concepts seem incredibly difficult by taking forever to explain them, and skimped on the concepts which were actually difficult. Kelley tried to insert humor into his lectures, but fell flat time and again--his jokes were not funny, and many of the alternative materials he employed (silly homemade videos, etc) had no purpose. Exams were completely non-representative of the material learned. Test questions were taken directly from the study guide (the one that accompanies the book--be SURE to read this and you'll do fine on the exams). Good points of the course: the blackboard discussion board is very helpful for tests.\"",
            "review 32: \"06S with William Kelley: The class material wasn't very interesting, but if a person needs a science course or something from the 21, 26, 28 series for the psych major, then I guess this class isn't such a bad alternative.\"",
            "review 33: \"06S with William Kelley: this prof is really funny. the lectures are entertaining and the course material is interesting. the tests are very straight forward, read the book and your pretty much set (he always throws in a few poorly worded questions that are confusing, but if you know the material you can still easily get an A on the exams)\"",
            "review 34: \"06S with William Kelley: Let the textbook lead you to victory. It's an okay course, but it's work.\"",
            "review 35: \"06S with William Kelley: Painless and interesting\"",
            "review 36: \"06S with William Kelley: This class was okay, but nothing great. All the material is in the textbook and the tests are hard. I did well and studied a lot but Kelley's questions are just tricky and poorly worded. Unfortunately many majors felt they had to take it cause it's supposedly the best of 21, 26, and 28. Just make sure to read the textbook and attend class so you get Stuff Points.\"",
            "review 37: \"06S with William Kelley: The material was typical psych stuff although generally Kelley's part of Psych 1. I found thr stuff pretty interesting. Lectures were never a drag to come to because Kelley is such a funny lecturer, movies, stuff points, etc. Definitely a good class for major or non, plus the tests are fair and pretty easy too.\"",
            "review 38: \"06S with William Kelley: I took this class because I thought it would be interesting...it wasn't. Don't take it unless you have to. Kelley tries, but he isn't as entertaining as some say he is. His lecutres are dull. The book is subpar. Nearly impossible to enjoy. Tests are standard for 20-level Psyc courses--multiple choice and not too hard.\"",
            "review 39: \"06S with William Kelley: this class was great except for the \"stuff\" points. At the beginning of class he makes them seem basically pointless unless u are one point below a letter grade where they could then help you. he also says they will basically be in every class. WRONG! he hardly gave any for the first two thirds of the class, and then the fact that i missed about half of them almost cost me a whole letter grade even though i did great on all three tests. soo they count for more and will effect your grade more then he accounts for. also he tells you your grade at the end of the course and wont round up even if you have an 89.98 to an A-...but then the offical school grades do, so dont worry too much about and fall to grade grubbing as he calls it. but he is an amazing prof and i would deff take this class again!\"",
            "review 40: \"06S with William Kelley: his tests are rediculous and half the questions have no bearing on the course\"",
            "review 41: \"06S with William Kelley: In a nutshell, the material is interesting, the class is pointless. Kelley doesn't seem to enjoy teaching but more making movies of himself to vaguely illustrative concepts in cognition. Yes, they provide a good laugh and that's a great way to approach learning, but I feel I got very little from his home videos. He just comes off as a lazy and distantly engaged professor. Basically you would get a better idea of the information by just reading the textbook, but you have to go to class for 'Stuff' points. I was slightly offended by the fact that he would never return blitzes. Yes, he is probably a professor who gets a lot of blitzes but I wrote asking to discuss my grade, in person, after the final, the term was just ending and I'm sure some time frees up to respond to blitzmail like every member of the Dartmouth campus. He has a formal 'grade grubbing' policy at the end of the term which is fine, but I think it is decent to at least respond. If the class is required or an option for your major, take it and you will laugh plenty of the time. If you can take multiple choice tests you will also do fine on the exams. If you are only taking it to fulfill your SOC distrib, pick a different course.\"",
            "review 42: \"06S with William Kelley: This class was enjoyable to go to. Kelley is a good lecturer and makes class enjoyable. The material itself isn't that interesting, although it has interesting implications. The method of testing is pretty annoying since it's just a multiple choice test with questions pulled directly from the review book...it doesn't really let you feel like you've learned things. The biggest down side to this course is the size. It would be interesting to discuss many of the topics and implications covered, but the class is pure lecture. Also, Kelley is lazy. He doesn't bother to do anything outside of preparing the lecture, and I always felt like he was too busy to deal with students or even talk to them.\"",
            "review 43: \"06S with William Kelley: The prof was not that into class, not the greatest lecturer, but not bad either. It was interesting material at least.\"",
            "review 44: \"05S with William Kelley: Lectures were very funny (Kelley is hilarious) and yet educational Definitely a fun course to take\"",
            "review 45: \"05S with William Kelley: The class was a very difficult class, not just the material but trying to figure out what the prof was talking about during lectures and why the tests seemed so difficult.\"",
            "review 46: \"05S with William Kelley: Professor Kelly gives great lectures on a subject that could potentially be boring. His powerpoint presentations do a great job of explaining difficult concepts, and he obviously puts a lot of effort into them. A special highlight of the class are the famed \"Psychology Hunter\" videos!\"",
            "review 47: \"05S with William Kelley: Kelley's lectures were interesting and entertaining at the same time. Although some of his funny sideshows weren't always related to the class, they kept everyone awake and didn't make the class boring in the least. One gripe I did have about the class was that the tests, especially the two midterms, weren't written that well. They were pretty tough because even if you knew the material well the questions could trip you up because they weren't clear or were plain unfair. But other than that, the class was interesting, wasn't too much reading, and there were bonus points for going to class, so overall it was good.\"",
            "review 48: \"05S with William Kelley: The class is strange, but entertaining, very game showesque. Tests are standard multiple choice\"",
            "review 49: \"05S with William Kelley: When I first signed up for cognition, I worried that the course material might be painfully boring. I can't tell you how wrong I was! Cognition turned out to be one of the most entertaining, enlightening courses I've taken at Dartmouth. Professor Kelley made lectures a joy to attend. He was clear and he used DDR, karaoke, Simon, and home videos to illustrate concepts. We covered pattern recognition, attention, long and short term memory, language, neural networks, problem solving, and decision making. The workload was very manageable. The textbook was short and easy to understand. There were three multiple choice exams based primarily on lectures, but they also included some material from the textbook. We had plenty of time to complete the exams. Take this course! You'll have a great time and learn a lot!\"",
            "review 50: \"05S with William Kelley: Class was really fun with a lot of comedy. Unfortunately tests would include asking questions about details of the jokes. Many people complained that despite knowing the material very well, the tests were still very difficult.\"",
            "review 51: \"05S with William Kelley: Very lively lectures, lots of fun, Prof Kelley was hilarious at times. The material was interesting and easy to understand. As long as you put in the effort to study the material in the textbook and in the lectures, you'll do FINE on the exams! There are 3 exams- 50 multiple choice questions for the first 2 and 100 multiple choice exams for the last one (last one is cumulative). Kelley is funny and easy-going. Students don't usually fall asleep in this class- there's always something lively going on. Great lectures, good power point slides, very fair exams (although he may ask about some detailed material- so be sure to study thoroughly). Highly recommended!! Textbook was also great- clear and simple. If you did well in Psych 1, you'll probably do well in Cognition.\"",
            "review 52: \"05S with William Kelley: Kelley tries to keep things interesting (maybe because he understands that the material itself is completely boring), but in the end, his lectures still don't make the subject matter any more inspirational. I was thinking about majoring in psychology, but after taking this course, I am totally sick of it and don't want to take another course related to it again. Kind of a shame. also, the testing format is totally bogus. it's like psych 1 testing, only worse, because there are only three tests, with the last one being one of the combined tests. also, they're all 50 multiple choice questions, and a lot of the time, the questions don't make much sense. VERY FRUSTRATING COURSE.\"",
            "review 53: \"05S with William Kelley: The class was very interesting, about 75% of the lectures simply repeated material in the book, but professor Kelley always tries to give a humorous spin on the material. you get about 50 pages of reading a week, which is very interesting if your into the more scientific aspect of psyc. The only problem with the course is that the exams hardly test understanding of the material. There are three multiple choice exams, two 50 question mid terms and one 100 question final. The questions on the test are often very ambiguous, and they test your ability to solve multiple choice questions more than it does your understanding of the material.\"",
            "review 54: \"05S with William Kelley: First off, I have a general problem with the Psychology Department's policy of multiple-choice tests, but that's not the main problem here. When, at the end of the course, Prof. Kelley allows for a grade-grubbing \"process,\" he demeans his students. The way you make petitions to alter your final grade is to post in a discussion board forum on Blackboard called \"I am a Grade Grubber.\" There you must post your reasons why you deserve the grade you seek and then three people with grades higher than yours must reply to your post and say that they support you. Then Prof. Kelley notes that he will \"seriously consider\" your petition, but, \"most likely do nothing.\" In addition, he does not round up, ie when the cut off for B- is 80, and you receive a 79.99, he records your grade as a C+ unless you go through this process which will, as he states, \"most likely\" not benefit you in any way. This process of making students post for \"grade grubbing\" demeans students who are otherwise fighting for the generally less than one percentages point that they already deserve in standard grading policies. The whole process, starting with its name, \"grade grubbing,\" is entirely ridiculous. My advice: expect nothing from Prof. Jackass.\"",
            "review 55: \"05S with William Kelley: The class was fun during lectures. But the tests are all 50 multiple choice questions in which at least 6 questions are totally obscure unimportant things that you hve to just guess on.\"",
            "review 56: \"05S with William Kelley: THi sis definitely the best of the 21, 26, 28 series. It's really not that bad, and he's actually an interesting and engaging prof. I'd recommend it. Study your previous tests for the final-he doesn't rewrite th equestions.\"",
            "review 57: \"05S with William Kelley: This course was the best I've taken so far at Dartmouth. The material was interesting and easy to understand. Professor Kelley is the best professor I've had at Dartmouth. His lectures are comprehensive, engaging, and fun. He constantly uses humor and makes the class laugh. Each class was unpredictable - we did karaoke and dance dance revolution. Great class if you are interested in Psych and want to have a great time.\"",
            "review 58: \"05S with William Kelley: the class is a standard 20-level psych course. 2-3 chapters assigned in text a week. ppt lectures. 2 midterms and a final exam, plus attendance points (in the version of \"noodle\" and \"stuff\" points). prof kelley is a really funny and engaging lecturer, although i didn't feel particularly challenged or inspired by the subject or class material. he definitely is a little off the wall at times, but overall a nice guy. i basically took the class because i had to for the major and i heard not-so-great things about psych 21 and 26. so, although it wasn't an outstanding class, it was fun for what it was worth.\"",
            "review 59: \"05S with William Kelley: Very similar to Psych 1 - a large survey course - but I found it a lot more interesting because cognition is fascinating. Kelley is really funny and does things to try to make the class more entertaining then your typical survey, like making a few of his own videos and having a Price is Right style \"noodle points\" to encourage attendence. A good class but a little slow at times - some of the things Kelley does for entertainment just seem pointless and a waste of class time - we spent quite a bit of time watching two students play DDR for instance.\"",
            "review 60: \"05S with William Kelley: by far one of my favorite courses at dartmouth. kelley is awesome and makes the lectures a lot of fun. definately a class worth taking even if you're not a major.\"",
            "review 61: \"05S with William Kelley: This was a good class that didn't require that much work. The tests were muliple choice, so if you don't like those, don't take the class... but they weren't tricky or anything. Kelley is a good prof, who spends a lot of time putting his lectures together. He tries to make all the info applicable to the real world, which is helpful. It's a good class, and not work intensive.\"",
            "review 62: \"05S with William Kelley: This class was remedial. If you took Psych 1 with Kelley, be prepared for the same lectures. I learned nothing new in this class. Except that professor Kelley has a dog and daughter. Cognition seems like an exciting, modern field but this class was way behind the times. All of the studies were from the 60s and 70s. The lectures were disorganized and confusing. Kelley is not approachable and doesn't interact with the class much. I don't recomend this class if you don't need it. WASTE OF TIME!!!\"",
            "review 63: \"05S with William Kelley: Kelley is an awesome professor and his lectures are helarious. His tests, however, are far different. He would hand out review sheets of what would be on the test and then say that nothing else would be on the exam. Then when the exam was handed out, things would be on the exam that weren't even close to the ideas on the review sheet. If you want an entertaining Multiple-choice-based course, go for it. However, the exams are pretty painful.\"",
            "review 64: \"05S with William Kelley: Professor Kelley is a very entertaining guy, and you don't have to worry about being bored in lectures. He comes up with all kinds of novel things to do to keep class entertaining. He is also good at explaining fairly complex psychological concepts. The tests are multiple choice, and he asks about some pretty specific material, so you have to read the book carefully and look over class notes a few times to make sure you're ready. Kelley does have a few ways you can get extra credit in case your exam scores need a little padding, which is nice. The most important thing is to go to class (that's how you can get extra credit - all the opportunities happen in class). If you're not really into psych this class might be more work than you're looking for, but if you want to learn about the brain or have an NRO to burn and want to go to some good lectures, this is a good course to take.\"",
            "review 65: \"04S with William Kelley: kelley's antics were cute for about two weeks and then i wished he would stop playing stupid movies on his computer and start teaching the somewhat complicated material from the readings. he seemed more interested in getting laughs than in teaching anything. the man is pretty funny but he's not a good teacher. good attendence does pay off in this class, incidentally\"",
            "review 66: \"04S with William Kelley: Professor Kelley is entertaining for teaching a large lecture course.\"",
            "review 67: \"04S with William Kelley: Prof. Kelley is incredibly funny, but after a while you wonder why you come to lectures because it's hard to get much out of them since they aren't too well organized. Sometimes the tests can seem kind of arbitrary but if you read and look over lecture slides they shouldn't be too hard.\"",
            "review 68: \"04S with William Kelley: Very little work for the amount stuff that you'll learn. This would be a good third course if you're looking for something that will keep you awake in lectures without over-burdening you with work.\"",
            "review 69: \"04S with William Kelley: the most interesting thing about this whole class was the stuff not about psychology. in an attempt to make it interesting he includes silly games and \"stuff points\" in the class to add a bit of life. the entire subject is basically about stuff you already know (common sense and knowledge) but they give it all names and people, whose names need to know, create tests for it and all that.\"",
            "review 70: \"04S with William Kelley: Prof Kelley was like a gameshow host in his lectures. He brought in the funniest songs and video clips... The lectures were absolutely entertaining. He always knew how to spice up the powerpoints a bit to help us understand the material.. which was great because some concepts weren't too easy to grasp. The textbook was pretty dull. The exams weren't easy... They reminded me of psych 1 exams.. but a bit more confusing and detailed. Not unreasonable though. He'll give you a study guide for the exam, and if you go to class, some \"noodle points\"... Cognition is a fascinating subject, and Prof Kelley is hilarious... You'll learn a lot and you'll have fun too!\"",
            "review 71: \"04S with William Kelley: kelley was entertaining but not a good teacher. while he did do a good job keeping people awake in class, a lot of times his jokes got kind of drawn out and almost stupid. especially as tests were drawing near sometimes i wished he would talk about the material instead of showing clips he found online about some kid imitating star wars etc. i mean sure it might be mildly amusing the first time but sometimes he would show it over and over again like 5 times, and end up leaving an entire chapter or subject area that we were about to be tested on untouched. many of the questions on his tests were kind of unfair... for example some of them were worded so vaguely that you could have interpreted it in different ways so multiple answers would have been legit. i talked to him during office hours about certain questions but he refused to change anything even though he admitted they could be legitimately interpreted different ways. he also had an arbitrary grading system (eg. the cutoff for a B+ was an 87.5). the material was ok but pretty complicated and boring at times. it would have been ok except that we had to learn a lot of it on our own cause his lectures were so irrelevant to the material. bottom line, if you want a class with fun entertaining lectures, take it... if you want a class with interesting material where you'll learn a lot from the prof, don't take it.\"",
            "review 72: \"04S with William Kelley: this class proved to me that psychology is kind of that grey area of the sciences: is it one, isn't it one? i found this class to be boring and tedious, but that's the course material's fault. prof. kelly tried hard to make it more interesting, but the nature of the material just made it a vain effort. if you don't have to take this course (i.e. you're not a major or really into learning which model best describes how you remember that a falcon is a bird), don't take this class. please, don't do it to yourself.\"",
            "review 73: \"04S with William Kelley: if you like this kind of stuff, it's really interesting. the prof is constantly joking around and making students play games for extra credit - actually has a very effective way of getting students to come to class. will call students up at random and make them answer unrelated trivia questions so the whole class can get credit - lots of pressure, but funny to watch.\"",
            "review 74: \"02S with William Kelley: I found this material rather unintersting, but if you like it the lectures are great and its not a tone of work. Professor Kelley works hard to make the lectures (all powerpoint) fun. The grades are based on 3 multiple choice exams.\"",
            "review 75: \"02S with William Kelley: Professor Kelley has a weird sense of humor. There were lots of references to 80s music, so brush up before you get to class. Class was sometimes fun with reference to these irrelevant pieces of music (which sometimes transferred to extra credit points) but the actual course material was a little hard to grasp and the tests were multiple choice, so you really had to know your stuff exactly (no wiggle room). Not a bad class though.\"",
            "review 76: \"02S with William Kelley: So let's talk about the prof: Young guy, not the most dynamic lectures style, but he does 'attempt' to make class interesting with his rather quirky off beat sense of humor (credit here for trying). I found myself falling asleep a disproportionate number of times. It's the same gig with most 20 level and below psych classes. Big class (80?) Impersonal, tests are all multiple choice. If you did well in psych 1, you'll probably do well here if you put in the work. Would I recommend it as for your major requirement... hmm. Depends. Cognition, I find is boring, but probably not as boring as perception. Kelley's ok on the whole, but perhaps the most attractive thing about the course is there is the potential to get a good grade. I hope this was marginally useful.\"",
            "review 77: \"02S with William Kelley: This course was easy. the lectures are in power point format and come DIRECTLY from the book (word for word). therefore attending class and reading the book is redundant. the exams are multiple-choice. not necessarily the most effective way to learn, but not very difficult either. prof. kelley is a funny guy... works hard to make the classes as interesting and varied as possible even when the material is dry. i took the course because i had to, and i think it's easier than psych 21 or 26)... sometimes it was very interesting, sometimes it was boring. prof. kelley doesn't answer questions very well, but otherwise he's a pretty good (and very organized) professor.\"",
            "review 78: \"02S with William Kelley: One day in class, we watched the Simpsons to create a laugh track for a study Professor Kelley was doing. He does a great job of making lectures entertaining. More importantly, he does a good job of pulling in material not in the text book, and using lots of examples to demonstrate concepts. Even though it was a 2, I usually looked forward to going to class.\"",
            "review 79: \"02S with William Kelley: Prof Kelley had a way of making every class entertaining. This guy is hilarious!!! The material was interesting and he had a great way to present it. He offered lecture notes on the web and helpful study guides for the tests. The best part was that he brought in the scantron machine to scan our tests right there for us after the tests. He had \"stuff\" points which even included watching a Simpsons episode for a psych experiment. The only thing that I might complain about was that he wasnt exactly the best at explaining things when there was a seeming discrepancy in what he was saying and someone wanted clarification. But other than that, this was a great class that I enjoyed going to every day. I only missed one class and I was sad about that.\""
        ],
        "Viola Stoermer": [
            "review 1: \"23S with Viola Stoermer: Personally, I would not recommend this class to anyone that is not completely committed to Psych. This course used to be known at Dartmouth as a major layup, but this course is absolutely no longer a layup. Old reviews that talk about the layups of midterms have been replaced. They are still multiple choice, but they are so contrived and ambiguous that for 50% of the questions it feels like there are two to three possible answers. For what it is worth, the one positive of this class is that there is ZERO attendance requirement, and because the lectures are recorded and the sessions are all lecture, this is a class that you could never go to once if you wanted to. I went most of the time, but by the second week we only consistently had about 30% of the class there on any given day. The course grading scale is: 10% for online experiments (these are very easy and you definitely should get a 100% on these), 25% for the first midterm, 25% for the second midterm, and 40% for the final. Because tests account for 90% of your grade, and because the tests are no longer layups, I really wouldn't take this class again. I took it because it seemed interesting and I needed an easy senior spring third class, but man was that a mistake. If you really really love psych, take the course. The topics are actually very interesting, but the book is one step short of sleeping medication and the lectures are very dry. Probably wouldn't take again had I known.\""
        ]
    }
}