{
    "EDUC052": {
        "Michele Tine": [
            "review 1: \"23F with Michele Tine: Great class. Learned a lot about different education theories. A few assignments/essays, a couple of discussion posts, one midterm, one final (in class section and take home section). Didn't really need to do the readings outside of a couple of discussion posts. Tine is great: super passionate about the material and a solid lecturer.\"",
            "review 2: \"22F with Michele Tine: LOVED THIS CLASS! Prof. Tine is super engaging and knows how to explain things in detail in class. She gave 5 different assignments that were done throughout the term, but they are not super time-consuming or difficult at all. Her exams are very fair, but it does involve a lot of memorization because they are majorly based on her PowerPoint slides. Manageable during a four-course term. Highly recommend!\""
        ]
    },
    "EDUC019": {
        "David Kraemer": [
            "review 1: \"21S with David Kraemer: Probably one of my favorite classes that I've taken at Dartmouth, even though it was remote. The material was just that interesting, and it fundamentally changed the way that I viewed any assessment. Kraemer is a floaty guy but a solid, well-meaning professor. Hard to get a hold of, though.\"",
            "review 2: \"20S with David Kraemer: Kraemer is a super nice guy and clearly passionate about education. That being said, this course took a hit as a result of the transition to online learning. Prof Kraemer still worked really hard to make lecture videos and go over weekly quizzes in our once-a-week in-person meetings, but we ended up not covering about a week and a half of course material. We also didn't get feedback on our papers (some people got one of theirs back), and the course grade was essentially just three papers and quizzes, so there wasn't really much we could take away from the course aside from what we learned on our own from readings and lecture videos. I recommend taking this course when it's offered again in-person as the material covered is interesting and Kraemer is a great prof, but he just had difficulty adapting the course to the online format and dealing with everything else going on in his life. The course also has debate and volunteering components that we could not do this term due to the pandemic, but they sound like they'd be a lot of fun.\"",
            "review 3: \"19S with David Kraemer: Prof Kraemer is approachable, helpful, and knows his stuff. Highly recommend taking if you are interested in the policy-side of education\""
        ]
    },
    "EDUC013": {
        "Donna Coch": []
    },
    "EDUC030": {
        "David Kraemer": [
            "review 1: \"19F with David Kraemer: This class should be called the neuroscience and psychology behind learning. The workload was way more than I expected and it especially ramped up when he assigned not only a paper but 2 ten minute partner presentations. This was on top of studying for the final. Furthermore, Kraemer is not the best at explaining concepts and his slides are messy. Sometimes there's so much text that you don't know what to copy down and other times when there are actually important graphs/images/charts to understand, there is ZERO text/analysis. I often found myself wondering \"what are we supposed to know about this slide??\" when I was studying for the midterm and final. Lastly, some of the readings were completely unnecessary as he would only focus on one small aspect of it in the lecture but you still had to do the reading anyway to do well on the predictable 'pop' quizzes. I left this course being pretty disappointed and I no longer want to minor in education.\"",
            "review 2: \"19F with David Kraemer: I thought this course was pretty okay. For most of the term, the workload was pretty minimal; just a couple of readings to read for each class. There were 6 pop quizzes during the term, and they were a mix of bigger points from the lecture (that if you looked over your notes from the previous class for ten minutes before class, you'd be fine) and maybe one or two questions from the readings assigned for that class. The midterm was pretty manageable, though it did help to have taken Educ 001. The last two weeks of the term were insane, though. Kraemer had assigned two presentations to do with a partner over research that you should be researching for your research paper, also due the week of finals, which, oh yeah, there was a final that finals week, too. The last two weeks of the term were jam-packed, but if you start studying for the final early, you'll be fine. you're not going to do that though bc who really does? lectures were great in the front half of the term, not as good the second half, and the vibe of the class for the term was slightly awkward the entire time. felt like a layup work-wise, but we'll see grade-wise.\""
        ]
    },
    "EDUC017": {
        "Donna Coch": [
            "review 1: \"24W with Donna Coch: Y'all should NEVER take a class with this professor!! Nothing we did was ever good enough for her. The midterms had info that we never even covered in class and still she magically expected us to know what she was talking about. She ably demonstrated what does NOT work in education. I put in so much work for this class and it still was not enough for her. Take a different education class if you want to save your sanity and GPA.\"",
            "review 2: \"19W with Donna Coch: This class is no where near a layup. Coch's class is out of 100 points, 50 of which are a cumulation of assignments for a research project that she expects to be published. She is really evidence-based and the whole class is basically saying that nothing currently works in education. There are 10 pop quizzes so you have to stay up on your readings. Her 2 midterms and final are super specific and hard to study for because she's a very hard grader. Also, accused people of plagiarizing in class.\"",
            "review 3: \"19W with Donna Coch: This class is a lot of work mainly due to the term paper, but you get to choose the topic so make sure to choose a topic that interests you. The readings are not too bad and as long as you get the over picture of the readings, you'll be fine with the reading quizzes since they're not specific. If you don't know much about how to read and evaluate the quality of research studies, then take this class because you'll learn how to do that, especially after writing that term paper. Otherwise, the lectures are ok. Some topics are similar, but basically, research in education is not that great. Her midterm and final asks a bunch of really specific questions which are hard. Coch is super knowledgeable about what she talks about and she's wiling to help. Not a layup.\""
        ]
    },
    "EDUC009.08": {
        "Melissa Herman": []
    },
    "EDUC027": {
        "Michele Tine": [
            "review 1: \"24S with Michele Tine: Great class, learned a lot. Tine is an engaging lecturer and very passionate about the material. Exams are rote memorization so make sure to study a lot for them. Other components of your grade are discussion posts, activity reflections, one paper (about two books we read during the term, both books were very interesting and not a challenge to get through), and a grant proposal. Highly recommend this class, even if you are just remotely interested in education.\"",
            "review 2: \"23S with Michele Tine: LOVE THIS CLASS!! Prof Tine is super organized and cares so much about what she teaches, and how she teaches it. Her grading is very clear and her feedback is super helpful for the writing assignments we had. Our workload was: 3 exams (2 midterms, 1 final), 1 4-5page paper on two books, 7 page grant proposal (this is not as dreading as it may seem). The grant proposal was by far one of my favorite assignments at Dartmouth ever, and prof Tine does a good job at explaining it and guiding you through it. I would highly recommend this class for anyone interested in Education, it changes your life!!\"",
            "review 3: \"23S with Michele Tine: Really interesting course with engaging lectures every all around. Tine does a great job organizing and leading us through the assignments, class flow, and material. She’s incredibly kind, friendly, and funny, and always makes class enjoyable. Canvas discussions, 2 midterms, a final, a paper, a grant proposal project, and 5 very tiny 1%-of-your-grade-assignments were the assessments - all with clear expectations and fair grading. Wouldn’t say this is a layup but it is a QUALITY course that you should 100% take if you are at all interested in education and/or effects of poverty and/or are looking for a thought-provoking class.\"",
            "review 4: \"22S with Michele Tine: A really great class, and so much good information that is great to take out into the real world. Love critiquing public education in this country and addressing my trauma from it. The workload was reasonable. There was a lot of readings, but you can just skim them if you are pressed for time to do the discussion posts. Definitely a great class in the education department, and Professor Tine is great.\"",
            "review 5: \"22S with Michele Tine: This was a great class; I learned a lot. Professor Tine is an awesome and passionate person. You would be hard-pressed to find someone who cares so much about the material that they teach, even at Dartmouth. Grading is reasonable, and workload is mostly fine. I would absolutely recommend this class.\"",
            "review 6: \"19W with Michele Tine: Great class if you're interested in Education. Mediocre amount of work but TIne is an awesome professor and keeps the entire class engaged!\"",
            "review 7: \"19W with Michele Tine: Tine is a great professor, take this course if you get the chance. It's a decent workload and the grading is very fair, Tine is a wonderful and inspiring lecturer.\""
        ]
    },
    "EDUC009.07": {
        "Jamshed Bharucha": []
    },
    "EDUC059": {
        "Holly Taylor": []
    },
    "EDUC024": {
        "Janice Mccabe": [
            "review 1: \"22W with Janice Mccabe: One of the more interesting classes I've taken at Dartmouth. This course took up a lot of my time outside of the classroom, so I advise you not to take this course if you're not interested in the material since the readings are much, especially during midterms. The workload took up most of my time, especially the group project at the end of the term, but the project felt rewarding when finished. Professor McCabe is nice and does try to make lectures eventful and engaging, though sometimes it felt dry and repetitive. Overall this class is helpful if you're interested in education and all the disparities that come with it (social class differences, race/ethnicity disparities, sex/gender norms in the classrooms, different modes of education and their effects, etc.). The course is not difficult, but it sure takes up a lot of time. However, this class is rewarding, and I'd say it's pretty helpful to know the stuff taught in it. in short - good class, no lay-up tho\""
        ],
        "Janice McCabe": []
    },
    "EDUC007.02": {
        "Donna Coch": []
    },
    "EDUC082": {
        "George Wolford": []
    },
    "EDUC058": {
        "Laura-Ann Petitto": [
            "review 1: \"07W with Laura-Ann Petitto: This is a great class, you learn a lot of information. You need to go to class and fill out the Thinking Guides. Do not have to read assigned materials. Professor is passionate but at times is a little over the place. I would recommend taking this class.\"",
            "review 2: \"07W with Laura-Ann Petitto: Petitto is a good teacher overall. She loves her research, and loves to talk about it, so the course is mainly based around it. It's very interesting and all, but I feel like she went way too slow. She wanted to make sure everyone knew the material, and so, she kind of 'held our hands' too much. Everything she covered probably could have been discussed in 3 to 4 weeks, and then we could have moved onto other areas of research from there (it's a big field!). Midterm & final are really easy. She gives you all the possible essay/short-answer questions beforehand, and she tells you she'll select a handful of them to actually put on the midterm/final. So if you prepare adequately, it's easy to do well.\"",
            "review 3: \"07W with Laura-Ann Petitto: Is not so good. Class is easy-ish though\"",
            "review 4: \"07W with Laura-Ann Petitto: This was by far the easiest class I've taken at Dartmouth. Professor Petitto really wants everyone to learn the material, so she goes very slowly and tells you exactly what will be on the midterm and final. There is hardly any work outside of class - just a few readings a week, which you don't even really have to do (if you take this, don't bother buying the textbook - it's expensive and Petitto doesn't test on anything from it). At times it's frustrating how slow-paced the course is, but it's certainly nice to have when your other two classes are intense! Professor Petitto is a passionate, caring educator who loves to gush about her area of expertise! You can't help but be interested in the material when you listen to her. If you put in even a little effort, she'll love you forever.\"",
            "review 5: \"07W with Laura-Ann Petitto: This class was fun because Professor Petitto was always so upbeat and enthusiastic about the material in her lectures. Her slides were colorful and interesting. The course focused a lot on Professor Petitto's research work over the years; she has done a lot of fascinating, brilliant research in language acquisition. This is not a difficult class if you prepare ahead of time for the exams. Professor Petitto is one of the most friendly and encouraging professors I know and is always available outside of class. She geniunely cares about her students and makes a strong effort to get them to learn the material.\"",
            "review 6: \"05W with Laura-Ann Petitto: This is an easy class. She gives you the exam questions before hand. It's very interesting though and Petitto's great, even if Petitto is head-over-heels in love with herself. To give her some credit there are some things she deserves to be proud of...but how many times do you hear a professor say: \"I was great friends with Mr. Crick and I'm proud to say that I was able to influence him and stretch his mind\" or \"I am the only research ever to...\" or \"I discovered...\" Take the class, its interesting and pretty easy!\"",
            "review 7: \"05W with Laura-Ann Petitto: This class is very easy and very repetitive. I don't feel you learn that much. Especially if you are an education minor and have already taken a course with Petitto. She tends to repeat herself. But easy course and somewhat interesting.\"",
            "review 8: \"05W with Laura-Ann Petitto: This class really taught me a lot and was definitely interesting. The exams are in-class essays and they're very straight forward. A lot of information is covered in the class and Petitto does an excellent job teaching it in her lectures. I would highly recommend this class!\"",
            "review 9: \"05W with Laura-Ann Petitto: easy class; you don't need to do any of the readings. petitto is a great person to be teaching this class b/c she's very knowledgable in the field and really passionate about what she does. the class starts out a little slow w/ lots of what makes up language but gets more interesting once you get to the sign languages and bilingualism part\"",
            "review 10: \"05W with Laura-Ann Petitto: She is very accomplished and she will let you know. Luckily, the subject is something she had a large part in establishing as a field of study and developing the theories. The work is not difficult and will leave you with an appreciation for language.\"",
            "review 11: \"05W with Laura-Ann Petitto: The material inself is really interesting and Professor Petitto has done amazing research. I dreaded class, however. Petitto gives very repetitive lectures. Sometimes we would spend an entire hour discussing one slide. I got really frustrated with the lectures and just wanted her to move on to the next topic.\"",
            "review 12: \"05W with Laura-Ann Petitto: Petitto made the class really interesting. There was lots of reading, but most of it is reinforced in class.\"",
            "review 13: \"05W with Laura-Ann Petitto: The first half of the course deals with theories and facts of language acquisition, while the second half focuses on applications and policy. Readings are definitely not necessary, as she gives you the exam questions ahead of time basically making it a take-home that you then memorize and spit back out. Because of that, attending class seemed kind of pointless at times. However, Prof. Petitto is an extremely sweet woman with a lot of passion for her field, so it was almost worth it to go just to hear her speak so enthusiastically about her work (she does tie it in a good amount) and where the field is going. Definitely a nice third class.\"",
            "review 14: \"05W with Laura-Ann Petitto: This class was very easy but also pretty interesting. Professor Petitto is very nice and eager to help students, her huge ego notwithstanding. She gives out all test questions ahead of time so if you spend any time preparing, it's easy to get an A. She does seem to have pretty specific expectations, so some people were surprised when they got A-'s when they thought there was nothing wrong with their answers. If you put thought into thinking about what she wants in the answers though, it's not hard to do well. The material is interesting, and hearing about the experiments that she has done is enjoyable. Petitto's ego is definitely huge, but because she's so nice, I was more inclined to laugh than to get angry.\"",
            "review 15: \"05W with Laura-Ann Petitto: The class was interesting and not much work. If you take this class, participate because it will help your grade.\"",
            "review 16: \"05W with Laura-Ann Petitto: the material for this course, how children acquire language, is really interesting. i did learn some, but overall, this course was incredibly easy. no need to do ANY of the readings. grades based on a really easy assignment, a midterm and final, and class attendance.\"",
            "review 17: \"05W with Laura-Ann Petitto: This is probably the best class I have taken at Dartmouth to date. The perfect combination - easy and interesting. Easy because you really didn't have to do any of the reading - all you need for the exams is stuff that's on the powerpoint sheets she hands out in class. You fill out \"thinking guides\" during classtime which is a bit annoying, but they come in handy for exams because all the info you need is right there. And this class was fascinating in some respects - really changed my views on the nature of language. Loved the bit in the beginning when she talked about her experiences living with Nim (a chimpanzee) - it was a great intro. And all the info on sign language made me get a whole new concept of the language. Take this class.\"",
            "review 18: \"05W with Laura-Ann Petitto: I feel terrible writing a bad review for this course because Professor Pettito tries so hard to inspire interest in the topic. She is clearly very interested in her students, and she makes an effort to have discussions even though the class is far too large. The problem I have with this course is that it is SO incredibly boring. Each lecture crawls by because the material is so easy. Petitto seems to think that we cannot understand the simplist of concepts, and she continuously drops her own name during lectures and on slides (its a little weird because she's so nice yet comes across as so self-congratulatory when she does this). So now you're thinking, \"Great. An easy A.\" Nope. Petitto's midterm was incredibly unfair. She gives you the questions beforehand, but looks for extremely specific components in your answers - things which don't necessarily seem relevant to the question at all. Leave one or two things out, and you're down to a B+ or B. This is only annoying because the material is so easy, and you feel like you should have gotten an A+. I have heard that the reason for this obscure grading is that Professor Petitto tried to make the course harder when she heard that people thought it was easy. Well, now the course is still painfully easy, but the tests are unfair. Petitto's main goal in this course is to try and teach you a few key facts that you'll remember for the rest of your life. I understand that she really wants to drive those points home. The problem is that I learned NOTHING else, and spending ten weeks learning that monkeys don't have Language, bilingual babies aren't confused, and that we're all hard-wired to pick up language patterns is a waste of time. Only take this course if you have to because you'll be really bored. From what I learned in this course, I just don't get the sense that language acquisition deserves a whole course. The topic is just too specific and there's just not all that much to learn. Petitto is a really nice woman, and she is clearly a really brilliant researcher, but her low expectations for her students completely ruined my experience in her class.\"",
            "review 19: \"05W with Laura-Ann Petitto: Prof. Petitto really is incredibly knowledgeable about the subject and is so responsive to students. Reading is really irrelevant, and class is good, just no something i'm veyr interested in.\"",
            "review 20: \"05W with Laura-Ann Petitto: Interesting material, but very much \"Professor Petitto tells the way it is\". She's an expert in the field but sometimes she gets a bit too caught up in what she thinks. Also, for me it was a hard class to get used to because it was so big, we had TAs, and Petitto didn't grade our tests and stuff. I'm used to classes with 20 people or less. So it was definitely very impersonal and she didn't seem too concerned with our work, as we were undergrads. She was really really nice though, and made an effort to learn our names and answer our questions in class. She is definitely passionate about the subject and wants you to be too. Cool stuff to learn, too...although if that's what all the classes are like I'm not sure I want to be an Education minor.\"",
            "review 21: \"04W with Laura-Ann Petitto: This course is incredibly interdisciplinary and fascinating. Petitto will probably be one of your most memorable professors you've had on-campus. There are few other courses like Language Acquisition around the country. Even though it's a 10A ... the two hours will go by and bearably so. She uses various media effectively to get her lectures across. The material appears to be easy to absorb and that is true, but if you get the wording slightly wrong, then you've made a really silly stupid mistake. Therefore, enjoy this course and relax but do keep a keen eye on the reading materials so you can get the right phrases and such down cold on the exams. It should be an easy A but there are plenty who slipped up. Otherwise, it was simply an amazing course so take it if you're looking for a 4th class to fulfill or you're merely interested in a thought-provoking course that'll change the way you look at certain things in life forever.\"",
            "review 22: \"04W with Laura-Ann Petitto: Prof Petitto is easily the most enthusiastic lecturer I've ever had. Unfortunately, she runs out of things to say by the third lecture. From there on out, the course is extremely repetitive... On the plus side, there's no reason to buy the book and reader, because you can easily get an A in this class without opening either one. Just go to class and you will do fine in this wonderful gut course.\""
        ],
        "James K.": [
            "review 1: \"08W with James K.: The concepts that we covered in this course were really interesting, and Prof. Nelson did a great job of mixing in videos with the slides, but his lectures were only mediocre. He definitely tried hard, and answered all the questions asked during class, I just felt like given the material, class could have been a lot more stimulating. In terms of evaluation, there was a short assignment at the very beginning, as well as a midterm and a final consisting of short-answer questions and an essay. It was all fair evaluation, but we didn't get the midterm back until about a week before the end of term, so beyond the early assignment we had absolutely no indicators of how we were doing in the course, which was incredibly frustrating.\"",
            "review 2: \"08W with James K.: I took this course because I was really interested in the subject matter. It probably would have helped if I had taken Ling1 and some other relevant lower-level pysc and ling courses prior to taking this course, but I chose this one purely because of the course material. I struggled with the textbook because it wasn't as well-organized and engaging as other textbooks I've used in the past (actually, I really hate the textbook), but in a way this field is highly dynamic as well, so perhaps the book's organization only reflects the current state of affairs... Anyway, it was probably a lot harder for me than others in the class to digest the material, but I don't regret having taken it and would recommend it to anyone interested in linguistics, cognition, etc.\"",
            "review 3: \"08W with James K.: Interesting material, especially if you like learning about kids and/or language. Prof seemed to be new at this whole thing, and used a lot of lecture material from a previous professor. He seems like a brilliant guy in another aspect of psychology/education/linguistics. But, he conveyed the material adequately. Readings were interesting and exams were fair, and even fun.\"",
            "review 4: \"08W with James K.: and I expect that he will improve as he teaches more. I found the lectures interesting. The biggest problem I had with the course was the way it was assessed -- one assignment, one midterm, one final, plus attendance/participation. I wish the course had more small assessments and was more interactive. Also, Prof. Nelson took an absurdly long time to return the assignment and the midterm.\"",
            "review 5: \"08W with James K.: The lectures and the readings are really engaging, and Professor Nelson is really interested in making sure that everyone understands the material. The class covers a great breadth of topics, and it made me wish we went more in depth on some of them. Work is minimal--a midterm and a final (for both of which you receive a study guide with questions ahead of time)--and a short write-up at the beginning of the term.\"",
            "review 6: \"08W with James K.: This class could be really interesting and i have heard with the previous prof it was a lot better. but professor nelson was pretty boring and not the engaging. its not too tough but its not exciting at all.\"",
            "review 7: \"08W with James K.: The material was actually really interesting, but the class flopped because of the prof, which is unfortunate. The professor just seemed to lack in expertise in the material. Thus, lectures always ended early and asking him questions almost seemed pointless. He's a nice person, but just not so great at lecturing, unfortunately.\"",
            "review 8: \"08W with James K.: Prof. Nelson has the class structured fairly well, but I often found myself bored in class, as lectures essentially amounted to a re-hashing of the reading with a few extra tidbits over the course of 2 HOURS. Additionally, the volume of material was not particularly large, particularly for myself being a neuroscience major already acquainted with several of the aspects of the brain and research that were gone over in class. Prof. Nelson does do a great job of letting students know what to expect on exams--questions were all pulled directly from his review sheet, as well as the essay question, which was given to us in advance, making exams a fairly simple task to study for. Were it not for the \"thought guides\" given every class that are essentially a glorified attendence credit (he never looked at the guides), there would have been next to no compulsion for me to go to class. The class is interesting; lots of great material (i especially enjoyed the first phase when linguistics were the focus, as well as the emphasis on sign language in the second half). But hopefully prof. Nelson becomes a better lecturer in the meantime.\"",
            "review 9: \"08W with James K.: the course material is so amazing, i can't believe i'm about to write a poor review. the slides were all petitto's, and she's in half the readings and videos we saw, she's done the research and been such an integral part of the field...i was really excited to take it with her, and i'd heard great things about the course. i was truly disappointed to see a name other than hers as professor, and nelson did not change my mind. he was certainly enthusiastic, but that only annoyed me more and more as he was unable to answer basic questions about the studies he was talking about. it was like he learned the slides/readings and no more, and could only clarify what we had read or seen ourselves, instead of going deeper, providing a new perspective, or giving more info. to me, that's pretty useless.\""
        ],
        "Adam Kay": [
            "review 1: \"11W with Adam Kay: This is a great class if you're interested in linguistics, we go through all developmental phases of children during language acquisition, as well as cover bilingualism towards the end of the term. Take it! Prof Kay is so fun and he loves the topic, it's a very chill classroom environment, and you learn a ton. Readings can be a little dense and take a while to fully understand, and the tests were fair but hard. But overall great class, highly recommended!\""
        ],
        "Janine Scheiner": [],
        "Sean Kang": []
    },
    "EDUC088": {
        "Donna Coch": [
            "review 1: \"11W with Donna Coch: Ironic that the worst teacher I have in my entire Dartmouth career (and that includes a prof who couldn't quite speak English and had terrible public speaking issues) is in the Education Department. I'm passionate about education (hence the minor) and if you're checking out this class, I'm assuming you're a minor too. Well, get prepared for a term of hell. Worst class I've ever taken, Coch doesn't teach you anything - in fact, after the first two classes she literally sits while you as students fumble through trying to teach a 2 hour class by yourself. She provides NO guidance, NO help, going to her office hours is purely frustrating because she doesn't provide any teaching. She merely sits and frowns at you. Overall, I almost quit this class and gave up my minor because it was such a horrific experience and I know many people in my class considered doing the same thing. You don't learn anything and what you do learn you teach yourself. I've never been so disappointed by a class in my life. Unfortunately, if you're a minor, this is mandatory hell you have to go through. Hopefully she'll lose this class before you have to take it.\"",
            "review 2: \"09W with Donna Coch: Prof Coch delivers. She is organized, systematic, and makes sure you learn what you need to learn. Unlike most profs at Dartmouth, lecture in her class isn't about a meandering journey through a subject, it is structured around the Individuals with Disabilities in Education Act, goes through each of its categories using the same framework, and provides you with the special ed background you'll need to be a classroom teacher. There are 4 short research papers that may help you learn to evaluate education research findings and how to apply them to teaching, but I didn't learn much content from them. Be careful because Prof Coch is suuuper picky about APA citations, tardiness, grammar, etc. And maaad obsessed with attendance. And she uses almost every x-hour to show irritating movies about complaining parents. I'm not so interested in the subject so I'm trying to be fair here, but this class wasn't for me. It was much better than I thought. If the subject is your thing you can probably stomach the boring papers and irritating movies because Prof Coch is a good teacher and you'll learn a ton from lecture.\"",
            "review 3: \"08S with Donna Coch: The seminar (this term at least, it may change) met weekly for three hours. The main part of the course was each student teaching one class, giving an oral presentation about a specific topic. There is a ton of reading for each class meeting, some of it helpful, some of it repetitive, and you have to do a research proposal (anywhere from twenty to forty pages plus) for the final class meeting. The proposal is based off of your oral presentation, which is based upon your week's topic in education. There is a clear bias for making education more science-based (neuroscience and psychology) over the more traditional educational perspective, although all perspectives are recognized to some degree. If you are a teacher, do not assume you will like the minor because it tends to be heavy on the science. The psychology majors in the course seemed to do very well. Professor Coch is extremely organized, and has extremely high expectations, even if they are not always clear. She is great about helping outside of class, so take advantage of that! Overall, not too bad, but the class is way too long and the proposal is painful to write. Try not to put it off!\"",
            "review 4: \"05S with Donna Coch: It is a good course if you like studying neuroscience and the brain. If not, it can be very confusing. Sometimes it is hard to see how this course connects to education.\"",
            "review 5: \"05S with Donna Coch: The subject matter, at face value, is quite interesting. Take one look at the syllabus and the topics are rather intriguing. Also, the idea of tying together brain & education is novel, but as the course goes on you get the feeling that the professor tries too hard to link brain & education. I liked this better than the other education courses I have taken, mainly because this wasn't a \"we'll sit around a table discussing our personal experiences and in return i'll dole out A's and A-'s\" course and actually challenged me to some extent. The whole exercise of writing a \"quality research proposal\" was rather useless though, and her expectations are always vague/ambiguous to say the least. Not the best, and not the worst class I've taken either. The work doesn't really seem worth all the trouble though. Just remember that what you see on the syllabus is what you get.\""
        ],
        "Daniel Ansari": [
            "review 1: \"05S with Daniel Ansari: This was an interesting class that made me think about education in a much different way. Although the neuroscience part of the course was completely new and interesting, I criticize the course for being unbalanced. There was not enough focus on the nurture (of the nature vs. nurture debate). They say it is a blend of the two and try to make connections between them, but I found this course to be heavily focused on the brain. The readings were almost exclusively neuroscience/neuroimaging studies. By the end of the term, the lack of creativity and monotony of reading Intro, Methods, Results, Discussion...got to my motivation. Presenting the neuroscience side of things is good, but this course is a bit of an overdose, especially for those of us seniors who are all new to this turn in the department.\"",
            "review 2: \"05S with Daniel Ansari: Professor Ansari is very helpful and responsive to students. The class is heavily focused on neuroscience, but that's the way the Education department is headed. The presentation and research proposal take a lot of time - start working on them early - but all seminars require a lot of work so I thought the assignments were fair.\""
        ]
    },
    "EDUC086": {
        "Ann Clark": [],
        "George Wolford": []
    },
    "EDUC085": {
        "Ann Clark": [],
        "George Wolford": []
    },
    "EDUC064": {
        "Donna Coch": [
            "review 1: \"21X with Donna Coch: Took this online – hated it. Prof Coch recorded her lectures in her dark scary attic, had the most boring slides, and graded insanely harshly. I put so much into this course, took it out of interest, and it tanked my GPA for the term. Slightly ruined my Summer. Super interesting material though and I learned a lot about a field I'm interested in but the course design made it a miserable experience overall. So ironic because it's about children with learning disabilities yet she did a horrible job accommodating my SAS disability like she didn't even believe me. Beware\"",
            "review 2: \"21X with Donna Coch: Yeah, yeah, there are some fire and brimstone reviews, and I also struggled some in this course, but it was also well taught and VERY interesting. Imo, Prof Coch has designed the course well, with the best use of Canvas modules I have ever seen. The topics (ADHD, autism, dyslexia, deafness, etc etc ) were SO interesting. We looked at them from both a scientific neurobiological perspective AND the personal, empathetic perspective. I'm a neurobio guy, and this class was better than Atypical Neurodevelopment at looking at these disorders. We read from the POVs of parents, teachers, students, disabled people, etc. I cried during some of the readings and the movies we watched--they were very moving. I agree with the other reviewers; the most difficult part of the class was the four essays. The long 19W review is not wrong in its description (though I wouldn't describe it so tortuously). I have some disabilities and get accommodations through SAS and I did find Prof Coch to be accommodating, while also holding me to a high standard. The thing is, that's how it should be. As a disabled person, I don't want to be allowed to do subpar work just because I'm disabled. I want to learn to do excellent work--that's why I'm at Dartmouth. Prof Coch seems to understand that idea well. I felt supported and seen by her, AND challenged and pushed by her.\"",
            "review 3: \"19W with Donna Coch: Okay, a lot of the reviews on here trash Coch but few do the course justice. This is not a layup, but it is a course that I think absolutely everyone should take. It doesn't matter if you want to study education, psychology, etc. If you want to learn about ADD, autism, depression, anxiety, deafness, dyslexia, lisps, etc., then take this class. It isn't terribly easy, but at the same time, it's not terribly hard. The workload is totally manageable; you just have to prep for the papers and stay on top of them. This is such an important class that I think everyone should take.\"",
            "review 4: \"19W with Donna Coch: I was warned not to take this class. I didn't listen. I should've. DO NOT TAKE THIS CLASS. NO MATTER WHAT. With that out of the way, let me tell you about the horrors of EDUC 064. Donna Coch is a nice woman, but she is extremely unrelatable. Class lectures were always dry and boring, and I fell asleep during them at least half of the time. She expected a lot of \"audience participation,\" where she would basically ask questions about everything in the lectures. It always proved to be awkward and extremely forced since no one wanted to answer. Lectures followed the same format each class, too: an overview of the disorder, the prevalence of the disorder, the diagnosis of the disorder, the treatments for the disorder, the genetics and environmental factors behind each disorder, and the neuroscience behind each disorder, with many different studies thrown in as examples. This format became repetitive and annoying very quickly. Moving on, Coch assigned 4-8 daily readings that would cover some of what we would learn about in class that day. During the term, she gave a total of 10 pop quizzes over each daily reading (these pop quizzes would accumulate to be 10% of the total grade). These readings were SO DRY. I have a passion for education, but these readings made me, someone who would cry reading education 001 readings because they were so moving, fall asleep reading them. There are an overwhelming amount of readings, and they very quickly become tedious. Onto the WORST PART of the class: the papers. Coch assigned four papers during the term; each was 15% of the final grade. These papers could be written about anything that we had covered within a certain time period, as long as you included two primary research articles from outside sources and as long as the papers were 3-4 pages in length. It sounds reasonable until you actually take the class. She is the harshest grader I have ever met. She expects you to be extremely specific about everything in each research article while also including and referencing class sources while also synthesizing your own conclusion while acknowledging the limitations of all of your evidence--all in 4 pages maximum. This was impossible. Every single person in our class struggled to write these papers. If you go to office hours, Coch may--MAY--read your paper and give you notes. This was the only way to get near an A- on the papers. It was the most frustrating experience of my life. Finally, Coch gave a final exam worth 15% of the final grade, which was probably the fairest part of this class. Overall, this class is HELL. I spent countless hours in the library working on this class. I took a very difficult stem class this term along with this class; my stem class was 10x easier than this one, hands down. I will NEVER take another class with Coch again, and I hope that you don't, either. If I hadn't had such an amazing experience in EDUC 001 with Tine, I 100% would have given up on my education minor after this hellish class. DO NOT TAKE THIS CLASS. IT IS NOT WORTH IT WHATSOEVER. EVEN IF YOU WANT TO WORK IN SPECIAL EDUCATION LIKE I DO, THIS CLASS IS STILL NOT WORTH TAKING. DO NOT TAKE IT.\"",
            "review 5: \"12W with Donna Coch: Course: The course content had the potential to be interesting, but the syllabus was outdated. Professor: Much like a washing machine or a garbage disposal, Professor Coch does her job but is impossible to relate to on a human level. She is incredibly intimidating and inflexible. While she is obviously an expert in the field, her inability to communicate effectively with students results in widespread frustration and an overall diminished course quality. Workload: Professor Coch assigned 4 papers, had 2 exams, and gave 1-2 pop quiz per week, often too days in a row. This may have been doable if she were approachable, but it was nearly impossible to improve over the course of the term as her feedback was unhelpful.\"",
            "review 6: \"09W with Donna Coch: Professor Coch is great!!! The class is very good. Make sure you are interested in the topic though. Grades are based on four 3-4 page papers each worth 15%, a final worth 15%, and easy pop quizzes that are given throughout the term.\"",
            "review 7: \"09W with Donna Coch: The subject material covered by this class was very interesting and relatively comprehensive--we covered each of the major learning disabilities in depth from an educational and neuroscience perspective. Although Prof. Coch's lectures are very clear and organized, they can be kind of monotonous and repetative because she relies on powerpoint presentations outlined in the same format for every class. While I loved the class and the topic (definitely a must for anyone thinking of going into Education or interested in childhood disabilities), my main problem with the course was the papers. The main part of your grade is based on research papers that are due every 2 weeks, and are often graded more on technical writing skills than understanding of the material. I learned a ton in this class, but the papers and grading criteria do not reflect the amount of material we cover in class. Total Assignments: 4 research papers, 1 final exam, and periodic pop quizzes on the reading\"",
            "review 8: \"08W with Donna Coch: This course was great because it opened up my eyes to the many different learning disabilities that occur in education (deafness, depression, autism, ADHD, dyslexia, dyscalculia, dysgraphia, stress/abuse, SLI). lectures: powerpoints with the prof making outlines of the text and putting them on blackboard. Some lectures were more interesting than others... readings: you get a big fat reader and have to download a bunch of articles online. For the most part, they're interesting. assessment: pop quizzes every so often, they aren't hard if you've done at least a skim of the readings. Four papers (3-4pgs) in APA style about a topic discussed in class - a little tedious, but not too bad. On a positive note, the prof returns them in two days. A very fair final exam and you get a cheat sheet. Overall: I was pleased with the course and the prof, the course material is well worth learning about.\"",
            "review 9: \"08W with Donna Coch: I liked the course because I learn in the style that Coch teachers. I'm into being lectured at, memorizing things, extreme organization, concrete learning styles. Lectures were often a little boring. Papers are graded hard but the weekly pop quizzes are easy. A good course, valuable for the minor. Harder than most education courses.\"",
            "review 10: \"08W with Donna Coch: For a 9L, it was really good in keeping my interest. The material was intersting. The papers weren't too bad. The final exam wasn't exactly what I expected but I got through it alright. Professor Coch is a wonderful professor. I recommend this class to anyone, especially if you plan on working with children in the future in any setting.\"",
            "review 11: \"08W with Donna Coch: clip art = irrelevant font = ugly format = repetitive the outlines weren't helpful, either were the lectures. waaaaay more about brain stuff than actual educational policy.\"",
            "review 12: \"08W with Donna Coch: Lectures are boring and there is a ton of reading for this class, and while some of it is interesting, the sheer volume of it is quite overwhelming. While the subject matter is extremely applicable, its applicability is rarely discussed. Lots of brain info. and studies. there were four 3-4 page papers pop quizzes blackboard postings and a final while prof. coch posted her grading criteria, doing well on papers was difficult. grading seems quite arbitrary and it was hard for me to figure out what she was looking for. the 9L is killer, and it sucks that you might be greeted with a pop quiz, subsequently followed by a mind numbing lecture. don't take it unless you have to.\"",
            "review 13: \"07W with Donna Coch: Take this class if you are a minor or even if this is your first education class. It has applications for your future children, what you experience in school, and can help if you are a psych major. The prof is fantastic!\"",
            "review 14: \"07W with Donna Coch: such relevant and interesting information, but the lectures were a little bit slow and the assessments aim at good writers.\"",
            "review 15: \"07W with Donna Coch: This course was interesting and applicable to future educators, parents, and informed citizens. Prof. Coch was extremely organized and graded very fairly; she was open to any questions or comments we had about the material or the course. The readings were lengthy but helpful for introducing the material. The course consisted of 4 3-4 page papers about a topic of our choice (15% each), class discussion/online discussion board participation (13%), a final consisting of multiple choice, fill in the blank, short answer, and essay questions (15%), and six pop quizzes on the readings (12%). The course gave me a new perspective on children with learning disabilities and on the education system in general, I would definitely recommend it. It is not an easy A but its worth the effort. Its also very neuroscience-based, so if you don't like \"brain stuff\" you might not appreciate the course as much.\"",
            "review 16: \"07W with Donna Coch: I really liked Coch because I appreciated her interest in the subject and thought she was nice, and liked the feedback on her papers, but she's pretty dry in class and all the lectures are on powerpoint. The papers are a great way to get to know the subject material better, though they come up unexpectedly. Towards the end of the course the work was a little less interesting, but the final wasn't too bad.\"",
            "review 17: \"07W with Donna Coch: I found the material in this class to be very interesting, and I think it would be interesting even if you are not an Education minor or Psych/Neuroscience major or minor. The lectures were clear and well organized, though the professor was kind of boring at times. The professor gave pop-quizzes every once in a while to make sure we had done the readings, which was annoying (even if you had done the reading)...but she didn't grade them very hard. Nevertheless, I feel I got a lot out of the class, and it was definitely worth taking.\"",
            "review 18: \"06W with Donna Coch: Professor Coch delivers extremely organized lectures, which made it very easy to follow along in class and to study for the final (despite its not being my best performance in the class). The essays were graded rather arbitrarily, and the prof. was never quite specific as to what she was looking for content-wise. The random pop quizzes were not enjoyable, but they do make you keep up with the reading (there's a lot, but it's definitely doable). Prof. Coch is quite strict in her expectations for her students with regard to attendance, arriving to class on time, and keeping up with the work. Nevertheless, she is very fair and will reward you for working hard in the class. The subject matter is quite interesting and will make you a better teacher. Even if you don't want to teach, awareness about atypical development is necessary for anyone that will eventually deal with kids, including future parents!\"",
            "review 19: \"06W with Donna Coch: NOTE: its titled \"the exceptional child\" but don't think this is about teachign gifted kids - this is a course on Special Education and learnign disabilities. Coch is definitely a prof with high expectations, sometimes she sort scared me, but most most of her toughness is about makign sure you get as much as possible out of the course. You have to do the readings since there are pop-quizzes. there are 4 short research papers due every 2 weeks on whatever you found interestign enough to further research. I thought Coch did a good job ofconnecting this class to the real-world; if you intend to be a teacher, i'd definitely recommend you take it.\"",
            "review 20: \"06W with Donna Coch: Lots of tedious reading, but great if you're interested in the subject. if not, not so much\"",
            "review 21: \"06W with Donna Coch: i wouldn't recommend taking this course just because the material interests you-- it's a ton of reading and a ton of researching and a ton of writing, and generally more stress than it's worth.\""
        ]
    },
    "EDUC062": {
        "Andrew C.": [
            "review 1: \"09S with Andrew C.: This review is actually useless to you since Prof Garrod is gone but if you ever get a chance to meet him you DEFINITELY should because the man is the nicest, most aware, sensitive, funny, brilliant, delightful, skilled, fantastic genius you'll ever meet. His class was absolutely insane in both the classroom environment he created, making a 90+ person class seem incredibly intimate with people voluntarily sharing secrets from their own adolescence, to the amazingly cohesive way he taught including readings, movies, discussions, interviews, novels, case studies, personal experience, studies, magazine articles, guest speakers and all sorts of techniques that tied the class together in incredible ways. Garrod also sees each and every student as completely brilliant. Absolutely life changing course.\"",
            "review 2: \"09S with Andrew C.: Professor Garrod is an exceptional man. In a class of 90-some students, he knew almost all of our names on the second day. He brought in a variety of guest lecturers and drew on all topics concerning adolescents. I see myself and others around me in such a new light, and I understand myself so much better. The reading was interesting and, although it was quite a bit, I wanted to get it all done because it was so fascinating. The three papers were creative yet thought-provoking and I thoroughly enjoyed doing them. Garrod knows how to engage a class and truly make you think for yourself. I haven't regretted taking this course for a second!\"",
            "review 3: \"08S with Andrew C.: The course is a good amount of reading and writing, which can be hard to stay on top of. However, I think that EVERYONE should have to take this course. It is amazing and you will learn so much about yourself and how people come to be the way they are. TAKE THIS COURSE.\"",
            "review 4: \"08S with Andrew C.: If you really put yourself into this class, you will get so much more out of it than you can get out of any other class at dartmouth. Take it.\"",
            "review 5: \"08S with Andrew C.: Professor Garrod is an amazing professor. I learned so much from this course, both about general theory of adolescent development, but more importantly, applications for dealing with adolescents and understanding my own past. Even though this course is in the Edu dept, we learned a lot about psychology The course is reading-heavy, and you are expected to do all the readings. I didn't really take extensive notes on readings (just underlined), and I was fine. I put a lot of work into this class, but I found that it was all work I wanted to be doing. The papers aren't tremendously difficult, although they can be time-consuming if you want them to be The tests require you to know the information backwards and forwards because you have to write really fast in order to finish on time\"",
            "review 6: \"08S with Andrew C.: This course is one of the best I've taken at dartmouth. Not only do you learn about what all the theorists think about adolescence, you learn about what YOU think of adolescence, and how your own adolescence contributed to who you are as a person today. The class is very varied, with assignments ranging from readings and movies to conducting a real Kohlberg interview and writing a paper analyzing a moment in your own adolescence. This class was a welcome break from my other academic work this term, as it was fun reading -- first-person cases from adolescents (that you cover in discussion sections, which are a really rewarding complement to the classes themselves), TIME articles about teen sexuality, novels with adolescent protagonists, etc. There were a number of guest speakers as well as video clips shown in class, and most of the classes were discussion-based, and very worth attending. Garrod is known for being a great teacher at Dartmouth, and the rumors are true. He's a quaint little british guy who is very matter-of-fact and has been doing what he does for a long time and knows how to do it just right. He's got a sense of humor that lightens the class but also he knows how to lead discussions and probe deeper for further exploration of the issues. He's really an inspiration to do well (and not be late to class!!), and absolutely worth visiting his office hours. There are an absurd number of books to get for this class (as well as a big fat reader from Wheelock) -- but my only advice is, USE THE RESERVES. Garrod is very good about putting all the required books on reserve in the library, so you don't have to pay anything to take this class, you can borrow the textbooks when you need them. That's what I did and I got by just fine. TAKE THIS CLASS, it will change your life.\"",
            "review 7: \"07S with Andrew C.: this is one of the most personal classes at dartmouth. while you do learn a lot about the theorists, garrod really makes an effort to make this class have a personal effect on each person. he tries to learn everyones name in the class, and really encourages discussion in class (talk a lot, participation counts). there are small group discussion xhours every week but they are totally worth it, it was my favorite hour of the week... the assignments are a lot of fun to do (a book review, interviews and an autobiography). it's definitely worth it, whether you're a freshman or a graduating senior!\"",
            "review 8: \"07S with Andrew C.: Very interesting class, Garrod really makes you consider your own adolescence in light of what theorists and researchers have found. There's a lot of reading which the quizzes are mostly based on and a lot of guest lecturers. You need to keep up with the reading. Overall though, this is a great class!\"",
            "review 9: \"07S with Andrew C.: You have to stay on top of the reading. The papers require a lot of work. Exams are not too hard. The prof likes an interactive class which is hard in a lecture class. You learn a lot about the adolescents and yourself.\"",
            "review 10: \"07S with Andrew C.: So Garrod is great. He has a clear passion for teaching and the material and will go out of his way to make sure you grasp it. That said, one of the ways he tries to help is piling on work and assessments. There were 6 or so types of grades (papers, tests, biographies, participation), and each x-hr was used for discussion groups. To finish all the reading meant sacrificing a GOOD amount of time - it's just impossible to do it all. And the tests were very specific so you had read everything to do well. The two tests were only 30% of the grade (one of the tests was the final) so not reading won't kill you. I'd suggest taking the course if you want to be engaged, but don't go in to it like it's a piece of cake otherwise you're in for a real shock.\"",
            "review 11: \"07S with Andrew C.: But I have to admit, I got a little sick of all of these theories about adolescents. I'm just not a sociology person, I guess. Everything just seemed more and more like generalizations about gender and race. But Garrod was a good professor. And it was an interesting course. I am very glad that I took it. It made me somewhat introspective about my own life and adolescence. In that way, this course can get a little personal. Garrod even makes you write an autobiography for the final paper.\"",
            "review 12: \"07S with Andrew C.: Generally, I enjoyed it a lot. But despite the massive workload (of readings, written assignments, exams, films, discussion sections, etc.), I don't feel as though I ultimately learned a lot. Prof. Garrod tends to overreach w/ his classes which was definitely counter-productive in this course. Still, an enjoyable experience. Prof. Garrod is very devoted to his classes--this was my 2nd course w/ him. He is a talented teacher and lecturer, but some of his diagnostic tools can be frustrating. Recommended, but not what I would consider a \"must-take\" class.\"",
            "review 13: \"06S with Andrew C.: Professor Garrod is an incredibly interesting lecturer, and I always enjoyed going to class. He also brings in good guest speakers. This class requires you to put in a lot of time on reading, papers, discussion sections, and movies, but if you do the work it is easy to get a good grade. I highly recommend this class to anyone who is interested.\"",
            "review 14: \"06S with Andrew C.: The class was good....A lot of reading..Weekly Discussion group session was fun....Its a very personal class....Be ready to be introspective and open about stuff in your childhood....Great prof....\"",
            "review 15: \"06S with Andrew C.: Incredible. Really. The best class at Dartmouth I've taken so far or will ever take. I've taken another class with Professor Garrod and he's a fantastic professor, but he's extraordinary at teaching adolescent development. The assignments are extremely interesting and I can honestly say that all of my work in this class was motivated by my interest in the subject rather than my interest in my grade. If I can only recommend one class at Dartmouth, this would be it. It will change your life.\"",
            "review 16: \"06S with Andrew C.: This class is fabulous...As everyone says, it is a lot of work but it is definitely worth it. Don't be intimidated by the work load because it's really mostly reading which it's not the end of the world if it doesn't get done, but you'll likely be really motivated to do it anyway. Garrod is amazing and this class is one of the best I've had!\"",
            "review 17: \"06S with Andrew C.: This class was a great overview of the different theories that exist relating to various views of adolescent development. Professor Garrod is one of the most knowledgeable and engaging professors that you will find at Dartmouth. He does take a long time to return papers and has very high expectations in grading, but you will learn a great deal in a short time. There are many readings, so it is important to keep up. This class is definitely useful for anyone interested in working with adolescents or interested in learning about their own adolescence through creative assignments.\"",
            "review 18: \"06S with Andrew C.: This is a really enjoyable class. It's more of an experience than a class. You are taught in so many different ways - weekly discussions on case studies, contemporary articles, theories, guest speakers, videos, novels - it's great, but very consuming. This is a class that can hit home really easily and will give you a lot of chances to look back at your own life and better understand yourself. Be prepared for a lot of work and a lot of emotional investment. You will get out of this course what you put into it.\"",
            "review 19: \"06S with Andrew C.: This is a fantastic course for anyone at Dartmouth. The material you read and study is so relevant to any college student. Anyone will be able to identify aspects of themselves or their friends in the various case studies and stages. There is a TON of assigned reading but you'll learn how to juggle it all and pick and choose. The majority is actually interesting too, and the lectures themselves we almost always engaging. I highly recommend the course!\"",
            "review 20: \"06S with Andrew C.: Garrod is probably the best prof I've had at Dartmouth (and I'm graduating), mostly because he does not shy away from addressing really important and relevant issues head on. He assigns good reading and brings in good guest lecturers, but it's quite a bit of work, and he makes a point of getting to know everyone and holding them accountable. The discussions can be pretty emotionally charged and sometimes uncomfortable, but good things come out of them. If you're looking for a class to cruise through, this isn't the one, but it is good. If you can, take Garrod's other course, Ed. 20, offered in the Fall.\"",
            "review 21: \"06S with Andrew C.: The material for this course is extremely interesting. I enjoyed going to class because Professor Garrod gives really effective lectures in which the entire class participates. Even with about 60 students in the class, he knew everyone's name within the first few days. Due to the nature of the class and the discussions, everyone really got to know a lot about each other. He would often bring in guest lectures as well, who were fascinating and very knowledgeable. Overall, the class was great. But.....there was a ton of work. The work was interesting, but still overwhelming at times.\""
        ],
        "Sean Kang": [
            "review 1: \"18F with Sean Kang: This class on the outside seems fairly straightforward and easy but sometimes Professor Kang would put stereotypical \"gotcha\" questions on his weekly \"pop\" quizzes about a certain phrase that was only mentioned once in a reading or during lecture. Overall, it was a fairly interesting class because we were able to learn and discuss about a wide range of topics. In addition to the 6 pop quizzes, there are debates (you only have to do one yourself in a small group that is randomly assigned) a reflection essay based on that debate and a final exam. The median was a B+ which may be due to the surprisingly difficult quizzes which may sink your grade. Also with each reading you have to post a discussion response but they can be as brief as you want. Professor Kang did not put any grades online all term so your grade is an mystery until the final grades are announced, unless you can remember what you got on every quiz.\""
        ]
    },
    "EDUC060": {
        "Daniel Ansari": [
            "review 1: \"05F with Daniel Ansari: THis course was far more sciency than i wanted. I wanted to study types of education accrss cultures, instead i learned about cognitive differences and linguistic differences and it wasnt as fun as i wanted it to be. THe prof is really amazing though.\"",
            "review 2: \"05F with Daniel Ansari: I really enjoyed ED 60. The material is fascinating. All the readings are current studies about education and culture (no textbook, you just print them off blackboard). The lectures are good and usually are combined with class discussions, little activities, or student presentations, so that helps keep things interesting. There is one midterm paper (6 page), one final paper (10 page), a presentation, and a cumulative final exam. I'd highly recommend this class if you're interested in education!\"",
            "review 3: \"05F with Daniel Ansari: Overall, ED 60 was an enriching and interesting class. Professor Ansari is extremely available, approachable, and enthusiastic about what he is teaching. He is an effective lecturer and the small class size created an intimate atmosphere, though the class was far fostering a seminar style environment. The readings are a good supplement to the lectures, not too long, and rather interesting. Additionally, you can print all of your readings off of blackboard, and you do not have to buy a text!! There is not a lot of work for the class overall, and you can spend more time enjoying the class lectures as opposed to worrying about memorizing lots of facts or doing a lot of reading. Overall, a good class.\""
        ],
        "Sean Kang": []
    },
    "EDUC057": {
        "Michele Tine": [
            "review 1: \"18S with Michele Tine: Really great professor. Exams and quizzes are very fair. Just make sure you start on the very large \"intervention / prevention project\" early because it is definitely a lot of work to complete. Would definitely recommend the class though!\"",
            "review 2: \"12S with Michele Tine: Course: Well-organized and relevant course. Professor: Very clear and engaging teaching style Workload: The workload doesn't seem to be heavy on the syllabus, but the two papers take a lot longer than they look. The tests are moderately difficult, but fair.\""
        ]
    },
    "EDUC056": {
        "David Kraemer": [
            "review 1: \"19W with David Kraemer: The class is almost entirely neuroscience, which I found super interesting. Prof Kraemer is a nice and engaging, and the social impact practicum is a cool component with the class and an opportunity to get to know the classmates that you work with for the project. If you go to class, take good notes, and study those notes, you will do well. Would recommend!\"",
            "review 2: \"18W with David Kraemer: Professor Kraemer is a really nice man and an easy-to-fair grader. This course is mostly just reading 3-4 journal articles about primary school math/science education, then coming in to lecture. Definitely a layup. You have 6 short pop quizes throughout the term, but if you read the abstract/conclusions in the articles and review your notes for 5 minutes before class, you can typically get 100s on them. You do one debate and write one position paper. Have one midterm and a final exam, both of which are very fair. Your final project is really cool - you get to write a lesson plan for a local organization that teaches kids of various ages STEM topics. A word of warning - this class definitely caters towards education minors and people who intend to teach primary school. The information you learn doesn't really apply to college-aged people. Also, Kraemer sometimes doesn't give much direction - there was no rubric for the position paper or lesson plan, both of which I had never written before. Overall, this is a super chill class, and if you're interested in education you should definitely take it.\""
        ],
        "Adam Kay": [
            "review 1: \"12W with Adam Kay: Course: The course was a discussion-based class. It was okay, but not spectacular. Professor: Professor Kay really cares about his students. Great prof. Workload: Light workload. Two lectures, a few papers, and a short final.\""
        ],
        "James K.": [
            "review 1: \"08S with James K.: I really liked Professor Nelson's style. He can initiate a great discussion without being overbearing. The class, which was a seminar, was pretty laid-back. The readings were interesting and the projects were fun to do.\""
        ],
        "Janine Scheiner": []
    },
    "EDUC055": {
        "Andrew C.": [
            "review 1: \"04S with Andrew C.: This is a really interesting course, and not just for education majors. Prof Garrod presents the material effectively, is interested in his students (and knows everyone's name by the 3rd class, even when there are 75 students). He also brings in great guests to lecture. Paper assignments include book reviews, personal narratives, and interviews. Best class at Dartmouth so far...\"",
            "review 2: \"04S with Andrew C.: This class was very interesting and entertaining. I highly recommend it to any non-major students with an interest in, but not passion for, education and psychology. The teacher's enthusiasm for the students and course was an added plus.\"",
            "review 3: \"04S with Andrew C.: This class is a great way to examine your own adolescent experiences and those of others through an academic lens. Professor Garrod helps to bring the material to life through films, discussion sections, readings, and creative testing. I am VERY glad that I took this course.\"",
            "review 4: \"04S with Andrew C.: Nobody's perfect, but when it comes to executing a college course well, Garrod comes closest to it. At times I felt bogged down because of a high level of subjectivity in the class (i.e. sometimes you're certain he has his \"favorites\"...apparently he ran a discussion section with his \"favorites\" in it.), but at the end of the day you realize that he's a good guy and pretty much likes all his students. If you're intensely private and not ready to open up your teenage years for introspection, don't take this class until you're ready to. Sometimes I feel like I would have gotten more out of the experience if I had been more ready to deal with the horror that is/was adolescence. All in all, everything was pretty simple. The grading was very straightforward --- except a participation grade of 15% that always seemed to be limbo. Not a particularly easy class to sail through, since it's hard to tell exactly what he's looking for, but this is one of those classes you have to take to make your Dartmouth experience totally worth the effort.\"",
            "review 5: \"03S with Andrew C.: Although I didn't really learn that much beyond pop culture psychobabble (the exception being a little bit about developmental theories of Piaget and Freud), I thouroughly enjoyed all of the things we read and discussed in class...after all, what's more fascinating than yourself? Taking a look back to (or actually, in my case around) adolescence is fun and illuminating. Even if the things you learn aren't going to be practically applicable to a career, they help you understand yourself a bit better. Papers were fun to write and discussions were interesting to listen to most of the time, although people (as always) have a tendency to monopolize discussion with trivialities.\"",
            "review 6: \"02S with Andrew C.: Garrod is an amazing prof. He invests a lot of time and interest in his students and made me think about issues that I hadn't really thought much about before. There is a lot of reading, some difficult papers, and a mandatory xhour every week, so be prepared to work- but it is well worth it. This is by far the best course I've taken here. Writing the autobiography at the end was very emotional but it has changed the way I view myself and my adolescence. Anyone who gets the chance should take this course- you'll leave seeing your past in a whole new light.\"",
            "review 7: \"02S with Andrew C.: I took this class as part of my ed minor and found it to be a wonderful experience, in large part due to the professor. Andrew Garrod makes a huge effort to help students in the class get to know each other, to learn everyone's name and to foster group discussion, not an easy task in a class of over 60. The material is interesting (especially the case studies that we discussed every week) but Professor Garrod really made the course for me. He shows a genuine interest in students and a genuine interest in the course work, and makes the class periods themselves really enjoyable. This course is a fair amount of work; there are three papers, a midterm and a final, plus x hour discussion sections and 3 movies outside of class. All in all, though, I think it's definitely worth it. The class is structured well and the material really makes you think about your own adolescence and how you've come to be the way you are.\"",
            "review 8: \"02S with Andrew C.: This course was REALLY awesome. Even if you don't have much of an interest in education, this course is great. It allows you to explore your own adolescence and it puts things into perspective. I'm really glad I got to take this course, and Garrod is a stellar prof. Don't miss out...sign up now!! Also, don't worry about the work-load -- it's definitely do-able.\"",
            "review 9: \"02S with Andrew C.: After taking Child Development and being enthralled by every minute of it, I expected adolescent development to be even more interesting, since it is a course about, well, ourselves. Unfortunately, it was not. The professor was overambitious in his subject matter--choosing far more to go over than we could-- and the class, too large for a discussion, was ineffective as a lecture class. The assignments were interesting, but graded hard. And the midterm may have been the closest thing to a high school exam I've had in quite some time.\""
        ],
        "Mary E.": [
            "review 1: \"05S with Mary E.: we've had one assignment so far and Casey hasn't handed it back in to us yet. I have no idea how i'm doing grade-wise in this course. the subject material is interesting, but really not based on scientific evidence-- it seems that all the theories are based on anecdotal evidence, at best. also, the lectures are totally disorganized. Casey is a visiting prof from Harvard, so maybe she's not used to the trimester system and doesn't know how to pace her lectures appropriately.\"",
            "review 2: \"05S with Mary E.: Mary Casey was a visiting graduate professor from Harvard, and was really an amazing prof. She really knew what she was talking about, and was very interested in the study of adolescents. She was, however, often late for class and disorganized. The lectures were very interesting and there was very little work outside of class that was mandatory. Our grade consisted of a take home midterm, a paper, and a take home final. Those were all very difficult and time consuming, but Casey was very easy in the grading. Overall, I thought it was a great class, though I would have appreciated a little more structure.\""
        ],
        "Sean Kang": []
    },
    "EDUC051": {
        "Kevin N.": [
            "review 1: \"05W with Kevin N.: I couldn't imagine taking a topic as interesting as Ed Pysch and making it boring, but Dunbar did. It's kind of sad that a person who is teaching about education and teaching lacks effective teaching skills.\"",
            "review 2: \"05W with Kevin N.: The title and description of the class sound really interesting, and this class definitely has potential to be a really cool class. However, the professor was very slow and only talked about each topic generally; we never went into any detail. It was a frustrating class for me because I'm a psychology major and a senior, so much of what we covering in this class was a review for me. However, if you are an underclassman without much of a background in education or psychology, I think you would find this class interesting and easy.\"",
            "review 3: \"05W with Kevin N.: I was really excited to take this class, I thought it would be really cool to learn about teaching a children. Dunbar is extremely scattered and boring. He seems incapable of communicating ideas effectively. He doesn't follow any of his own recommendations on how to teach effectively. I thought this was a big disappointment. Dunbar means well but doesn't communicate anything. You only have to go to class and study for an hour or two to do well on the exams.\"",
            "review 4: \"05W with Kevin N.: The readings were easy and the tests were easy. The material was interesting. Professor Dunbar clearly cares about his students and it showed.\"",
            "review 5: \"05W with Kevin N.: Prof. Dunbar is a really sweet man, and clearly has a lot of passion for his subject, but the class itself wasn't very interesting. Much of the material is completely obvious to anyone that has attended formal schooling. Dunbar's lectures were often disorganized and some of his interactions with the class seemed really forced. However, pretty easy class and you will pick up a few interesting tid bits here and there.\"",
            "review 6: \"05W with Kevin N.: Prof. Dunbar is really sweet and very knowledgeable. His lectures were not always above average, but he is clearly very interested in the material and this helps to engage the class. The work is definitely manageable and it's an interesting class. Prof. Dunbar is also very interested in student perspectives and has a lot of knowledge to share.\"",
            "review 7: \"05W with Kevin N.: Professor Dunbar is an effective lecture and usually gives very interesting lectures. The reading was okay - mostly from a textbook. There were two papers, a midterm, and a final. I thought the midterm didn't really test what we learned but the final did a better job of focusing on the main topics of the course.\"",
            "review 8: \"05W with Kevin N.: dunbar's lectures were boring; he repeated himself over and over again and a lot of what he said was very obvious/common sense. the readings were also really simple and often unnecessary. dunbar's a nice guy though, and an easy grader. this is a good class to take if perhaps you're taking 2 really hard classes and need a breather for your 3rd class. or if you just want an easy A. but don't expect to get much out of it... i didn't learn much and didn't feel motivated or challenged.\"",
            "review 9: \"05W with Kevin N.: This class could be much better than it actually was. For the first half of the class, pay attention, and do the readings. For the second half of hte class, you can pretty much veg. Sit through the lectures, but don't look at the readings until the end of the course. He'll give out a sheet with all the questions on it. You can just use that to study for the final. Overall, the class was a waste of time. Take Child Development or Language Acquisition instead. Although I have not taken them myself, they have a pretty solid reputation.\"",
            "review 10: \"05W with Kevin N.: Educational psych is definitely a good, easy class to take. Although the material is not always incredibly interesting it is certainly bearable and Prof Dunbar definitely gives good lectures. He adds humor along with a genuine passion for the subject. The class consists of two take home essays, a midterm, and a final in addition to daily readings.\"",
            "review 11: \"04W with Kevin N.: While Prof. Dunbar might not give the most inspiring lectures, he likes the material so much and gets so excited about teaching it that it makes you like it too. He is very responsive to students in and out of class, and there really isn't a lot of work at all in this class. It's a great 3rd class if you have 2 really hard ones\"",
            "review 12: \"04W with Kevin N.: Professor Dunbar is a wonderful professor. He inspires discussions and really brings the material into context, making it interesting. The class was fascinating and I would recommend it to anyone. If you do the readings and participate in class, you'll get a good grade and learn a lot.\"",
            "review 13: \"03W with Kevin N.: i still dont understand his grading system and i feel like we didnt cover anything that wasnt common sense\"",
            "review 14: \"02W with Kevin N.: I didn't need to take this class to know the material presented; it was all common sense, things that anyone who has ever had a good teacher knows from logical inference. Prof Dunbar is a nice guy and really is interested in seeing the class learn, but the material is just not very interesting. Take this class if you want an easy but fairly boring class without much work required.\"",
            "review 15: \"02W with Kevin N.: As an Psych major, Ed minor I was pretty psyched (excuse the pun) to take this class. And don't get me wrong, I'm glad I did. It was a very informative class requiring a decent amount of work (with both midterm and final papers as well as a final exam). However I was rather disappointed in the professor. Professor Dunbar is a great guy, but his grading of papers was rather unnerving. I wrote a decent midterm paper but certainly nothing spectacular - and received an A+. Has anyone else here not received an A+ in their entire Dartmouth career? Also, Professor Dunbar's lectures tend to be carbon copies of his powerpoint presentations, which tend to be carbon copies of the main points of the chapter. Rather than his lectures expanding upon the material they tended to repeat it. It's great to reinforce but one can only hear the same thing so many times before you get sick of it. I also had a bad experience with Professor Dunbar and blitzmail. I've blitzed him before without severe problems, but three days before our final papers were due I blitzed him with some questions about the setup of the paper. He never replied. This was Professor Dunbar's first class taught at Dartmouth and certainly with time he'll adjust to the Dartmouth grading/email/lecture system. And the material was very interesting. So I guess what I'm saying is take this class - but know what you're in for.\"",
            "review 16: \"02W with Kevin N.: I absolutely loved this class- Dunbar is one of the most accomodating, responsive teachers. He even gave us an extension on our midterm papers because some students claimed they were \"stressed out\" from other midterms. He wants to make this class a great experience, in which he is successful. I think the material is definitely interesting, but it's Dunbar's style that makes the class. I highly recommend this class.\"",
            "review 17: \"02W with Kevin N.: This class skimmed the surface of several huge psychological issues in education and learning. There is one written take home midterm paper, one final 10 page paper, and one final exam with 7 short essay questions. The lecture notes are always handed out in the beginning of class. Sometimes class got boring, but Prof. Dunbar tried to keep it exciting. He is a really good guy. We also had 4 discussion sections (a nice break from lecture!).\"",
            "review 18: \"02W with Kevin N.: This was one of the best classes that I have taken at Dartmouth. The material is awesome. I plan to go into teaching, but Prof. Dunbar also make the course work for students who were trying to learn about themselves as students. He was available outside of class. His lectures brought in his experiences better than a lot of other profs. A must take class if you want to learn about yourself and the educational world we live in.\""
        ],
        "David Kraemer": [
            "review 1: \"19S with David Kraemer: Prof Kraemer is approachable, helpful, and knows his stuff. Highly recommend taking if you are interested in the policy-side of education\"",
            "review 2: \"18S with David Kraemer: Kraemer is a nice prof, kinda all over the place but knows his stuff! The class has two midterms, a debate and a research project with that debate group. Not too much work, definitely doable!\""
        ]
    },
    "EDUC050": {
        "Donna Coch": [
            "review 1: \"23S with Donna Coch: The material is very interesting especially if you want to go into education but Professor Coch is a very harsh grader for papers which are basically 50% of your grade. There is a lot of reading and pop quizzes as well which could be difficult if you weren't able to read for detail. She will give extensions and does care but is just very traditional. If you are going to take this class, I recommend NRO-ing it.\"",
            "review 2: \"23S with Donna Coch: Terrible - she doesn't care at all and grades super harshly. Met with her about 6 times per paper just to get a C on my papers. Don't take this it sucks\"",
            "review 3: \"23S with Donna Coch: I do not recommend this course - she is a very harsh grader on essays and provides little feedback and instruction for what you need to do to fix things. You spend too much time trying to figure out how to please her in your writing that you do not even get to enjoy learning the content. Even if you are an education minor I suggest finding different EDUC courses to take because this is not worth it.\"",
            "review 4: \"09S with Donna Coch: Wow, this was kinda grim. She's very smart, but just uninspiring.\"",
            "review 5: \"08S with Donna Coch: Hard, but interesting and worth it. Coch is dry at some points, but knows so much and is so fair.\"",
            "review 6: \"08S with Donna Coch: This course was interesting from both a neuroscience and education view. It was well-taught. The readings could be boring sometimes, and there were pop reading quizzes, but they weren't too difficult if you just skim the reading the night before. Most of the grade was papers. Prof. Coch grades pretty toughly, but she's fair. Overall, worth taking for a neuroscience elective.\"",
            "review 7: \"08S with Donna Coch: This class was okay, but I wasn't wowed by it. Professor Coch was adequate, but she seemed very formal and strict. I don't know exactly how to explain it, but if you take the class, you'll see what I mean. I took the class for my neuroscience major, and there was probably too much education and not enough brain stuff for my taste.\"",
            "review 8: \"07S with Donna Coch: This course is a 9L, consists of powerpoint lectures, and requires a lot of reading, so if that's not good for you, you won't like it. Prof. Coch is extremely knowledgable, responsive, and fair. She's very by-the-book, so she won't screw you over but you won't be able to slide on things either. The course: 3 papers (3-5 pages) on any topic that interested us pertaining to the lectures, 8 pop quizzes on the reading, a final with multiple choice, fill in the blank, short answer, and essay questions, and a participation grade. Overall, a good course if you're interested in reading and education.\"",
            "review 9: \"06S with Donna Coch: This class sounds boring in its description, but for those pursuing teaching, it is an essential class, especially for elementary school teaching. It provides an in-depth understanding of the process of reading, where it fails, and how best to teach it.\"",
            "review 10: \"06S with Donna Coch: interesting class if you're interested in teaching. a lot of reading, but only 3 short papers and a final. hard grader but very knowledgeable in terms of course material. I got a lot out of the class.\""
        ]
    },
    "EDUC048": {
        "Jay Davis": [
            "review 1: \"07F with Jay Davis: ED48 is a project-based course which looks first at an urban school system in Dorchester, Massachusetts. This phase includes a two-day trip to the high school there where you get to observe classes and talk to faculty to get a different perspective (i.e., not an Upper Valley one) on public education. The second project is a look at one specific student of yours who struggles in your class. You get to shadow the student and identify an action plan to help the student to succeed in the future. Both projects are useful supplements to the Teacher Education Program and provide good experience for any teacher.\""
        ]
    },
    "EDUC047": {
        "Michele Tine": [
            "review 1: \"23W with Michele Tine: One of my favorite classes I've taken. You can't not love Prof. Tine, and the workload is manageable. Definitely recommend\"",
            "review 2: \"23W with Michele Tine: This is an AMAZING class. I really believe Tine is the best lecturer at this school. You can just tell how much she cares about what she's doing every day and she always says \"this is my dream job\" which is adorable. Course topics are very interesting and follow relatively the same flow each lecture so the material is easy to manage. Her exams are just memorization so it's relatively straightforward studying and knowing if you've prepared well enough or not. For the majority of the term, there are not a lot of assignments (you watch ~13 hours of a TV show the first few weeks but it is interesting, and the readings can be skimmed as much as you need them for some discussion posts), but there is quite a bit during finals. There is a final exam and a major project, and if you save the project until finals week to start (as I'm pretty sure the entire class did), you might be pretty screwed. While it's a lot of work, the project is really interesting and lets you dig deep into something that you care about. Overall awesome class and would really recommend, just definitely be on top of your stuff before/during finals.\"",
            "review 3: \"23W with Michele Tine: I LOVED this class. Tine is a fantastic prof who puts a lot time into making the class great - she makes lectures interesting, incorporates great discussion/activities, gives really great assignments, and gives the most thoughtful feedback I've ever received from a prof. The class is a somewhat layup - there are readings for each class but they're covered in the lectures, and none of the assignments during the term are too bad. You have to watch a 13-15 hour video series at the beginning, but the stakes are not high, and the other assignments are pretty minimal and meaningful! I will say that the exams are just regurgitating the material, so if you don't test well/have a good memory, that can be hard. Finally, the term ends with a final test and a final project, which is a LOT. Definitely ideal to get ahead on the project, although I did all of mine in three days. It really picks up at the end, but it is so worth it! Super interesting and important to know!\"",
            "review 4: \"22W with Michele Tine: I absolutely loved this class. Prof Tine is the best, and gave super interesting and engaging lectures. The workload for this course is definitely more than other education classes I've taken, so I definitely wouldn't call it a lay up; if you're willing to spend a fair amount of time on the work, though, it is an incredibly manageable and very rewarding course!\"",
            "review 5: \"22W with Michele Tine: Tine is such a queen - great lecturer, caring, and super helpful and approachable. The class does have a decent amount of work, especially at the end of the term, but it's all really fascinating and 'relatable' material. Workload included discussion posts/responses, a short 3 pg paper, 2 super short activities, 2 short group activities, 1 midterm, 1 final, and a big project. Pretty manageable overall. Highly recommend for anyone even remotely interested in the topic!\"",
            "review 6: \"22W with Michele Tine: Like everybody says, Tine is an incredible professor and one of the top three I've had at Dartmouth without question. This class is interesting whether or not you are an Education minor. Every lecture laid out a concept related to development, talked about the outcomes related to the concept, and the neurological underpinnings. Overall, you will leave with an understanding of a breadth of concepts that help you to re-evaluate your own development and recognize patterns in the development of others. The workload for this class is quite heavy, even compared to Tine's other classes. There is a lot of reading for each class, although nothing is on exams that isn't explicitly covered in lectures. The main point of frustration for me was the end of term project, which was given in addition to the final. The project was a paper that turned out to be roughly 20 pages for me and required research, synthesis, and obviously a lot of writing. I thought that the project was useful but would have appreciated if it were assigned in chunks over the course of the term instead of all in the last two weeks, coinciding with finals.\"",
            "review 7: \"21S with Michele Tine: Heads up, this isn't a layup as much as I expected- but still a fun class! The topics were not too difficult and were really interesting. It was cool to look at human development from an education perspective, and we got to see a new topic each week to keep things interesting. There was a fair amount of work for the final paper/project so be prepared for that. Prof. Tine is kind of an angel. Not too difficult in the end, just need to put in the time, and it was fun!\""
        ],
        "Jay Davis": [
            "review 1: \"07F with Jay Davis: This is it! ED47 is the actual Student Teaching Internship at a local high school. You're there the whole day, you teach 2 1/2 classes, you lecture, you make lesson plans, you write, grade, and go over the exams, you do the grades, you attend the meetings, it's all you! Expect to spend the vast, vast majority of your time this term doing work for this \"class.\" It is an unbelievably valuable time, and goes incredibly slowly in the middle of it, and rapid-fire fast at the end. It is challenging (obviously), and the learning curve is steep. At the end you will be a better teacher whether you like it or not! Through observations by Jay and constant contact with your Mentor Teacher you will be better equipped to teach your students. It is fun, exciting, and rewarding even while it is difficult and tests your desire to actually teach high school. If you're undeniably passionate about teaching high school, then the Secondary Teacher Education Program is for you.\""
        ]
    },
    "EDUC046": {
        "David Kraemer": [
            "review 1: \"21W with David Kraemer: This class was actually way more interesting than I thought it would be, which was a pleasant surprise. I did it asynchronously, so it was a bit different from how it was in the past. We had two midterm exams, three quizzes (even though he originally said there would be 6), and two papers. My only issue with this class is that the professor was seriously behind on grading. I waited about a month after taking the first midterm until someone said he doesn't really keep up with grading and usually just hands out one final grade. Despite this, I would still recommend taking this class, especially if you can do it in person since it seems like it would be even better then.\"",
            "review 2: \"19W with David Kraemer: The older reviews for this class are very outdated. The content of this class currently includes the neuroscience and psychology of learning in STEM courses, especially math and science. This class has reasonable pop quizzes, two debates (you participate in one and are an audience member for the other), two exams, and a group project involving a social impact practicum that includes a presentation and a group paper. This is a fun class if you're interested in the material and professor Kraemer is a nice prof who is engaging in class. I highly recommend this class, but it is not a layup. It has a decent amount of reading and the workload can feel like a lot, especially at the end of the term.\"",
            "review 3: \"19W with David Kraemer: The class is almost entirely neuroscience, which I found super interesting. Prof Kraemer is a nice and engaging, and the social impact practicum is a cool component with the class and an opportunity to get to know the classmates that you work with for the project. Would recommend!\"",
            "review 4: \"19W with David Kraemer: I'd consider this class to be more on the end of a layup. If you don't read everything (which you shouldn't be in a psychology class anyway), the amount of things you need to actually turn in isn't that much. The debates, papers, and final project aren't too much, honestly. They're relatively short, so I'd consider this to be an average-workload class. Really interesting material too!\""
        ],
        "Jay Davis": [
            "review 1: \"07F with Jay Davis: ED46 is the seminar that accompanies the student teaching internship during the fall following the spring in which you take ED45. The seminar meets twice weekly for two hours each session and you discuss readings, hand in lesson plans, journal entries, you have guest speakers, and you discuss the many, many different aspects of education and teaching. It is a valuable time but is not as much of a \"release\" as would be helpful (you have to find that time on your own). The readings are rarely discussed, and could be useful if you did them on your own time (not necessarily by the date stated in the syllabus). It is right after school so sometimes it's tough to get there on time, and for that reason you will more than once regret having the seminar, but you will appreciate it (even just a little bit) at the end.\"",
            "review 2: \"03F with Jay Davis: Ed 46 is part of Dartmouth's teacher prep program--students spend their days working in a high school or a middle school teaching at least 2 classes completely on their own, co-teaching a 3rd class with a mentor teacher, and observing other teachers. Ed 20 provides a great background on the American education system, but you need to student teach to get a feel for what things are really like. The on-campus part of the course takes place in the seminar, which meets twice a week for two hours. There, readings are discussed, as well as different theoreis and strategies about teaching. Students also get to take a two-day trip to Dorchester, MA to see how urban education is different from the bubble that is the upper valley. If you're passionate about education, interview for the teacher prep program and take this course.\""
        ]
    },
    "EDUC045": {
        "Jay Davis": [
            "review 1: \"08S with Jay Davis: This course is really for people who are going into teaching or preparing to teach in the Marshall Islands with the ed dept program. I would suggest it for people who have a possible interest in teaching in the future, I would not suggest it for people who have an interest in education but not in teaching. Professor Davis is great and super responsive both inside of class and out and knows his students really well and is very caring, but his classes are sometimes run like middle school classes and the readings are really hit or miss. The time in the classrooms is great and Prof Davis is good at preparing you for it and supporting you throughout it.\"",
            "review 2: \"07S with Jay Davis: Take this course - you won't regret it! It's a big time commitment - you have to be in schools 8-10 hours a week, in addition to the readings, journals, presentations, etc. But it is worth it! Jay Davis is really wonderful and caring and you will learn so much. You will also build great relationships with other students in the class.\"",
            "review 3: \"07S with Jay Davis: . . . and find out just how tough, rewarding, time-consuming, enlightening, frustrating, worthwhile . . . well, you get the picture. If you are looking at this review, then you are interested in teaching (most likely), so you should seriously consider taking this teaching practicum course. If you are in the Teacher Education Program or are going to the Marshall Islands, then you will certainly take this class. You will probably be amazed at the sheer amount of work that goes into this course (it really should count for two, but that will never happen as long as lab courses are not). In addition to the 10A seminar with more reading than you can handle, weekly (and lengthy) required journal entries, and whatever else class preparation/projects/presentations are needed, you are required (expected) to spend eight-to-ten hours weekly in a local high school observing and then, eventually, teaching, after which you must submit all lesson plans (highly-detailed, of course) created. Do not consider taking four classes or working at any jobs during this term unless it really works into your schedule/you really need the money because the school observation and seminar can easily dominate your spring term. Prof. Davis is an engaging and enlightening lecturer and this class will require you to take a look at education in general and education specifically in the public high school system. Be warned that a lot of the work you do for this class will not be counted as part of your grade and you will not technically receive credit for it. Also, the class is by no means an \"easy 'A.'\" In other words, only those incredibly passionate future-teachers out there should enroll in this course! But if you do, you will be very pleased in the end.\"",
            "review 4: \"06S with Jay Davis: Whether or not you are actually in the teacher certification program, or headed to the Marshall islands (both of which would get you into the class) you should take this class if you think theres a possibility you might ever want to teach in the future. Jay Davis is amazing as a prof, the two hour classes fly by. 8-10 hours observing (with a little teaching) in a local school are part of the course and incredibily eye-opening. The only assessments in the class are about preparing you to teach for a week sometime at the end of term. This class is refreshingly practical and hands-on; really, take it if you've got the chance, because it'll give you a much better idea of what teaching is really about.\"",
            "review 5: \"05S with Jay Davis: Everyone should be required to take this course -- absolutely amazing!! By far the best course I have taken at Dartmouth.\"",
            "review 6: \"05S with Jay Davis: I benefited more from this class than any other class at Dartmouth. But, it is A LOT of work. The work isn't too hard, it IS necessary but it take a lot of time. It is worth it.\""
        ]
    },
    "EDUC042": {
        "Janet Zullo": [
            "review 1: \"09F with Janet Zullo: This course was probably the most frustrating course I have ever taken at Dartmouth. In addition to the course being 17 weeks long and having a 40 hour practicum outside of the course, the professor is disorganized, irritating and offensive. There was no set syllabus during the semester and classes were always subject to change. The work load was literally unmanageable and irrelevant. There are two professional portfolios that you have to complete by the end of the semester. My portfolio was 140 pages. THIS CLASS IS NOT WORTH IT. However, the worst part of the class is the professor herself. She is repetitive, condescending and DISORGANIZED. There are so many other ways to teach. You can teach in a charter school or join TFA or even apply for an emergency teaching license in a state. I would highly suggest that you earn your teacher certification another way. Were it not for the amount of time and energy I had already invested, I would have dropped out a long time ago.\"",
            "review 2: \"04F with Janet Zullo: This was the best term I had at Dartmouth. The teacher is great and gives you all of her time in and out of class. You will learn more in this class then you will in any other class at Dartmouth.\"",
            "review 3: \"04F with Janet Zullo: Being a part of the Teacher Education Program (TEP) was the best thing I have done at Dartmouth. I absolutely loved it and Profesor Zullo is amazing!\"",
            "review 4: \"04F with Janet Zullo: Professor Zullo is very enthusiastic about what she teaches and the class(es) benefit a lot for her invovlement and interest.\"",
            "review 5: \"02F with Janet Zullo: For anyone interested in teaching - public or private - this is the course for you. The class size is small and the professors are deeply invested in your learning. The course is directly connected to a full time student teaching component. It is one of the best courses I have taken at Dartmouth because it has been and will be the most useful. I will use all of the things that I have learned during this course in the teaching that I plan to do for years to come. I can't imagine walking into a classroom without having this work. The program is wonderfully individualized and both the students and professors are very supportive.\""
        ]
    },
    "EDUC041": {
        "Janet Zullo": [
            "review 1: \"06S with Janet Zullo: You'll learn a lot of amazing life skills in this class. even if you haven't been thinking about teaching, this might make you want to think about it. It's time consuming and emotionally taxing, but also pretty rewarding. This class was especially difficult for me because I'm philosophically opposed to a lot of the structures and priorities of the American school system, but I'm still glad I took it. Certainly makes my top 3 at Dartmouth.\"",
            "review 2: \"05S with Janet Zullo: This class takes over your life. In the end though, it's worth it. One of the best classes I've taken at Dartmouth.\"",
            "review 3: \"04S with Janet Zullo: If you are interested in education or teaching at some point in your life you should take this class. You will learn a lot that will be so valuable to you later when you want to teach public or private school. It was one of the best classes I have taken at Darmouth.\""
        ],
        "Amanda Bean": [],
        "Susan Finer": []
    },
    "EDUC029": {
        "Kimberly M.": [
            "review 1: \"07W with Kimberly M.: Professor Williams is really engaged in the material, and loves discussion. There is a lot of work, but you learn so much, and she rewards hard work with good grades. Definitely worth the time.\"",
            "review 2: \"07W with Kimberly M.: Honestly, this course made my senior winter. Professor Williams is the coolest prof and is SO interested in the subject material and in her students. I felt so encouraged and inspired. The material is really interesting, though at times long and dense, but overall I feel like I have such a better sense of policy and politics in our educational system. She's just so cool and I would encourage anyone who can to take this course.\"",
            "review 3: \"07W with Kimberly M.: I loved this class. It was incredibly interesting, and definitely doable for anybody, even if you have never taken an education class before. Totally interesting, with issues that apply to today's scene. Williams is an amazing professor who truly believes in the value of learning.\"",
            "review 4: \"07F with Kimberly M.: This class was really interesting, although I procrastinated on the readings (that we had to write a short paper on weekly) so I crammed a lot during the weekends. There was a little too much student discussion and not so much guidance from the professor, though. I wouldn't have minded a little bit of lecturing from the professor. Overall really interesting - I would definitely take more education courses in the future!\"",
            "review 5: \"07F with Kimberly M.: Professor Williams as well as the class are amazing. It is discussion led and she puts the material into students hands (debates, discussion leaders) but it inspires a lot of talking and she relies on student feedback and experiences to promote discussion. There is a paper due every week as well as a final paper and several projects but it's worth it and the readings and shows are very interesting when i can be a lot - it's worth it! Take this class!\"",
            "review 6: \"07F with Kimberly M.: Wonderful class! I absolutely loooove Prof. Williams. She is inspiring and incredibly engaging. Classes are almost all discussion based, with weekly papers summarizing the reading. The reading and the papers get a little overwhelming if you don't stay on top of your work, but this class is definitely worth all the hours!\"",
            "review 7: \"07F with Kimberly M.: The prof is absolutely amazing. She makes you approach the issues discussed in class from many different viewpoints and helps you broaden your thinking. I would recommend this class to anyone, whether you're interested in education and policy or not.\"",
            "review 8: \"07F with Kimberly M.: the class is really interesting but it's kind of a lot of work (you have to write a paper every week on the readings) but she's a very fair grader and it's worth it and you probably don't actually have to read all of it professor williams is actually amazing and so nice and invites you to her house for thanksgiving and is such a mom -- shes amazing take this class or another class with her\"",
            "review 9: \"07F with Kimberly M.: The subject matter is really interesting - everyone gets involved in discussions and looks forward to class time. Only used one X-hour. Work load is very manageable - 5-page reaction/summary papers each week that are really easy to write and easily graded. Two debates are automatic As and leading one class discussion. Final paper really manageable and easy to write. Subject matter is so interesting that all the assignments are enjoyable. Williams is an incredible prof. She's really knowledgeable and funny and makes class fun and interesting. Always available outside of class for questions about class, or just talking about education and life. Take this class!\"",
            "review 10: \"07F with Kimberly M.: This class was an incredible experience. Even if you don't think you are interested in ed policy, you should take this class. Williams is an incredible prof, and teaches the material in a way that everyone finds it interesting. She is very nice and very supportive and an easy grader, which allows you to learn the material instead of stressing over grades. The papers each week reinforced the readings and were very helpful. TAKE THIS CLASS! YOU WILL NOT REGRET IT!\"",
            "review 11: \"07F with Kimberly M.: The course was amazing! It looked like an interesting course based on the course description, but it was even better than I expected. Professor Williams did not give lectures each class. She facilitated classroom discussion, yet still managed to teach the material during the discussions. I was considering pursuing a career in education policy, and this class inspired a greater interest in the subject. Take this class!\"",
            "review 12: \"07F with Kimberly M.: Not only is the material really interesting in this class, but Professor Williams is an amazing, understanding professor who actively engages all students. She is soo funny and enthusiastic about the class that everyone loves her. She even invited those who couldn't go home for Thanksgiving to celebrate the holiday with her family. The workload is a bit heavy with lots of reading and a 4 page reflection paper on the reading due every week. In addition, each student must be in two debates and lead one presentation on the reading. If you choose a topic that you really enjoy, then the last paper is not bad to write. Take this course!\"",
            "review 13: \"07F with Kimberly M.: Take this class!!! Professor Williams is absolutely amazing, and she was incredible! This class explores interesting educational policies, which all students should learn about. It was an amazing class.\"",
            "review 14: \"05S with Kimberly M.: This course was a great overview of currents issue in educational policy. It was great to learn about issues that are currently in the news and are disputed by government officials continually. Williams was a friendly, incredibly dynamic prof - it's just unfortunate for those people who weren't in this course that she was only here for the term. In any case, everyone should learn about these topics!\"",
            "review 15: \"05S with Kimberly M.: Professor Williams is very knowledgeable, experienced, and personable. The class has a lot of reading, but most of it is relevant and interesting. Reading is essentialy required because reflections are due weekly and the class is centered around discussion and group projects. Great Class!\""
        ],
        "Brendan F.": [
            "review 1: \"02W with Brendan F.: I entered the class with the hopes of gaining an understanding of different educational issues and becoming conversant in the details of the controversies that make up Ed. policy. This is the objective of the course, according to the ORC. Unfortunately, I was disappointed in this regard. The only educational policy that we saw was an analysis of 4-5 specific, narrow cases of educational reform. Don't expect this class to give you an understanding of large scale educational issues - it won't. The class focused instead on leadership development - ways of building influence and challenging existing establishments to change. This WAS valuble, and applicable to my own career plans, even though I would have preferred to learn about the material in the ORC. Unfortunately, a lot of time was spent (wasted?) on class discussions that really didn't go far. People really struggled to apply the concepts to Ed. policy, because they weren't provided with a factual foundation on which to discuss the issues of Ed. policy. Prof. O'Day was an excellent prof in terms of getting to know students, although he seemed afraid to let his knowledge of Ed. Policy serve as a resource in class discussions. He didn't want to lecture, but perhaps some of that would have been useful in creating better discussions. He also likes to play a lot of mind games with the class, to illustrate various principles. All in all, this was not a bad class, and I definitely learned something useful from it, although NOT Educational Policy. This class should be re-named \"Educational Leadership.\" Buyer beware - check with the professor before enrolling, because you probably aren't signing up for the course described in the ORC!\"",
            "review 2: \"02W with Brendan F.: So this course isn't exactly what the ORC says it will be. We actually spent very little time discussing actual current education issues, which was somewhat of a disappointment. But the material we did cover, mostly about leadership and formulating effective policy, was extremely worthwhile, and at the risk of sounding cheesy, really applicable to our lives now and in the future. Prof. O'Day is young and accessible, and especially as a Dartmouth alum, the class felt really comfortable having discussions about a huge range of topics. He is the best reason to take this course, and he were to teach another course, I would take it in a second.\"",
            "review 3: \"02W with Brendan F.: This class was about leadership and getting things done, rather than really about education per se. i learned the most when i didn't think i was learning. we didn't memorize anything in this class. but rather i slowly adapted a new way to think about problems. you've got to be ready to learn in a weird way in order to enjoy this class. it also helps if you enjoy participating in class. the professor determined how this class was and what i learned from it.\"",
            "review 4: \"02W with Brendan F.: Although the course was interesting because I personally enjoy learning about leadership, it had little (if any) relation to education or the course description in the ORC. O'Day tends to let the class have a large amount of latitude with the way the course is run which can be beneficial at times, but he tends to let it get out of hand. We studied few recent policy developments in education with two exceptions: the tracking policies of one Boston High School and a more general study of charter schools (seeking this type of discourse, I found this to be the most interesting part of the course). I do not think that O'Day is a bad professor, just that he does not seem to be interested in teaching the course material as described in the ORC. If he were teaching a leadership course, I think he would be a fascinating prof, unfortunately this did not occur.\""
        ],
        "Michael Harris": [
            "review 1: \"11W with Michael Harris: If you are going into public policy of any kind, you need to take this class. It is a fantastic introduction to the educational system in the United States in a very positive environment. Professor Harris is fantastic. A couple reaction papers and 3 real papers in addition to a final exam. The papers were all very reasonable if you tried your best and listened to his feedback. There's quite a bit to study for the final (which is almost all memorization) but the good thing is that a lot of the things you need to know by then are things you've been discussing all term, so it shouldn't be \"crazy\" or anything. Absolutely great class. Strongly recommend it to any future leaders out there.\"",
            "review 2: \"11W with Michael Harris: Course: This is a wonderful course for anyone interested in education issues. Professor: Professor Harris was great. His experience as a superintendent greatly added to the course. Workload: The workload was very manageable.\""
        ],
        "Peter Rodis": [
            "review 1: \"09W with Peter Rodis: Professor Rodis is awesome. The class was about 80% discussion, and 20% lectures. The lectures were sometimes led by Prof Rodis and sometimes led by students. There was a lot of reading for the class, and we had 4 pop quizzes on the reading. However, as long as you knew the main idea of each article, you didn't really need to read the whole article to do well on the quizzes. The other grades were an in-class presentation, a midterm that you didn't really need to study for, and a 10-12 page final paper on any topic you want. Prof. Rodis teaches grad students and this was his first time teaching undergrads in about 4 years. If he teaches another course for undergrads, I will definitely sign-up for it.\"",
            "review 2: \"09W with Peter Rodis: I can't believe that I paid tuition for this course. Here's what I hated about it: -Professor Rodis never actually lectured; he would speak to the class but only to raise provocative points but not to actually teach anything. He assigned loads of reading but we never discussed it in class. When readings did come up, it was in student presentations. Each class consisted of 1-2 presentations from students and essentially we did the teaching. -Professor Rodis' grading was ridiculous. There are 100 points possible in the entire course so when you miss points on the quiz or presentation or exam, you're losing points from your overall grade. It was possible to get an A- on everything but a B+ as a grade. -Professor Rodis' expectations were not clear. He provided us with rubrics for both the presentations and the paper; when we got our presentation grades back, he took off for things clearly not on the rubric. Given how little he actually \"taught\" in class, his expectations for us were completely unmatched and ridiculous. -The entire class was discussion; after the first week when we all had said something, it was easy to figure out how everyone would comment on everything else. Plus, Professor Rodis presented everything as black and white, only enhancing the repetitiveness of everybody's comments. And what's worse, it was so extremely liberal and biased... I really didn't learn anything that I didn't already know by taking this class. It was two hours of discussion about education issues per class and frankly, I don't think it was worth paying for.\""
        ],
        "Robert Binswanger": [
            "review 1: \"02S with Robert Binswanger: Fairly interesting course in terms of material covered. However, Binswanger's teaching strategies didn't set well with me. He singled out a few students and picked on them all term. I wasn't one of those he picked on, but felt terrible for my classmates as he berated them. He created a negative learning environment, as students became afraid to speak for free of being humiliated. Also, visiting him during office hours was a trying experience. He once yelled at me for an hour. Assignments were often vaguely worded, yet were expected to be very precise. The exact instructions were apparent later, after he had already graded students down for not meeting them.\""
        ],
        "Janine Scheiner": []
    },
    "EDUC020": {
        "Andrew C.": [
            "review 1: \"08F with Andrew C.: That this course isn't offered anymore. If it is, take it.\"",
            "review 2: \"08F with Andrew C.: I had read some reviews of past Ed 20's where the class supposedly was a life-changing experience and didn't really take them seriously, but now I'm a believer. For someone like me who was on the edge about whether I wanted to become a teacher or not, my fate was sealed just a few weeks into the term. Just being exposed to some of the major issues in American education was enough to uncover my passion for the profession, and between the lectures, readings, discussions, and movies, I was hit from all angles and had an educational experience unlike any other. I am so grateful for Prof Garrod and the Ed department for really setting my life into the right direction, and I feel bad that the class is ending and that so many hundreds of students won't be able to take the course in the coming years. My advice...try to take classes with Jay Davis, and if you think you might want to be a teacher, don't let other people direct the course of your life for you.\"",
            "review 3: \"08F with Andrew C.: to take this class taught be Andrew Garrod for the last time. Professor Garrod inspired us to think critically and work hard while tapping into the experiences of every individual in the class and challenging our previous perspectives. The readings are awesome, the tests were tough but okay if you had done all the readings but could be nitpicky and frustrating at times too. The TA's were used a lot and greatly enhanced the class.\"",
            "review 4: \"08F with Andrew C.: the only negative thing i have to say about this class is that more people canâ€™t take it. the class thoroughly examines the problems facing the american education system with a lot of readings and guest lecturers on almost every topic. in a way, it also asks you to examine your own life and educational experience, and what youâ€™re going to do with an opportunity like dartmouth. it can make you appreciate the teachers who made a difference in your own education even more. it can inspire you to become a teacher yourself and try to fix the challenges in public education. every student should take a class like this.\"",
            "review 5: \"08F with Andrew C.: lives up to the hype. take this class. garrod is an incredible lecturer, but there are so many guest speakers (from all across the board, all dynamic and engaging and relevant) that garrod rarely lectures himself. this class should be required for all Dartmouth students.\"",
            "review 6: \"08F with Andrew C.: There was a lot of reading, but it was worth doing it for what I got out of it. It's also worth doing the reading on time and keeping up because it makes the lectures, discussion groups, and movies that much more valuable. The class made me reexamine not only my perception of the US edcuational system but also my life.\"",
            "review 7: \"08F with Andrew C.: Best class at dartmouth, period. It will be a shame if this course is not offered again, because Garrod is retiring from teaching.\"",
            "review 8: \"08F with Andrew C.: I only hope they keep offering it in some semblance of its current form.\"",
            "review 9: \"08F with Andrew C.: This review will probably be irrelevant since it's the last section of Ed20, maybe ever. Nevertheless, this was probably one of the best and noteworthy classes in Dartmouth's history (it's been around for awhile). It covered all topics of education and its societal connections, and was extremely rigorous, with sometimes overwhelming amounts of readings, very extensive 'quizzes,' and papers. However, Garrod makes it all worth it as captivating and humorous lecturer, who is so genuinely invested in the material and each and every one of his students that the standing ovation on the last class of the year was well worth it. If there's any chance that this class comes back, even with a different teacher, don't hesitate, take it.\"",
            "review 10: \"07F with Andrew C.: This is an interesting course with a LOT of reading. Many describe it as life-changing. I would contend that it's life changing for the incredibly naive, as Garrod's point is that great inequalities exist in the American educational system. If you read slowly, don't take the course. If you read quickly - yay! You'll learn a lot.\"",
            "review 11: \"07F with Andrew C.: I cannot recommend this class highly enough. Everyone should take this regardless of major because the material is absolutely fascinating. That being said, do not take this as a third class. I did more work for this class than any other in my college career. Be prepared to spend a lot of quality time in the library curled up with your readers (there are three of them!) and books. And by read, I really mean it! Some of the quiz questions are rather specific. The first draft of your first paper will be a nightmare, but after that they are fairly straightforward. Take advantage of the TAs as they can be very helpful. There are also five mandatory movie nights and weekly discussion sections. Do not let this scare you away! Every bit of work I put into this course was well worth the effort. I learned so much about not only educational problems, but social injustices in general. I am almost ashamed of how naive I was upon entering this course. I honestly feel like a much better person because I am more aware of things I had previous ignored or taken for granted. Garrod inspires such passion for the subject that I am seriously considering completing the teacher certification program, which is something I would have never even thought about before. Even if you have no interest in education, please take this class. I guarantee that you will not regret it and you will come away changed.\"",
            "review 12: \"07F with Andrew C.: I feel like this is one of those classes that should be a requirement for graduation. After spending over 12 years in the education system, (for me, 16) now you finally get to step back and really examine it. You look at diverse issues such as racial and gender inequalities, socioeconomic status, sexuality, varsity sports, teaching about democracy, ways of teaching, cheating, etc. This is a course that really makes you think, and Garrod is just so knowledgeable and understanding with his students. He just really wants you to succeed. It is a lot of work, and a lot of reading. I did it all, but I know of many people who didn't and still did relatively well. But his quizzes do try to see that you've read pretty much all of the assigned readings. Basically 1 movie per week, but you only have the go to 5. Grading is very straight-forward. Interesting writing exercises (more creative pieces) and 2 reading critiques, for a total of 4 3-page papers, but you get drafts in the exercises that you go over with the TA's.\"",
            "review 13: \"07F with Andrew C.: Very enjoyable and interesting.\"",
            "review 14: \"07F with Andrew C.: A great class. There is a TON of work for the class, and while it seems too much at times, it is really engaging material. There are movies once a week in the evening; the x-hour is used as a TA-led small discussion group; and outside of that you'll be doing lots and lots of reading (3 readers worth). Definitely a class where you have to stay on top of the material, but I still feel like the material affects me in more areas than just \"education in America\".\"",
            "review 15: \"07F with Andrew C.: Garrod is an excellent professor. This class, however, is too large, covers too much, is too broad, and is poorly assessed through inane exams that are absurd. Don't take it if you don't want to do a lot of work. Median grade was a B+, so it is not a cakewalk.\"",
            "review 16: \"07F with Andrew C.: good: very interesting material awesome prof, very receptive and accommodating helpful TAs no huge assignment, midterm or final (each quiz or writing assignment is 10%) generous grading bad: a solid 2000 pages of reading time commitment (all x-hours, mandatory movie showings, reading checks) frustrating writing assignments (it really does get much easier after the 2nd draft, though) a liberal slant: alternative views are acknowledged but not really considered\"",
            "review 17: \"07F with Andrew C.: This is a great course and I highly recommend it. Professor Garrod is one of my favorite professors. He also is retiring soon so take this class in the fall of 2008 if possible. The course is a lot of reading, and it is EXTREMELY hard to catch up if you fall behind, SO DON'T FALL BEHIND. Do the readings for each class before the class. Don't save them for the night before a quiz. And you may want to make sure your other classes aren't a lot of reading because this class is.\"",
            "review 18: \"07F with Andrew C.: This is the most interesting class I have taken so far. Luckily my other two courses this term weren't too hard, so I could spend about 90% of my time on ED 20. I recommend it to anybody. We all have spent a great deal of time in school and this course provides a great opportunity to reflect about that experience.\"",
            "review 19: \"07F with Andrew C.: Everyone makes this class out to be an amazing class, and the classes itself are interesting, but not interesting enough to be worth all the work that is involved. Think carefully before taking it. The discussion groups are more fun. You do get to meet a lot of interesting people. Be prepared to spend night times watching movies as well. Just a time consuming class.\"",
            "review 20: \"07F with Andrew C.: So the famed Ed 20 is very much a survey class. Which means there will be interesting stuff, fascinating stuff, and some boring stuff. And you don't really have much choice over what gets covered in lecture. Which isn't to say that Professor Garrod and his various guest speakers aren't great, but this class is really made for intimate discussion. Which is where your discussion section comes in! A good section leader and a positive bunch of students makes for a rather fantastic discussion every week, in which you really can steer the conversation whichever way you like. Lots of fun and very rewarding. The class itself is certainly recommended.\"",
            "review 21: \"07F with Andrew C.: This course mistakenly gets the rep of being AWESOME, LIFE CHANGING, EYE OPENING, or all of the above. On this heady advice, heard from a number of friends and this very course guide, I excitedly enrolled. Let me tell you: This course is none of the above, especially if you're not a doe-eyed frosh. Prof. Garrod's a good lecturer, but he lectures about 10 percent of our classes - the rest are guests that contribute little that is relevant to the course. The only issues this course deals with happen to be those near and dear to the prof; in fact, he'll have you read about HIS program in X random country (you will literally read press releases about his programs as assigned readings) - do not expect to address topical issues whatsoever. As to the workload, it is quite a lot, but it's mostly bitchwork. Tediously memorize random facts from the myriad readings and you should be A-OK. Go to movies that have little or nothing to do with the rest of the syllabus, too. Bottom line: not so awe-inspiring, and probably not what you expected. If you have never seen/experienced/heard about poverty or discrimination, mayyyybe you'll get something out of this.\"",
            "review 22: \"07F with Andrew C.: A fantastic class that exposes you to many different issues in education. Garrod is awesome and does a good job of keeping people interested. There is a good amount of reading for the course, but nearly all of it is worth your time. Be sure to use your TA's.\"",
            "review 23: \"07F with Andrew C.: The reading material was fantastic, but the assignments accompanying them were ridiculous bordering on pointless and annoyingly both. It is rare that I find myself with a knee-jerk reaction towards \"busy work\" at the college level, but this class proved the exception. Especially ironic for an EDUCATION COURSE. The lecture classes themselves were 100 person recreations of the smaller, weekly discussion groups...so much so, that it left me wondering why they were even there in the first place. The class was a cinch until I got my final grade, and that just left me confused as to which of the hundred tiny inane little assignments I must have lost some sort of point for.\"",
            "review 24: \"07F with Andrew C.: I thought this course was interesting, but it was not the eye-opening experience it's made out to be. Garrod is a fabulous prof, but he lets guest lectures take up about 80% of the course, and are kind of hit or miss. His quizzes are pretty trivial and the papers don't have much to do with the course material, but I learned a lot about many facets of education and am happy I took the course.\"",
            "review 25: \"07F with Andrew C.: Professor Garrod is one of those professors I am glad not to have missed. He is a good lecturer and very personable, getting anyone and everyone to speak in a 100-person lecture class where you end up getting to know at least 10 new people, and you recognize everyone else. The material is incredibly interesting, as well as incredibly relevant to your Dartmouth experience as well as life in general. There is a lot of reading, but the vast majority of it is worthwhile. I loved this class, and I would do it again\"",
            "review 26: \"07F with Andrew C.: Professor Garrod is an amazing prof. Even though the class had over 100 students, he learned everyone's name within a week or two, and seemed to remember the oddest details about everyone. He's completely responsive to students. The workload was a bit much, with three readers and a few books, plus movies, and a mandatory weekly discussion section. Other than that, there are two papers and four quizzes, which aren't that bad if you do all the reading. Once of my favorite courses at Dartmouth.\"",
            "review 27: \"06F with Andrew C.: While there was a TON of work (obscure papers, 3 readers and 6 books), Garrod's class is well worth taking. He is an amazing prof, he learned everyone's name after 2 class meetings, and this is for an 80 person class! He's done some fantastic things in his life, and he brings passion to the subject. You can literally see his face light up when anyone answers anything. The class material was very interesting and has made me reevaluate the education system, my current and apst teachers, as well as my own views on things such as NCLB, the gender gap, the achievement gap and socioeconomic issues.\"",
            "review 28: \"06F with Andrew C.: The best part of this class was the readers. The chosen readings were extremely interesting. If you cannot take this class I reccommend buying the readers from Wheelock and reading them on your own.\"",
            "review 29: \"06F with Andrew C.: I would love to take it again. The material is incredibly interesting and relevant, and some of it is very inspiring. Garrod is a great professor and he always makes the effort to get to know all students--go see him during office hours. this class was fantastic--it had a huge influence on how i think about my own education and how i think about issues in general. and you end up getting to know a good portion of your class. the criticisms of the class are usually too much reading, arbitrary quizzes, etc...I and all of these critics still enjoyed the class immensely, however.\"",
            "review 30: \"06F with Andrew C.: Garrod's an inspiring prof who values listening to every voice in the class. I gained a good understanding of the current education system and was able to discuss my opinions. Go to all the xhours and evening film/discussion sessions - they're worth it. The reading is a lot but also worth it.\"",
            "review 31: \"06F with Andrew C.: This is supposedly one of the most difficult classes at Dartmouth (I believe it), but it's worth the work required of you. To get the full experience of the class, though, I do not recommend taking it in a term when you have other difficult courses--a lot of reading and time-consuming writing required! You will also be required to spend a few hours in class settings each week outside of class time (x-hour discussions, evening video screenings, panels), but these were also some of the best elements of the class! Prof. Garrod is a great lecturer with a lot of passion for his subject. He also found many great guest lectures--class was always too short for everyone. A warning/complaint--Prof. Garrod is a critical grader of papers. The grade he gives your papers is also often mysterious...he offers very little feedback (two out of three of my essays were given no comments whatsoever, just an unexplained grade at the bottom). The TAs for my class were very dedicated and great (almost) across-the-board (and there were about 11 of them, I think). This is another testament to Prof. Garrod--he can inspire passion and quality work in others. I had a very good experience in this class and would not hesitate to recommend it to non-majors (a must for Education majors!!).\"",
            "review 32: \"06F with Andrew C.: ed20 is a great class and i really enjoyed it. however, i did not think it was the most amazing course at dartmouth. that said, i would still definitely recommend it! be prepared to work--there are absurd amounts of reading, every x-hour is used for discussion (one of the best parts of the class), and garrod shows films in the evenings every week (also a very good part of the class). i was not a huge fan of garrod, but a lot of people really like him. he is a good lecturer, though he does bring in a lot of guest speakers as well. some of the assignments are frustrating, and the quizzes are reading checks that essentially require you to memorize titles of articles and their authors. however, class is never boring and the material is very interesting, so for me this made up for the flaws of the class.\"",
            "review 33: \"06F with Andrew C.: definitely meets the hype. garrod is wonderful, and even though this course requires tons of reading and lots of outside class time watching movies, reading checks, and discussions, these are the things that MAKE the class. take it!\"",
            "review 34: \"06F with Andrew C.: Ed 20 is hands down the best class I've had at Dartmouth...I took it senior fall and only wish I'd discovered it earlier. I truly believe it should be a graduation requirement, and every Dartmouth student can benefit from it. It is a ton of work, but I soon realized it was actually very manageable. This should definitely not deter someone from taking it, and it's actually quite possible to do very well in the class gradewise if you put in the time. The grading itself is not that hard... The discussion sections were amazing...I thought I'd hate having x-hour every week, but I was actually sad to see them end. There are also movies about one evening per week...5 required and then bonus for going to any more than that. I ended up going to all, very enlightening. Garrod is amazing. As much as people in the past have said he presents a liberal bias, I really think Garrod himself remained very neutral. The readings themselves may have a liberal slant, but Garrod was very open to any and all opinions in class. He is inspiring, engaged, and so invested in his classes. He loves student feedback and questions and makes an effort to get to know every student. This is truly a life-changing class and one that everyone should get the opportunity to take!\"",
            "review 35: \"06F with Andrew C.: Best class ever, without a doubt. I think everyone should take this course because it's so eye opening to the different kinds of schools in America that the majority of us are completely unaware of. The readings are so interesting--I really only got bored once. I loved going to this class and wished it could have lasted longer. The discussion groups are awesome because I got to hear differing opinions from my own. And Garrod is just really personable in class and truly cares about his students. You don't need to be going into education to take this--but do take it!\"",
            "review 36: \"06F with Andrew C.: Ed 20 is an excellent class. I took it my senior fall, but I think that it's best to take it during your freshman or sophomore year. This class made me wish that I had discovered the education department sooner in my Dartmouth career. The discussion sections in this class were one of the best aspects of the course. I loved the other students in my group and I learned a lot from them and from my discussion leader/TA. This class requires A LOT of time and dedication outside of the MWF class meetings. All of the x-hours are used. There are also 1-2 movies that are *required* each week. Essentially, this was two classes wrapped up in one. So it's important to be aware of that before you take this class. Also, the first paper was extremely frustrating and made me resent the class...but don't let that deter you from taking it, cause Ed 20 is an excellent, eye-epening class.\"",
            "review 37: \"06F with Andrew C.: I only took this class because everyone said how great it was; I didn't know what it was about. Now I'm becoming at education minor and going to teach in the Marshall Islands. This course is that inspiring. Garrod is a brilliant teacher.\"",
            "review 38: \"05F with Andrew C.: Best class I've taken at Dartmouth (I've taken 30). This course used to get 240 people enrolled in it every time it was offered-- it has now been restructured with a cap at 50, but don't miss this course if you can help it. It's more work than most other courses, but it doesn't feel like work. Everything I did for this course I wanted to be doing. You'll get to know the other people in the class and interact with them in meaningful ways. This class is incredibly relevant, intellectually stimulating, and fun to be in. I missed one x-period because I forgot about it, and was terribly disappointed to have done so. I learned more in this class than nearly any other I've taken at Dartmouth. Garrod exemplifies excellent teaching, with the emphasis being on our learning rather than on just presenting information. This course will consume whatever term you take it in, but it will be worth it.\"",
            "review 39: \"05F with Andrew C.: This really is a hard course. I took it as a freshman and wouldn't recommend doing that. Lots of reading and a number of policy issues. Uses every X hour for discussion sections. Garrod is really passionate and tries hard to get to know you and facilitate discussion, but doesn't completely satisfy either of those goals. If I had the chance, I'd definately take this course again, but not freshman fall.\"",
            "review 40: \"05F with Andrew C.: This class was so awesome!!! It is a very easy class with a lot of reading that you can do fine with and understand well just skimming. There are so many different and interesting subjects covered in this class and the professor is brilliant and super interesting and now I am almost positive I want to be a teacher!\"",
            "review 41: \"05F with Andrew C.: This was a fantastic course! It changed my view not just about education/teaching, but also about being a student at Dartmouth. Professsor Garrod was always there when I needed to talk to him or was confused, and he's a fantastic lecturer. I strongly reccommend this course, but make sure you can handle the workload. I went into the course freshman fall and I had no idea how much time, effort, and energy this course requires. Take it after you learn how to read a wide variety of texts carefully and quickly!!! But make sure you take it while you're at Dartmouth, because it is AMAZING!!!!\"",
            "review 42: \"05F with Andrew C.: LOTS AND LOTS OF READING...THE PAPERS WERE VERY FRUSTRATING AND TEDIOUS...BUT FUN CLASS...OPENED MY EYES TO THE INJUSTICES IN THE EDUCATIONAL SYSTEM\"",
            "review 43: \"05F with Andrew C.: Ed 20 has a reputation as one of the best classes at Dartmouth, and after taking it, I couldn't agree more. Expect to work a TON- there is a huge amount of reading, papers, discussion sections every x hour, quizzes, and reading checks (conversations with a TA). However, the majority of the work is relevant and interesting. Professor Garrod is incredibly passionate about what he does, and it comes across in the way he teaches his class. Take this class, and you will not be disappointed.\"",
            "review 44: \"05F with Andrew C.: I took this as a freshman and was fine doing the work...if you just stay on top of it and are interested it's not that bad...sometimes it's a pain to complete but you'll get over it. THIS CLASS IS LIKE NO OTHER CLASS AT DARTMOUTH and should be part of youur experience... it will make you a better person and American.\"",
            "review 45: \"05F with Andrew C.: Hands down the best class I have taken so far. Professor Garrod is an approachable, dedicated, and intelligent professor. There is a lot of reading associated with the course, but it is on really interesting material. TAKE THIS CLASS!\"",
            "review 46: \"05F with Andrew C.: This class was the most interesting AND the most challenging I've taken at Dartmouth. We did reading on every topic of education you can imagine--including things I had never even considered. It is so interesting to take a class on a topic that we all have so much experience with -- American schools. The class is legendary for being hard and in many ways it was overwhelming--mostly in the volume of reading (three readers and about five books over the course of the term). And you actually have to DO the reading because of the one-on-one reading checks with the TA's and Garrod's reading quizzes. But almost all of it is very interesting and worthwhile. Garrod is an incredibly knowledgeable and inspiring professor who cares about the course a great deal. The TAs are also amazing resources who put a ton of time into the class. The writing exercises definitely test your patience and can be rather frustrating, but definitely help Garrod make a point. Overall, this class is incredible. It will take over your term, but it's completely worth it. TAKE IT!\"",
            "review 47: \"05F with Andrew C.: This course is great and Garrod is superb. Though the readings, discussion sections, and evening films are time consuming, they're really all very interesting and inspire very thoughtful contemplation on a diverse number of issues in American education. TAKE IT!\"",
            "review 48: \"05F with Andrew C.: Nothing new here . . . EDUC 20 is tons of work! Many, many readings are assigned for each class, and the quizzes to test your knowledge of the readings are extremely specific. Papers are graded somewhat harshly, so be prepared to work in that respect, too! Nevertheless, this class was a great survey of some of the problems we are having with American education (and some of those problems' possible solutions). The guest speakers sometimes are quite good and other times are not so engaging, but you will certainly learn a lot in this class. Just be prepared to work!\"",
            "review 49: \"05F with Andrew C.: This is a great course. Taking it freshmen fall, I took it for granted and expected most dartmouth classes to be like this. Garrod is an inspiring lecturer and he makes a real effort to know everybody in the class from Day 1. There are small discussion groups that meet every week, and these are run by one of the many undergrad discussion leaders. Some of these TAs are great, some of them are not. Garrod brings in a lot of guest lecturers. Most of them are fantastic. There is no doubt that he's pretty liberal, but I think when it comes to talking about real issues in American education, you have to have a pretty liberal mindset to dig deep. True, it's quite a bit of reading, but it's definitely manageable. Regardless of your major, I reallly think you should take this class at some point in your four years at Dartmouth.\"",
            "review 50: \"03F with Andrew C.: I don't think I can praise this class enough. I tell all my friends to take it, audit it, NRO it, just TAKE IT. This class is a lot of work, a lot of reading mostly. The x-hours are used all the time. In class, there are lectures and a lot of guest lecturers. We had to watch movies outside of class, in the evenings. There were 4 3-page papers, graded by undergrad TA's and 4 reading checks, which were oral exams in which you discuss the readings with a TA. The papers sort of sucked and seemed unrelated to what we were learning in class. In papers 1, 2 and 4 you have to write in this descriptive language that is either difficult or easy to master, depending on your TA. The papers really depended on your TA, and how helpful they were, and sometimes whether or not they agreed with you. The papers were by far the worst part of the class. Nevertheless, the material we covered in class and in reading is FASCINATING. I'm keeping all my readers and books. It was funny, we took a show of hands at the end of the class and about 50% of the class was interested in teaching after not being interested before taking the class. Garrod is a great professor, very available during office hours or out of class. He managed to make a large lecture class into a discussion. The administration wants to change the format of the class, so that undergrad TA's aren't as integral. I think this will take away from the class, especially with the reading checks and small group discussions.\"",
            "review 51: \"03F with Andrew C.: This class is amazing and everyone should take it. The drawbacks are few: yes, it is a lot of reading but just organize your schedule so you can do it and it will pay-off huge for you. It is no understatement to say that because I took this course, I look at the world around me with new eyes, more informed and motivated to change the world. I learned so much about so many different and incredibly interesting issues in our society and our world that I truly am changed for the better. The reading checks (a form of assesment where you talk to a TA about the readings) was the best way I have ever been graded in my life. I just can't say enough about this class but if you are reading this...just take it.\"",
            "review 52: \"03F with Andrew C.: Ed 20 was by far the worst class I took at Dartmouth. It was a very brief superficial look at issues in education. The readings were very superficial, and not very scholarly. Issues were not analyzed at all. The essays have nothing to do with the course material or with social science. You will get nothing out of them except for frustration. The class is cognitively easy although it is a time-sucker. Do NOT take it!\"",
            "review 53: \"03F with Andrew C.: Critical thinking and oratory skills are key to doing well in this class. It asks a lot, but the readings are thought-provoking, discussions are enlightening, and the TAs are some of the most interesting people I've met on campus. However, if the college decides to do away with the current structure of the class, I'm not sure if I would recommend it as highly.\"",
            "review 54: \"03F with Andrew C.: Do the work, keep things in perspective, and you'll be fine!\"",
            "review 55: \"03F with Andrew C.: This class gave more work than I've ever had in my life. I often felt like I was MAJORING in ed20. However, if you put in the time, you will get so much out of this class. It opened my eyes to a lot of issues in education, as well as the US and world. If you want to work hard, you will be rewarded. Don't fall behind or you'll drown.\"",
            "review 56: \"03F with Andrew C.: I've never in a course. But it was the most rewarding class I've taken so far at Dartmouth. I'm going to be an education minor and go through teacher certification so it was a course i needed to take. But I knew last fall from watching friends of mine in the course that it was something I wanted to take. Keep in mind that they are changing how the course is set up; the role of the TAs is getting drastically reduced so the course I took won't be the same as the one you take. But the material is definitely worth it. The other thing that got me excited going into the class was Professor Garrod. The Free Press listed him as one of the best professors on campus; the Review labeled him one of the worst. It was real interesting being taught by someone with a definitive stance on the issues. All in all, this is an amazing course. Take it!\"",
            "review 57: \"03F with Andrew C.: Let me begin by saying that everyone should take this class. As students in America who are attending an Ivy League institution, we tend to take our educations for granted. With that in mind, this course is quite eye-opening in many respects. Professor Garrod is a very nice man; he is quite approachable and is great to visit during office hours. He is generally available when you need him, but I've noticed most students don't bother making a connection with him simply because they know the grade they're going to get is completely out of his hands (it's in the hands of the TA). So if you take this class, by all means keep in touch with Garrod throughout the term. He is an invaluable resource and will always help you out if you're feeling lost or muddled. About the TA's: I'm aware that this class may not be taught with TA's in the future. That is sad. I got a chance to work with some awesome undergrad TA's this term. Generally, for the papers, they grade squarely under a set of guidelines. Each TA has his/her own style, which can be annoying at times --- some TA's like to stay in touch by Blitz, and others just get annoyed when you do so and get a total attitude problem (I know of one TA in specific that everyone complained about as having an attitude/ego issue and as being totally unapproachable, and I agree with them in that specific case). But generally the TA's are very approachable, very helpful, and are always going out of their way to help out. I now have a network of friends (TA's) who are seniors & juniors because of this class -- and that's great, particularly because I'm a freshman. I do take issue, however, with the way reading checks are graded in general. All the TA's look for something different and there is absolutely no consistency in how an RC is graded (I know Garrod & the TA's will swear on the Bible that they have standards set for RC's, but even if they do have 'standards' it doesn't work) -- case in point, one TA apparently scored down a friend of mine because he was unable to encapsulate groups of readings into one-word themes (why only one word, only God & that one TA know); another example is that yet another TA scored ME down because I didn't \"organize it the way\" she wanted me to -- she didn't ever explain what that way was. Overall most of the TA's were good though -- some were downright unbearable but others were key to the success of myself & my fellow classmates. LECTURES: Most of the lectures are by guest lecturers. Garrod lectured maybe 5-6 times, max. Sometimes I wish he lectured more, though the guest lecturers did an awesome job of presenting the material. READING: At times the reading can be long, and sometimes boring. But as a whole it is quite engaging. TAKE THIS CLASS! YOU MUST!!\"",
            "review 58: \"03F with Andrew C.: I absolutely loved this class -- it was fascinating and gave me a totally new perspective on education. It's a lot of work (a LOT of reading) that you can't skip, so be prepared to work, but it's definitely worth the effort.\"",
            "review 59: \"03F with Andrew C.: Ed 20 is by far the best class I've had at Dartmouth. It challenged the way I look at everything, particularly my own education, and I have become a much more critical thinker. There is a lot of controversy about the reliance on undergraduate TA's in this course, but the class would not be nearly the same, nor nearly as amazing if it were not for the TA's. Unfortunately, it looks as if this term was the last term ED 20 is going to be taught in the same manner. However, I would still recommend this course. Garrod is a great lecturer, the only thing I wish is that he would lecture more often and have guest lectures less frequently.\"",
            "review 60: \"03F with Andrew C.: then this is definitely the class for you. It's going to be taught differently from now on (without the TAs) but I still think it's going to be a good and very relevant class because it brings education issues to light that have, will or do touch us all right now. Professor Garrod is also great--take a class with him if you can because he's a character.\"",
            "review 61: \"03F with Andrew C.: Ed 20 is a legendary class. And with good reason. The workload is huge, the readings are enormous and rewarding. But I'm glad it will never be taught under the same format again-- with TA's, etc. The class does cover the issues in depth and it is engaging and interesting. But be WARNED: if you cannot stand overtly biased and hypocritical teaching DO NOT TAKE THIS COURSE!! I agreed with 97% of the views and educational policies set forth and consider myself a liberal, but the extreme liberal bias and exclusion of varying viewpoints made the class unbearable. The class has a very real educational value, but for me personally, the costs (the lack of real dialog, the use of unqualified TA's who added little value to my graded assignments) were too much. I would not take this class again because I was disgusted with the way it was taught. My advice: talk to people YOU KNOW who have taken this course to decide if it would be right for you as perspectives and opinions are GREATLY varied and mine is only one.\"",
            "review 62: \"03F with Andrew C.: Ed-20, in its current form, is an amazing class!! it makes you think and is worth all the thinking and reading. it truly opens your eyes to problems with the education system in america and helps shed light on what makes good teachers. most of the lectures and most of the readings were very thought provoking and interesting; definately worth all the effort. the TAs are an amazing aspect of the course, although many are skeptical considering they are undergraduates -- but the time they commit to the course is invaluable. at many points it seems as though they are teaching it, not Garrod, and you learn just as much if not more from them. Even if the class changes, take it for the information that you will be exposed to.\"",
            "review 63: \"03F with Andrew C.: Ed. 20 is probably among the most stimulating and thought-provoking classes at Dartmouth. Although there was TONS of reading, I enjoyed learning about the education system in the US, the problems found in it, the issues that need to be addressed and the reforms that can be implemented. All of the readings need to be done for the four reading checks with the TA's. The four papers were next to useless, though. Some of the TA's are helpful and others think too highly of themselves. Garrod is a great guy who takes interest in his students and in how they are doing in the course. Overall, I learned a lot of interesting stuff and I definitely recommend it to everyone.\"",
            "review 64: \"03F with Andrew C.: This class was amazing! I'm so glad that I took it. I expected it to be interesting, but I had no idea how much I would love this course. It is without a doubt the best course I have taken at Dartmouth...actually the best course I have ever taken in my life. It is definitely worth the massive amounts of reading. The TAs are the best part of the class (there is talk that TAs are going to be eliminated, for students thinking of taking the course, i hope it is not true). The TAs are extremely responsive and helpful. The lectures are usually interesting (depending on the guest speaker) and the reading checks are an excellent way of testing the material. Overall, it was excellent.\"",
            "review 65: \"03F with Andrew C.: I felt that this class had a very very heavy reading load. However, most of the subject matter was extremely interesting and opened up my eyes to issues in education that I had previously been shamefully unaware of. I think that everyone should take this class- although they may not agree with Professor Garrod's liberal views, it will be of use to be aware of the problems with our current education system. Whatever your major is, this class is applicable because at some point, you either have been or will be affected by the issues discussed in this class.\"",
            "review 66: \"02F with Andrew C.: Great class- everyone should take it at some point in their Dartmouth career. It really makes you think, but make sure it is the only really hard class you take during the term.\"",
            "review 67: \"02F with Andrew C.: This class really opened my eyes to the reality of American Education. The discussions were very insightful and the class really inspires you to think. The written assignments were somewhat frustrating. The reading was very interesting but there was a massive amount of it. I reccomend everyone to take this course, but make sure to take it at a time when the workload for you other courses is light, because this class is very time consuming but definitly worth the effort.\"",
            "review 68: \"02F with Andrew C.: This class is tough, but absolutely wonderful. It is so interesting, and I finally found a course at Dartmouth where the TA's and the professor put in more effort than the students to make the learning process enjoyable. It is very possible to get a good grade if you put in the effort, and you'll want to put in the effort because the material is so relevent to our society and to Dartmouth students in general. You'll be sorry if you miss out on this class. Also, Professor Garrod is an excellent prof, so don't hesitate to take it with him!\"",
            "review 69: \"02F with Andrew C.: A great class to have taken first term, shows what is good about classes at Dartmouth. Shows how a prof in a big class can know every kid and care how they are doing. Absolutely an inspiring class that everyone should take.\"",
            "review 70: \"02F with Andrew C.: As many will tell you, ed 20 is an experience. But one you really shouldn't leave Dartmouth without. this class forced me to be more focused and more tenacious than any class i've taken at dartmouth. the sheer amount of material that we cover and are rigorously tested on is grounds for amazement. the stuff we covered was fascinating. i never before looked at my own education under such scruntiny--and learned so much. the class is unbelieveable, and i most definately recommend it, but be ready to work your tail off.\"",
            "review 71: \"02F with Andrew C.: The class is a wonderful overview of many of the problems facing American education today. For all of the people who say the class has a liberal bias: the point of the class is to inspire debate and make you question yourself and the things you take as they are. So question! The papers: write them early! once you figure out what the graders are looking for it's rather easy to adjust your style. Meet with TAs! everyone, ed minor or not, can benefit from this course.\"",
            "review 72: \"02F with Andrew C.: The class requires a big commitment, but it's worth it.\"",
            "review 73: \"02F with Andrew C.: This class is very difficult and requires a lot of time. There are films and reading checks to attend besides regular class meetings. The readings are usually interesting and thought-provoking. The papers are extremely difficult. The TAs are mostly stellar, although there are a few exceptions. Discussion group is one of the best parts of the class. Professor Garrod is an excellent lecturer, but most class periods are devoted to guest speakers. If nothing else the course will raise your awareness of many important issues. It can be very frustrating, but the course is decidedly worthwhile.\"",
            "review 74: \"02F with Andrew C.: Ed 20 is known to be a class that changes is Dartmouth and is often described by those who take it as the one class that crafted their Dartmouth experience. Even after the hype, it lived up to its potential. There is a heavy workload, but it is reassuring to know that Professor Garrod puts just as much heart and energy into it as the students do. You get A list speakers and quality readings. As long as you stay on top of your papers and prepare for reading checks you will do well. Just try to take the course in a less busy term.\"",
            "review 75: \"01F with Andrew C.: The course is amazing... and a lot of work. Having undergraduate TAs is cool experience - and Garrod is hilarious when you think about him for a while. If you are not going to NRO this course (I didn't) be prepared to put in a lot of solid hours to get a decent grade. Also, Garrod offers several bonus points throughout the term - get them! If you takw this class - it'll be the biggest thing in your life, so wait until you have an empty term to go for it. As a freshman, I would encourage other freshman who are interested in education and have decent backgrounds in oral presentation to take the class. But find another firstyear to study for reading checks with - it makes all the difference!\"",
            "review 76: \"01F with Andrew C.: This is a great course for anyone whether or not they plan to become a teacher. It deals with a lot of important issues in education that can be tied directly with a student's life and makes you think about them in depth. Be prepared, however, to spend a lot of time on this course, especially the reading of which there is a lot. There is a lot of writing too, but there are no set deadlines so you have to be able to budget your time. Professor Garrod is a good lecturer, and the many guest speakers brought in really add to the class. I would recommend this course to anyone who wants an excellent, thought-provoking, challenging course\"",
            "review 77: \"01F with Andrew C.: I first heard of Ed20 as a course that everyone should take before leaving Dartmouth, and I simply cannot disagree. The readings and lectures introduce controversial topics that are prevalent in today's society, and have a large effect on the lives of most people. The course requires an immense amount of time and dedication, however it is well worth the work. My only criticism is that the large number of topics covered, sometimes left me feeling rushed, as we often moved beyond a topic before I had been able to fully comprehend or absorb it.\"",
            "review 78: \"01F with Andrew C.: First off, and the most important point, is that this class introduced me to some absolutely amazing ideas. It inspired the most self-reflection of any class I've taken yet. For that reason, I believe that every student at Dartmouth should be exposed to these ideas and issues. Having said that, the actual structure of the class is frustrating and tedious. I have no complaints about the huge amount of reading- it was all extremely relevant and worthwhile. But the 4 self-paced papers are to be honest a complete chafe. They require constant revision and adherence to an arcane \"code\" that Garrod has decided is somehow a useful lesson, presumably to teach brilliant Dartmouth students what it is like to feel stupid and fail- it took me 6 drafts to even pass my first paper. At the beginning of the class Garrod touted its ability to improve the writing of every student, which I feel is completely false. My writing has not at all improved from having taken this class. Lectures (which were all by guest speakers, only one by Garrod) were also not particularly inspiring- most just covered the reading material with a few notable exceptions. Getting to know TAs and other people in the class was great, and reading checks were very effective tools for coming to a personal understanding of the reading and how you related to it. So bottom line: by all means, TAKE THIS CLASS. Just NRO it or even audit it. Or heck, just borrow a friend's readers (yes there are two huge readers) and books and you'll probably get just as much out of it. If you do decide to take it, just get on paper 1 right away and meet with your TA right from the beginning.\"",
            "review 79: \"01F with Andrew C.: This course is an overview of issues in modern education, and it certainly lives up to that billing by touching on many of the concerns that impact education. I was a bit disappointed by the liberal slant of the class - sometimes the viewpoint was accepted as unquestioned fact in the class, even thought there are often more conservative counterpoints that seem just as legitimate. The real learning in this class, for me, was produced by going to Borders and looking for books that presented the other sides of issues. I thought that this let me see the interplay of the different ideas, and really let me weigh the arguments against each other. It's really a shame that the nearly 200 of reading for Ed 20 didn't include enough material to do this. I think Garrod is a good match to the class, because he works very hard to make lectures interactive and brings in experts to discuss the material. The paper topics were very odd, and took a great deal of time for re-writes. The focus was on writing in this weird descriptive language, and it really prevented any presentation of complex issues. This was a real disappointment - I expected more of the writing component of the class. Overall, though, I would recommend this class to anyone - it definitely gives you a lot to think about. If you're a conservative, though, take your blood pressure medication before class. The same advice goes if you're a moderate liberal.\"",
            "review 80: \"01F with Andrew C.: Ed 20 sticks with you. It's kind of like a cult. You become part of the ed 20 circle - you meet a ton of people and you enter into this \"alumni\" network of people that all have taken the class before and can talk about the issues raised outside of class. It caters to different styles of learners from large discussion group settings to small discussion groups right down to one on one reading checks which by the way are the essence of the course in my opinion. Unlike any other class I've taken you 1. become really passionate about the material 2. really understand it, synthesize it, and can draw connections between readings/lecutures and central themes 3. become articulate about talking about it. Should be a mandatory requirement to graduate.\"",
            "review 81: \"01F with Andrew C.: for this class to consume your life. There is so much reading that it is a struggle to even think about doing work for your other classes. And you pretty much need to do all of it, unless you are really good at b.s., cause you have to sit down one-on-one with TAs to discuss it in detail. The first paper is a struggle, but I see a value in it now that I am through. Also be prepared to talk about this class constantly with friends and classmates - the material is almost always extremely provocative. And if you aren't into the material, you will certainly have plenty of discussions about why the class was so frustrating.\"",
            "review 82: \"01F with Andrew C.: The course readings and a few of the lectures along with the movies and discussions are moving and emotional and truly inspiring. Students get a overview of many issues, sometimes, not being able to focus on a couple topics that really interest them. I would suggest that student be permitted to submit a research paper overviewing an issue covered in the course to provide direction for students individually. Then, this lit review report could be presented to the class in sessions (on which they would be graded) that would have optional attendance, putting the student in the role of the teacher and seeing if, like Dick Light writes, students do better work for their peers.\"",
            "review 83: \"01F with Andrew C.: Never before has a class of 165 become so personal. The 27 TA's have a lot to do with that. Professor Garrod on his own is all right, but the TA's make the class what it is. The discussion groups every Friday help you grasp and form opinions about the extensive readings. Beware the papers - if you choose to take this class (which I recommend for anyone willing to put the necessary amount of time and effort into it) DO NOT put them off. The key to this class is self motivation. There are no deadlines for the papers (aside from the last day of the term) and the only way you are tested on the readings is through a one on one interaction with a TA 4 times over the course of the term. Take this class when you have the time and energy to put into it - and by energy I mean motivation and emotion. This class deals with inequality a great deal, and speaking from personal experience I would not recommend taking this class that also deals with inequality (or by the 3rd week you'll think all the world's problems are your fault). Don't take this class as a 4th class, don't NRO it. Just take it, experience it, and form your own opinions about it.\"",
            "review 84: \"01F with Andrew C.: The best way to describe Ed 20 is to identify it with being a special education teacher. It's a lot of work if you wanna do it right and you care at all, but it's extrememly rewarding in the end.\"",
            "review 85: \"01F with Andrew C.: Ed 20 is a class that will change the way you think about your education and society as a whole. it is a really amazing and interesting class...but you have to be willing to put in a lot of time. there is a ton of reading, complicated papers, and reading checks, so be ready to work.\"",
            "review 86: \"01F with Andrew C.: This course lived up to all of my expectations. It was alot more work than I thought, though. It completely consumed my time but it was only because I was so interested in the material that I allowed the majority of my day to be consumed with ED 20. I learned a great deal about my own education as well as the educational system and policies. It helped me to become a more active reader and thinker. I would definitely recommend this course to someone else because it will challenge your thoughts, beliefs and actions. You won't be the same. The professor definitely made the course. I wish I had known how much time it would have taken up in my life before I took the class, but every minute was worth it.\"",
            "review 87: \"01F with Andrew C.: This course is extremely biased. I, as a conservative felt that not only were my views unrepresented, but that I could not speak up in class. Conservative views were not tolerated and in general \"diplomatically squashed.\" (a quote from a discussion on the last day of class wherein Prof. Garrod was practically yelling at a conservative who said that she felt her views were unheard. This course is also a LOT of work for a very low grade. I read every word of the text (a hard thing to do) and attended most of the lectures. I wrote every paper and attended every out of class event. Yet I am still getting a grade somewhere between a B- and a C-. Expect to spend a LOT of time on this class, often at the expense of your other classes. I reccomend NROing this course.\"",
            "review 88: \"01F with Andrew C.: I had a love/hate relationship with Ed 20. Professor Garrod is, as the rumors have it, extremely liberal politically. However, this course does has a tendency to change your life or at least your mindset about your college and secondary education. It has most certainly changed the way I will look at my family, my high school, my town, Dartmouth, and myself. I did not enjoy Garrod's lectures, but most of the classes are actually conducted by excellent guest lecturers. The weekly discussion groups were a great way to get to know some classmates and probe your consciousness on difficult issues. Also, the assigned books are interesting and thought provoking. The paper assignments are not the high point of the course but it is important not to let those take you over. I would definitely recommend Ed 20 to any Dartmouth student.\"",
            "review 89: \"01F with Andrew C.: Going into the course, I was told that it was one of the best offered at the school. It definitely is. Everyone needs to take this class. There really is no way that anyone at this school can really appreciate and attempt to understand their educational experience before, and during college as a whole, without taking this class. The pace is incredibly fast, there is a huge amount of reading, and the 4 short papers are difficult, but the course pushes you to understand all the different areas that are covered. Professor Garrod puts together a syllabus of reading and lectures that covers every area of education. The course covers multicultural education, race/gender/socioeconomic issues in education, testing, and so many other areas. This course will make you angry at times and inspire you the rest of the time, and that is what Garrod wants. This course makes you realize that if we're going to be good citizens we can't deny the issues in education just because all of them didn't necessarily apply directly to us. Going into the class anyone that takes it should know that it's a HUGE amount of reading, but not to get discouraged, and dont' let it defeat you, because every page is worth reading and make sure you get everything you can out of the course, because there is so much that is offered. Take advantage of your TAs and Garrod's office hours, they both are right there to be used.\""
        ],
        "Peter Rodis": [
            "review 1: \"02S with Peter Rodis: This class is a lot of work (a ton of reading and four papers), but you will learn so much. Pano was an awesome professor and the TAs were very helpful. I really liked the process for papers which involved writing drafts and getting lots of feedback from the TAs, which helped so much! Take this class even if you are not interested in minoring in Education!\"",
            "review 2: \"02S with Peter Rodis: The course goes pretty quickly and i felt like i was racing to get a lot of the reading done, but overall it's a great class. The readings are really interesting and you can pretty much choose the grade you're going to get; you can revise papers until you get the grade you want. However, i would recommend taking this class with Harrod- Rodis was great, but was a little preachy sometimes.\"",
            "review 3: \"02S with Peter Rodis: Although there's a lot of reading and writing to do for the course (but no exams), it's all interesting and the TAs are a great source of help if needed. Anyone who's interested in education or just wants to learn about some of the social issues present in the American schooling system should definitely take this class.\"",
            "review 4: \"02S with Peter Rodis: Just an aweful course. The professor's lectures consisted of reading a one page prepared statement about the day's issue. Student discussion would consist of either spouting political sound-bites or telling stories from kindergarten. The paper assignments were intentionally wrong, so a multitude of required rewrites consisted of nothing more than trying to figure out what you were supposed to write about in the first place. If you've ever thought about the purpose of education for more than 30 seconds, you already understand far more than this course can teach you.\"",
            "review 5: \"02S with Peter Rodis: ED 20 is an amazing class, and anyone who is even slightly interested in Education should take it. Prof Rodis is a great lecturer and great listener. The reading is heavy and the work never ends, but it's woth it.\"",
            "review 6: \"02S with Peter Rodis: A lot of people complain about the workload of the class, and it's not worth all of the complaining. There are a lot of readings, but it's possible to breeze through them pretty quickly. Papers are annoying and take awhile with the several drafts that you have to hand in, but it's pretty manageable as long as you stay on top of things. There were a lot of guest lecturers so the professor does not actually teach the class very much. The class is almost entirely dependent on the TAs who do all of the grading of papers, reading checks, and discussions.\"",
            "review 7: \"02S with Peter Rodis: hard work but worth it\"",
            "review 8: \"02S with Peter Rodis: My friends who took the course reported that it was the lowest grade they got at Dartmouth, but the best class they'd ever taken... I agree with this statement. (although it was a tie for my lowest grade at dartmouth) Definitely take this class at some point... and take it with an NRO so you can enjoy it without stressing out about your precious GPA. ;-)\"",
            "review 9: \"02S with Peter Rodis: This was easily one of the best classes I've had at Dartmouth. It was also one of the hardest. I really had to do ALL of the reading--with the reading checks there was no way to hedge and only half-read articles. The way we did the papers, where we were allowed as many re-writes as we needed until we got the grade we wanted, made me put a lot of work into every draft. I definitely recommend this class, but it's also hard!\"",
            "review 10: \"02S with Peter Rodis: Ed 20 is a great class. It's not as hard as anyone makes it out to be, but you do need to stay on top of the work load. Prof. Rodis is wonderful, honest and is interested in simply inspiring thought on a lot of complicated issues regarding education today. It made me see our education system in a new light. As for the papers, it's not like any other class. The TAs read them, and they really have little to do with the lectures. It's almost like doing the work for a separate class. It's easy to do well on them if you just put in the time. If you have the time, definitely take this class. It was a lot of fun and a pleasurable experience in general.\""
        ],
        "Charles Wheelan": [
            "review 1: \"23W with Charles Wheelan: I don’t think I’ll ever take a better class than Education 20 with Wheelan. The class is SO engaging, so interesting, I think everyone will probably tell you how much they love it. Prof Wheelan is simply phenomenal. He’s easily my favorite professor at Dartmouth - he’s funny, he’s WICKED SMART, engaging, and genuinely cares about his students. I think he knew all our names in 2 weeks. The class itself is not easy, but the work is all really enjoyable. Wheelan’s lectures are just incredible, every class went by so quickly. That man could talk about anything and I would be fully engaged. The class is significantly back-loaded, so be mindful of that. But I would take this class if you get the chance. It has honestly changed my life and career path.\"",
            "review 2: \"23W with Charles Wheelan: Great class. Wheelan is so engaging and his style of lecture is basically humor, making every class feel really casual and enjoyable. There are a lot of readings but they are interesting/don't feel like too much of a chore to get through, and the books you read are also really good. Pretty much the entire class is five short writing assignments. Recommend!\"",
            "review 3: \"21W with Charles Wheelan: Awesome class! All of the books, articles, and podcasts for the course were super interesting, and class discussions were very engaging. Grading consists almost entirely of five policy memos that are spaced out pretty evenly throughout the term. He lets you rewrite the first two individual memos for half credit, so definitely go over his comments and turn in a second draft to improve your grade. Overall, incredible course and while the readings will take up a lot of time they are honestly so interesting and worth doing. Wheelan is such an engaging lecturer and amazing professor. TAKE THIS CLASS.\"",
            "review 4: \"21W with Charles Wheelan: Take it. other 21w review sums it up well. Worked well over zoom because you don't really have to do the readings to participate in the discussions, although the readings were all really interesting and fairly simple (New Yorker pieces, Brookings briefs, economist articles, etc). One of the best classes I've taken at D\"",
            "review 5: \"20S with Charles Wheelan: Great class-- the class consisted of discussions of the readings that we did (mostly nonfiction novels which were well-written and thought-provoking) and writing policy memos (most of which were group memos, making the graded workload not too bad but it was a very reading heavy class\"",
            "review 6: \"20S with Charles Wheelan: BY FAR the best class I have taken at Dartmouth. Wheelan runs the class through discussions and a lot of group assignments. There are a lot of books to read for this class but some were great reads! He also brought a lot of guest lecturers in from diverse backgrounds in the education field which was very useful. This class was also so insightful to learn about school experiences other than your own, especially from other Dartmouth students. You would be surprised how different all of our school experiences prior to college actually were despite Dartmouth not being the most socio-economically diverse school. I HIGHLY recommend taking this class regardless of if it counts as a requirement for you. Was very intellectually stimulating and really widened my perspective on a lot of societal barriers through the lens of our \"modern\" education system.\""
        ]
    },
    "EDUC016": {
        "James K.": [
            "review 1: \"09W with James K.: The class could have been interesting if it wasn't for Prof. Nelson. I felt like I was back in high school doing group work sheets and listening to him babble on and on about simple concepts.\"",
            "review 2: \"09W with James K.: The class was full of interesting topics, but if you've already taken a lot of psych or ed. classes there will be quite a bit of overlap, especially in the first third or so of the class. Take this class if you're looking for an enjoyable and easy class- lectures, while occasionally boring, were usually supplemented by videos and activities. Professor Nelson is a nice guy and really helpful- he pretty much outlines the one paper you have to write, making it way easier, and the tests are really fair and straightforward. I reccomend the class.\"",
            "review 3: \"09W with James K.: This course was fairly interesting, not too much work, and fairly slow-paced, but nothing spectacular. Class was generally lecture-based, with two short-midterms, a 5-page paper and a final.\"",
            "review 4: \"09W with James K.: Professor Nelson is a nice guy, but his lectures were downright awful. You can just read the book and not go to class and get an A. Half the time I didn't know what he was babbling about so I had to skim the book any way. Some topics were interesting, but overall this class made me realize what a joke psych classes are--simply memorization (and a lot of it, too). It was like a flashback of high school, cramming in vocab words the night before.\"",
            "review 5: \"09W with James K.: Prof Nelson is not a good lecturer, which makes attending class extremely painful. You can do well in this class by doing the reading and prepping for exams. The book was a good resource and you can learn alot from it. But even though the class may appear easy you need to know your concepts. Like most psyc classes alot of memorization. I wouldn't take it there are easier and better classes out there.\"",
            "review 6: \"08W with James K.: The textbook was way more interesting than the prof. I could have never come to class, read the book on my own, not taken the exams and learned more.\"",
            "review 7: \"08W with James K.: Not a lot of work, just two exams and a 1500 word paper. Readings are manageable, class lectures are fine, Professor Nelson is a really nice guy. Overall, a fine experience.\"",
            "review 8: \"08W with James K.: Even though the material was interesting, the pace of the course tended to be slow. Nelson gave clear, if somewhat boring, lectures (largely because of the 2 hour period). Exams and papers were fair, and definitely doable if you did the reading. I would recommend this class as a relatively easy third class for those with busy terms.\"",
            "review 9: \"08W with James K.: The readings were great! I learned a lot from the textbook and it was an easy read. However, the lectures were everything from the textbook. There really was no need to go to class until the last few days when we started to learn information that was not available in the textbook. The class is pretty easy though, all you have is one paper, a midterm and then the final. The only homework assigned was the reading, which I encourage everyone to do since the exam is mostly based off of the reading. Nelson tries to make the class interesting with videos which are great, however I feel that his lectures were very basic and were not very interesting.\"",
            "review 10: \"08W with James K.: It wasn't too much work. Quite honestly I didn't do any of the readings, came to every class, and still got a fair grade. The lectures were the majority of the material. They were a little boring at times but that's to be expected with a 2A. I was a little bothered by the essay. We had to analyze an educational study, which I felt very unprepared for because I had never taken a psychology/education/statistics class before. It wasn't as painful as it could have been (being only 1500 words), but I felt like I was at a disadvantage to the educ/psych majors.\"",
            "review 11: \"08W with James K.: The material was interesting and I wish that we could have delved more into the psychology, but Professor Nelson was pretty boring and didn't really give the best lectures. It's an easy class and could be a GPA booster, but it's also a bit of a waste of time.\"",
            "review 12: \"08W with James K.: this class turned out to be much different than I expected -- from the ORC I was hoping for something about the nature of learning, the acquisition of knowledge, and how intellect works in our heads. Instead, it was a whole term basically preparing you to be a teacher, arming you with surface-brushed topics from personality differences to developmental theories. I didn't really have any intention of being a teacher, and thus felt a bit alienated in this class as it felt like it was solely focused towards that. this may just be the fault of the textbook, though. If you've taken psyc 1 or any other education class, there will probably be a lot of overlap. prof. Nelson is pretty new to dartmouth but did a good job of keeping the information that is mostly intuitive/boring interesting by mentioning case studies and modern research in the field. there were a couple exams and a paper, which lets you take free rein and research a particular topic within the field that is of interest to you.\""
        ],
        "Kevin N.": [
            "review 1: \"07W with Kevin N.: dunbar was a horrible prof. i learned nothing in this class. he spends half the class telling us what we were going to learn about and then spends the second half of the class repeating exactly what he said in the first half.\"",
            "review 2: \"07W with Kevin N.: I enjoyed the course material but did not appreciate Dunbar's teaching. He relied heavily on disorganized PowerPoint presentations and he did little to encourage class discussion. He is an expert in the field and I enjoyed his personal stories and accounts of various experiments, but overall I was bored by this class.\"",
            "review 3: \"06W with Kevin N.: This course, which should have been really helpful to me since I want to go into education, ended up being one of the worst courses I've taken at Dartmouth. Professor Dunbar lecturers only on the most basic, obvious parts of the material and beats self-explanatory points into the ground; we rarely took an in-depth look at anything. Professor Dunbar is so inarticulate that it's painful to listen to him, and if students ask him questions he gets very flustered and never really answers them. On the midterm, his multiple choice questions were highly ambiguous and poorly worded, and he fails to communicate clear expectations of what he wants on exams and essays. This professor is a very poor reflection on the education department as a whole, so if you've never taken an ed class before, I would highly recommend choosing any other course in the department over this one. And if, like me, you have to take this, maybe wait and see if they get someone more competent to teach it in the future.\"",
            "review 4: \"06W with Kevin N.: Its brutal in class. Dunbar likes to make a lot of \"key points\". If you are a non major, take something else. The paper sucks. As do the exams. Just dont take the class...\"",
            "review 5: \"06W with Kevin N.: The Reading of this class was very interesting.\"",
            "review 6: \"06W with Kevin N.: He's a good guy, but doesn't answer questions effectively. The subject matter itself is inherently redundant and repetitive and redundant and repetitive.\"",
            "review 7: \"06W with Kevin N.: Professor Dunbar really means well for his students and the class. However, he very clearly fails at inspiring any interest in this subject and ruins a subject that could even potentially be somewhat interesting. Unfortunately, Prof. Dunbar delivers unbelievably repetitive, monotonous lectures about the most common-sense topics you could imagine. The textbook was useless; I opened it once and didn't bother to read it. The online readings were useless as well. Everything you need to know you will hear in lecture at least three times. The prof. is obviously passionate about the subject and communicating it to his students, but you can't help but feel bad since he falls incredibly short of making this class even somewhat enjoyable. You will not necessarily be a better teacher for having taken this course. But, if you can tolerate a painfully (and I mean painfully) boring lecture course, then you will likely be rewarded with a good grade, provided you maintain a pulse during class.\"",
            "review 8: \"06W with Kevin N.: Professor Dunbar is a nice man and means very well, however he is quite possibly the worst professor I have encountered at Dartmouth. His lectures are slow and monotonous, he gets flustered when students ask him questions, and he beats to a pulp material that is fairly intuitive. The subject has potential to be interesting, but after taking this course I never want to look at the textbook again. In addition, there was very poor communication between Professor Dunbar and the class regarding what his expectations were for the exams/paper. While the class was not difficult by any means, I would strongly urge you not to take it if there is another option.\"",
            "review 9: \"06W with Kevin N.: i didn't really learn anything that wasn't completely intuitive. would reccommend only if you haven't taken psych 1\""
        ],
        "David Kraemer": [
            "review 1: \"20F with David Kraemer: Kraemer is insanely lazy. He didn't start teaching the class until a week into the term and consistently neglected his own syllabus timing. Ignored my emails asking to meet with him about our essay. I wanted to meet with him because I'm not a psych major and have never written a psych paper. He also ignored many of my peers' emails, too. We had a GroupMe to discuss how tuned out he was to his own class and everyone agreed that his behavior was ridiculous. I'm not sure how he expects students to take him seriously when he barely takes his own class seriously. We had NO IDEA how we were doing grade-wise throughout the whole 10 weeks. He literally took a month to grade our first paper and never told us how we did before our final paper was due, leaving us completely blind to areas for improvement. I'm honestly not even sure he read the second paper seeing as it was due 6 days before final grades were due and he failed to finish grading the first essays in quadruple the time. Psych majors did super well in this class, for sure, but Kraemer completely left non-Psych majors in the dark as to how to succeed in his class. INCREDIBLY FRUSTRATING.\"",
            "review 2: \"17F with David Kraemer: Fine class but wayyyy more neuroscience than was said in the description of the course. It was mostly neuroscience with a bit of psych and honestly only a little true education material. Also, for being a professor in the education department, Prof. Kraemer was a shockingly bad teacher. It was an absolute struggle to stay awake during and I got a lot less out of the class than I was hoping to. However, Prof. Kraemer is unbelievably nice and helpful outside of class and was willing to write me a very positive recommendation even after I did not do great in his class or speak up much. This is DEFINITELY not a layup!!\"",
            "review 3: \"17F with David Kraemer: This is one of my favorite classes I have taken at Dartmouth. Professor Kraemer is a great prof and a nice person. There was a pop quiz almost every week, but the questions are fair if you have been in class and done the readings. There is definitely a good amount of neuroscience content, but no prior neuroscience background is assumed (it is helpful though). After 3 education classes, I have found the education department could be more accurately described as the \"neuroscience and psychology of learning\" department. I prefer this, but it depends on what you're looking for in a class. While this class is not a layup (there's quite a bit of reading, tests, and a paper), it's also not extremely difficult.\""
        ],
        "Michele Tine": [
            "review 1: \"11S with Michele Tine: Course: Favorite course at Dartmouth. The material is so interesting and the professor is awesome! Professor: Professor Tine is great - if you're interested in education at all, be sure to take a course with her! Workload: The workload is average.\""
        ]
    },
    "EDUC015": {
        "Michele Tine": []
    },
    "EDUC001": {
        "Michele Tine": [
            "review 1: \"23F with Michele Tine: MIchele Tine is my absolute FAVORITE prof and I loved this class. Each class was a different topic in education and everything was super interesting. I had taken her classes before so I knew what to expect but exams require you to know great detail about a lot of content. It is a content heavy course. That being said, if you actually study you will do extremely well as there are no surprises and exams are very fair. 2 midterms and a final. A mix of multiple choice and short answers (a few words to a few sentences). Besides this, needed to make 3 discussion posts about readings throughout the term and comment on 3 other students' posts, and one 250 word assignment. That was it. Study for the exams and you will learn so much and get an A! Not sure if layuplists still posts medians so if not, median was 23F was an A-.\"",
            "review 2: \"22F with Michele Tine: Tine is an awesome prof: super passionate about the content covered and very helpful during office hours. Although the content was very interesting, classes were lecture style and tended to get boring at times. There were a few in class activities and homework consisted of readings to prepare you for the next day's lecture. You have to do some discussion posts based on the readings but they aren't hard to do. Exams are heavy memorization but if you study sufficiently you can do well on them. Overall, the workload is not terrible at all and I definitely recommend taking this course.\"",
            "review 3: \"21F with Michele Tine: Echoing every other review...this class was amazingly taught and really interesting. As a serious slacker, I will say I did not study hard and paid for it because there are a lot of specific details you have to memorize, and the exams are half short answer questions so you really have to know your stuff. She assigns readings to be done for each class but they're covered in the lectures so reading them only really gives you more depth if you're interested...I never did them. You do have to pace yourself with the 6 discussion posts. I did not, and again, paid for it, at the end of the term trying to cram them all in. But the workload is definitely manageable and I really enjoyed the lectures and learned a lot. I had been advised by many people to ONLY take this class with Tine, so I'll pass that on as well cause I can see why.\"",
            "review 4: \"21F with Michele Tine: If Tine is teaching this class, TAKE IT! I signed up for this class on a total whim and now want to minor in education because of her. I specifically recommend it for any gov/pub pol/future politicians out there because every single lecture of this course genuinely made me want to go out and revamp the US educational system. Tine is such an engaging lecturer (the two hours FLY by) and posts all of her slides to Canvas so you always have everything you need in order to succeed. She is very clear about expectations for midterms and assignments and gives super helpful and thorough corrective feedback on everything you do. It's so evident how passionate she is about the material. It definitely requires studying to do well on the midterms and final (it is a very substantial amount of memorization) but you know exactly what is expected of you and the way she makes the material so interesting definitely makes putting in that time worth it. Tine is the best prof at Dartmouth and I could not possibly recommend this course with her more.\"",
            "review 5: \"21F with Michele Tine: This class is pretty straightforward in terms of work. It has 6 discussion board responses (you choose the dates over the term), 2 midterms, and a final. Attendance isn't even necessary bc all her lectures are just powerpoints that she posts. The exams are heavy memorization from the slides so if you study them its definitely possible to get an A in the class. Also, Tine is one of the sweetest profs you will meet! :)\"",
            "review 6: \"21F with Michele Tine: While I did not literally get laid, this class was very very good. Prof. Tine is the most engaging lecturer I've come across. The midterms (while midterms and therefore not amazing) were fair and well-designed. Minimal homework, especially if you don't do the readings. I did do the readings. I'd recommend doing the readings if you care about the subject, but otherwise you'll get by without most of them. There were some discussion posts, which were easy if boring. And Prof. Tine is AMAZING. Take this class with her. You will laugh. You will learn. You will get irrationally furious at the illogicality of the English language. It's worth it. Although attendance isn't mandatory, you will want to attend simply because Prof. Tine is just that good of a professor.\"",
            "review 7: \"21F with Michele Tine: Very interesting class! It made me decide to minor in Education because every single aspect is just so interesting. However, the neuro-aspect, not really my thing (Prof Tine loves it!) but every other concept in the course was very interesting. I promise that you will walk out of class each time with your mind blown, there is so much about the education system that Prof. Tine teaches about and it truly makes you start to question this world. Her lectures are very organized, some slides may be unclear but Prof. Tine is always available for help outside of class. Her exams are fair, though there is ALOT of memorization that goes into it. She uses her slides to make the test, therefore, specific details are important for doing well (such as for research studies, brain parts, policies, etc.) Overall, the class was very interesting and Prof. Tine is the best! Take this class with her if you can, regardless if you plan to pursue a career in education or not!\"",
            "review 8: \"20F with Michele Tine: Great class! Clearly outlined expectations, two midterms, and a final. Professor Tine's lectures are engaging. The worst part of this class is the group assignments but those are a necessary evil. Very easy to do well in the class.\"",
            "review 9: \"20F with Michele Tine: Super interesting class, very enthusiastic and knowledgeable Prof. Took it asynchronously so it was easy to fall behind but otherwise workload is very reasonable. The two midterms and final are relatively easy, but the MC questions can sometimes trip you up. Would recommend!\"",
            "review 10: \"20F with Michele Tine: Super engaging lectures, wonderful and friendly professor, exams are completely fair because she literally tells you exactly what you need to know. Education is interesting because it's at the intersection of public policy, psychology, cognitive science, and common knowledge. You write 8 reflection posts on assigned readings and have 5 group assignments throughout the term. The group work can be frustrating if your groupmates can't carry their weight (happened a few times to me), but that's kinda how all group projects work. Highly recommend this class with this prof.\"",
            "review 11: \"20F with Michele Tine: AMAZING CLASS! The only problem I had was keeping up with the asynchronous lectures, they can pile up if you put them off. I highly highly recommend this class, especially with Professor Tine!\"",
            "review 12: \"20F with Michele Tine: Loved it! Took this class freshman fall and highly recommend it to anyone remotely interested in education. Professor Tine is very passionate about education and is an inspiring lecturer. Her lectures are all super interesting and all major assessments (two midterms and one final) are very reasonable given you study the slides - mix of multiple choice and short answer. Hardest part of this class was honestly getting together in time for the group projects.\"",
            "review 13: \"19F with Michele Tine: I'm not really interested in education and took this class because a friend recommended, and I'm so glad I did. Tine has to be one of the best professors at this school. Lectures are super fun, engaging, and interesting, even to people like me who probably won't be involved in the field of education. There's also not really homework. There are daily readings but I didn't do any of them and still got an A; we didn't even discuss the readings ever in class. There's a lot about learning \"how to learn\" which is helpful too. Exams are somewhat difficult but very fair. If you just study the slides (which she always posts online) you'll definitely get an A, but they're very detail oriented and if you're bad at memorization might have some difficulty. Can't recommend this course enough, and can't recommend taking it with Tine enough either. If you're thinking about taking it with someone else I'd honestly just wait to take it with her.\"",
            "review 14: \"19F with Michele Tine: It seems that Education classes at Dartmouth are very content/memorization forward. There's a lot of reading and the lectures are very dense. You're expected to memorize details of studies as well. If this seems interesting to you, definitely take the class. If you are more interested in actually teaching, I wouldn't suggest this class. You don't really get the opportunity to think critically. Instead, you just get a bunch of info thrown at you and are expected to have it sink in by the time a 10,000 question MCQ exam comes along. I found it kind of ironic that this class is taught in the Education department. You would think that discussion would be emphasized and that memorization wouldn't be the only thing tested on exams. I think this class could be a LOT better.\"",
            "review 15: \"18F with Michele Tine: I cannot recommend this course enough. It is not a layup, so if you're looking for that, EDUC 001 won't be that for you; there's not a lot of homework, but the exams (2 exams and a final) are not easy (they are extremely fair, though). That said, this course is so worth taking. I have never been more inspired by a professor. Tine is phenomenal. She makes each lecture exciting and meaningful, and she really wants everyone in the class to learn and be inspired. I have never met a professor more passionate about their field, especially one who is passionate about teaching that knowledge to students. Apart from that, the course material is great. This class focuses on the background of education policy in the US, the neuroscience of how we learn, and strategies that make teaching and studying more effective. Even if you don't have interest in becoming a teacher, you are still in an education system, and there are really useful tips on how to study and also important facts about the education system in the United States that really puts things in perspective. There is a lot of content, but it is all important content; Tine really encourages the class to believe that, and I think that we all did. Finally, Tine is extremely fair. She gives a five-minute break in the middle of class every day, saying that the human brain cannot pay full attention for two hours straight (the class was a 10A); on exams, if a certain percentage (I believe it was 33%) of the class missed a question, she threw the question out, stating that it was her fault. She really wants the best for the entire class, and she really just wants the class to become passionate about education. Take this class with Tine; I cannot recommend it enough. You will not regret it.\"",
            "review 16: \"18F with Michele Tine: I definitely recommend this class! I took it my sophomore fall and I wish that I had taken it my freshman fall because it provides a great overview of learning, teaching, neuroscience's relevance to education, and K-12 public education in the United States. Ed 1 also puts college students in a great headspace for learning and success. For example, we talked about learning and study strategies such as interleaving, the spacing effect, and the testing effect. I wouldn't call it a conventional layup because, as other reviewers have noted, you do have to study for the exams and there is a significant amount of content. That said, all content is covered in class (the readings are supplemental and became the \"first to go\" when my term got very busy, but I still did well in the course) and Professor Tine's exams are very fair, although you do have to know the content in detail. Likewise, her enthusiasm about the material is inspiring and contagious - and the workload for the course is fairly light. I have heard that Prof. Tine is better than the professor who teaches the course in the spring, so I would recommend taking it with her! I also found there to be a substantial amount of overlap with AP Psychology, which was nice because 18F was a busy term for me.\"",
            "review 17: \"18F with Michele Tine: I took this class on a whim, and I’m so glad I did. Professor Tine is AMAZING. She’s so excited about the material that you feel lucky to be learning it. The class is actually super interesting, and incorporates a lot of neuroscience and psych concepts. Even if you aren’t interested in teaching, this course has so much information about study skills and other things that will be super relevant in your life. I think that taking this class actually helped me become a better student. On top of that, Professor Tine is SO nice. She’s committed to helping her students learn and grow and is always super accessible. Even though our class had more than 50 people, she knew most by name at the end and always took the time to talk to anyone with questions. She even wrote notes on our short assignments, despite the fact that she had a ridiculous amount of grading to do. I seriously can’t recommend this course enough.\"",
            "review 18: \"18F with Michele Tine: I LOVE LOVE LOVE Professor Tine!!! She's so enthusiastic and makes the class so interesting. She's so down to earth and so receptive to what students have to say. The class was a 10A when I took it, and she always gave us a break in the middle of class. I didn't do too hot cause I never showed up to class because I love sleep, but I HIGHLY recommend taking this class with Professor Tine if you care about education.\"",
            "review 19: \"16F with Michele Tine: Professor Tine is so excited about the material, it's hard to not also be excited. The course has very interesting and eye-opening material that you will not regret learning. This course definitely has me wanting to take more EDUC classes. The work load is really good (3 brief assignment, two midterms, and one final), but make sure you do the readings.\"",
            "review 20: \"11F with Michele Tine: the course was really interesting and inspired me to become an EDUC minor\""
        ],
        "Daniel Ansari": [
            "review 1: \"06S with Daniel Ansari: I needed to take this course for secondary teaching certification. It teaches you a lot about different neuroimaging methods and about the necessity to bridge the gap between education research and the classroom. I feel that as a teacher I'll be better able to evaluate research from having taken this class. However, this class really shouldn't be two hours long. The subject tends to get a bit dry after an hour and a half. Professor Ansari is leaving next year so it's difficult to say how the class will be run in future years. Please don't take this class as an introduction to the ed department. They offer so many incredible courses it would be a pity for this to be your impression of the learning sciences.\"",
            "review 2: \"06S with Daniel Ansari: This class is an overview of the various different courses that are offered in the Education Department. If you have taken many courses already from this department, you will most likely find the course painful as it is paced a little slowly with each week guest-lectured by a different professor from the department who lectures on his/her area of expertise. The reading load was not bad at all, but quizzes and papers can be a slight pain. Professor Ansari (who will no longer be teaching here) does a good job with the class, trying to accommodate the varying levels of interest in and experience with the education department. It is a nice introduction to the department, but I suggest you try at least one other class before you decide if you will minor or not.\"",
            "review 3: \"05S with Daniel Ansari: this class is one of the top three worst classes i have ever taken here at dartmouth. the education department has major problems. ed. 1 should never be taught again, regardless of prof. the course is basically a week by week anaylsis of the education department. we covered in 4 hours what an entire course is about, i.e language acquisition. it is a horrible class and i don't recomend that anyone take this who doesn't need it. personally, it has turned me off from ever taking another ed class here at dartmouth. i still don't really know what the class is about.\"",
            "review 4: \"05S with Daniel Ansari: For an intro lecture class, this one is pretty good. Professor Ansari is very organized with powerpoint lectures that are on the web, however he does use \"thinking guides\" to take class attendance. All the other profs came and each guest taught on a different topic for a week, and that was really cool - it really lets you get to know the department. You have to take this class for an education minor, and I'd say it's pretty good. A warning, I think his grading is kindof unfair, he has ridiculously high standards on open response questions of exams. But don't let that deter you from taking the class.\"",
            "review 5: \"05S with Daniel Ansari: A class still new enough the profs involved are very interested to be there. Prof Ansari particularly showed a lot of preparation for every lecture, kept the class totally updated on his office hours, and set out individual grading rubrics via email for each writignn assignment. Some methodology lectures were dull to get through, but visiting profs discussions of their own ongoing research was really interesting. Also, a big advantage of this class was having all the reading assignments through Blackboard, so there were no books to buy. work was fair, two \"lab reports\", a midterm, a final, and Thinking Guides.\"",
            "review 6: \"05S with Daniel Ansari: I did not like this professor at all. He just is not a good teacher. His lectures were boring, and he really did not attend to my needs as a student. To me, the lectures were all over the place, from one extreme to the next. There was no cohesion. The best part of the class is when he was not teaching and the guest lecturers taught. He actually turned me off of education as a minor, and made a horrible decision in taking this class.\"",
            "review 7: \"05S with Daniel Ansari: A heavy emphasis on the psychological process of learning. Can be confusing dealing with brain specificities. The readings are scientific experiments and can be very difficult to understand, but Ansari does a good job of putting them into understandable terms. The different sections later in the course are taught by other education profs, so you get to meet them and see about the different ways dartmouth is taking the education major. Dartmouth is also at the forefront of connecting research to education, so thats pretty cool.\"",
            "review 8: \"05S with Daniel Ansari: This course provides a nice overview of some of the big issues in education today. I would recommend it to people that are considering going into education or just want to learn more about it. It's a good intro to the education department because each week one of the profs in the department lectures on their area of expertise. For ed minors/teacher cert people: take this BEFORE taking the upper-level courses, otherwise it will be almost all review, as it was for me. Still, it's an easy and interesting class. There is a really easy midterm and final as well as 2 writeups of some of the eductaion-related \"labs\" you do during class time. Professor Ansari is one of the sweetest professors I've had at Dartmouth. He's really good about communicating over blitz, and you can tell he really cares about the students.\"",
            "review 9: \"05S with Daniel Ansari: This might be bitter so take it for what it's worth. I was originally thinking about being an education major, took Ed 1, and changed my mind completely. Professor Ansari's lectures were boring, uninspiring, and based somewhat heavily on sciences. I'm sorry to all those who thought it interesting, but I was interested in education as a discipline, not in just how people learn - although that I recognize that it is an important facet. It was just emphasized so much. But it could be my personality. I don't want to know how people learn scientifically. I want to know how people learn in reality. Anyway - Ansari is okay; he and I had our moments, but whatever. I survived and made out okay. Don't take this class (or any intro class for that matter) if you think you want to major in the subject. Seriously. It'll make you run in the other direction.\"",
            "review 10: \"05S with Daniel Ansari: Unless you're doing the teacher certification program, in which case join me in petitioning that the course be eliminated. If you're at all interested in education, DO NOT TAKE THIS COURSE, it will turn you off completely, which is very unfortunate. Instead, take Ed. 20 with Garrod, which is the real intro to education. It's a lot more work than Ed. 1, but you'll love the work, every bit of it. If you take Ed. 1, you'll just be angry and frustrated and bored, and worst of all, come away thinking education is a stupid field of study. Please don't take this class. For your own sake and of those who follow you. Maybe if enrollments are low enough they'll recognize their errors and do away with the course. This was almost certainly the worst class I've taken at Dartmouth. (Incidentally, Ed. 20 is almost certainly the best).\"",
            "review 11: \"05S with Daniel Ansari: A great introduction to the variety of topics and courses within the ed department. Prof Ansari is a wonderful teacher - goes over and above what you'd expect and is always available for feedback. Another great reminder of all the great professors and courses in the ed department!\"",
            "review 12: \"05S with Daniel Ansari: It's a lot more science than you probably expect. Prof Ansari is not especially interesting, although he has a teddy bear quality about him. Pretty boring.\""
        ],
        "Elise Temple": [
            "review 1: \"09F with Elise Temple: The 10A timeslot for this course is a killer. Professor Temple is very nice and knows a lot about neuroscience, but the class pretty much consists of going over research studies for two hours, then memorizing those studies for the exams. The writing assignments are easy, but don't have a page limit, so that can be a little difficult. The textbook is terrible. Overall, Educ 1 is informative, but pretty boring. The information is valuable for teachers and pretty much anyone who plans to have a kid-- the course just needs to be tweaked so that it is more exciting and creative.\"",
            "review 2: \"09F with Elise Temple: The class has a heavy emphasis on education research/studies and neuroscience, and offers a very limited perspective on policy and actual implications in the classroom. As the intro class to the minor, the course is a good reminder that there will be some boring times in education. Overall, the course is interesting if you can last through a 10A lecture class without getting bored (there is a break!). The work is not that difficult, just memorize a lot and make sure you're well-versed in brain parts for the exams. Professor Temple is very enthusiastic and nice, but the class itself could use an upgrade.\"",
            "review 3: \"09F with Elise Temple: Maybe this was my fault, but I was under the impression that the course had a higher education emphasis. I mainly thought this because I initially wanted to be education minor. Also because I thought since it is an introduction course there would be more education policies and general education material. However, the main thing is that the course is very neurology focused. In order to succeed, the best method is to view all the material by considering how the brain is affected. This is also apparent in the professor's method of teaching. Although she is knowledgeable about other education topics it is obvious that her strong point is developments in the brain. Regardless the course is pretty informative in, you guessed it, brain development in young children but does present an approach to education in a pragmatic aspect.\"",
            "review 4: \"09F with Elise Temple: Prof Temple is great. She's so much fun, very engaging, very obviously interested in the subject. The material did get a little repetitive by the end of the term, but it was overall an interesting, not too difficult class. Perfect for a random interest type class\"",
            "review 5: \"08S with Elise Temple: I took this class during Senior Spring because I needed an SOC distrib and because I wanted to learn more about education. Professor Temple teaches the class from the perspective of a neuroscientist, which was exciting because she taught us about bleeding-edge research. The brain science perspective also added a bit of scientific rigor to the course. Professor Temple was very accommodating to student questions and requests, and prepared well for her lectures. She uses powerpoint extremely well. I can't think of many negative aspects of the course. One time we had a class consisting of a silly quiz game, which was fun but not very educational. Also, know that Professor Temple often uses \"I\" and \"me\" incorrectly, and says screwy things like \"the test subjects did very good on the experiment\" instead of \"... did very well ...\" These things bug me. If they bug you too, you might go crazy listening to some of Prof. Temple's lectures. All things considered, EDUC 001 with Temple is an outstanding course! One of my top 10 during all my time at Dartmouth!\"",
            "review 6: \"08F with Elise Temple: This is much more of a psych course than an education one. With that said, it was interesting and pretty easy, and Temple is a nice professor.\"",
            "review 7: \"08F with Elise Temple: Interesting class. Not bad for a 10A. Not too much work. The textbook was interesting but boring.\"",
            "review 8: \"08F with Elise Temple: This class is all about child development, which wasn't exactly what I expected (there weren't many connections to the institution of education). Professor Temple gives good lectures, but the textbook is really frustrating to read (poorly organized and repetitive). In all, a good class if you're interested in learning how children learn.\"",
            "review 9: \"08F with Elise Temple: ED 1 is not a great class or an awful one, it's just not very memorable or engaging. Professor Temple is a great person and very enthusiastic and well prepared for the lectures, but I think it's the course design that dooms this one. Both the textbook and the lectures follow the same format, which is to present a long line of experiments that have been performed on infants and young children. Many times the second half of class is spent going over the research study we were assigned to read for homework, which is more an exercise in learning to understand how to read scientific articles in general than learning about child development in a cohesive way. The workload is average, with a big midterm and final that require a ton of work to fill out her review guides. The three writing assignments are a HUGE pain that require you to track down an appropriate research article and then tediously analyze every little aspect of it....my advice for these would be to get the articles as soon as you can and work on them throughout the term so you're not in trouble the night before they're due, because they take much longer than you would think. Overall, this class is good for someone who might want to go into brain/child development research, but it won't be interesting for anyone else. It really shouldn't be included as a requirement for secondary teacher certification, as I can't imagine that anything I might take with me will be relevant when I am a high school teacher. The links we make to education are few and far between, and I feel like I just didn't learn very much overall about anything. Contrasted with psych 1, where I learned about ten really interesting new things everyday, Ed 1 is a far inferior experience and I would recommend it only for those with a specific interest in the material or for those who have to take it for the minor or the Teacher Ed program.\""
        ],
        "Donna Coch": [
            "review 1: \"19S with Donna Coch: The content of the class is very interesting for anyone w/ any interest in sociology, psychology or education but Coch is not a teacher I would recommend. Take the class w/ someone else if you can. Coch had a very ambiguous, confusing grading style. The tests were unnecessarily harsh. It was pretty ironic that the class was centered around \"good teaching styles,\" yet she did not effectively apply most of them. Take caution when signing up for ed 1 w coch, it definitely won't be easy\"",
            "review 2: \"19S with Donna Coch: Introduction to Education with Donna Coch is the only experience at Dartmouth I'm inclined to describe negatively. I have never interacted with a university professor less receptive to reason, feedback, and honest communication. Notwithstanding exercises that solely test rote memorization or manufactured reflection, nearly every course facet mirrored the poor teaching techniques she decried in lecture. Be it excessive exam count, limited feedback, non-interactive discussion, unjustifiably stringent grading, or the litany of other pedagogical defects: This course—with this professor—is a strange contradiction. To those who take Intro to Education with Ms. Coch, I can only wish you the best. To those who don't, mistake averted. Beware.\"",
            "review 3: \"18S with Donna Coch: DO NOT take this class as a layup. If you aren't sincerely passionate about the material it suuuuuckss. Coch's class focus' on education legislature which can be super dry. Also, she grades things harsher than any teacher I have had before-- doesn't give extra credit and tries to trick you with her questions on tests. It's actually crazy how she will give lectures about bad grading techniques and then employ those very techniques herself in class-- i.e. rogue memorization. I would suggest if anything to stay away from Coch she is the worst and will completely kill your passion for education.\""
        ],
        "Michelle Tine": [
            "review 1: \"21F with Michelle Tine: Prof Tine is my favorite professor I have ever taken a class with. She is incredibly knowledgeable, fun, and engaged in the lectures, and really really wanted us to engage in the class and take home learnings. Not a ton of work and readings are not super mandatory but will really help your engagement in the class. Midterms and the final were not super hard but definitely require studying.\"",
            "review 2: \"21F with Michelle Tine: I learned a lot in this class and professor Tine is amazing in teaching. I usually find it a bit hard to learn only through lectures, but this lecture class was a big highlight of my term for me because the way professor Tine explained the subject helped me learn so much. Another very good aspect of this class is that you don't really have to do the readings to do well. Actually, professor Tine doesn't use the readings at all in exams - all the exams are based on the slides she uses to teach the class. She posts the slides on canvas after class. In the beginning of the term I used to do all readings (sometimes 60+ pages of reading), but in the middle to the end of the term I began only doing the readings that were more interesting to me. Also, the readings are very very good and they differ a lot in style. That being said, the class is not a layup because it's not easy to get A. I worked a lot and I managed to end up with a A-, but the tests are not easy. Some of the questions are very tricky and it can be hard to perform well on the multiple choice questions. However, professor Tine is very fair in the way she corrects the exam, and the short answer part of the test is very well-structured. Overall, I recommend this class. You will not have a huge amount of work daily, only when we have exams (two midterms and one final exam). It is a good class to balance with classes that have more work and that the grading system is more completion-based instead of mastery-based. If you are an international student, be a lot of the content of this class is US based. However, there are a lot of interesting topics. If you are interested in understanding educational systems, this class is a very interesting class. If you are a freshman and is still not sure about the minor in education, I recommend taking another class that you are really interested in and then taking intro to education if you like the class. Don't take this intro class first because it's very content heavy and I honestly don't think this class helped me decided on my minor.\"",
            "review 3: \"18F with Michelle Tine: I cannot recommend this class enough. Prof Tine is a passionate and inspiring teacher who made me leave class every day feeling happy, excited, and empowered. In addition, as other reviewers have noted, she is always open to questions, kind and heartfelt in her answers, and very fair on the exams. Whether or not you are interested in becoming a teacher, the material in this class is relevant to you as a student and as a citizen in a country in which the majority of children go through the public education system. You will not regret taking this class with Prof Tine!\""
        ],
        "Michael W.": [
            "review 1: \"06F with Michael W.: The course was very interesting; though I know that I had trouble following it many times because the reading didn't really align with the content of the lectures and it was difficult to discern what was important from the readings. Prof. Connell is a really nice guy, and he's tries hard...but it was sometimes difficult to follow his train of thought through the diagrams he drew on the board and in his lectures. He was very receptive to concerns and spent a great deal of time responding to essays; however, some of the lectures were ineffective and I ended up confused even more. For example, his description of ANNs was the same every time, and for those who were confused about how exactly they worked, it was difficult to get an \"acceptable\" answer. I think the material is at blame for this because it is very abstract and at points, kind of dry, and Prof. Connell was receptive to this, but overall, it was a little difficult to pay attention and follow the lectures.\"",
            "review 2: \"06F with Michael W.: This class could be good. Education is a really, really interesting subject, and I'm glad I didn't give up on it because of this course. It was cool to have every different Ed prof come and teach once, so we got to see all the different sub-topics in the department. It was good to get a background as prep for Ed20 and 29, which are highly recommended. Otherwise, this class sucked. Connell was a nice guy, but too smart for his own good. He was commuting from Boston too, so I just felt bad for him. We would joke about how he was teaching us proper teaching methods, but not employing them himself. The class had a lot of very technical and scientific subject matter, and a LOT of reading that I was never able to finish. The essays and tests were really tough too. The class bonded over how screwed up it all was. Basically, education is great, the material that this class covered was fascinating and really cool to learn, but they need to restructure this course to make it bearable.\""
        ]
    }
}