{
    "FILM047.33": {
        "Monica Ndounou": []
    },
    "FILM044.12": {
        "Ayo Coly And Mak Williams": [
            "review 1: \"22S with Ayo Coly And Mak Williams: WOULD NOT RECOMMEND THIS CLASS if you are looking for a layup. It is in no way shape or form a lay up. there are 3 essays, a video project and a movie report. The class when taught by Coly is okay, but Mark Williams is awful. He is extremely boing, with a monotone voice. When he teaches he goes way off topic and digresses much too often. The subjects he teaches are irrelevant tot the course. he also asks broad questions with multiple answers, but claims only his answer is correct. They are also not too easy on the grading. Would not recommend this class unless you are a film studies major truly interested. Does not teach much about Africa, more so European influence to Africa.\""
        ],
        "Ayo Coly": [],
        "Mark Williams": []
    },
    "FILM007.20": {
        "Jeffrey Ruoff": []
    },
    "FILM047.02": {
        "Shevaun Mizrahi": []
    },
    "FILM048.04": {
        "Jacqueline Wernimont": []
    },
    "FILM048.03": {
        "Jacqueline Wernimont": [
            "review 1: \"22F with Jacqueline Wernimont: Great class! I also adore prof wernimont; she's very nice and a great prof, she treats the students like human beings and really emphasizes that the class shouldn't be stressful by any means. At the beginning of the term, she asks us what topics we would be interested in learning more about during the term, so it was really cool to touch on the different range of topics in data science. The end of term final project also has a lot of creative freedom.\""
        ]
    },
    "FILM046.09": {
        "Iyabo Kwayana": []
    },
    "FILM042.20": {
        "Gerd Gemunden": []
    },
    "FILM047.32": {
        "Danielle Simon": []
    },
    "FILM041.20": {
        "Paul Young": []
    },
    "FILM049.02": {
        "Monica Ndounou": []
    },
    "FILM042.22": {
        "Desiree Garcia": [
            "review 1: \"21X with Desiree Garcia: This class was fabulous. Let me begin by saying I took it ASYNCHRONOUSLY which I'd imagine won't be the case if it's offered again but still I think would be a great class. I feel like I really easily got my CI/ART without it being SUCH a layup that I felt guilty. The class (async) lectures were honestly interesting and the relevant readings each week were cool too, with discussion post threads that legitimately stimulated my interest and thoughts on the subjects. Grading was 30% participation for completing discussion sections, 20% of a straightforward midterm that was a combo of MC from the lectures and asking you to briefly reflect on readings/films from the course, 20% a short paper which was honestly pretty cool to do which entailed using newspapers from ca. 1915 to investigate the premiere of and reaction to a deeply problematic film, and 30% a final paper (only 6-8 pages) on any remotely relevant moviegoing topic of your choosing. Awesome class. Very doable and flexible, while at the same time offering interesting material and thought provoking assignments. Potentially my favorite course at Dartmouth so far and I'm a bio major that loves bio classes. Recommend to ANYONE (film majors? for sure; need a CI and/or ART? take it; just want an easy and interesting class alongside your others for the term? sign up). SERIOUSLY enroll in this class if it's offered I'm sure it would be great in person too Prof. Garcia seems wonderful.\""
        ]
    },
    "FILM044.10": {
        "Eugenie Carabatsos": [
            "review 1: \"23S with Eugenie Carabatsos: Professor Carabatsos is amazing, and I really enjoyed taking this class with her. You learn so much about TV writing -- plus getting to workshop your pieces is really nice.\"",
            "review 2: \"23S with Eugenie Carabatsos: Do NOT take this class. As a film major, it killed my love for screenwriting. Just take Screenwriting with Prof Phillips instead.\""
        ]
    },
    "FILM042.21": {
        "Trica Keaton": []
    },
    "FILM041.19": {
        "Desiree Garcia": []
    },
    "FILM044.09": {
        "Iyabo Kwayana": [
            "review 1: \"21W with Iyabo Kwayana: She is the best professor on this campus. Take a class with her if you can. She fosters creativity and camaraderie in her class which is the best combo for artistic classes. I learned so much, but never felt overwhelmed. Cherish her!\""
        ]
    },
    "FILM042.19": {
        "Andrew Simon": [
            "review 1: \"23F with Andrew Simon: Wow. I am simply blown away. Today was our final class and I am honest to God emotional about it. This is a truly special class. Engaging, provocative, challenging (intellectually not workload wise) with an exceptional professor. Professor Simon reminds you why you pay the big bucks to go this school. He literally was in Cairo for Arab Spring -- the man is brilliant and funny and captivating to listen to. This is without a doubt the most I have learned in a Dartmouth class. The structure goes like this: two movies assigned per week plus some readings (and a discussion post). A couple students lead a discussion based on those materials and the whole class engages. Sounds simple yet it's quite effective. Beyond that, it's just a final! Not too shabby at all! You can write a 18 page paper, make a podcast + a 4 page paper, or do an art piece with an 8 page paper for that final. The last day of class, he brought us pizza and gave a little speech about how important this class was to him. I legitimately teared up. He is one of those professors that is intimidating, not because he is scary or intense, simply because you crave his approval. He is so eloquent and kind and just exactly what a professor should be. A+++++ for this class. I am a senior year and I am so happy I took this class. Wow. I am genuinely sad it is over.\""
        ]
    },
    "FILM007.19": {
        "Joanna Rapf": [
            "review 1: \"21W with Joanna Rapf: This class was something. I will say I went into this class dreading Silent Films, and the first few weeks were definitely very rough, but over time these films tend to grow on you and you definitely develop an appreciation for them. The course description for this class describes it as a 6000 word maximum writing, but that is completely false. The weekly journals alone clear past that word count by the end of the term. Overall I floated my way through the class and even with high B's on the papers was able to finish with an A- overall. The biggest downfall of this class is the content gets a little boring at times. Joanna is such a funny professor to have. She is so kind and always willing to help you if you need it. She is very flexible with everything and if you ask for help with your papers she will definitely help guide you to an A in this class. Just a warning week 8 and beyond the few hours of movies a week gets old, but I would call it a fairly easy 90%+ if you keep up with the work\"",
            "review 2: \"21W with Joanna Rapf: I actually enjoyed this class much more than I thought I would. Joanna is so so sweet and understanding. I got behind in this class. and she helped me catch up and was so kind about all of it. The films do get boring at times, but I watched them all on 1.5x or 2x speed, so it made them more bearable and more funny. Stay on top of your work if you can help it and get an early start on your research paper and you will be fine. Probably even get an A.\""
        ]
    },
    "FILM050": {
        "Mark Williams": []
    },
    "FILM044.07": {
        "Iyabo Kwayana": [],
        "Shevaun Mizrahi": []
    },
    "FILM007.18": {
        "Paul Young": [
            "review 1: \"20W with Paul Young: Love the class and prof Young, first film class and hope to take more next term as a result of how much ive enoyed this one\""
        ]
    },
    "FILM050.03": {
        "Mark Williams": []
    },
    "FILM047.28": {
        "Lakshmi Padmanabhan": []
    },
    "FILM047.27": {
        "Mary Desjardins": []
    },
    "FILM042.17": {
        "Gerd Gemunden": []
    },
    "FILM041.16": {
        "Desiree Garcia": []
    },
    "FILM044.06": {
        "Sharang Biswas": [
            "review 1: \"22X with Sharang Biswas: Just a heads up he's teaching the same curriculum for this class and video game design. Accidentally sent the wrong syllabus to the class over email and it's identical. Just lazy teaching. Steer clear as long as Biswas is teaching if you actually want to learn about digital storytelling and not exclusively videogames. Started the first class talking about how he wasn't afraid to give bad grades so red flag there if you're looking for a layup. Also I get that his research focuses on sex but his demeanor and behavior in class are often overtly sexual in a way that made me feel pretty uncomfortable. Steer clear.\"",
            "review 2: \"22X with Sharang Biswas: I don't know if the other review stayed in the class but it was a lot chiller than Sharang made it out to be on the first day. Some readings for class but most work was focused on projects in different media. I found almost all of them super engaging but could see that they were very game-based. Even if the game design class had similar topics, we definitely investigated different areas of media. Our class ended up being small and tight-knit. In-class engagement was really high and Sharang really cared about our wellbeing, even slashing some of our assignments or making them less work so that we would be less stressed. Sharang is a visiting prof so unclear if/when he will teach this again, but I found it to be one of the best classes I've taken.\""
        ],
        "Jennie Chamberlain": [
            "review 1: \"23S with Jennie Chamberlain: lazy teaching using an super old syllabus. most of the course just describes the basic elements of a story (with maybe a week or two at the end being about ar/vr) and class time is spent watching movie clips that vague tie to an aspect of a story but there is hardly any structure. dont expect to learn anything relevant in this course. multiple people in this class agreed that it was the worst class that we had taken at dartmouth and we would leave most classes regretting showing up as it was a waste of time. easy to get a good grade though!\""
        ]
    },
    "FILM050.04": {
        "William Cheng": [
            "review 1: \"23F with William Cheng: This class was so awesome! Probably one of the most interesting and fun classes that I've taken at Dartmouth. Out of the classes I was taking that term, it was most definitely the layup, however, there does need to be a few good hours of work put in each week to do readings, study for the weekly quizzes, and stream video games with a group. But the readings are very interesting and it's quite fun to play the different games required on the syllabus! As for Prof Cheng, he is simply amazing: he's very understanding and chill and does everything in his power to help us all succeed in class by changing up class load, making easier quiz prompts, etc. Would highly recommend taking this class regardless of major!\"",
            "review 2: \"20F with William Cheng: Word on the street is it isn't a layup anymore but when I took it there were only weekly writing packets 3-5 paragraphs total. Super interesting readings and playing video games is part of homework. Some people cried at the end of this course. Professor Cheng is so well-spoken I think he has super powers he almost intimidates me because he's so intelligent yet humble. There's so many reasons to take this course from the interesting material to the world class prof (chairman of Music dept) to the CI + ART/LIT/TMV distribs so I recommend to all my friends.\""
        ]
    },
    "FILM048.02": {
        "Mary Flanagan": []
    },
    "FILM041.17": {
        "Jodie Mack": []
    },
    "FILM042.16": {
        "Trica Keaton": [
            "review 1: \"22S with Trica Keaton: Super intelligent, compelling, and relaxed about assignments. Not a lot of work but you really have to engage in the general conversation in order to do well. Overall, an extremely interesting topic with an amazing friendly professor.\"",
            "review 2: \"22S with Trica Keaton: This is the worst class available at this school. Not only is it not academic, it is boring and makes a highly interesting subject uninteresting. The professor literally showed us an episode of What Would You Do? in a serious context. The worst reality TV show ever.\""
        ],
        "Matthew Richardson": []
    },
    "FILM047.26": {
        "Mary Desjardins": []
    },
    "FILM043.02": {
        "Annabel Martin": [
            "review 1: \"22S with Annabel Martin: This class is incredible. Annabel Martin is the SWEETEST professor I have ever had. She truly cares about her students and the curriculum. This is my second class with her, I needed the lit distrib but did not want to read full books. We are responsible for 2 movies and 2-3 WGSS theories a week. I skim most of the readings, you really only need to read 1 piece fully because there is a writing assignment to write a reflection of one of your choosing. The movies are super interesting and many are in different languages and countries which can keep it interesting! Class is all discussion based. As I mentioned are a few writing assignments throughout the term but they are very \"reflective\". Martin is just looking to hear about your opinions and experiences - the writing is all VERY informal and casual. She gives you a 100% on every assignment as long as you truly talk about yourself and how you connected with the text. The final is a group project... once again she will give you a 100% if you just put in effort and make it personal.\""
        ]
    },
    "FILM044.04": {
        "Shevaun Mizrahi": [
            "review 1: \"22S with Shevaun Mizrahi: Shevaun is the best film professor on this campus. The class was very time demanding but I doubt anyone did not get an A. She pushes you to do hard work and you shouldn't sign up unless you want to put in the work to make something you're proud of.\""
        ],
        "Amy Lawrence": [],
        "Peter Ciardelli": []
    },
    "FILM007.17": {
        "Mary Desjardins": []
    },
    "FILM096": {
        "Mary Flanagan": [],
        "Paul Young": []
    },
    "FILM046.08": {
        "Iyabo Kwayana": [],
        "Martin Roberts": []
    },
    "FILM042.14": {
        "Desiree Garcia": [
            "review 1: \"23S with Desiree Garcia: This class was actually very informative and I learned a lot about Mexican Cinema and history, which was awesome. It was structured as a Monday lecture followed by a film showing in class, a film we watched on our own and corresponding discussion post about it on Tuesday, and a Wednesday class that was a lecture and discussion on the 2 films we watched that week. Garcia knew a lot about the material, which made it engaging. I recommend not calling Garcia's bluff -- I wouldn't consider this class a total layup but one that you can do well in if you keep up on the material. The midterm and final exam required you to know the gist of the readings and some more context about the films, which was really interesting material itself. If you prep for the midterm and the final and participate in class discussion, you should be all good. I would recommend, just with the forewarning that it's a real class.\""
        ]
    },
    "FILM041.15": {
        "Joanna Rapf": []
    },
    "FILM042.15": {
        "Sean Griffin": []
    },
    "FILM041.14": {
        "Mark Williams": []
    },
    "FILM048.01": {
        "Mary Flanagan": []
    },
    "FILM047.24": {
        "Desiree Garcia": [
            "review 1: \"23W with Desiree Garcia: This class was definitely interesting from a content standpoint. Each week you focus on a different racial motif/stereotypical depiction in film. This class was a 6B so usually Professor Garcia talked about the previous week's films for the first hour and then we watched a film for next week. Overall the films were really good, such as Moonlight, Enter the Dragon, etc. In terms of assessment, I found this class kind of unfair. We had two film identification exams where she played a five second clip of a film and we had to identify which film it came from. The issue with this was if you didn't pay attention to the most random, five second clip of a movie, you were sort of screwed, even if you watched the majority of the films in depth. We also had two bibliography assignments which were pretty straightforward. Then, you were graded on participation and a final video compilation project. It's not entirely clear what she's looking for in terms of participation. The class is in BVAC which makes the discussions sort of difficult to participate in since everyone is spread out. Professor Garcia is also incredibly impersonal -- it seemed as though she was looking for reasons to take points off and give people a hard time even though this was conceptually not a difficult class whatsoever. TLDR, if you're interested in films and don't have a lot of film knowledge, this is a good class. Just beware of her weird grading and don't expect an A.\"",
            "review 2: \"23W with Desiree Garcia: I found the material in this class rather interesting and enjoyable. The class is not difficult conceptually, -----BUT------ Prof. Garcia as a grader is quite unreasonable. She tries very hard to take points off for any assignment. The class consists of a video essay final, a reflective paper, a few research assignments, and two tests that are all easy to complete, yet somehow you will not get great grades on. Additionally, 20% of the class grade is a participation grade which is extremely annoying because she gives horrible participation grades, even if you show up to every class and participate... The workload in general is not too bad. You have to watch 2-3 movies (1-2 hours each) a week to prepare for the tests which are fairly disappointing in nature. You watch a series of short, random little clips from the movies and have to identify the movie, director, and year made. The clips are always the smallest and most random parts of the movie that are difficult to remember. Do not expect an A in the class.\"",
            "review 3: \"19S with Desiree Garcia: This was one of my favorite classes at Dartmouth!!! Not only is it super relevant and interesting, you get to watch some great movies. The professor is super laid-back and lets the conversation go wherever the students are most interested. It's also pretty much a guaranteed A. You have to write a short paper and have a term-long project, which is pretty low maintenance, and I think that might've been it. It's very interesting and engaging though, so it'll barely feel like work!\""
        ]
    },
    "FILM044.03": {
        "Fern Silva": []
    },
    "FILM047.25": {
        "Chante Mouton Kinyon": []
    },
    "FILM041.07": {
        "Paul Young": []
    },
    "FILM039.01": {
        "Jeffrey Ruoff": []
    },
    "FILM041.08": {
        "Paul Young": []
    },
    "FILM047.09": {
        "Paul Young": []
    },
    "FILM046.07": {
        "Martin Roberts": [
            "review 1: \"22W with Martin Roberts: a layup (he let us turn in assignments late etc), if you're interested in media you'll probably find the readings/assignments interesting and I enjoyed the class, though I see how some prob saw it as kind of a nothing class\"",
            "review 2: \"22S with Martin Roberts: I can safely say that I ended this term having learned nothing. I sat in that auditorium twice a week for two hours for ten weeks and left knowing the same amount as I did at the beginning of the term. Sure, it's a layup, but I'd much rather at least take a class where the information is remotely interesting/fruitful. Not only was it incredibly useless, Roberts planned the lectures in his car 15 minutes before class every day only to come in a lecture for 2. hours. straight. If you want to sacrifice precious brain cells for an easy A, then this is the class for you. Personally, I would rather slam my ballsack into a car door than take this class again.\""
        ],
        "Iyabo Kwayana": []
    },
    "FILM041.13": {
        "Amy Lawrence": []
    },
    "FILM007.16": {
        "Martin Roberts": []
    },
    "FILM007.15": {
        "Joanna Rapf": [
            "review 1: \"23W with Joanna Rapf: Prof Joanna is an expert of the field, a lot of the readings are directly her works or from journals that published her work. You get to watch many funny, and often very gay, women, and then write papers of passion about them. Totally recommend it as your seminar if you've ever laughed at a movie. The course is very organized, every week you discover a new film comedians from a different era. There's a A- median, and Joanna enforces that strongly. She will curve down your grade to maintain it.\"",
            "review 2: \"18W with Joanna Rapf: Joanna is super sweet! Helpful in office hours. Learnt a lot. One of my favorite classes at Dartmouth so far.\""
        ]
    },
    "FILM047.22": {
        "Gregory Seton": [
            "review 1: \"18F with Gregory Seton: Don't take this class. Ridiculous amount of work that you have to turn in for every class. Lots of the concepts don't make sense and lectures are disorganized.\""
        ]
    },
    "FILM047.07": {
        "Gerd Gemunden": [],
        "Silvia Spitta": []
    },
    "FILM046.01": {
        "Jodie Mack": [],
        "Mary Desjardins": [],
        "Mary Flanagan": []
    },
    "FILM044.02": {
        "Jodie Mack": []
    },
    "FILM041.02": {
        "Gerd Gemunden": []
    },
    "FILM046.04": {
        "Mark Williams": [
            "review 1: \"22F with Mark Williams: I do not recommend taking this class with Professor Mark Williams. If there was another professor who taught this course that was more organized, lenient (I will get into this later), and more clear, then I would suggest taking this course because there is some interesting material about the inner workings of journalism. However, I was let down tremendously due to how the professor \"structured\" the class. First, the syllabus was not put together well, making it difficult to see what needs to be done before class. The instructions for some of the assignments were not clear either. Next, speaking of assignments, the professor expected too much out of the students to complete towards the last weeks of the class. As mentioned in another review, he expected us to complete a video project, research paper, and then a final exam (that consisted of two short essays). If the length of the assignments were shortened, then they would have felt less like a chore to complete given the time frame. On top of all of that, the professor never gave back any written feedback on the assignments we completed in the previous weeks (or on any assignment at all), so students never knew what they needed to improve on in the class. Lastly, the class itself was mostly dull which is something that I personally was not expecting considering how the subject of the class is hugely dynamic. The course was half historical, half production, but the production was mainly done outside of the class. I felt that if more production was done during the class, it definitely would have improved the state of the class. The professor would lecture sometimes here and there. Then, there were some videos/movies played in class and several guests were invited to speak to the class. I enjoyed some of the guests as I thought they were insightful, but some things that were discussed strayed away from the lectures that the professor had given, so I was often left wondering how it connected. Anyways, if you read this far, I hope that I have convinced you enough to not take this course with Professor Williams.\"",
            "review 2: \"19S with Mark Williams: This was probably the worst class I've taken at Dartmouth. The professor is terribly unorganized and would assign up to 300 pages of reading per night, but never mention anything about the readings in class. He speaks monotonically about random topics for two hours straight before ending class, at which time each and every student is drained but also very thankful that they made it through yet another awful lecture. He also did not smooth out the workload throughout the term to a fair, consistent amount. In the beginning of the term, there really wasn't much to do outside of the readings, but in the last two weeks of the term, he gave us a final exam, final project, and a final paper, which, considering the size he expected of each project, is far beyond the workload expected in any other class here at Dartmouth. Additionally, he didn't return graded work back in a timely manner – the first assignment we received feedback occurred in week 9 when he gave us out exams that we took in week 5, yet somehow he expects us to learn from our previous assignments and improve from one to the next. Overall, I highly advise against taking this class if it is with Professor Williams, no matter how interesting the material may seem. He will make it boring either way, and then you'll just have to put up with having him as a prof and taking an awful class.\""
        ]
    },
    "FILM047.06": {
        "Carlos Martinez Casas": [],
        "Kui Dong": []
    },
    "FILM042.08": {
        "David G. Ehrlich": [
            "review 1: \"16X with David G. Ehrlich: If he ever comes back to Dartmouth, I highly recommend you take this class with Professor Ehrlich. He's one of the few professors that isn't afraid to express how much he wants to see you succeed.\""
        ],
        "David Ehrlich": []
    },
    "FILM047.16": {
        "Jeffrey Ruoff": [],
        "Mary Flanagan": []
    },
    "FILM039.02": {
        "Jeffrey Ruoff": [],
        "Mary Flanagan": []
    },
    "FILM036.02": {
        "Jeffrey Ruoff": [],
        "Mary Flanagan": []
    },
    "FILM044.01": {
        "Jodie Mack": []
    },
    "FILM042.13": {
        "Martin Roberts": []
    },
    "FILM047.21": {
        "Mary Desjardins": [],
        "Mona Domosh": []
    },
    "FILM007.14": {
        "Michael Evans": []
    },
    "FILM047.03": {
        "Carlos Martinez Casas": [],
        "Theodore Levin": []
    },
    "FILM007.13": {
        "William Phillips": []
    },
    "FILM046.05": {
        "Mark Williams": []
    },
    "FILM047.17": {
        "Iyabo Kwayana": [],
        "Jodie Mack": [],
        "Mark Williams": [],
        "Mary Flanagan": []
    },
    "FILM095": {
        "Mary Desjardins": [],
        "Mary Flanagan": [],
        "Paul Young": []
    },
    "FILM093": {
        "Mary Desjardins": [],
        "Mary Flanagan": [],
        "Paul Young": []
    },
    "FILM080": {
        "Iyabo Kwayana": [],
        "Jodie Mack": [],
        "Mark Williams": [],
        "Mary Desjardins": [],
        "Mary Flanagan": [],
        "Paul Young": []
    },
    "FILM051": {
        "Mary Flanagan": [
            "review 1: \"22S with Mary Flanagan: This class was... an experience. I was looking forward to taking it, but had heard that Flanagan could be kind of a weird prof, but boy that didn't prepare me for this class. It started out great, but as the term progressed, the assignments just got more and more intense and I ended up pulling nearly weekly all-nighters and still wasn't turning in work that made Flanagan happy. She's also the least understanding prof I've ever had. Every time someone got sick and couldn't make it to class (keep in mind COVID was prevalent), their grade was docked, and she didn't care what you had going on outside class, you weren't getting an extension and she was going to shame you for asking for one. She was a real stickler for attendance, which I usually don't mind, but she'd count you absent and dock your grade for being even a minute late. She threatened to fail me at the end of the term even though my grade in the class was a low A up to that point. I don't think any of this even begins to describe how much her treatment of students damaged my mental health. Do I think I learned something in this class? Sure. Was being denied extensions due to unavoidable circumstances worth it? No. Take this class if you're interested, but know what you're getting yourself into. NOT a layup. If you're considering taking it for the distrib, choose another class.\""
        ]
    },
    "FILM050.01": {
        "Paul Young": [
            "review 1: \"23W with Paul Young: Such an enjoyable class — I could tell within the first week that it would be one of my favorites at Dartmouth, and it has lived up to that impression. The class's theme (basically meta films, or films that reveal some kind of theme or visual related to filmmaking itself) is clearly one of Young's passionate interests, so discussions were really engaging. Our seminar was small—probably 9 people—so participation ended up being pretty crucial. Young appreciates when students read closely, so show up to class with notes! Also, he's a bit of a harsh grader (he does have a PhD in English, after all), so be sure to put good time/effort into the class's two main assignments (short midterm paper and 10-15 page term paper on topic of your choice). Ultimately a class I would heartily recommend to majors and nonmajors alike.\"",
            "review 2: \"23W with Paul Young: I loved this class! It was such an interesting topic and Young is very passionate about the class. I love small classes (ours was only nine people) and it felt like a big conversation every day, talking about assigned films and readings, but Young also encouraged the class to go off topic if it felt right for our conversation. He is kind of a harsh grader, but if you go in for office hours and build a relationship with him (not hard to do as he is a nice guy) you should be good.\""
        ]
    },
    "FILM047.20": {
        "Aily Nash": [],
        "Jodie Mack": []
    },
    "FILM047.19": {
        "Dennis Washburn": []
    },
    "FILM047.05": {
        "Jeffrey Ruoff": []
    },
    "FILM047.01": {
        "Jeffrey Ruoff": [
            "review 1: \"23X with Jeffrey Ruoff: Took this class over the summer and it's one of the classes I've enjoyed the most. I learned applicable skills in Premiere Pro and it was really not too demanding. You can adjust how difficult and fancy you wanna get with your video edits for the most part. Jefferey is nice and understanding if you need to be gone for a few class periods—but don't make it it too much, otherwise it might compromise that A. Also, he told us that he plans to give an A to everyone and he lived up to that statement.\"",
            "review 2: \"23X with Jeffrey Ruoff: Great course, very chill professor and excellent TA. Project-based style may be a little too time consuming for people without Premiere experience, but I didn't find it to be a problem.\"",
            "review 3: \"22X with Jeffrey Ruoff: This has been my favourite class at Dartmouth. It's the perfect sophomore summer class for people both interested in minoring/majoring in film, and other students who are just interested in easy film-making. Professor Ruoff (aka Jeff) is a wonderful teacher who makes you feel welcomed and comfortable during class. Projects at the start of the term are group-made videos, and your final project is a solo video (although you can petition to do it with someone). I thoroughly recommend this class!!\"",
            "review 4: \"22S with Jeffrey Ruoff: Absolutely love this class and Professor Ruoff. Most production driven than a lot of the 40s which makes the content more engaging because you can put it into practice later. Ruoff is a cold caller, which isn't for everyone, but he does work with you and provides good feedback, especially during critique classes when the whole group give productive criticism about your video. All of the assignments are really enjoyable and there are a lot of resources to work with if its your first time editing video. \"Video mashups\" is a very diverse range of media so you yo-yo between styles and topics but its always interesting.\"",
            "review 5: \"22S with Jeffrey Ruoff: Super dope class; if you have any interest in it at all you should definitely take it!!! Though, I wouldn’t recommend it if you're not willing to put in the work because I think the class was as fun as it was because of how much effort I took to learn how to use Premiere and completing the projects. Also prof ruoff is very nice (just be on time to class and watch out for cold calling because he takes that seriously haha). Even if you don’t have experience, this is a really great starting class if you want to get into film and editing a bit more!\"",
            "review 6: \"20F with Jeffrey Ruoff: Really fun and easy class. If you enjoy editing, the assignments are honestly pretty fun and aren't that much work. Ruoff is definitely a character but a nice guy overall and helpful if you need him. My only issue with the class was that he relied solely on calling on people for discussions rather than just letting people talk naturally, but it wasn't that bad. Would recommend it overall.\""
        ]
    },
    "FILM046.06": {
        "Amy Lawrence": []
    },
    "FILM045": {
        "Mary Desjardins": [
            "review 1: \"07X with Mary Desjardins: Expect 3 quizzes (lowest one dropped), 2 take-home midterms and a take-home final. Each of the take-home tests requires two 3-4 page essays. What I don't like about the essay questions is that more often than not she asks you to read and synthesize what scholars say about certain programs/genres rather than let you analyze them yourselves. But you do need to analyze the programs, the more specifically the better, to support the opinions that you quote. It's a long class and the room is dark during screening so it's quite easy to fall asleep so you may want to bring coffee to keep yourself awake.\"",
            "review 2: \"07X with Mary Desjardins: This class was relatively easy in terms of work load, and the take-home format exams minimized stress. However, the quizzes often asked about minute details of readings, and it was difficult to earn an A on the essay exams and final.\"",
            "review 3: \"06S with Mary Desjardins: The clips of TV shows we watched in class were fun, especially since many of them were comedies. The tests (take-home essays) and reading quizes were not too difficult if you've done the reading. Prof Desjardins, however, is a boring lecturer, and will say a lot of information in her lectures. If you can make it through the lectures (the other 50% of class time is devoted to watching clips), then this class is pretty good.\"",
            "review 4: \"06S with Mary Desjardins: good for non-artistic people to fill an art distrib without taking a ridiculously stupid class. this is more like a history class and desjardins is great. she is understanding about extensions too.\""
        ],
        "Paul Young": [
            "review 1: \"21W with Paul Young: Young is a great prof, even though he's a bit of a character, but that's just the film dept. He's really nice and very accommodating. He also is definitely extremely knowledgable and engaging with him on the material is really interesting. I really enjoyed the material as well, especially because the homework was often watching shows like The Simpsons and The X Files. It's a lot of analyzing the social contexts behind television trends, and you can see how it shaped TV today. The only bad part about the material is we spent the first 2 weeks on radio which was pretty boring but it got better after that. There was a decent amount of reading each night to be honest, but you could usually get away with skimming a lot of it. There were reading checks every Wednesday though so you definitely had to do more for that. Overall it was a relatively easy and interesting class with a pretty good prof. I would recommend.\"",
            "review 2: \"21W with Paul Young: If you get the opportunity to take this class with Prof. Young, DO IT. Young is arguably a top-5 Dartmouth professor, and it's easy to see why. Extremely nice guy, very knowledgeable, and more than willing to assist students who need help. Television history as a topic is pretty interesting, but it's Young's teaching of it that makes this class special. Even if you're not a film major, I'd highly recommend this class for an ART distrib - or if you're just looking for an interesting class to take. Class was mostly dedicated to discussion about assigned readings and viewings, so you had to speak often. The textbook readings could get tedious, but it's the TV episodes and respective texts that livened up the workload. Additionally, there were 3 sets of short (500-1000 word) essays about the material spaced out throughout the term. These assignments were actually quite fun to complete, as Prof. Young allowed for some creative liberty in your responses. Each Wednesday, there was a comprehension quiz on 1 or 2 readings or viewings. These quizzes were not difficult provided you actually did the work. Young also dropped your lowest quiz score, so you had a little cushion there. TL;DR: Great Prof, interesting material, 10/10 would recommend.\""
        ],
        "Mark Williams": [
            "review 1: \"03W with Mark Williams: This class was very interesting and Prof. Williams was key in making it interesting. But, it is definitely not a blow off class despite it being about TV. The essays were graded very hard and the tests were difficult. But if you're willing to put in the time, it is definitely a cool class with lots of clips and interesting lectures.\""
        ],
        "Brandeise Monk Payton": []
    },
    "FILM044": {
        "Iyabo Kwayana": []
    },
    "FILM043.04": {
        "Mark Williams": [
            "review 1: \"21S with Mark Williams: Best class I have taken at Dartmouth. Definitely recommend if you are looking to major in film. The class is a decent amount of work (~25 pages of writing, 20 feature length films, discussion posts, reading), however, class time was mostly discussion based. Professor Williams is awesome to work with, and was very flexible considering extenuating circumstances of the term. Wouldn't consider it a layup, but if you put in the effort, the grades should match.\""
        ],
        "Paul Young": []
    },
    "FILM043.01": {
        "Mary Desjardins": []
    },
    "FILM042.03": {
        "Thamyris Almeida": [
            "review 1: \"22F with Thamyris Almeida: Thamy is a sweetheart! She's a great professor who is very understanding about deadlines, gives super interesting lectures, and also is very flexible in helping/understanding your thesis for various papers. If you can take any class with her - DO IT! She's a great professor who works hard to make courses interesting and accessible for all students :)\"",
            "review 2: \"22F with Thamyris Almeida: I love Thamy. She is a very knowledgeable historian and very dedicated to her students and gives comprehensive feedback on all assignments! Attend office hours and also sign up for walk&chats which are hangouts with her. You either walk or visit a café and can ask as many questions about the class or not! The Latin American Studies department should really reconsider hiring her permanently. She adds a tremendous contribution to our Latine faculty community, especially being an expert in Brazil!\""
        ],
        "Gerd Gemunden": [],
        "Silvia Spitta": []
    },
    "FILM042.02": {
        "Jeffrey Ruoff": [
            "review 1: \"21F with Jeffrey Ruoff: Took this class with high hopes and was very disappointed. I've been very interested in film my whole life and was considering a minor, but after this class I might not. The class was small, only about 13 people, and while you think that would make for good discussion and community, it did not. The environment was very awkward and no one really talked to each other, even though I know people in the class are talkative and social people. This environment was a result of Ruoff and his teaching style. He is a very nice man, however, he would often ask very awkward questions that would inhibit discussion and make people feel uncomfortable. Also most of the questions he asked the class during discussion were not open-ended and often had only one answer, which was not conducive to people sharing their opinions or thinking critically. There was also a huge disparity between people that really liked film and those that were there for the credit. Don't get me wrong I have great respect for people who are interested in other things and take a film class for the art distributive because they are curious, but I honestly think Introduction to Film should be a prerequisite for this course because it is very hard to think critically about films from these new wave genres if you do not know film techniques or history and have never analyzed a movie before. Professor also cold calls a lot and when people are not interested enough to do the readings, their comments are just bullshit and the whole discussion turns into people commenting on material they haven't read in order to get participation. The workload isn't a lot if you don't do the readings. The readings are incredibly dense, but will interest you if you are interested in film. Although they were really tough to get through sometimes, I actually did learn a lot from the theory readings. If you're just interested in learning theory- pick up Bazin's What is Cinema? and you will learn as much as I did in this class. Otherwise, there is only one 4-page paper, one website project (which was not very hard, but it is a group project and he only gives you one grade so if you get a shitty partner you're kind of screwed), and a final project of either a 4 minute video essay (with partner) or 8-page paper (without partner). Choose the video essay- I chose the paper and it was a mistake. Ended with an A, but I also put in a lot of effort because this is a subject I care about, others were not as lucky. TLDR: Don't take this class unless you are VERY interested in film and its history. I love movies and part of me wishes that I dropped it and took something more engaging. A is not super easy to get. Professor is kind, but weird and not a good teacher.\"",
            "review 2: \"21F with Jeffrey Ruoff: Great class, Jeff is a fantastic professor. You can get by just skimming the readings and there were only 2 writing assignments, Tuesdays you just watch a film and Thursdays you discuss them, and overall very chill and fun course\""
        ]
    },
    "FILM041.11": {
        "Jodie Mack": []
    },
    "FILM041.10": {
        "Dennis Washburn": []
    },
    "FILM041.09": {
        "Jodie Mack": [
            "review 1: \"23F with Jodie Mack: Professor Mack is so quirky and funny, I LOVED her. Clearly outlines everything in her syllabus, and she is very understanding. Decent amount of reading, but multiple ways you can complete your weekly discussion posts and a midterm project and a final project. HIGHLY recommend taking this course.\""
        ],
        "Amy Lawrence": []
    },
    "FILM041.06": {
        "Amy Lawrence": []
    },
    "FILM041.04": {
        "Laura Ogden": [
            "review 1: \"24W with Laura Ogden: I took it through the film department, but it was a relatively decent ANTH experience in terms of the theories and content we covered. Though, I wasn't really prepared for the content; there was some very dense material and she only briefly goes over it during lecture. The response papers are actual short essays, and not at all reflections; she expects citations and a very specific structure to the outline. Prof Ogden is a very sweet lady and was understanding about giving reasonable extensions, but she wasn’t very available outside class and often didn’t go to office hours, so I felt like I couldn’t get help on larger papers when needed. About half of the x-hrs were used, which is expected since we usually spend class watching movies, and honestly, there were only a handful of movies that were dreadfully boring so the film content wasn’t bad overall.\"",
            "review 2: \"22S with Laura Ogden: Such a boring class if you're doing it for film. It requires quite a bit of work on a very niche subject. You have to write quite a few short responses and you do need to participate despite the fact that very few people did. The median on participation was like 83. But, all things considered not that hard to get an A if you can tolerate the boringness of the class.\""
        ],
        "Dwaipayan Banerjee": [],
        "Jeffrey Ruoff": []
    },
    "FILM040": {
        "Mary Desjardins": [
            "review 1: \"07W with Mary Desjardins: First off, Prof. Desjardins is great. This is the third time I've had her for a prof. She's a very knowledgeable, very approachable person with a great sense of humor (every once she lets it show). The readings are all very interesting, but they are definitely not the kind you can just skim through to understand. We got to watch about a movie a week, up until the last week or so of class. You also have a reading quiz about once a week, but you can drop your two lowest scores.\"",
            "review 2: \"04W with Mary Desjardins: The material constitutes the bread and butter of film theory, but I felt that it was stifled by Prof. Desjardins' terrible lecture style and uninspiring management of in-class discussion. A struggle to stay awake for, this class was helped by an interesting array of assignments.\"",
            "review 3: \"04W with Mary Desjardins: The course material was dense and at times a bit boring. Desjardins is a really great Prof to get to know though and she really enjoys teaching and helping her students.\"",
            "review 4: \"03W with Mary Desjardins: This class was a bit heavy on the reading - but if you were able to get it all done, it's all fantastic stuff. Prof Desjardins knows the subject matter well and really brings out an enthusiasm on the topic.\"",
            "review 5: \"02S with Mary Desjardins: This class, taught for the first time this term, was executed almost flawlessly. Prof. Desjardins set out with a clear direction and followed through with it. Film majors will have to take it under the new major structure, but it will be worth it. Quizzes kept us honest on the readings but were never unfair. Class discussions sometimes got off track but were mostly well moderated by the prof. What impresses me the most about this course is the sheer breadth of knowledge it covers thoroughly in a short span of time.\"",
            "review 6: \"02S with Mary Desjardins: This class had a lot of promise, but tried to do too much. There were also weekly reading quizzes that picked out little nit-picky aspects of the readings--the readings were long and it was hard to pick up the details that the prof was looking for on the quizzes. The final two weeks of the class were spent on fan culture, which didn't seem to have much to do with film theory--I wish we could have spent more time learning the basics of film theory, as in explanations of different theories, so we could actually use that in later analysis. Don't take this class unless you're a major and it's required.\""
        ],
        "Amy Lawrence": [
            "review 1: \"08W with Amy Lawrence: Had to take this class for the minor, wasn't really expecting much. Overall, I'd say about half of the course material is pretty dry and half is really interesting. We spent A LOT of time studying Kevin Bacon in light of his coming to Dartmouth this term. Professor Lawrence is somewhat disorganized (especially with following the syllabus--it was always confusing when or if we had something due or not) but really knows what she is talking about. She also encouraged some interesting discussions on pop culture.\"",
            "review 2: \"06S with Amy Lawrence: If film isn't your thing, especially in an academic class, then this class isn't for you, but Amy Lawrence is a fantastic prof, and all the material is interesting. You learn about film and television from so many different perspectives, and learn all the major basic theories and ideologies. The work is great, the readings are kinda tough, but it's a tremendously rewarding class.\"",
            "review 3: \"06S with Amy Lawrence: i thought all film theory was bs until i took this course. Amy Lawrence was one of the best professors i've had at dartmouth; she is engaging, fun, and assigns creative assignments. i never thought i could learn about film theory by writing 8 pages on denzel washington, but we did! be patient with the first half of the course- the readings seem never-ending and they are more difficult than the readings at the end. the class is mostly discussion and it is great to get to know other film majors you haven't met yet. this course was superb, but i don't know if it would be as great if it was taught by someone else.\"",
            "review 4: \"05S with Amy Lawrence: If you don't mind doing a lot of reading (or trying to get by without reading) then it's a decent course. You learn all about the wide variety of criticisms and such that academics write about film and television. But just remember there is a fair bit of reading, and it's all dense esoteric \"film scholar\" language. But the class discussions are good and you learn a bit with them There are essays, too, but they were for the most part assigned with enough time to complete them satisfactorily. Lawrence is a solid Prof. Definitely one of my favorites, in the film department.\""
        ],
        "Paul Young": [
            "review 1: \"24W with Paul Young: one of the best profs in this school - if you need to take 40 take it with him. super encouraging during discussions and makes it easy to bring up points. exams/papers also graded very reasonably.\"",
            "review 2: \"21W with Paul Young: Only take this class if you are a film major/minor, or are really into movies. This class forces you to think about film in a very distinct way that will be hard to get involved with if you are not super into film. Plus, film essays are not easy. That being said, Professor Young is an undisputed top 10 prof at this school. He is always available for help with (sometimes very tricky) concepts, and his lectures are often quite funny and entertaining. He is very discussion based, and most of class time is spent in a seminar fashion. Really made the best of the online setting.\"",
            "review 3: \"19F with Paul Young: This was a good class!! It's really meant for majors honestly, so if you're not a film nerd and you're looking for an art distrib, this probably isn't for you. Professor Young is really nice, and encourages everyone to speak. You don't really have to do the readings honestly, and you can glide by as long as you participate! Young is really big into participation and if you don't for a long time, he'll probably call on you. Very laid-back environment and guy, though.\""
        ],
        "Mark Williams": [
            "review 1: \"23W with Mark Williams: If you're a film major, I'm sorry — you've got to just grit your teeth and get through this class. Mark Williams is one of the worst lecturers I've taken a class with: he recycles through the same class material between Weeks 5-9, hardly allows women any speaking time, and is generally condescending to all his students. On a weekly basis, he assigned ~4 discussion posts per week (each one 200 words), including one for the X hour which he used every week. We wrote a 5-7 page midterm paper, which was actually very manageable. The final, though, is a beast — it includes both a term paper (10-15 pages) as well as 2 essays (5-7 and 3-5 pages, respectively). The good news, though, is that you don't have to read or watch all his materials to get something out of the class. Participating even a little bit in class, and showing up to office hours, goes a long way.\"",
            "review 2: \"23W with Mark Williams: Mark is a nice guy. He is an admittedly polarizing professor, but I still enjoyed this class. The films are all really interesting, and Prof. Williams does his best to engage students in discussions about them, even if his lectures are somewhat complicated. I will admit, it's a little hard at first to \"buy in\" to the class, but if you do, you'll do fine. As others have said, this class is really only for Film majors, and it is definitely not a layup. Expect to write a lot about these films and incorporate complex ideas pertaining to semiotics.\""
        ],
        "Jeffrey Ruoff": []
    },
    "FILM038": {
        "Jodie Mack": []
    },
    "FILM037": {
        "James Brown": [
            "review 1: \"08W with James Brown: He talks and talks and talks and talks and talks and talks and talks and talks. He has good insights but could communicate them in a tiny fraction of the time he takes to do so. I loved the actual work of the class, but couldn't wait to get out of there at the end of every class period because it was so hard to listen to him blather on needlessly for three hours. That said, I'm glad I took the class, and he's a very very nice guy -- just incredibly frustrating in this respect.\"",
            "review 2: \"07W with James Brown: For me, Film 31 was one of the most interesting and exciting courses I have taken at Dartmouth. The prof. is a great guy and the course is one of the few in Dartmouth that give students much hands-on experience and an opportunity to really express their creativity. It is, of course, not without pitfalls. Allowing students much independence is one of the main strengths of the course, but it also can actually become a serious weakness. Students come in with a wide range of experience, and for some, the initial pace and amount of self-initiative expected might just be too much. I think for the first few weeks, a lot of handholding and firm coverage of the basics can really help the students. The time commitment can be rather nuts depending on what you want to do. If you have other intense, time-consuming courses, you might want to think over carefully before signing up. I think, however, the amount of time commitment can be well controlled by not going too far ahead of yourself. I had some more time, so I spent much of my time on the course, but I think depending on the students' schedules, the time commitment does not necessarily have to be extreme. We are not trying to produce Oscar-winning movies, after all. Another weakness I saw was the organization. The lectures I felt often lacked focus and the prof. was not always prompt with giving hand-outs on time. The teacher remedied this problem a great deal by holding extremely helpful ono-on-one biweekly sessions, but it still can't hurt to be a little bit more organized. If you have an interest in film and want to produce a crazy little short film, this class will serve your needs well. Just be aware of the time commitment and the self-initiative required.\"",
            "review 3: \"07W with James Brown: Prof Jim Brown is very knowledgeable about the subject, and provides excellent comments/criticism when he reviews your edits, but he has a tendency to talk. A lot. We watched movies in class, talked about filmmaking, and basically learned how to direct by actually directing. There was some instruction for how to direct, but most of the learning came from actually filming and from reading the Mackendrick book that was assigned. Overall, a good class if you're interested in filmmaking.\""
        ],
        "Samantha Davidson Green": [
            "review 1: \"18S with Samantha Davidson Green: The best class I've taken at Dartmouth. This is on the shortlist of classes you need to take before you graduate. It is a LOT of work, but if you do put in the time, it is incredibly rewarding. Samantha puts in the time, herself, and cares so much about every student and their vision. She is extremely talented, has a lot to teach you and will get the most out of you. Don't take this class if you don't have the time. Even after all the hours poured into the class (filming, meetings, workshops, screenings, etc.), I would do it all over again. Coursework: two films and weekly film analysis (5-7). Most of your work is done outside of class. You'll get an A if you care.\"",
            "review 2: \"17S with Samantha Davidson Green: INCREDIBLE class. Best I had in Dartmouth. Totally transformed my perspective in terms of filmmaking.\""
        ],
        "Iyabo Kwayana": [
            "review 1: \"24W with Iyabo Kwayana: One of my favorite classes ever taken; it was so fun to get to create a short film, and Iyabo is AMAZING she is so sweet and cares about her students so much! The thing to note about this class is that it will take a lot of time, as most of the filming and editing take place outside of class, and the X-hours are used for workshops to learn how to use the equipment, how to edit, etc. One thing that might get you ahead of the game in this class is having an idea of what you want your film to be about; it’ll save you about a week of brainstorming that you can use as more time to shoot scenes or edit. Grading-wise, definitely a layup as long as you show effort in the assignments for each part of the process.\""
        ],
        "Samantha Davidson": []
    },
    "FILM036.03": {
        "Peter Ciardelli": []
    },
    "FILM036.01": {
        "Jeffrey Ruoff": []
    },
    "FILM035": {
        "David Ehrlich": [
            "review 1: \"09W with David Ehrlich: This course is seriously work intensive (just like most of SART courses I guess). It's mostly drawing - you just draw and draw and draw. While you don't have to work A LOT, you get out of the course as much as you put in. The last four weeks or so of the term you work on a project of your choice, in a media of your choice. again, can be a lot of work. I would pull at least one all-nighter every week, mostly before the day we had to present our progress. Prof. Ehrlich is neat and likes to get to know students on a very personal level and will offer you advice on any aspect of your life (not only academics).\"",
            "review 2: \"09W with David Ehrlich: I took this class because I was like \"hmmm...3rd class? animation? I guess I'll give it a try.\" I have no background in drawing/artsy stuff. But I absolutely loved loved loved this class. David Ehrlich is the most amazing person I have ever met. He makes everyone feel really good about themselves, and realized the special qualities in everyone. He's awesome. As for the workload, I feel like this should be explained. Yes, you have to put 20 hours a week into this class. But you can do it. It's not \"thinking\" work. So I would watch tv or listen to music while I animated. I found the animating \"homework\" relaxing, rather than stressful, because I just got to draw and catch up on tv shows. I'm a varsity athlete, and I could still put in the work for this class because I enjoyed it so much. You'll like this class so much that you'll find time to do the work, trust me. And being in this class just to experience the presence of David Ehrlich is worth it. He WILL be your favorite professor at Dartmouth. hands down favorite.\"",
            "review 3: \"09F with David Ehrlich: This was an amazing course. As a biochem major I had never taken an art class at Dartmouth before. I couldn't be happier with deciding to take this one. David Ehrlich is an amazing teacher and person. I think he inspires a love for animation in every single student he has ever taught. Not in all of my studies have I felt so accomplished after completing a course.\"",
            "review 4: \"06X with David Ehrlich: Well, it's obvious I am biased in favor of this course, given the stats I gave for it and for the prof, David Ehrlich. This is because I found this class, Animation, to be a great combination of my interests (and majors) in studio art in biology. I felt it realized the best of each subject, and so I spent the term focusing on naturalistic animation involving human, animal, and insect movement. It was a great class, with a great prof. As our workload increased with each animation project, David offered more and more of his time and resources, and by the final project, he had started supplying us with food, drink, even a sleeping bag at the studio. Many students used it. The 20 hours described as the expected workload for this class is no exaggeration. We spent an average of 15-25 hours a week on animation alone, and I also took another art class at the same time that required 10 hours of outside work. It was not easy, and it's recommended that you take this with just one other class. Given everything, I highly recommend this class, even (and maybe especially) to those who don't consider themselves artistic. Animation requires a lot more than artistic talent, and there are many different ways to create an animated short - clay, mosaic, motion capture, and traditional drawing. Again, great class, and great prof. This class requires passion, dedication, and motivation!\"",
            "review 5: \"06W with David Ehrlich: This class will be one of the greatest classes you could ever take. However, the work load is incredibly intense. There is a project a week until the final project, and each subsequent week requires more work. One of the great things about the class was that David did not teach us how to animate as much as show us various ways we could develop our own styles. Each student in our class developed a wholey unique style. By the end you will be wanting to learn more, and make up for all your lost sleep, but contrary to popular opinion it is possible to get sleep if you pace yourself well. There were a number of people in our class who were taking two other intense classes, such as orgo, and were able to survive the term.\"",
            "review 6: \"06W with David Ehrlich: Holy crap, this course is so much work. Many weeks, and especially at the end, people were passing out with exhaustion and kind of going crazy w/o sleep. Animation is insanity-inducing and frustrating, but overall very rewarding. THis is a strange class b/c as \"miserable\" and draining as it is, the entire class loved the experience and was sorry to see it end. Ehrlich pushes every member of the class individually, and he really tried to find something unique for everyone to work on. He was very supportive and encouraging throughout the entire class. Any class with this man is worth your time. Also, the bonds created between everyone in the class was uncanny- there were 12 people who were really really different, who probably wouldnt get along under normal circumstances... and who ended up to be really good friends. overall the class is worth the agony, but try to only take one other class in whatever term you're taking it.\"",
            "review 7: \"06W with David Ehrlich: This class is amazing. David Ehrlich really gets everyone into the course and you become really good friends with your classmates. The workload is insane though, and it's probably best if you take this class on a two course term or without a lab. You don't need to have intense artistic talent to take this class, which is nice since there's a lot of different mediums to animate in. Take this class, you won't regret it!!\"",
            "review 8: \"04X with David Ehrlich: David Ehrlich is an incredible teacher that will inspire you to do amazing work you may have thought you were not capable of doing. To do this course the right way, it really requires full dedication and at least 20-30 hours a week outside of class. It's like a full time job, but to do any less just makes the class not worthwhile. Regardless of your ability level, this class will be one of the most memorable things you do during your four years in New Hampshire.\"",
            "review 9: \"04W with David Ehrlich: This class was incredible! It is really fun and didn't actually feel like a class, it just felt like a place that I wanted to spend as much time in as possible. The entire course is a workshop in animation, so the course had 4 small animation projects and one month long culminating project that was shown in the dartmouth film festival in the spring. In class was devoted to watching animation and critiquing other students work. This class was a great deal of work, especially the last month of it. I would recommend taking a two course load if you choose to take this course because you will want to spend all your time doing the work for this class and spending time with the other students. I left this class with a love for animation as well as a group of close friends who I absolutely love. The only negative aspect of this class is that many of the students in the course were seniors and graduated shortly after I got to know them. I will miss them all terribly, but they will always be a part of who I am. I bring this up because if you take this class, you spend all term with the people in your animation class and you will grow to love them until it feels like you are part of a family of crazy and wonderful animators. It is an incredible experience, and if you are even vaguely interested in animation, TAKE THIS CLASS! because you will leave it a different and happier (albeit more sleep deprived) person. It is an intensely rewarding experience!\"",
            "review 10: \"02S with David Ehrlich: This was the best class I've taken at Dartmouth so far (although also the most work.) Prof. Ehrlich is very accessible outside of class and is just a very interesting person. The class is a ton of work, however, 20 hours/week or more.\"",
            "review 11: \"02S with David Ehrlich: A lot of work, but it was worth it. A LOT of work. Don't take this unless you have 10 hrs at least to spare per week. It will eat those hours away. I pulled a couple of all- nighters for this course (some people actually took to keeping their sleeping bags and toothbrushes there). But I think most everyone thought the end result was worth it. A huge relief. A lot of fun. And getting to know Professor Ehrlich is half the fun. He has the weirdest anecdotes ever.\"",
            "review 12: \"02S with David Ehrlich: takes a lot of time and work of the rather boring sort of variety, but your final product is pretty satisfying. it's good to balance out some more involved classes if you want to do something art-related that has sort of brainless homework (i'm talking about drawing the same thing over and over for 3, 4, 5 hrs..). the small class size really made it a fun group and i enjoyed going to class and especially seeing each others' work.\""
        ],
        "Jodie Mack": []
    },
    "FILM034": {
        "William Phillips": [
            "review 1: \"07S with William Phillips: I really enjoyed this class, but it was almost entirely because of the other students. The ones who actually cared about the class made it really interesting and had a lot of great insight and cool material (and some of their scripts were great). Professor Phillips isn't a great professor, but he's good enough for this class. His biggest problem is that he lets his personal feelings about students influence him a lot of the time -- i.e., he'll let people he likes slide on things that he'll yell at other people for, and so on. So don't get on his bad side, because he holds grudges. The workload is pretty intense, but if you space it out over the term then it's not too awful.\"",
            "review 2: \"06S with William Phillips: the course is a workshop in which the students complete a feature-length screenplay. what you get out of it depends upon how receptive you are to comments and suggestions. do not go into this class if you are expecting lectures or a clear, step-by-step explaination of how to write a screenplay. also, please don't take this class if you are defensive about your work (why would you be taking a workshop class if you don't want people to critique your work?) or if you only plan to talk about your own work and not give suggestions to others.\"",
            "review 3: \"06S with William Phillips: The major advantage to this course is that, whether youâ€™re ready or not, you will leave it having written a full, feature-length screenplay. I can tell you that thereâ€™s no way I would have ever written a screenplay so fast if not for this classâ€™ due date. Thatâ€™s both a good and a bad thing. Class structure is much like Film 33, but even less lecture. Every minute of this class (thatâ€™s not spent in the fun but sometimes slightly out there tangents that Bill always allows) is spent in workshop. Thatâ€™s a lot of minutes. But youâ€™ll get lots of feedback on your pages. The other trick of this course is that you HAVE to be writing an average of 20 pages per week. For me, the speed caused me to rely on tropes and simplified plot, but I canâ€™t tell you how happy I am that I at least have a full screenplay in handâ€”a starting point. My general consensus is that, if you liked 33, finish up. Take 34. Youâ€™ll learn a ton, if only from yourself. And, as always, watch out for typos in your final draft!! Bill will want a pound of flesh for each one.\"",
            "review 4: \"06S with William Phillips: The professor is quite lazy. He reads your papers on the elliptical and makes very minimal comments. He's a nice person, but he doesn't really care about teaching. I think his motto is, \"get away with not doing as much as you possibly can and call it work\". Also, he let an annoying old lady audit the class and she got the class off topic all the time. Basically, The professor was not able to keep the class under control long enough for anything productive to happen all term. The only way this class is beneficial is that it forces you to write and finish a draft of your screenplay, but the comments in class were useless and no one seemed to understand the very basic way in which a workshop is supposed to run. Also, the professor's comments were often useless. The only thing he is capable of doing is spotting typos that often aren't actually typos. Like I said, he is a nice person, but he is not a good professor. Also, he is very bitter at the film industry because he never really \"made it\" and as a result, he feeds the class a very distorted and bleak view of an industry that many dartmouth alumni are finding a great deal of happiness and success in.\"",
            "review 5: \"05S with William Phillips: The point of this course is to complete a full-length feature screenplay...and that is exactly what you accomplish. Try to stick to the suggested page number per week plan and you'll be fine.\""
        ]
    },
    "FILM033": {
        "William Phillips": [
            "review 1: \"23F with William Phillips: I learned a lot about writing for the screen, using relevant screenwriting software, and the business behind screenwriting in this class. It was fairly easy as well. That having been said, I have two main complaints. First, Professor Phillips, who is super smart, kind, and qualified, is also... old... and a little long-winded / seems to be going senile. I feel bad saying this, but I include it because it was a detriment on the class and the workshop that he would spend so much time talking about random unrelated stuff or his director friend who did this that or the other movie. I wish all the class time had been used for teaching or workshop. That having been said, Phillips is fair and lets you write about anything you want. He does not play favorites and has a real investment in everyone's work. Second drawback: fellow students were all at totally different levels of writing, which meant sometimes we were workshopping stuff that was simply not ready to be workshopped. Phillips does not provide tons of fiction / writing advice, so if you are unsure of your abilities in that area, I highly encourage you to take an Intro writing class in the creative writing dept. before you take this one. Nor can Phillips steer the workshop in a very helpful manner. If people start going off topic / telling anecdotes / whatever, he does not stop them. But if you love writing and want to get into screenwriting (and you can't get into / have already taken Carabatsos's Writing for TV class) then you may enjoy this class.\"",
            "review 2: \"21F with William Phillips: This class is so fun! I highly recommend it. You learn how to use Final Draft and actually walk away knowing how to write a script. Prof. Phillips is really encouraging, super nice, and tells interesting stories in class. You watch movie clips, workshop your script in class with others, and read it out loud. If you enjoy creative writing and coming up with movie/television ideas, this class is the best.\"",
            "review 3: \"17W with William Phillips: Fantastic class! So much fun, but also intellectually engaging. I love having a creative outlet, and this was so cool because you get so many opportunities to put your ideas into play with your scripts. You have to write a feature film and a short film, and everyone's ideas are so cool. It's only fun though if you're willing to really sit down and write your scripts. One time, I ran out of time, and turned in something that was not my best work. When we discussed it in class, it was pretty sad. I still got good feedback, but I kept wishing I had put more work in! Great class, not TOO much work, but best output is if you put in work. It also sucks when people don't give you good comments, so take this class if you're willing to dedicate it to your work and to your peers!\"",
            "review 4: \"13F with William Phillips: Course: This was a great course and I learned a lot. I loved the seminar style of the class that allowed me to learn a lot from Professor Phillips and my peers. I definitely grew as a writer and I learned information that will help me in my future efforts to work as a screenwriter. Professor: Professor Phillips is really knowledgeable and gives great anecdotes about his experiences as a writer. He is also pretty understanding with regards to students that turn work in late. Late work won't be discussed in class but those are the only consequences. He's very openminded and creative in his thinking, making the classroom a safe space to discuss whatever ideas cross your mind. Workload: The workload is really manageable but you get out of the class what you put into it. If you choose to not participate in discussions and revise your work you won't get much out of it and you probably won't enjoy it.\"",
            "review 5: \"08W with William Phillips: This class was very fun and laid back. I would have liked a few assignments from the screenwriting book we were required to buy (because I don't think anyone actually ended up reading it!) But overall, Bill Phillips is really fun and the class is great. Your assignments are basically to write and read other peoples' work. You come out of the class with a short script (10 pages) and 20-30 pages of a feature length script. There's not a lot of instruction, so if you want a term to write, go for it!\"",
            "review 6: \"08W with William Phillips: The only negative comments I've heard about this course from any students was that there wasn't enough instruction. Those students were usually ones with poor writing skills and ideas- this class if for people who are interested in screenwriting, not for those who have no idea how to write. It is all workshopping, you learn to make strong decisions and defend them, which is half of what a screenwriter's job is, so if you cant handle criticism, you probably shouldn't take it. Phillips lectures are more stories about the business and how it works. Overall, a great class that forces you to write and let's you interact with other creative students.\"",
            "review 7: \"08F with William Phillips: The class is a great opportunity to try writing a screenplay, but you won't get much feedback from Phillips other than his instructions on how to format your script. Also he's so laidback that it's easy to do much less work than is assigned if you want.\"",
            "review 8: \"06W with William Phillips: This class is exclusively a workshop class. There are no mandatory readings. Prof. Phillips calls the text book â€œrequired,â€\u009d but he never assigns pages in it. Rather, he expects that you will refer to it as you need to in order to write your script. While I suspect most people donâ€™t even crack the spine, it is a useful guide, which is ideal, considering that Prof. Phillips wonâ€™t lecture on the craft of screen writing once. For some, thatâ€™s a blessing. You learn by example, both positive and negative, considering that the only screenplays youâ€™ll read will be written by your class mates. And, other than Prof. Phillips red marks on your drafts, theyâ€™ll be your main source of feedback. For me, that was more of a curse. I wish Prof. Phillips had done at least a few lectures. Workshops got boring, and I feel like I could have learned a lot more about the subject had Prof. Phillips delved into his extensive knowledge base. On the other hand, how are you supposed to teach something â€œcreative?â€\u009d All in all, this is a good course. The work is spread out, so you can divvy it out depending on the intensity of your schedule from week to week. However, donâ€™t take this if you arenâ€™t committed to your own personal screenplay. The one biggest advantage of this course by far is that it grants you the opportunity to write.\"",
            "review 9: \"06W with William Phillips: Professor Phillips is an easy-going, fun professor. The class is pure pleasure: write and watch movies and talk to other people with similar interests in film. Further, Professor Phillips reallly knows his stuff when it comes to the film industry. He is full of practical and amusing advice, which is just how it should be in this instance. A theoretical approach to screenwriting would be completely worthless, and luckily, Phillips sees that. Anyone who has watched a number of movies should have a basic intuition for how a film's story should be developed and structured. The class is all just hands on experience writing and getting feedback. He does a good job helping students learn how to use Final Draft, which is the main benefit to taking this course. I think formatting is the major issue that stands between potential screenwriters and those who actualy end up doing it. So for that alone, this class is incredibly worthwhile. My only complaints: the class gets off to a slow start, and few of the other people in the class were annoying and wrote really bad scripts, and it was painful to comment on them. It seems that with an application process, these people could and should have been weeded out. I'm not sure what happened, however, that is not really a fault of the professor so much as the quality of applicants (most likely). Some people should never take screenwriting because they will never be good at it and that is all there is to it. Professor Phillips falls very much on the realism side of the fence when it comes to making films, but he encourages students to follow their visions rather than conforming to his aesthetics, and for that, I admire him immensely. He is respectful of his students and very encouraging. He makes a big deal about attendance and punctuality, but in reality, he is kind of a softie.\"",
            "review 10: \"06F with William Phillips: It was a great course, and a great introduction to screenwriting. I just would have liked more instruction in terms of how to construct a good scene of drama, what is the best way to heighten the tension in a scene, etc. It was more learn by doing, and you'd learn based off of the other students' comments on your script. Overall, if you like writing, then this is a great course.\"",
            "review 11: \"05W with William Phillips: pretty good class, definitely good to take if you're interested in screenwriting.\"",
            "review 12: \"05W with William Phillips: Bill Phillips is an awesome, no-nonsense prof - all he really asks is that you do your best, turn in assignments on time, and not be late/absent. You can really do whatever you want with your screenplays, as long as you write a certain # of pages and limit yourself as few typos as possible. Class was interesting and very relaxed - every few minutes Phillips goes off on a new tangent about Hollywood and his experiences that actually teach you more than you realize as you're listening to him. I left the class with a clear picture of how the business works and the no-BS truths about how you have to write and sell your screenplay. Although this class is as unpractical as they come, it was never a burden to go to class, and I was sad to leave on the last day.\"",
            "review 13: \"05F with William Phillips: Professor Phillips is awful. He will give you a for the whole term BEFORE he even reads your script. It happened to lots of people, not just in my class. Don't let him trick you with his \"I'm a nice guy\" attitude. He's just lazy, and you can't depend on him for anything, least of all, fair criticism regarding your work. He's only nice if it is convenient for him. His grading doesn't make any sense. I was lucky to get a good grade, but it was arbitrary and unfair. Don't take this class if you want to learn about screenwriting. Only take it if you want to listen to a bitter, discouraging old man who knows absolutely nothing about screenwriting, as demonstrated by his godawful film he wrote and directed called \"There Goes the Neighborhood\" that he makes the class watch. He couldn't say a legitimate comment about the technique of screenwriting to save his life. The class is insulting to anyone who has any sense about narrative structure, dramatic tension, or building character. I'm surprised he's still allowed to teach at Dartmouth, although the fact that his wife is head of the Creative Writing program probably accounts for that. This class is a waste of time, money, and frustration. I'm disappointed in Dartmouth for letting such a lazy, sloppy professor who does not have tenure stay in his position year after year. If I could ask for my money back, I would.\"",
            "review 14: \"04F with William Phillips: Bill's class is a good way to take a shot at working on writing a screenplay in a unintimidating environment, which is great if this is your first time trying something like this and you're nervous. Bill is real laid back and will go out of his way to help you with anything, he's as nice as could be. The class is mostly what you make of it - all of the assignments are to work on your own creative writing/screenplays and ideas. If you're expecting things to be handed to you on a plate, you'll be disappointed, because most of the class time is spent discussing other people's writing and doing in-class readings.\"",
            "review 15: \"04F with William Phillips: While the course was a lot of fun, Phillips had to be forced into actually teaching anything. Usually he was content to sit back and let the class work as a workshop. He should focus more on creating a balance between workshop/lectures, as screenwriting is not something that you can just figure out for yourself.\"",
            "review 16: \"04F with William Phillips: I felt that this class was sort of a waste of time. The format was the problem. Twelve students sitting in a room talking about other students work. This seems to promote nitpicky examinations of work rather than useful discussions. I felt that a short miniversity course would work better. All you need to know is the basics of final draft and the style that screenplays require and you can begin writing. It shouldn't take an entire term. However, on the bright side it is an ART distrib, so it's easy if you need it. As for professor Phillips, he is a nice guy, but he gets confused by modern references in screenplays and I feel he can be ineffective in commenting on the meat of the screenplay story because he focuses on the technical aspects. He is extremely helpful with his comments on technical aspects, but you don't need a full course to learn that. As for grading, that is a bit arbitrary too. The whole grade is based on the last script you turn it, your previous effort means nothing and he gives no way to standardize the grade. Class attendance is also required at the threat of grade reduction.\"",
            "review 17: \"02W with William Phillips: This was the most fun, most interesting class I have taken so far at Dartmouth. It is a workshop format class, so everyone gets to read and comment on other people's work and get feedback on their own work. Allows you to get really involved with the story you are writing. The actual class time is fun and very worth going to (I don't think I've ever said that about any other course). I highly recommend taking this class for anyone who likes film or likes to write.\"",
            "review 18: \"02W with William Phillips: This class really teaches you the basis technical techniques of screenwriting. It's set up as a workshop where the other students read your work and then comment on it, but sometimes the comment is just lacking. Phillips definately does most of the commenting. He does have experience in \"the business\" and his stories are interesting. Some lectures expose the not so pretty side of Hollywood. It's fun to watch movies as homework, and talk about your favorite actors and directors in class. One criticism is that too much attention is paid to the technical side of screenwriting, and not enough to the creative. You may end up with a grammatically perfect script, but a mediocre storyline.\""
        ],
        "Cirri M.": [
            "review 1: \"07F with Cirri M.: The class has a very clear structure that is outlined from the very beginning. Professor Nottage is very good at guiding you through crafting a screenplay and all that that entails. Be prepared to turn in about 6-10 pages of writing regularly, but then, this is a writing course, so that's really not too much to ask for. Prof. Nottage can be a little passive aggressive at times (probably coming from her experience in the film industry and a no-bullshit approach to work), but she is also available to students. Definitely a good class if you have ANY interest in screenwriting.\""
        ]
    },
    "FILM032": {
        "James Brown": [
            "review 1: \"05W with James Brown: This class can get on your nerves because you only get to make one film. You spend A LOT of time writing scripts, then at the end of term have to scramble to make a final film. It would be a lot better if you got to shoot more films. Prof Brown also is very resolute in his opinions of how your film should have been shot. Can be very hard to convince him otherwise.\"",
            "review 2: \"03S with James Brown: If you are taking this class, you probably already took Filmmaking 1 and know all about it. Prof. Brown is great, if sometimes a little hard to track down. At the end of the class, you have a film that you've finished and that is screened in Spaulding. It's a more rewarding experience than writing a term paper.\"",
            "review 3: \"03S with James Brown: Making films... what more is there to say? Prof. Brown is a bit long-winded at times but really exhibits a profound understanding of the subject matter. You can come away from the class understanding cinematography and basic concepts of directing and story telling. A fun class.\""
        ],
        "Iyabo Kwayana": [
            "review 1: \"21W with Iyabo Kwayana: The best professor and best class for culminating projects. Highly recommend any class with Iyabo because she is extremely understanding. Though a bit disorganized, this often gets assignments pushed back or canceled all together.\""
        ],
        "Samantha Davidson": []
    },
    "FILM031": {
        "James Brown": [
            "review 1: \"08W with James Brown: The class is good though the emphasis is on practical filmmaking so don't expect extremely effective lectures on theory. This class will get you through the basics of 16mm filmmaking and the theory necessary to put together a short of your own. The level is nowhere close to film schools, but Jim is a great prof, an extremely nice and knowledgeable guy who will make your journey through the joys and pains of filmmaking bearable. Do take this class.\"",
            "review 2: \"08W with James Brown: the fun and also the challenge is that you'll be dealing with serious and expensive film-making equipment, no digital cameras here. Take advantage of the group exercises to learn the technical stuff, so that when you make your own movie (the final project), you feel comfortable handling the equipment. Personally, I wish I could take more hands-on classes like this instead of the required theory classes. The prof is great! He's very funny and chilled. At the same time, he'd give you very useful suggestions to your movie idea or your cut. Beware that the syllabus might seem unorganized, so if you are confused about the assignments, just ask him questions. Lastly, if you've taken film 1, this class is great because you'd get to apply what you learn into your own movies!\"",
            "review 3: \"08W with James Brown: This is a great class for anyone really interested in how films are made. After doing a couple short exercises in editing and filmmaking, each student produces a short 16mm film during the last few weeks of the term, which can be anything from another exercise in cinematography to a complex short narrative. The point is, beyond the basic requirements, you decide what you want to get out of this course. Jim is a rambling lecturer, but then again, you won't learn much about filmmaking by listening to someone tell you how to do it. He strongly encourages a hands-on approach, and is very helpful outside of class for questions or to just throw ideas around. Sometimes the work was pretty stressful, with some long hours out of class. But as with any other art, all the satisfaction lies in the final product, and nothing beats the feeling of successfully going start to finish on something like this.\"",
            "review 4: \"07W with James Brown: As this is a production class, it's a little different from the vast majority of classes. It takes a lot of out of class time to edit and shoot the films and so it's a big time commitment. But the class is really fun and a really good learning experience to get accustomed to working with actual film. It's definitely worth taking.\"",
            "review 5: \"06S with James Brown: this course is great if you want to learn filmmaking, because you will be thrown right into it. JB's lectures are mostly incoherant and the readings/test don't count for anything. just come to class and make creative films and you will do fine.\"",
            "review 6: \"06S with James Brown: This class is pretty good. The professor is not perfect and neither is the class, but it could have been a lot worse. I got a good idea of what it is like to make a film by the end of the course, so I did learn from it. The class itself wasn't really very fair. The midterm counted for about 1% of the grade, which I think was a opportunity the professor had to make grades somewhat objective and then didn't take it. The professor is at times tempermental with certain students, and he tends to ramble, but he is in general pretty nice and willing to help, and he is responsive to student questions. So it was a pretty good glass, but it was missing something to make it a wonderful experience. Also, don't take this class if you aren't willing to spend a great deal of time sitting in the editing room, because that is what most of the class turns into by the end of the term.\"",
            "review 7: \"06S with James Brown: It's a production class, so most of it involves learning how to use the complex equipment, then going out and doing it yourself. Professor Brown is knowledgable, but tends to ramble. If you're willing to make the time commitment to really learning how to make a film (it's not easy), then the class is fine.\"",
            "review 8: \"05S with James Brown: The course was interesting and you learn all about how film works and how to use a film camera, plus you get some experience editing on Final Cut Pro, and you learn about lenses and f-stops and all that jazz. However, the course is a lot like being tossed in the deep end as a method for learning how to swim. The first weekend everyone spent around 15-20 hours on the first film assignment because no one knew what they were doing and had to rely on each other to learn the material. Prof Brown is very knowledgeable, but for some reason, he acts like all of us understand the material and teaches us very little in class. He will answer your questions and will teach you a lot and help you if you ask him, but don't expect to learn too much in class by default. You'll just be learning by doing and by refering to the text book. It worked for me, but some people had a lot of difficulty because you never actually learn *how* to tell a story with film, like how to edit and what not. For that, you have to ask Brown for advice on your film or to look over it. Then he'll teach you. So if you can learn to swim by being tossed in the deep end, this class is for you. It also helps if you already know how to tread water.\"",
            "review 9: \"05S with James Brown: This is a great class to take if you like exploring the world of film using a hands-on approach. The work starts from the get-go and it is necessary to stay on top of things. In addition to having 3 films to shoot, you have to review movies and keep a journal which are very time consuming but worth the effort if you want to learn more about filmmaking. All in all a good class but be prepared for the work load\"",
            "review 10: \"05S with James Brown: At times, many times, there was confusion about how to do a lot of the things that was expected - that might have been b/c I came in late in the term - a spot opened up (I recommend not doing that). There could have been better lectures, but overall the course was open to creativity!\"",
            "review 11: \"05S with James Brown: This is probably the worst class that I've taken at Dartmouth. It drove me NUTS. Professor Brown is a great guy outside of class, but as a professor he is a mess. He doesn't teach--he just sort of has dialogues with himself and expects us to be able to read his mind. (ie, he never really tells us what our assignments are, but expects us to know exactly what's going on.) He never teaches us anything in class, so you have to go out and shoot with no idea what you're doing, and then once you get the film back he tells you all about exactly what you did wrong. Since you learn everything retrospectively, it is impossible to be happy with your work because you always find out too late what you did wrong and therefore you always feel like your work sucks. It is a maddening class and that is too bad, because it has the potential to be really good.\"",
            "review 12: \"05S with James Brown: Brown can be a tough critic but he does it in the most tactful way. And though his advice may seem heavy handed he knows what he is talking about. The class is very demanding but at the end of it you come away having learned a lot of the technical as well as aesthetic aspects of film production. Even though he seems distracted at times Brown is a great guy to get to know. Its really fun producing your own film.\"",
            "review 13: \"04F with James Brown: definitely very hands on. i've made three films, very time consuming, but awesome and i have three films! brown strays off topic easily, but the course is not rigidly structured and fun. take it if you can.\"",
            "review 14: \"04F with James Brown: i really enjoyed this class. its the only class i've taken at dartmouth wehre you learn something and the very next week you go out and use it. jim brown is also very knowledgeable and an awesome prof. dont be fooled, however. this class takes a lot of outside work\"",
            "review 15: \"03F with James Brown: The course structure and assignments are pretty logical and helpful for learning the Basics of Filmmaking, so it doesn't stray to far from its title. Unfortunately the professor likes to stray and does so often. The class has a huge amount of class time, including a weekly meeting requirement. Unfortunately, again, Prof. Brown doesn't seem to find them important, not showing up for about half of them and without notice. This seemed to be a theme with all the students. The lectures are dry and often include little more than watching movies. The class seems geared toward students who are interested in \"the business\" or something like that. It is not geared toward students interested in appyling aspects of film to other academic projects.\"",
            "review 16: \"03F with James Brown: great course, for anyone from film newbie to those thinking of film production as a career. total creative freedom, you get to make the final film of your choice. vastly increases your working vocab of techincal terms dealing with lighting, photography, editing. a lot of time outside of class is required, because we help on each other's shoots. but it's time well spent, and you're a part of many fun productions\"",
            "review 17: \"03F with James Brown: i highly reccomend this class for anyone who is interested in film -- major, minor, what have you. while the lectures may occasionally put you to sleep (sitting for three hours straight through ANY class will do that to you!) this is rare. we watch a lot of movies (especially old student films) and discuss film techniques. the key to the class, though, is the actual filmmaking itself, which is completely open-ended. you have total free range and can make your films about pretty much anything...and you work on other students' films, too, which is great, fun, inspiring, etc! you leave (at least i did) with more ideas/questions than you came in with. the prof is great -- very very receptive to students. he has weekly meetings with you just to chat about your films, and often keeps you later than the usual half hour (but only because he's so genuinely interested in your work). great class, great prof, very interesting -- and you walk away with three great films! take it. great.\"",
            "review 18: \"02F with James Brown: You get to shoot and edit celluloid - is there anything else you can say? The prof was great and the cohesiveness of the students was really nice. Watch out though - costs can skyrocket.\"",
            "review 19: \"02F with James Brown: I love all the production courses in the film department. They usually end up taking up more time than any of my other courses, but I don't notice because I enjoy working on them. I'd recommend this class to anyone remotely interested in the subject -- you learn a lot of technical stuff but can also be creative. The format of the class is very free form. (Meaning if you're one of those people who can't stand not having exact due dates, it's not for you.) Because it is the first in a two part series finished in the spring, students can work at their own pace and focus on what interests them. I also really liked the small class size (12 in our class, two dropped to make it 10) -- you really get to know some of your fellow students that you normally wouldn't.\"",
            "review 20: \"02F with James Brown: James Brown is the most accessible, down-to-earth professor I have encountered at Dartmouth. He's always available to talk shop or just bullsh*t about film with his students, he is flexible about the workload, and he understands that students at this level of work are serious enough that they won't turn in a bad product at the end of things. Take this class, but be ready to put the time in.\""
        ],
        "Shevaun Mizrahi": [
            "review 1: \"23W with Shevaun Mizrahi: TAKE IT, in all caps and screaming. You will learn so much out of the class, knowledge just flies at you from so many directions. Prof Shevaun might just be the kindest and most engaging prof that I have encountered at Dartmouth. However, a major caveat is to not treat the course as a layup, if you give genuine effort to it, prof Shevaun directly rewards it in the grading. It is a major time commitment though, you're running the production all by yourself and also later editing your project. Do not recommend doing the class in a 4 non-layup course term.\"",
            "review 2: \"22W with Shevaun Mizrahi: Shevaun is wonderful. Deeply caring professor and very focused on creating an environment for students to explore their ideas. Class is structured to help students succeed and grading is very generous. Would highly recommend.\""
        ],
        "Iyabo Kwayana": [],
        "Samantha Davidson": []
    },
    "FILM030": {
        "Jeffrey Ruoff": [
            "review 1: \"21S with Jeffrey Ruoff: The structure of this class changed due to COVID, but I really enjoyed the new format of the course. Instead of a term-long 10 minute video, each person had 5 smaller assignments throughout the term that focused on different technical aspects of filmmaking and editing. The production lab component with Peter Ciardelli was a great introduction to video editing, as I personally had never edited video before. Ruoff makes the course materials really accessible and none of this class requires that you be a film major/minor. In general, if you have never done film before but are interested in taking a class, take this one. The editing process can be a lot of work, but it's incredibly rewarding to see the finished project.\"",
            "review 2: \"21F with Jeffrey Ruoff: Not hard to get an A. It's a lot of work, though, especially towards the end. Jeffrey also gives a lot, maybe too much, independence on the projects, so if you don't know what you're doing, you have to try hard to have something presentable in the end.\"",
            "review 3: \"19F with Jeffrey Ruoff: Great class, even if you have zero experience. You basically spend the entire term working on a documentary, and every week, you critique each other's work. There were a varying levels of skill within each of the groups, and I think that everyone will agree that we all learned about what we can personally handle and what we can all do. This class does take up some of your weekends so be prepared for that, but it's such a supportive environment, and everyone's just rooting for each other to do well and make good films. Tip: Ruoff is the type of filmmaker who prioritizes clarity over style in his grading, so keep that in mind when you're deciding on edits. He's also the chillest dude ever. When he pulls up to class in his salmon pants? Swoon.\"",
            "review 4: \"07F with Jeffrey Ruoff: I'm not a Film major and I have never done anything film related before, but the class was so much fun! Really it was great to do something outside my academic purview. I now want to go into film in some capacity in my future. It was great to go through the entire film production process; I really learned a lot and it was great not having to write a paper (the exam was easy).\"",
            "review 5: \"06X with Jeffrey Ruoff: It is kind of crazy, what is expected of you for this class. The most work I've ever spent on any course. I don't really know how else you can make a film without putting in the work, but it is all a little overwhelming in the short summer term. Attendance and participation is required at every class but all you do is watch movies and talk about them. And the professor doesn't really teach you too much. The TA does all of the technical stuff. The professor's critiques are really helpful when it gets down to it, but for the most part he is just kind of there. He doesn't really seem to care one way or the other how things are going. Unfortunately, unlike every other art class I have taken here, the amount of work and the quality of your final project do not guarantee a good grade. So if you want to spend a summer pulling serious all nighters in an editing studio with no gaurantee of a good grade, take this class.\"",
            "review 6: \"04X with Jeffrey Ruoff: Ruoff is great -- smart, funny, good lecturer, definitely inspires interest in the medium. The class is good -- you are put in a group (of about three people) and you spend the whole term creating one documentary. The problem is that all the grades are based on groupwork, and that could be tricky because things weren't always totally even...Also, this class is definitely a lot of work. If you are interested in film, though, it is worth looking into.\"",
            "review 7: \"03X with Jeffrey Ruoff: Professor Ruoff shows some interesting documentaries for the course and really challenges you to think about filmmaking. In terms of learning editing though you are pretty much left on your own. This, like any other film production class is extremely time consuming but well worth it if you have any inclination at all towards film production.\"",
            "review 8: \"03X with Jeffrey Ruoff: Making documentary films is a wonderful experience. Prof. Ruoff is extremely knowledgeable and responsive. The subject matter for the films was interesting. The course design worked very well toward a general understanding of films of persuasion and an understanding of their inner workings. Great course.\"",
            "review 9: \"02X with Jeffrey Ruoff: This was my first (and probably only) production class, and it was great. I've never worked this hard (and not minded putting in so many hours!) for a class at Dartmouth. The one aspect I didn't like: early in the term, for a few days we sat around for two hours and really discussed nothing in class. It was before we really started our projects, and I think the time could have been better used watching and analyzing other people's documentaries. But by the third week we started working, watching our own stuff and other people's stuff, and this was a really rewarding class. Especially the final screening in Loew!\"",
            "review 10: \"02X with Jeffrey Ruoff: He shows interesting documentaries and the class discussion is thought-provoking. The material he tests on is a bit random so make sure to read the whole book. He is accessible, personable, and strikes a delicate balance between teaching and allowing his students to form their own opinions on the subject matter. Great course! Great Prof!\""
        ],
        "Nora Jacobson": []
    },
    "FILM023": {
        "Mary Desjardins": [
            "review 1: \"23S with Mary Desjardins: A pretty interesting class! We watched a lot of very good films that I never would have watched on my own. The workload wasn't bad, and the textbook readings aren't super important since all the material she expects us to know, she will lecture about in class, and having a slightly different edition of the textbook is totally okay for getting through the class, even though she had insisted we need a certain edition for the most up to date stuff. There are a couple of films that need to be viewed outside of class (like HOP Screenings or watching a film for homework), and all X-hours are used. Prof Desjardins is very nice and understanding, and is a good lecturer.\""
        ]
    },
    "FILM022": {
        "Mary Desjardins": [
            "review 1: \"09S with Mary Desjardins: Decent class, definitely worth taking if you're interested in this period of film history. Watched 1-2 films per week (in class) during the 3A, which could be kind of miserable since Desjardins uses every x-hour (aka class every Monday from 3-6). Minimal amount of work outside of class since the readings were very manageable. Desjardins is sometimes a scattered lecturer and frequently runs out of or goes over time, but she's extremely nice and approachable. The final paper topic is open-ended and if you go and talk to her about it (you should), you can tell that she just wants you to find something that interests you. This paper ended up being one of my favorites that I've written at Dartmouth. Interesting selection of films from all over the world (China, Cuba, France, US, Italy, Australia, Hong Kong, etc.). Not exactly canonical, which is both good and bad--wish we had studied some bigger-name films, but appreciated the diversity of Desjardins' selection. If the material interests you, take this class-you won't be disappointed, and Desjardins is a really nice woman.\"",
            "review 2: \"05S with Mary Desjardins: The subject was of course interesting, because everyone appreciates recent film, even if s/he is not a major. The homework and tests are manageable; if you have taken Film history 2 many of the assignments overlap. The only critique I have is that Professor Desjardins is not very good at time management, and thus the class runs overtime often. Her lectures are enough to do well on the tests, yet sometimes she could nto hold my attention.\"",
            "review 3: \"05S with Mary Desjardins: Desjardins is a very kind and thoughtful prof, but she ALWAYS ran over. She couldn't ever fit her lectures into the alloted time, so she ran 15-20 mintues over every time, which is frustrating because it was a 3A and was already a forever-long class period. It was a pretty dry and boring class. Though it was cool to get to see films from a lot of different cultures--particularly Indian film and Hong Kong cinema.\"",
            "review 4: \"05S with Mary Desjardins: As a film major I was required to take this course, but I didn't really expect to enjoy it very much because I am more interested in Classical Hollywood cinema that modern, global cinema. To some extent I was correct in that some of the foreign cinemas, such as Cuban and French modernist political films, were extremely dull and have no spectator appeal whatsoever. However, I enjoyed most of the subject matter, and Desjardins is a very well-informed and effective professor. She wants to be sure you understand the material and is eager to have students participate in a lot of discussion, despite the fact that there is usually a pretty large number of students in the class. The workload is very manageable, the exams are straightforward, and the final paper is only 10 pages and can be on almost any topic even remotely relevant.\"",
            "review 5: \"05S with Mary Desjardins: Professor Desjardins' lectures tend to run over. She packs a lot of information into them which reduces the time for class discussion. She is very personable though and willing to help students in whatever capacity. Her lectures at times might not be all that interesting but discussing the matierial with her one on one in her office hours is very interesting.\"",
            "review 6: \"04S with Mary Desjardins: The class was good, though Prof Desjardins's selection of films left much to be desired. Take this class if you need it -- if it continues to be taught by Desjardins, the format is one paper (term paper), a midterm, and a final. All are manageable. Do not take this unless you are a major or a minor -- if you want to try a film class, take Film 1.\"",
            "review 7: \"04S with Mary Desjardins: Some great films that really broadens ones understanding of other countries, but some very bad ones as well. Class was three hours on one day and and two hours on another, so the three hour days were impossible to sit through. Also, lectures didn't really teach you anything, they just skimmed over a few topics from the many pages of assigned readings. The class had great potential, but just didn't follow up on it.\"",
            "review 8: \"04S with Mary Desjardins: Hey Kids, You'd think that Film History would be a cool class because most of what you're doing is watching, discussing, and reading about movies. Unfortunately, the grade was based on only two tests and a paper, all of which did not (in my opinion) reflect true understanding of course material, but rather your ability to memorize picayune details and recite the professor's rhetoric. I went into this class hoping to be a film major, but left it glad to know it would be my last film class. DO NOT TAKE THIS AS YOUR EASY COURSE - it could easily kill your GPA if you're pulling two other hard courses that you're taking seriously.\"",
            "review 9: \"04S with Mary Desjardins: Often, Prof. Desjardins would run out of time for all the material she wanted to cover in lectures (which was sometimes due to her prolonging discussions). She would then rush through a lot of material in a short amount of time to compensate, making note-taking difficult and painful. She also sometimes would not explain esoteric terminology. Other than that, it was a fun course. Work load was good.\"",
            "review 10: \"04S with Mary Desjardins: interesting material, not so interesting prof. desjardins speeds through things just to get them covered, and there isn't enough time to really explore each topic. her exams are far too long for the amount of time given and the questions are so convolutedly written it seems like she's trying to trick you. the films were great, some classics, but take it with another professor.\""
        ],
        "Jeffrey Ruoff": [
            "review 1: \"08S with Jeffrey Ruoff: I'm not a film major and I'm not really into films so for me the class was horrible. I only took the class because I thought it'd be an easy distrib and the median was an A- before. Although Prof. Ruoff is a really nice guy and is real accessible outside of class, his lectures are really bad. He'll write something on the board and erase it two seconds later and won't explain half of what its in the readings, only to put it on the exam. He also grades papers pretty harsh and doesn't really explain why you got a B or a B+ versus an A or A-. He is available for office hours though and will review your papers ahead of time. I would skip this class if you're not really into film, because if you aren't its not that enjoyable.\"",
            "review 2: \"08S with Jeffrey Ruoff: Great class. The films are quite interesting, and the professor is wonderful and funny. Be careful about thr tests though. They can be tough. The Key is yo listen in class, and do the assigned readings.\"",
            "review 3: \"07S with Jeffrey Ruoff: it's a good idea to go to his office hour to go over your thesis sentence with him when you have to write an essay. There're some good and interesting movies to watch ;-) but of course, be prepared to write about them, too. The lectures are ok, not so interesting.\"",
            "review 4: \"02S with Jeffrey Ruoff: Prof. Ruoff taught some interesting class. His focus on non-traditional films from varius cinemas from Third World to American really broadened my film perspective. As a film major, I appreciated the depth of the course, noting that many non-majors took it and I don't think they got lost in it. The essays were a lot of the grade, which was fair, but there were also two mid-terms. He responded to student criticism by the second and adjusted the grades, but in general, both of these simplistic exams were quite difficult even though I did do the readings and I did see all of the movies. I am definitely happy with the course, and would recommend it to both majors and non-majors looking for a Non-Western. It's a bit of work, but worth it.\"",
            "review 5: \"02S with Jeffrey Ruoff: This course was great. very interesting movies and the reading was a good supplement to the class. studying for the exams was a lot of work and memorization, so i highly recommend making your study guide as you go and then memorizing lots before the test. Ruoff is a great professor- very helpful over blitz and in office hours!\"",
            "review 6: \"02S with Jeffrey Ruoff: ...'cause you will fall asleep! This was my first film course at Dartmouth, so I didn't realize the extent to which sleeping through a film would set me back in class. If you fall asleep easily in dark rooms, think twice before taking this class. That aside, Film History III was an interesting class. Ruoff's lectures and the films he selected for screening gave me a real appreciation of film history around the world--the French New Wave, Italian Neorealism, New German Cinema, etc. etc. This class was a 3A: on Mondays we saw a film, and on Thursdays we discussed it and Ruoff lectured on its historical context. We only had to watch two films outside of class--one for two papers (a short response paper and a longer, more focused paper); the second for the final paper. Ruoff administered two exams, for which we had to identify key terms. The tests give you a sense of what knowledge Ruoff wants you to walk away with. A fun class! Ruoff knows his stuff. (And it's also cute to have a professor who lectures off of notecards!)\""
        ],
        "Paul Young": [
            "review 1: \"23W with Paul Young: Agreed with the 20W review! Young is great, and each class was super interesting. Just emphasizing the importance of taking notes; I wish I'd paid a little more attn in class, especially going into the final. Young can be a bit of a harsh grader, but his feedback is helpful; I'd definitely make time to go to his office hours.\"",
            "review 2: \"23W with Paul Young: Paul Young is such a good professor who is passionate about film. Go into office hours and talk with him. He is a harsh grader but if you go in and discuss your ideas it definitely reflects better on your grade. This is not my favorite era of film. I found myself struggling to pay attention to the section of the French New Wave... but Young is great lecturer despite the sometimes unappealing material. Try to take some basic notes each lecture and you should be good for the final. Class work was pretty ok. You usually had to watch two films a week, some readings to go along with them, one discussion post a week, two essays, and a take home final. If you are a film major who doesn't love old films, I would suggest you try to take a history class with Young. One of my favorite profs!\"",
            "review 3: \"20W with Paul Young: This was my favorite non-major class so far – Young is a great and passionate lecturer! Expect to watch around 2 movies per week (occasionally in class), and to read about different film movements worldwide. There are ~5 pop quizzes (the lowest score gets dropped), 2 midterm papers (4-6 pages) where you answer 2 questions about the films and related movements, and a final exam with similar questions and a few more short answer questions. As long as you participate and take notes in class, you should do fine.\""
        ],
        "Amy Lawrence": [
            "review 1: \"06S with Amy Lawrence: The films are interesting, there's not a tremendous amount of work (reading, two short midterms, short final, all take-home papers), and Amy Lawrence is a great lecturer, she has a great sense of humor, and she's very understanding with and open to students and their questions, concerns, and problems.\""
        ]
    },
    "FILM021": {
        "Mark Williams": [
            "review 1: \"08W with Mark Williams: This class was a 3A and we used the x-hour every week, which meant we had a 2-hour and a 3-hour class. But the prof only ever used about a half hour of class to lecture; otherwise we'd watch a movie. Plus, we were encouraged to see DFS movies. You have 2 exams and a research paper. The exams are short answer ID's and an essay question. If you've read the textbook and skimmed over maybe 2 of the online course reserve articles, you're golden. Research paper is easy because you get to choose the topic. Williams is a nice man; if you go to office hours or even mention a couple of old movies you like to him he'll like you. Honestly I didnt do any work except for the 2 exams and paper and did well.\"",
            "review 2: \"08W with Mark Williams: This course has the challenge of compressing 30 years of film history from around the world in about 9 weeks. Its handles this challenge with middling success. For a time period covering the Golden Age of Hollywood, we watched very few American films (and many that we did were assigned for out of class viewing). The breadth of films studied is impressive, and class discussions were engaging more often than not. The biggest problems in the course came from Professor Williams, including: - letting the class out late every period - changing assigned readings without telling anyone - vague descriptions or answers to questions These are not insurmountable problems, especially if one is prepared for them, but they are annoying. Overall, an interesting course if you are interested in film, with some small quirks.\"",
            "review 3: \"05W with Mark Williams: This course broadens your perspective greatly. I was just an avid film fan before taking this class, but after taking this class, I learned so much more. It is definitely interesting, but challenging. This is one of those courses that require grasping main ideas and theories based on dicussion-driven explanations. Prof Williams could have lectured more to make some new topics more clear, but overall, he's a very nice professor and extremely knowledgable. Great course for everyone.\"",
            "review 4: \"05W with Mark Williams: really great films, interesting discussions, course material well thought out and interconnected so as to simplify understanding. way too much reading though.\"",
            "review 5: \"05W with Mark Williams: I am a film major in part because I adore film history. I think it's fascinating. However, Film History II chose the unfortunate path of focusing on all of the uninteresting parts of film history. Perhaps the problem lies in the fact that I can't stand neorealism, and the entire course seemed to hinge on realism and neorealism. Thankfully we at least touched upon wonderful genres like film noir and intriguing situations like the blacklist, but I would've liked to spend more time on them and less time on Italy. Subject material aside, however, my main quarrel with the course was that I received no feedback. My midterm exam was returned to me with a number written next to each short answer and a number written at the top of my essay. Not a single comment had been written on my exam, and therefore I had no idea why points had been deducted or what on earth I was supposed to study for the next time. It was extremely frustrating, especially since I thought that I had performed rather well, and the numbers written down did not correspond to how I thought I had done. On the plus side, however, Williams gave us total free reign in choosing our final paper topics, and encouraged us to really go out and research something that inspired us and that we wouldn't have the chance to research for ourselves otherwise. I really respect that. Moral of the story: a class that is not terribly interesting and affords little to no feedback, but gives the opportunity to write an awesome paper.\"",
            "review 6: \"05W with Mark Williams: Williams kinda let the readings teach the class for him. But you get to see plenty of great films. By the way, you can't NRO this...I found out the hard way.\"",
            "review 7: \"05W with Mark Williams: i liked this course a lot and found both the professor and the readings to be very interesting. i wish, however, that we watched less films so we could have more lecture and discussion. the research paper was also a bit rushed.\"",
            "review 8: \"05W with Mark Williams: The class was mostly film-watching, with some lecture. There were a lot of outside readings in the form of articles either photocopied for us or available online, plus the film history text book, but it wasn't difficult to keep up. The grades were based on a midterm, a final, and a research paper. On the midterm, Prof. Williams was a tough grader for the essay question (and not just for me). A decent class.\"",
            "review 9: \"02W with Mark Williams: I really didn't know what Film Studies was all about until I took this class. This was my first class in the department. i thought that we'd be watching movies and then talking about their content. However, this class is more like art history than english (not that there's anything wrong with that.) But it's more like you watch the movie, and then talk about the movement it belongs too, the director of the film, and the cultural, historical, industrial, and theoretical background of the film and its director. But you do watch really good films, films that I know I would've never have watched ever. And film history is a very cultural experience. I mean, how can you go through life and not know Van Gogh, or Rembrant? Like, in film, it's the same thing only the painters are replaced with guys like Ozu and Sirk. I call this class a sort of bootcamp because Professor Williams is a very academic type guy. I mean, that your papers and exams and stuff have to be very super thorough. And plus you only get three grades for the term: a midterm, a final paper, and the final. So you must do well on those. He gives a lot of reading, of which you must read if you want to perform well on the midterm and final. Most people i know, including myself read them all the couple of nights before the tests. But overall, i felt that i gained a great understanding of film during this period and I'm pretty happy that i now know what all those terms i've always heard of, but never knew what they meant, like: neo-realism, the french new wave, or poetic realism. So take this class, but prepare to work and think hard.\"",
            "review 10: \"02W with Mark Williams: the course was more about theory than i thought it would be; i thought it was supposed to be about film history. we did learn history as well. we watched good movies (overall) that represented all time periods and many countries, which was interesting. however, mark williams's teaching style leaves something to be desired.\""
        ],
        "Amy Lawrence": [
            "review 1: \"07W with Amy Lawrence: Some of the films and readings left a bit to be desired, but overall the course offered a fairly comprehensive look at film in the golden age. Lawrence is a brilliant woman and knows her stuff, but is difficult to approach at times.\"",
            "review 2: \"07W with Amy Lawrence: I took this class for my distribs so I found I wasn't as good at analyzing films as the other students in the class. Lectures were pretty interesting and Lawrence was very easygoing. Much of class time was spent watching films. The first midterm consisted of 3 3-page papers, the second was 2 3-page papers and the final was one 4 page paper. There was also a very interesting 4 page research paper on life at Dartmouth during WWII. The papers were a little difficult only because they required analysis of camera movement and lighting, which I normally don't notice.\"",
            "review 3: \"07W with Amy Lawrence: I was very happy with how this class turned out. I got to watch movies I never would have seen otherwise. We used all the x-hours, which meant a three hour class on Mondays, but we often just watched a movie for two of those hours, so it wasn't so bad. If you watch the movies, do the reading, and answer the essay questions thoroughly, you should have no problem in this class. Just a word of advice...don't wait until the night before an essay is due to watch the required movies at Jones. There will be a scary traffic jam...\"",
            "review 4: \"07W with Amy Lawrence: This course cemented my decision to pursue the film major. It was everything I wanted out of a film class. Lots of fun if you're interested. The films selected for the class were great examples to supplement the lessons, and the lessons were extremely well-organized. Prof. Lawrence's lectures were always interesting and clear, and often entertaining. She was able to include class discussions very well, but she could sometimes seem distant or ask questions in an unconsciously intimidating way. I learned a lot. The class was also an interesting way to learn world history from 1930-1960.\"",
            "review 5: \"07W with Amy Lawrence: Lawrence is okay. She is not extremely difficult but she requires you to work more than you wanted to. She has a dry sense of humour and that's okay but sometimes, it can be a little frustrating when you want to know what is needed for papers. She makes you write a lot of papers which can be good or bad depending on your affinity for papers. If you hate writing, well don't take the class.\"",
            "review 6: \"07W with Amy Lawrence: I went into this class not knowing much about film studies, and I'm glad I was exposed to the movies. A word of warning - they get really depressing. Lawrence claims she is notorious for picking morbid films where the characters die in the end, and this is generally true. For example, in a week and a half period, we watched two different movies about protagonists dying from stomach cancer (Diary of a Country Priest and Ikiru). At the time I was swearing I'd never take film again, but by the end of the course I was happy with what I'd learned. The midterms are very long though (12 and 8 pages each), but the research paper was easy and interesting. Take this even if you're not a major, but be prepared to write a lot.\"",
            "review 7: \"07W with Amy Lawrence: The class really didn't do justice to the time period that it focues on. We didn't watch Citizen Kane. Why, I'll never understand. We glossed over the better movies and spent agonizing detail on the really terrible ones. She has trouble with time management, keeping us long on occasion. You can honestly do just as well skipping all the classes and just renting the movies\""
        ],
        "Jeffrey Ruoff": [
            "review 1: \"04W with Jeffrey Ruoff: If you take one film course take a course with Jeff Ruoff. Ruoff inspires creativity in his students. He got me to start examining films in a whole new way. He is passionate about teaching and extremely accessible to students. The films he showed in class were interesting and from many different industries--not just the typical Hollywood stock. The work load is just right though if he assigns you a book to read for a test you better know the book backwards and forwards as there is no rhyme to his reason when it comes to testing.\""
        ],
        "Mary Desjardins": [
            "review 1: \"06W with Mary Desjardins: great films, great prof., interesting reading material, not stressful. If you are even the least bit interested in movies, take this course! It's great!!\""
        ]
    },
    "FILM020": {
        "Amy Lawrence": [
            "review 1: \"09F with Amy Lawrence: Professor Lawrence was clearly very interested in the material, and some of her enthusiasm couldn't help but rub off. However, the rest was a mess. The midterms and final were 2 papers each, and there was also a research paper. This would be fine, but the prompts reminded me of grade school. They were essentially lists of things to mention or talk about, using specific sources (even the research paper practically defined your sources for you). If that sounds like a fun time to you, take it. But I found it boring and frustrating, even though the material itself was often interesting. Also, during office hours she was rather unhelpful. Miraculously, they were always 1 day after the papers were due. The class itself is a strange mix of history and art - in your papers, you evaluate and the artistic choices of the filmmakers, and talk about how history affected those choices over time. So be prepared not only to learn the history, but more importantly to analyze individuals scenes from films for the editing, cinematography, mise-en-scene, and acting techniques used. If you do take the class, I'd recommend paying closest attention to the accuracy of your claims when you write the papers.\"",
            "review 2: \"09F with Amy Lawrence: i'm a pretty big film buff and i liked this class. the material was interesting and i was exposed to some movements in film that i knew nothing about, especially really early trick films. we watched some pretty great movies too, from avant garde german film to classic keaton and chaplin. we spend most of the class time watching movies so you don't actually hear from lawrence all that much, but she's really smart and a good lecturer when she does talk, although she could be a little livelier. there is a decent amount of reading for this class but only some of it pertains to the essays and i only did that little bit so it was really manageable. the essays thoughâ€¦ by themselves, they weren't that bad. they are only a few pages and lawrence is really specific about she wants in them, which is nice because you can just do what she says but kind of annoying because you don't have as much control over them. the worst part was that she would assign one essay, assign another a week later, and, the next week, they would both be due the same day. this was BRUTAL. i stayed up until at least 6 every night before these essays were due. there was no reason to assign them like that AT ALL. people in other classes of hers says she doesn't do that, and maybe she won't in the future, but it was really bad. also, if you fall asleep easily, you will fall asleep in this class. it's a huge room with few people so you can spread out on a few chairs. the movies are silent and black and white, so theres just nice music and uninvasive images playing for two hours and these movies are slow compared to what we are used to. i slept at least a little in almost every class. but that's kind of nice also, you can watch what you miss in jones later.\"",
            "review 3: \"07F with Amy Lawrence: I really like Professor Lawrence -- she is a great lecturer with a fantastic sarcastic humor, and she is very responsible about getting papers back to you on time. If you like silent film, you'll probably like this class. If you don't, you will probably fall asleep during most of the films, although that's probably not Professor Lawrence's fault. The one major criticism I had with this course is that there were too many papers for an intro class. All in all we did 7 essays in 10 weeks, which got very tiring. Also, the professor has the habit of wanting to include every reading and film in the papers somehow, so they get pretty complicated when you have to fit all of that into two pages. If you have to take this class for the major, Amy's the one to take it with. If you're just looking for an Arts credit, take Film 1 instead.\"",
            "review 4: \"07F with Amy Lawrence: Class times are fun; two times a week for two hours you get to watch movies. And most of the time, they are interesting. Prof. Lawrence lectures around said films, but it's crucial to read because lectures don't cover the reading nearly half as much. There's a lot of reading, and sometimes it can be dense. This class requires a lot of writing. You are only graded on papers, and sometimes grading can be harsh. Prof. Lawrence is very nitpicky about what she wants, but if you talk to her it won't be half as bad. Still, papers can be rough.\"",
            "review 5: \"03F with Amy Lawrence: This class has so much potential. The text readings, articles selected by the professor, and movies watched in class provide an excellent time line and analysis of the birth of cinema. But Professor Lawrence's lack of enthusiasm in class makes it very possible to show up to lectures and leave when she turns the lights off to watch a film, and miss out on all the great material this course has to offer. The limited amount of assignments can be done at the last minute, using one or two sources, and a student could be left with no understanding of the progression of the film industry from silent to sound films. I kept up with readings and attended every lectures, and I feel that I achieved a great understanding of film from just this one class. But I cannot thank Professor Lawrence for much of that learning.\"",
            "review 6: \"03F with Amy Lawrence: This is a class that will really appeal to some and absolutely bore others. If you love silent movies, then you will love this class. If you're unsure whether you like them, take Film 1 instead. Otherwise sitting through these movies can turn into a weekly nap. The class also goes pretty slowly and doesn't cover enough material historically. The readings are quite esoteric and will almost certainly bore you regardless of your level of enthusiasm for movies. Professor Lawrence is well-organized. Her lectures overlap with the reading quite frequently, so that can get boring sometimes. She has an interesting sense of humor, although she doesn't frequently show it. There are only a few research papers and some easy quizzes making this a relatively easy class. The hardest thing about the class is suffering through the long, scholarly articles about random, sometimes obscure topics.\"",
            "review 7: \"02F with Amy Lawrence: This course was about what I expected -- not too hard but decently interesting. Prof. Lawrence knows the material quite well. The only thing I had a real problem with was the paper topics -- the questions were not well worded and it was often time hard to narrow down what to write on. Overall, though, I'd reccomend it to people who need the ART credit or are interested in film.\"",
            "review 8: \"02F with Amy Lawrence: Professor Lawrence is incredible. She will keep you on your toes. Always fascinating, always informative.\"",
            "review 9: \"02F with Amy Lawrence: Unless you have to take this, don't.\"",
            "review 10: \"02F with Amy Lawrence: This class involves alot of watching really old silent films for blocks of often up to 2 hours at a time in the middle afternoon. Consequentially about half the people were fighting to stay awake most of the time. Proffesor lawrence talks tough but grades nicely though. not a bad class, just be prepared to need coffee.\"",
            "review 11: \"02F with Amy Lawrence: While I loved the material and found it extremely fascinating, the class was offered in a big dark auditorium with cushy chairs, and the prof's voice is monotone...the movies are silent. Unless you are chugging coffee, don't take this class with any intention to stay awake. It is however, a very fun course, and not exceptionally difficult.\"",
            "review 12: \"02F with Amy Lawrence: The course was boring. Lawrence is a very demanding grader. Her papers require great attention to detail but that is expected since it is a film course. Lawrence wasn't too available outside of class. There were some very interesting points of the course such as (Avante Garde films and animation) but we didn't spend much time on those topics.\"",
            "review 13: \"02F with Amy Lawrence: Prof Lawrence talks a tough line, but walks a very sissy walk. She graded papers surprisingly easily, although slightly unpredictably. From one paper to another, it was not easy to tell what she was looking for -- also, she is a STICKLER for page length and spacing. If you try to fit more on a page using Times New Roman size 11, or even 11.5, don't. She gets pissed. And also, when she says double spaced, she doesn't mean 1.5 spaced, which most teachers don't notice. Stick with 12 and double, and stay within the page limits. Her \"tests\" were laughable - a page of 20 questions, consisting of multiple choice, matching pairs and short answer. However, be forwarned -- the first test was MUCH easier than the second. I think she may have realized how easy the first was, and the second demanded much more knowledge and the power of observation. Focus is a little bit too much on the films than on her students -- her enthusiasm for the films(which occasionally borders on the excessive and feels forced)rendered her unable to discuss the films with her students. Overall, I would not reccomend this class to anyone other than majors (who have to take it) and people with a passion for film that borders on the excessive. It is a 2 hour long class in the middle of the day, that happens in a darkened room (75 percent of the time) with a silent movie playing before you. Recipe for disaster -- or, in my case, wonderful naps.\"",
            "review 14: \"02F with Amy Lawrence: This course has a fair amount of reading, which however can be easily skimmed. It does not need to be read in depth for understanding. Lawrence is highly motivated in her course, and definately knows her stuff... Maybe too enthusiastic however (if there is such a thing). I liked the course, and recommend it to anyone looking for an ART.\""
        ],
        "Mary Desjardins": [
            "review 1: \"06F with Mary Desjardins: So this course could be interesting, and sometimes it was, but the prof hesitates A LOT during lectures and goes over instructions way more times than necessary. Some movies are horrible some are interesting. If you fall asleep in class you'll definitely fall asleep in this one, because all of the films (except for the last one) are silent. It was definitely more historical and industry-oriented than I expected, but if you take good notes and do the readings you should do reasonably well on the tests. Her multiple choice questions are RIDICULOUS---if you have to think about it, assume that she's NOT trying to trick you (because it seems as if she's trying to trick you on every question). It's nice that there's only one paper and two tests. Don't ask her questions over email, she's not that helpful, but do go to an office hour or two.\"",
            "review 2: \"06F with Mary Desjardins: Professor Desjardins is extremely knowledgeable yet very down-to-earth and approachable. She came to class everyday with energy and enthusiasm. As a film major, I found the material covered in class to be very interesting (early short films and full-length movies, â€œsocial problemâ€\u009d films, â€œraceâ€\u009d films, the British film industry, silent comics, French avant-garde, German Expressionism, the Hollywood star system, sex symbols, Soviet cinema, the introduction of sound, etc.), although I understand that watching black and white silent films may not sound that exciting for everyone. All the films were actually quite entertaining (I especially loved the silent comicsâ€™ filmsâ€”Chaplin, Keaton, Lloydâ€”and Clara Bowâ€™s film â€œItâ€\u009d, as well as the musical we saw the last day of class) and a few of them have even made their way onto my favorite films list! For most of the class period, there is just straight lecturing in addition to the screening of films/film clips. There was some class discussion though it was limited, not due to lack of interest but rather due to lack of time. The textbook and course reader were both very helpful, and all or most of the films could be watched at Jones Media Center. I highly recommend this class. Itâ€™s laid back, entertaining, and all around much more enjoyable than a class where you just watch a power point presentation or learn formulas. Also, you canâ€™t beat the comfy theater seating. Overall, I give this course two thumbs up!\"",
            "review 3: \"06F with Mary Desjardins: Some fun movies to watch but the boring ones can make you fall asleep. For your final paper, check your thesis sentence with her to make sure you're on the right track. And don't think that you won't have so much work cuz it's a film class. There're a lot of reading so try to be on top of your stuff.\"",
            "review 4: \"04F with Mary Desjardins: This is one of those dream high school courses, in which you do nothing more than sit in a movie theater, watch movies, and perhaps, chow down on popcorn. At the college level though, you realize that high school ideal is pretty boring and even wasteful. The class was just a complete lack of challenge, and the material was just never very interesting.\"",
            "review 5: \"04F with Mary Desjardins: Silent cinema lends itself to being dry. This is no exception. This course is more work w/ Desjardins than other professors who teach the course. Desjardins is highly knowledgeable about film theory, and this course offers little opportunity for her to show that.\"",
            "review 6: \"04F with Mary Desjardins: Prof Desjardins' lectures were okay, but sometimes we would run out of time and she would rush through thick material too fast. Also, she had little concept of time and when we'd watch a movie in class, we would almost always run 5-10 minutes late after class should end, and sometimes we'd miss the end of a movie. Other than that, it was a good course. Learned some interesting stuff.\"",
            "review 7: \"04F with Mary Desjardins: I'm not a big fan of Professor Desjardins and this class did nothing to dissuade me from my negative impression. In fact, it reinforced for me that she can very easily show the absolute minimum amount of attention to a class as possible. There were weeks that we went without lectures and the documentaries we watched during the x-hours were by far the most informative and instructive elements of the entire class. Easy, but an absolute *waste of time*, something entirely due to Prof. Desjardins.\"",
            "review 8: \"04F with Mary Desjardins: This class was pretty interesting for the most part. It focuses on silent films, which can get kind of boring after a while. However, the films she showed in class were usually interesting and entertaining. Some parts of the class were more interesting than others, and some of the readings were ridiculously long. Her lectures are good, but sometimes she goes on a little too long and we would run out of time in the middle of a film. Also, she assigned every single x-hour. But this class is a refreshing change from your typical math/science/english class, and I enjoyed it.\"",
            "review 9: \"04F with Mary Desjardins: This course was taught almost entirely through watching films, with very few actual lecture periods (especially in the second half of the term). Even films that had very little bearing on the course (\"Our Dancing Daughters\" and \"Applause\") would be shown in their entirety during class time, so that instead of giving a lecture on the early sound period, we would just be told \"here is an early sound film\". Meanwhile, films that were important to the period, such as \"The Cabinet of Doctor Caligari\" and \"Birth of a Nation\" were largely ignored. Every x-hour was used, and in every x-hour we were shown a documentary videotape. These were often interesting, but why not just go to Jones Media Center and rent them? This is a class, the professor is supposed to teach it.\"",
            "review 10: \"04F with Mary Desjardins: The teacher didn't really inspire any interest in this subject. I went in as a possible film minor/double major but now I don't even know if I'm gonna take another film class at all. The teacher didn't even seem to interested in what she was teaching. Her lectures were boring and her exmas were somewhat unfair. They often asked you to understand the smallest, msot minute details about her lectures. That was really bad because i would study a lot beforehand and feel confident about my studying while going into the test, only to leave the test completely unsure about how i did. The movies themsleves were interesting. I enjoy watching black and white, silent films and I did gain some knowledge in this class not so much from the teacher's lectures, but from exposure to the films themselves.\"",
            "review 11: \"04F with Mary Desjardins: I took this course strictly to kill two birds with one stone in terms of distribs. It would fulfill the ART (in either EU or NA which allows for flexibility) and INTL I think. If I could take another interesting course that was more interesting and more eye-opening than this one, I WOULD! It's SOOO hard to stay up when the lights go out and the music's playing (to the silent films) and all the grainy flecks of the film just woos you to fall fast asleep. Unless you're a die-hard film fanatic, you probably won't be crazy about this course. It's doable though, but ugh so boring\"",
            "review 12: \"04F with Mary Desjardins: Class mostly consists of watching films during class and having discussions on them as well as topics of our reading. If you enjoy learning about silent films and the early film industry I recommend this class. I'm not a film guy but I had a pretty good time in this class.\"",
            "review 13: \"04F with Mary Desjardins: The class was interesting and you get to learn a lot about early silent films technologies, industry, stars, etc. One thing I did not like is having x-hour every week to watch a documentary. Other than that, Prof. Desjardins is an excellent professor. Her lectures are effective and the reading she assigns is useful in understanding the materials. Her tests are a fair assesment of your knowledge in her class. She is very nice and is available in class and outside of class. She responds to blitzes in a timely manner. She is one of the best professors I've had here.\"",
            "review 14: \"04F with Mary Desjardins: Watching Charlie Chaplin films = awesome. Getting yelled at by Desjardins for walking into a 70-person class 8 min late, but then her keeping you 15 min over the end of class = not awesome.\""
        ],
        "Mark Williams": [
            "review 1: \"22F with Mark Williams: Genuinely the worst class I have taken in my life, and no, that is not an exaggeration. I fell asleep probably half of the time, and could not follow what the professor was saying the other half. The professor was super condescending and didn’t like any view that wasn’t his own. All this class taught me was how much I disliked silent films. Don’t take this class.\"",
            "review 2: \"19F with Mark Williams: WORST CLASS EVER. This is a requirement for the major, so I had to take it, but if you don't, then DON'T! This is not a fun, interesting, or easy art distrib. Not only is the subject material super boring, the professor is super boring. He has a monotone voice, thinks he's the most brilliant professor to gift us with his presence, and constantly nitpicks his students. In fact, he interrupted all of us to correct our grammar or edit our word choice so much that everyone just stopped participating in class. Nightmare. Try to avoid it.\"",
            "review 3: \"01F with Mark Williams: Take this class! You'll see some wonderful films that you would probably would never see in your life otherwise! I took this class because it fulfilled an ART distrib, but I really ended up enjoying it. At first I disliked it, because the first couple of weeks of course material are pretty boring. But the films you see later in the term make it all worthwhile! You learn a lot of interesting facts, and Prof Williams certainly knows his silent film. His lecture style was off-putting at first, but once I got used to it, his mannerisms in class were enjoyable. Do the readings, though, and go to class, because the midterm and final are fair, but difficult. Details about the films are wanted, and how can you include those if you never came to class to see them?\"",
            "review 4: \"01F with Mark Williams: This class is a fun class if you have any interest at all in silent film. It is kind of boring the first few days, but as the films get longer, the class improves. Be aware that this class uses the x-hour on Mondays every week, so class is from 3-6PM. If you have schedule conflicts or don't think you can sit through class for that long a period (it's not all lecture...you watch some films as well), don't take this course. Also, Prof. Williams usually extends class to about 6 instead of ending at 5:50. The lectures are usually pretty well-organized. Prof. Williams is very intelligent; however, sometimes he assumes a little more knowledge of the subject on the part of the students than they actually have. He expects you to be able to analyze the films you see in class and discuss them, although most of the course is lecture rather than discussion. If you think you can discuss films at least a little, then you should take this class. There are a lot of reading assignments for this class, but I found that you don't necessarily have to read all of them until right before the exam, and even then you only need to read some of them. The exams (midterm/final) are difficult, but if you study for them, they're not a problem. There is one open topic 8-10 pg research paper due at the end of the term. You can choose any topic relating to silent film that interests you, so this is not a problem. If you have the time to devote to this class, it is definitely worth taking.\"",
            "review 5: \"01F with Mark Williams: I've talked to a few non-majors who took this class because it sounded interesting. Indeed, the material has the potential to be really interesting, and the actual screenings from the time period were quite good. However, Prof Williams chose to teach the class using a series of documentaries that on their own would have been quite good but, in the context of a class, slowed the tempo of that class and prevented us from seeing other films of the silent era. Prof Williams is a genuinely good lecturer and an intelligent guy, but he also likes to force discussions. Even after a film has run ten minutes past the time class is supposed to end (mind you, with a 3A, we're talking 6 PM by now), he insists on keeping the class behind to \"discuss,\" and when no one has anything to say he will threaten to make you do jumping jacks. This is not an empty threat. The screenings were good and the reading material was interesting, or at least informative, for the most part, but there were days when I dreaded going to class, only to be faced by the oppressive silence inherent in a class held in a movie theatre (it meets in Loew). Preparing for the exams does make you learn the material, though, and in terms of written work the class wasn't very hard. But be forewarned. It takes a fair amount of perseverence to make it through this class.\"",
            "review 6: \"01F with Mark Williams: I liked this course for the overall inspiration factor, but not really for the specific content. Silent films aren't really a hobby of mine, but some of the readings and lectures really struck a chord with me in relation to modernity, the role of new technologies, the changing scape of art, the effect of new media on societal trends, etc. Classes are three hours long. I can't stand it. The good news is you can grab fries at the hop if he's screening a film you don't care about.\""
        ],
        "Joanna Rapf": [
            "review 1: \"23F with Joanna Rapf: Take this class with Paul Young, if you can; he's one of the Film Dept's best profs. If you're a major and you absolutely have to take this with Joanna, it is very doable — but it is so, so gouging-my-eyes-out boring. Honestly, if you pay just a little bit of attention in class, your journals (1-2 pages single-spaced) will be a lot easier to write. The final project is also very doable; just approach her early on with notes/questions and refer to LANTERN media archive for primary sources. If you show her you care and have been paying attention (even if you dislike the class), she'll take note.\"",
            "review 2: \"22S with Joanna Rapf: Professor Rapf is the worst prof I have ever had. STAY AWAY. Ridiculous amount of work if you want an A. Every week, you have to write a \"journal,\" which is essentially an essay. So it's 10 essays, a midterm that takes 8-10 hours, and a research paper that will take 10-15 hours. She is the most unfair and horrendous grader of all time. No clear expectations, dry and boring material, and just mean attitude. Professor Rapf should be forced to retire. I am outraged by this class. PLEASE HEAR MY WARNING. DO NOT TAKE THIS CLASS WITH HER. I am lesser person because of her.\"",
            "review 3: \"22S with Joanna Rapf: This class is boring if you like writing about movies and horrifying awful otherwise. Rapf is a total dinosaur. as that other person said it’s a lot of writing, a lot of lecture without any depth. a guest professor came in to lecture on french film and i could have cried because of how much better she was that rapf.\""
        ],
        "Paul Young": [
            "review 1: \"23F with Joanna Rapf: Take this class with Paul Young, if you can; he's one of the Film Dept's best profs. If you're a major and you absolutely have to take this with Joanna, it is very doable — but it is so, so gouging-my-eyes-out boring. Honestly, if you pay just a little bit of attention in class, your journals (1-2 pages single-spaced) will be a lot easier to write. The final project is also very doable; just approach her early on with notes/questions and refer to LANTERN media archive for primary sources. If you show her you care and have been paying attention (even if you dislike the class), she'll take note.\"",
            "review 2: \"20F with Paul Young: After taking this class, Professor Young is now one of my favorite profs at Dartmouth. His instructions and grading are clear, he’s very laidback, and only rarely cold calls. He’s also pretty lenient with grading, and our class median was an A. And on top of all of that, I found the material interesting for anyone curious about how movies started. We learned about early film movements, stylistic choices, and even some legal and business issues. The syllabus and textbook readings lined up perfectly with the films Prof Young assigned for class, which made the class more engaging. I can’t recommend Prof Young enough.\""
        ]
    },
    "FILM010": {
        "Jan Schuette": [
            "review 1: \"08X with Jan Schuette: Prof. Schuette, if he ever comes back to Dartmouth, is a great guy to take a class with. He's German--speaks near-fluent English with only occasional questions about words, writes worse English but it's not a problem. He's also a major filmmaker, which is AWESOME. He has great anecdotes about the industry and knows quality stuff from sh*t. We watch a movie a week and discuss. there's no written requirement about the movie. In fact, the only assignment is a 15-page screenplay, adapted from a short story of your pick, at the end of the term. Theoretically, you're supposed to talk about everybody's ideas for their screenplay once a week. The class is paced way too slowly, and by the end we realized that we hadn't gotten through discussing all the screenplays, and we had to rush. But it's a great learning experience to write the script, and he grades easy. The movies are interesting and not traditional for a film class.\""
        ]
    },
    "FILM007": {
        "David Ehrlich": [
            "review 1: \"09F with David Ehrlich: I would highly recommend this class to any freshman looking for a seminar class. Although this class is listed under the film department, the course was more of an exercise in the creative process, and how it can be applied to writing, close reading, and other areas. Throughout the term, our professor, David Ehrlich (who is simply amazing and truly wants to get to know every single one of his students) had us do creative projects, such as musical compositions, artwork, and creative writing on nearly any subject of our choice. if you can take this class, I would strongly recommend that you do! You really won't regret it!\"",
            "review 2: \"08W with David Ehrlich: David is a teacher in every sense of the word. He works with you and wants to see you grow with the class. The guy bakes cakes, throws parties, challenges you and has a crazy life story. If you have the chance to take a freshmen seminar with him, do not pass it up. I'm not remotely interested in film(Econ, Gov, Phil, etc.), but the class showed an entirely different side of campus that I likely would not have been exposed to. It's not like 7level classes carry any major weight either. Bottom line, seminars might seem like a stupid requirement, but if you get in this one, you WILL NOT be dissapointed. David will amaze you.\"",
            "review 3: \"08W with David Ehrlich: You need to take a course with David Ehrlich sometime during your Dartmouth career. He is one of the most engaging, encouraging, enthusiastic profs I have ever met (Okay, I've only been here for two terms, but still) and he pushes you to do your best. He is there to listen, and will talk with you as an individual, not from above like most profs. Who else reserves one class as a \"fun day\" and gives you clay, pipe cleaners, construction paper and crayons during one of the most hectic weeks of the term? If you're up for the work, I highly, highly recommend this course.\"",
            "review 4: \"08W with David Ehrlich: David really takes care of each student in his class. He set up an individual appointment with each of us. He truly values whatever you have inside... ! The workload was not bad especially compared to the other seminar courses. Writing an analytical paper about a film was a bit challenging because it is so different from what I have been doing in other writing classes. But you will get used to it. So much fun!!\"",
            "review 5: \"08W with David Ehrlich: This was one of those classes where the professor could really make or break the course, and this professor certainly made it. This is a wonderful course, even if you aren't particularly interested in the film. The copious amounts of extra non-graded creative work that we did in and outside of class I found to be the most rewarding. It was nice to take a writing seminar that wasn't entirely focused on boring analytical writing, and actually challenged me to express myself through new mediums. The course could be better organized and less intense logistically; david could have been clearer and less wordy in exactly what our assignments were, as they were really pretty straight-forward. I might have preferred a little less of a focus on biopix films and even more focus on group activities and refreshing creative assignments. David, as we call him, is extremely approachable and enthusiastic about the students in his course, maybe even to the extent that it stresses him out a little. I appreciated the amount of energy he brought to the material, and how he ruthlessly tried to get us to come together as a group. He is also very critical of the writing and social behavior of his students, and is not afraid to express it- this is a good thing. David is a wonderful man, and a good person to know. David might have been a little less blatant when he would split up the class along gender, ethnic, and social lines during class discussions, but nonetheless I think that pushed our cohesiveness as a group. This is a wonderful class, and I am extremely glad that I took it as my writing seminar. It is only offered every other year, so if you get the chance, take it!\"",
            "review 6: \"08W with David Ehrlich: Professor Ehrlich is wonderful. I can't say enough great things about him. I am not an artsy person at all, I'm an engineering major, but I loved this class. He inspired interest in the creative mind, and helped everyone to grow. He pushed everyone try things they hadn't done, and allowed people to do this in a comfortable environment. Excellent class, loved it.\"",
            "review 7: \"08W with David Ehrlich: Papers were graded on writing/argument and degree of difficulty. The latter might seem a bit intimidating at first, but it made me think outside the box a lot and I actually ended up enjoying the work (while my friends in the other seminars couldn't stop complaining about their papers!). David likes weird, off-tangent topics, so if you take this course, you'll probably find yourself sitting in front of the computer for hours and hours every other week just to think of an interesting thesis - a really, really good way to stretch your imagination and open yourself up to really bizarre, creative ideas. Moreover, we had to do many creative assignments that ranged from dancing to prose writing to film-making (depending on what your interests are). Even the so-called non-creative people in the class found a niche and did well, so don't worry at all if you're not the typical musician or writer. In fact, I think this course would be even more useful for the supposedly non-creative type - I thought I couldn't write fiction until I took this course. In a nutshell, this course is a creativity bomb. You will learn a lot about creative artists, the creative process, your creativity, your classmates' creative ideas, your wonderful professor, and other random things. Take it, you won't regret it. P.S. David is GREAT. There should be a Facebook fan group for him.\"",
            "review 8: \"06W with David Ehrlich: Great class. Great Prof. David is awesome, and he is willing to get to know each individual student. He is notorious for keeping in touch with his old students, but he is very resourceful. The class ends up bonding. Its awesome\"",
            "review 9: \"06W with David Ehrlich: ehrlich is great. take this class.\"",
            "review 10: \"06W with David Ehrlich: After a tough first term this class was perfect...David really cares about every student and wants to get to know everyone..the class becomes super close, and you do loads of random creative work in addition to watching movies, some reading, quality class discussions, and eating food. There is a lot of work, but it is fun and maneagable work. Also, you don't have to think of yourself as a film buff or creative person to be in this class because each individuals journal and creative project is tailored to who they are..a bunch involved athletics in our class this year. I loved going to classs everyday and David is one of the most awesome people I have yet to meet at Dartmouth.\"",
            "review 11: \"06W with David Ehrlich: Do you see any bad reviews for David Ehrlich?! NO! Therefore, it's obvious he's the shizzle. He'll make you feel like you're the only one in his class, he's that attentive. Plus, the class will often have pizza/movie parties, and he'll randomly but you food. He brings in visitors to speak all the time too (usually past students), the X-hours are pretty-much devoted to this, therefore they're useless. For writing though, you're pretty-much on your own. This is a creative class first, NOT a writing instruction class. Dartmouth's \"freshman seminar\" program sucks, but this class ROCKS!\"",
            "review 12: \"06W with David Ehrlich: ehrlich is awesome and this class is too. we do all kinds of werid homeworks but they arent too hard usually. the final project was awesome and you really get to respect your classmates. great discussions all around! pretty laid back! and fun movies!!! DEFINITELY TAKE THIS CLASS!!!!\"",
            "review 13: \"06W with David Ehrlich: theres a ton i could say about this class, but basically if u can take it, take it. unless youre really really lazy. no scratch that, im really lazy and i still loved it. just take it\"",
            "review 14: \"04S with David Ehrlich: If you're looking for a great Freshman Seminar, TAKE THIS CLASS!! Everyone in the class had an amazing time with David, the Professor, and he had a great time with us. Once you leave this class, you will feel like a big family. The work outside of class was minimal, but what we did have was really interesting. David understands that class discussions work much better than forced readings, and I spent some of the happiest moments of my term in Film 7. David is an awesome resource, even after you're out of his class, and if you make even the slightest effort, he can become a great friend.\"",
            "review 15: \"04S with David Ehrlich: This has been my favorite class at Dartmouth so far. David goes above and beyond anything expected of him to make his classes extraodinary. I have never encountered a person as gifted as David in getting students to learn, to speak their true opinions, to think creatively and independently, and to work well as teammates and more importantly, as friends. All of David's classes are more work than typical courses at Dartmouth, but the work is worth it because students get more out of the courses as a result. David sincerely cares about all of his students and he tries to enhance the quality of their academic life, but he also cares about students as people and he does a lot to help his students become better citizens of this world. One notable aspect of this class was the many guest speakers who came and talked to the class, including dartmouth students and professors from diverse backgrounds such as politics, creative writing, and ice dancing. Other people also came and spoke included a few animators and also James Yorke, the man who pioneered chaos theory in physics. David is devoted to fostering different modes of thought and he encourages the expression of different points of view. If you want to take a class of the highest caliber and are willing to take risks and work hard and want to be rewarded, then this is the class to take!\"",
            "review 16: \"04F with David Ehrlich: this was my favorite course my first term without question. there was a bit of work involved--nothing that slowed us down, though--and some of the films were a chore to get through. but if you're at all interested in creative media, you'll thrive; you can show off your own skills and learn new ones. the group discussions are stimulating, and they can get pretty intense. david will ask a lot of you once he gets to know you, but he's open to argument. overall, i'd say that you'd be missing a fantastic opportunity if you didn't take this course.\"",
            "review 17: \"04F with David Ehrlich: best first year seminar I've ever taken good times all round\"",
            "review 18: \"04F with David Ehrlich: Fun material, interesting people...what more can one ask of a freshman seminar?\"",
            "review 19: \"04F with David Ehrlich: that's what you do. and sometimes watch movies and write short 4 page papers. prof. Ehrlich strongly encourages you to develop and expand your creative side. this can be stressful sometimes becuase he tends to get rather demanding. my advice is to try to keep going with whatever your art form is, so that you always have something to show him. the class requires a lot of time, but it is worth it. you become extremely close with the other students and with David. (there is way less writing of papers in this seminar than in others, i hear)\"",
            "review 20: \"04F with David Ehrlich: This course is unlike any other you are likely to have at Dartmouth. It's just as much about growing in your own creative field as it is about watching films. The atmosphere of the class is laid back and open and no topic is off limits. David is a great teacher and an interesting person. This is perhaps the best choice for a freshman seminar ever. Ever.\"",
            "review 21: \"04F with David Ehrlich: This is my favorite class I've taken at Dartmouth so far. Prof. Ehrlich is awesome and understands the problems that students face; he made the class worthwhile. Writing papers about film is strange and not really a necessary skill, but my writing improved anyway. Take this class!!!\"",
            "review 22: \"04F with David Ehrlich: the class was great and you have an amzing opportunity to do all sorts of creative activities and explore your abilities.\"",
            "review 23: \"04F with David Ehrlich: This class is difficult to describe because it involves so many different things and is completely unlike any other course you will ever take at Dartmouth. We watch movies and write papers on them, we discuss creativity (and life and love and human nature), we keep track of our own creativity and do random creative projects, we get guest speakers to talk about their own creativity, we do a final show that we create. It's nuts (in a good way). David is wonderful because he makes a huge effort to get to know each student individually and know what everyone's creative talent is. He makes cake for your birthday (although it's Vegan...) and takes you shopping for organic food. My favorite part was near the end of the term when all of the students did short presentations about their creativity throughout the term...you realize that everyone here is ridiculously talented and amazing, which is a good realization. Yay Team Film 7!!\"",
            "review 24: \"04F with David Ehrlich: so much fun. i love watching movies and talking about them. The papers weren't bad at all, and we did lots of fun creative stuff too. It got to be a lot at times, but it was fun.\"",
            "review 25: \"02W with David Ehrlich: <span class=\"not-found\">no comment</span>\""
        ],
        "Cirri M.": [
            "review 1: \"07S with Cirri M.: The title says it all, I guess. The class was interesting to some degree. You didn't have to do the work unless you found it enjoyable (other than the papers, of course). This made the class better.\"",
            "review 2: \"07S with Cirri M.: Nottage was an English major here, but she incorporates none of her education into her teaching. All she talks about is film, about which she seems to know very little. I think she only got this job because she used to roll with Spike Lee... she knows some things about the logistics of production and directing, but nothing about what she needs to know about to teach this class.\"",
            "review 3: \"07S with Cirri M.: Professor Nottage's grading and syllabus is a bit daunting at first but eventually you get used to have to watch all the movies and do all the reading. She is tough on grading the papers but she gives you a ton of chances to rewrite and is open to help you at any time. The material is really interesting but there is a good amount of work involved.\"",
            "review 4: \"07S with Cirri M.: I originally took this class because I didn't want to take an art class to fulfill my art distrib. and since its a film class, i figured i won't have to do much writing... wrong. by the first week of class, i've written three papers, short, but three. nevertheless, this class was very interesting and i was enlightened about a small area of american cinema. nottage is a great professor and since shes a film person who loves concision, i learned to cut my wordiness. she is also very fair, and really wants to see her students improve their writing by offering up to two revisions for each paper. the only thing i didnt really like was the outside class movies we had to see each week. since theyre on reserve, that means an average of four hours each weekend at jones media\""
        ],
        "Jeffrey Ruoff": [
            "review 1: \"06W with Jeffrey Ruoff: The classes were interesting to go to but the tests were not accurately based on course materials and the readings were boring.\"",
            "review 2: \"04S with Jeffrey Ruoff: Ruoff teaches the material well!!!\"",
            "review 3: \"04S with Jeffrey Ruoff: The readings, screenings, and lectures were done well. After taking the course, I knew more about both WWII and film history in general. Solid professor, good course.\""
        ],
        "Amy Lawrence": [
            "review 1: \"09W with Amy Lawrence: Professor Walp is always available to help with papers however, some of the prompts were difficult to understand/vague and asked several questions not necessarily relating to each other.\"",
            "review 2: \"05W with Amy Lawrence: If you have an interest in television studies than this a is pretty good seminar. Five papers to write total with revisions on the last one only.\"",
            "review 3: \"05W with Amy Lawrence: This class is a lot of fun. It starts out and seems that it is going to be tons of reading but it really isn't, we got to watch some really amusing old sci-fi flicks. This is an awesome class and the professor is a lot of fun.\""
        ],
        "Mary Desjardins": [
            "review 1: \"02W with Mary Desjardins: The course was interesting but a lot of work. The paper topics were relatively difficult and really made me think. The screenings shown in class were fun and showed a varying degree of work of women directors. It would have been nice to have more class discussion about the films, however.\"",
            "review 2: \"02W with Mary Desjardins: Professor Desjardins is extremely nice and helpful to students. However,sometimes her lectures run a bit long. She crams a lot of information into her lectures which sometimes does not allow enough time for class discussion. The films aren't all that interesting since they are mostly silent films from women directors of past decades. I would have liked to have seen much more of a focus on contemporary women directors.\""
        ],
        "William Phillips": [
            "review 1: \"08S with William Phillips: This course was so much fun! You have 4 2.5 page papers, where you can basically write anything regarding 4 movies which we view and analyze for the class. Instead of writing one of the papers, you can substitute a screenplay in its place instead. The screenplay is awesome to be honest. If you put in the time and effort, there is no reason you can't get an A. Also, Professor Phillips talks about his amazing experiences as a driector/screenwriter in hollywood. There really aren't many \"true discussions, just Professor Phillips telling us about Hollywood. Honestly, this is probably my favorite course in my freshman year. Live it up!!!\"",
            "review 2: \"08S with William Phillips: I thought this sounded like a winner - watch movies, talk about screen adaptations, learn a little about both, call it a day. Nope. I can honestly say I learned more about sudoku in this class than I did about screen adaptations. Napping was also a favorite activity of everyone in class. We typically justwatched movies in class - the few times he attempted a discussion, no one actually talked/raised their hand, so it was a sad one-sided conversation. Papers were due about every two weeks and you submitted them to a writing assistant before you gave it to Phillips to be graded. It was really hit or miss - Phillips typically didn't care about the same things the WAs were stuck on, and the WAs could have good or bad weeks. Phillips gave little to no guidance on HOW to write or what to write about. The class could be taught by anyone just grabbed off the street. You should only take this class if you're INCREDIBLY interested in film and would like to get to know Phillips (he's really available for office hours). Or if you want a hardcore slacker class that requires minimal effort on occasional papers. Oh, and sparknote the books - the only reason to read is for quotes. Otherwise, RUN FAR FAR AWAY.\""
        ],
        "Joshua E.": [
            "review 1: \"07W with Joshua E.: This seminar was a very good intro to writing on films. You get exposure to a lot of awesome films and some wonderful short animation films. I'm not sure if the films were to everyone's taste, but if you're open-minded about more obscure movies, you'll enjoy the class. The reading list is great as well (though we very seldom discussed the readings in class). Prof. Harrell is very interesting and approachable. (Ask him to show you his own short animations!) He gives you a lot of creative freedom for your final oral presentations and your essays, but he will also provide you helpful guidance if you ask for it. This class, more than any other I've taken so far, really allows you to create your own workload and academic interests. Although it won't be required of you, I definitely recommend reading all of the books assigned; it'll give you such a clearer understanding of how the prof. has structured the course and the film selection.\""
        ]
    },
    "FILM003": {
        "John Bell": [
            "review 1: \"22W with John Bell: I greatly enjoyed this class. Bell is great, super chill and holds very interesting discussions in class. The workload of the class is manageable and enjoyable. I took it as my intro class for the major, but I would highly recommend that you take this class with Prof. Bell regardless of your major.\"",
            "review 2: \"22W with John Bell: Prof bell is a goat. very chill and class is easy and interesting. honestly a great class to take at dartmouth regardless of your major\"",
            "review 3: \"21W with John Bell: Professor Bell is a super nice guy and really chill on the homework. Readings were easily and there's a lot of creative freedom on how to respond to them (you can always just write out a response too). Final project was a podcast about any digital culture topic of our choice and overall super easy.\""
        ],
        "Martin Roberts": [],
        "Mary Flanagan": []
    },
    "FILM002": {
        "Mary Desjardins": [
            "review 1: \"19F with Mary Desjardins: Other review of her is very accurate. Also old and sour. Powerpoints are plain B&W haven't been updated in years. Very few grades and assignments aren't explained well. Also, she listed the wrong TB on the timetable so a lot of people got it and then had to get another one. Don't recommend it....\"",
            "review 2: \"19F with Mary Desjardins: This course is boring, attendance is taken every class, and Mary Desjardins is a grumpy, cold, rude professor.\""
        ],
        "Amy Lawrence": [
            "review 1: \"13F with Amy Lawrence: Course: This class is unfathomably dull. No, I don't think you're listening. Unfathomably dull. There's zero theory reading and zero television criticism. It's seriously all about structure of TV shows, and it sucks. Professor: No. Atrocious lectures. At one point she actually asked if we knew what the Cold War was. Workload: Very little reading, but that's not really a good thing since you don't learn anything from lectures. They take attendance in every class.\""
        ],
        "Mark Williams": []
    },
    "FILM001": {
        "Joanna E.": [
            "review 1: \"08X with Joanna E.: if you like movies and writing about them, then this is the class for you joanna is fun too, a little nutty, but fun and it's just nice and easy (but yeah, be prepared to write about lots of movies) quizzes every week -- but really, if you do the minimal amount of reading there is to do, then you should be fine i really liked it because i really liked the movies.\"",
            "review 2: \"07F with Joanna E.: This is a very interesting course and a very easy Art distributive. Joanna is just great!\"",
            "review 3: \"07F with Joanna E.: This class is really what you make of it, since Professor Rapf is very easygoing and doesn't demand too much. You can get away with a decent grade without investing in the work, but it is much better if you do. Professor Rapf is kind of goofy, modest, and very nice. Her class was a 3A, so the schedule consisted of a film on Monday preceded by a brief introductory lecture, then a longer lecture on Thursday with movie clips to illustrate her points. Each week focused on a different aspect of filmmaking: cinematography, art direction, editing, etc. We had five quizzes, of which we had to take four - but these were really easy and had bonus questions at the end to make up for mistakes. We also had to write a journal entry about each film, which you could either bs through or spend a lot of time on. This were definitely the the part of the course that I got the most out of though, so I would recommend putting in effort. There was also an editing exercise (easy), a final project (easy), and a final test (easy). Really the class was not stressful and pretty fun so if you need an art distributive or a third class, I would recommend it.\"",
            "review 4: \"07F with Joanna E.: Joanna knows a lot about filmmaking and is a great resource. There are weekly quizzes on the movies we watch in class and on the readings. Keep up with your journal or else the end of term will not be fun. There's a midterm and a final and a final project that can either be creative or a short paper on someone in film. There's also an \"editing exercise\" that is painless. Overall it's a great introduction to movies and the movies you watch are for the most part great.\"",
            "review 5: \"07F with Joanna E.: This is a great course for those who don't know much about movies but would like to learn quite a bit. Joanna is great at giving lectures, her personal experience is amazing, she really knows what she is talking about. The movies she selects for the class are really good also. She is not a very tough grades, though I feel she is fair: as long as you put effort into this course, you will do well. You can probably get away with not putting so much effort in, but don't expect an A. Some people think this is an easy class, but you really do need to put effort into this (weekly quizzes, journal entries every week, plus extra movies you have to watch outside of class, midterm, final, weekly reading (three books plus a reader), editing exercise and final project). Go for it and you won't regret: seriously, interesting stuff taught in an enjoyable way.\"",
            "review 6: \"07F with Joanna E.: Definitely take this for an ART distrib or just for fun. The movies were awesome (except for one or two), and the readings were extremely interesting. Sometimes I felt like Rapf was relying too heavily on the reading in her lectures, but overall she was very attentive, responsive, nice, and enthusiastic.\"",
            "review 7: \"07F with Joanna E.: Joanna (she doesn't like \"professor\") is one of the nicest and understanding professor's I've ever had at Dartmouth. Having said that, her weekly quizzes are murderously tricky, you have to watch for EVERY background detail in the films. Also, think you're a good writer? Grading on the tedious journals might change your mind. If you're looking for a guy class, you might think \"oh yea, Film 1!!\"...DON'T do that, you'll fail. Other than that, I'm pleased with the introduction to filmmaking that I received.\"",
            "review 8: \"07F with Joanna E.: unless you are really on top of the assignments, they bulk up before final deadlines and leave you swamped. Rapf was awsome.\"",
            "review 9: \"07F with Joanna E.: The class was definately interesting with the different types of films we watched. The journals for each film were kind of tedious though. That's what essentially makes your grade though. There's a lot of reading involved and you are really expected to know the material for the class. You really have to study for this class in order to get a B or A. It's a good class though.\"",
            "review 10: \"06X with Joanna E.: For those more interested in analyzing art than creating it (e.g., drawing), Film 1 was a great course. We scrutinized the moviemaking process (directing, writing, editing, cinematography, etc.). This non-demanding enjoyable course an ideal one for Sophomore Summer. You get the most out of the course from the journal entries (on every film we see in class, plus three outside films) in which you set out moviemakers' rationale, answering why moviemaker Bob Smith did x, y, and z. Since you'll definitely be watching movies for the rest of your life, what you learn in class is definitely applicable towards real-life. Joanna Rapf is a very nice professor, who although likes director Sidnet Lumet a bit too much (the majority of the films we saw in class were directed by him), is still a worthwhile professor to take the class with. While she doesn't focus on popular recent films, she still runs a worthwhile class where you get to learn the nuts and bolts about movies. This class is honestly only as time-consuming as you want it to be. The assignments that take the longest - the journal entries can be as short or as long as you want them to be, although I get the feeling that the more analysis you write, the better grades you get.\"",
            "review 11: \"06X with Joanna E.: This was a great sophomore summer class. It was interesting, but also laid back. The majority of the grade is made up of the journals which are sort of time consuming, but it is definitely worth it not to have a final. The one problem with the class is that Rapf focuses mainly on films of 1 director (Sidney Lumet), and chooses arguably not the best films. But overall a good intro to the topic.\"",
            "review 12: \"06X with Joanna E.: I had no film experience beforehand, as in, I never really watched movies ever. But it was an amazing class. Fun, carefree, she let you do whatever you want, as long as you put in a lot of effort. Rapf has great anecdotes about the movie industry. Inspiring woman. I wish I could take it again. TAKE IT SOPHOMORE SUMMER, it was such a great summer course.\"",
            "review 13: \"06X with Joanna E.: This class is really enjoyable because you view really cool and old films. The quizzes are random and it your grade will be determined by luck. You will be expected to look at classes outside of class.\"",
            "review 14: \"05F with Joanna E.: sometimes youd be asked what a house number on a house in a movie was during a quiz. you arent really warned of these weird questions, but she does throw out the two lowest grades AND gives extra credit, so its pretty okay. Really interesting. Really Liked it.\"",
            "review 15: \"05F with Joanna E.: I took this class for my art distrib but got a lot more out of it than I expected. Expect to spend time on this class since it IS an intro class and so has a lot of small assignments -- they are not hard, but they may take some time. A wonderful class for everyone to take, because you really won't look at film the same way ever again -- and you'll be watching movies for the rest of your life, so you will definitely appreciate this course. Best distrib I've ever taken. You don't need any prior knowledge of -- or even interest in -- film.\"",
            "review 16: \"04X with Joanna E.: Professor Rapf shows a diverse range of films in this course. The writing assignments, though numerous, easilly allow you to anlayze the films. The class is a lot of work but it provides a good basis for understanding the various stages of film production. Rapf is extremely accessible outside of class. Go to her office hours; she's very down to earth.\"",
            "review 17: \"04X with Joanna E.: The course itself is a decent course. However, do not take it with this professor. She focuses primarily on the work of Sydney Lumet and on obscure details. Her syllabus lacks breadth and creativity. Lumet is a good director, but other than Citizen Kane no one else's work is covered. Furthermore, her knowledge and class materials are incredibly outdated for a course that should include relevant present day information. It's called \"From Script to Screen\" but the professor knows only about this process before computers. Thus, any information given on editing and special effects is useful in purely a historical context.\"",
            "review 18: \"04X with Joanna E.: this was a fun way to get my NA credit. i loved all the movies we watched for class and the lectures were interesting and engaging. there is a fair amount of work, however. i ended up handing in about 25 pages for my journal and the final projects were fairly difficult. its a good class and i wouldnt be scared off by the work, but just know that it sucks up a lot of time especially if you get behind on your journal\"",
            "review 19: \"04X with Joanna E.: All humanities majors who aren't big movie buffs should probably take this class. You actually learn the basics of how to watch a movie for academics. It's a helpful skill. Taking notes during movies is a drag, and writing journal entries isn;t the best either, but it's certainly not hard. You can write your entries about almost anything in the movie, as long as you address a few prompts from the syllabus (which actually makes it easier) Getting a perfect grade on the weekly quizzes is really easy if you've read the assigned reading. It's usually one or two short chapters - really not hard. It makes a huge difference to just do the little bit of reading. The project at the end is cake - I'd recommend doing a \"creative project\" about the making of a movie rather than picking a specific profession to study - it's hard to do that much research on obscure movies. Also - the air conditioned theatre is nice in the summers, and you can totally bring in ice cream from the hop during your break. Joanna is pretty interesting, although a bit eccentric, and loves movies like nobody's business.\"",
            "review 20: \"04X with Joanna E.: The class can really go either way for you. It's relatively easy - the only work are short journals to turn in every two weeks or so, based on the movies you will watch in class. Also, there's a short editing project toward the middle of the term, a relatively innocuous mid-term and a final project of your choosing (you can choose to write a paper, do a short movie of your own, or make a poster - of course, a lot of people choose the \"poster\" option). If you've taken other film classes at the school before or if you feel like you already know a lot about film, you'll probably find the class to be far too basic and introductory. As nice of a lady Professor Rapf is, and as accessible as she makes her office hours, her lectures can be boring, and worse off, often she won't lecture at all and will instead play endless clips off of videotapes. I found it disappointing when many class periods were taught more from the videotapes then from the professor. Professor Rapf is certainly passionate about her job and the subject matter, it's just that her teaching style often encounters difficulty in meeting that passion. Unfortunately, the course feels like a easy gut course, which is great if you're looking for a light last course to add on, and not so great if you'd like a more intense learning experience.\"",
            "review 21: \"04X with Joanna E.: film 1 was a great class. professor rapf was a ton of fun and really was into her teaching and inspired us to be as well. i learned a lot about film. so much more than i thought was possible. this is a great class for anyone needing an art credit or anyone interested in movies. that said, we used xhours every week.\"",
            "review 22: \"04X with Joanna E.: I took this class for the art distributive, and I learned a lot. Joanna (as she insisted we call her) is a great professor when it comes to lectures. My only frustration was her grading. It was unclear at times what she wanted, therefore impossible to perform accordingly. For example, the guidelines for the final project seemed very open ended. I just needed to create a project explaining the pre-production, production, post-production, distribution, and reception of a film of my choice. I spent quite a deal of time on my project, only to be severely marked down for not discussing the art director and editor with enough detail. This was NOT in the guidelines, and I could have easily included it if I had known. A similar situation happened both with my journal entries and the midterm exam, and my grade will suffer because of it.\"",
            "review 23: \"03X with Joanna E.: I enjoyed a lot of things about this class. It was very interesting subject material, and Joanna is very enthusiastic. I just have two complaints: 1). We spent so much time on Lumet, and I wish we'd watched a greater variety of films from different directors, and 2). A lot of the quiz questions were such small details of the movie, which made them exceedlingly difficult for someone just learning to watch movies analytically.\"",
            "review 24: \"03X with Joanna E.: Being an econ major you dont get to take too many truely interesting, different classes....this class is perfect for film fans just wanting to learn about how movies are made. The teacher is wonderful and very kind. She really wanted to help and made students want to learn.\"",
            "review 25: \"02X with Joanna E.: Prof Rapf is a great prof to have for film one. Because of her connections in the film world itself, we had interesting guest lectures.\"",
            "review 26: \"02X with Joanna E.: joanna rapf is very cool. the course is intro so it covers tons, but it is a great class. the films were good. some newer some older. do a project for the final, not a boring paper. go talk to her too, she is very nice and she learns names even though it is a lecture class.\"",
            "review 27: \"02X with Joanna E.: I've had Prof Rapf as a guest lecturer before, and she was good, so I thought she would be a good professor. Nope. She could have been good were it not for her bizarre obsession with director Sidney Lumet. The films she chose were not good choices to introduce people to aspects of film. The Lumet book we read was good, but his films are not. The course would have been salvageable with better films. The final project was also pretty ridiculous: she gave you the choice of a 3-5 page paper (covering an aspect of three films, way too much material to stuff into five pages), a collage, a scrapbook, or a short video. The journals throughout the term were a good assessment, though.\"",
            "review 28: \"02X with Joanna E.: ART and NA. Two birds with one stone. Not too shabby. The class is not hard, but I think that there is a bit too much work in it. The work's not hard at all, but it's tedious. The prof loves movies, so that's always good, but the reading didn't do much to inspire interest in the subject. All in all, you can't beat it if you need the distribs.\""
        ],
        "Mark Williams": [
            "review 1: \"21F with Mark Williams: Okay firstly, let me just say that I have very mixed feelings about this class. If you are looking for a layup, this is most definitely not one. To name a few of the downsides of this class, this was a class that used the X-hr every week, but despite the 3 hour lecture that it should be on the X-hr day, it oftentimes will run about 25 minutes after the class ends. This is also true for the other class time during the week, so don’t plan anything directly after class. As for the assessments, there are weekly quizzes and it’s very hard to predict what will be on them, so there was a lot of stress that went into this class since no one really knew what was going on. Speaking of quizzes, there will often be content on it that is within a 40 page reading that is assigned on top of textbook chapter readings. As for the prof, he’s a nice person, but he talks in a really soft voice and it’s sometimes hard to hear/concentrate without falling asleep. On top of that, attendance is required every time because classes aren’t recorded nor does he post slideshows of important notes for students to have a copy. But I personally didn’t mind the class too much because I want to study film so I found the content and all the films we watched were very interesting, and I learned so much about film techniques and film theory. But if you aren’t interested in film and need a layup, this is not your class to take.\"",
            "review 2: \"21F with Mark Williams: Do not take this class. I am not kidding. It is not worth it find another layup. Not even a layup find any other class. I promise you do not like film this much. Mark was a nice guy but very confusing. Also we did not get any grades back until week 8. Don't waste your time with this class. You have been warned.\"",
            "review 3: \"21F with Mark Williams: I don't even know where to begin with how incredibly painful this class was. This was my first term at Dartmouth, and I sincerely hope that this will be the worst class I take at this school. Williams is a horrible professor. Read any of the other reviews of this class from the past ten years and they will tell you all you need to know. He is pretentious, boring, doesn't engage with people well at all, doesn't return anything on time, doesn't answer simple questions. I could seriously go on and on. If you look at this and go 'An intro class couldn't possibly be that bad', think again. It was that bad. I am a prospective film major, and I dreaded going to this class every week. Not once did I feel like he valued curiosity or student questions that went beyond the scope of his predetermined lecture rhetoric, nor did he make it possible to meet with him outside of a one hour period of time each week (on Zoom or in person??? I'll honestly never know). Only redeeming feature of the class was that the films we watched were interesting, but you could get that from literally anyone else. Cannot believe that Dartmouth allowed him to teach this class. I know for a fact that everyone is rethinking their interest in film because of it.\"",
            "review 4: \"21F with Mark Williams: Bro this class was awful?? Half the class was falling asleep due to the awful hours (3 hours on monday afternoons) and boring lectures. The prof made no sense and the quizzes/exams were unpredictable. Genuine waste of time and not a layup, almost destroyed my passion for film and made me rethink coming to school. 0/10.\"",
            "review 5: \"18F with Mark Williams: Honestly one of the harder classes I've taken here. Not a lot of work but the midterm and final take a lot of studying. However, I may have learned more in this class than any other class I've taken. I really appreciate movies and TV shows more now. Basically, you get to watch a movie in class once a week, then listen to a lecture for the other class. Kind of hard, but so glad I took it.\"",
            "review 6: \"04F with Mark Williams: If you do, this is the right class for you. Professor Williams is a brilliant professor whose passion for film truly inspires others. Professor Williams is by far one of the best professors I've had. His lectures are so lively that time flies in that class! The material is fascinating and it will make you love and appreciate movies even more. If you want to take a film class, this is the class you have to take it is remarkable.\"",
            "review 7: \"04F with Mark Williams: The best part of the class is the variety in the movies screened. Most of them are good to very good. Lectures/discussion are passable but could be better. Consists of weekly quizzes, an editing paper, midterm, final. Five hours of class per wk (3+2). The two hour lectures can get tiresome if there's no movie that day.\"",
            "review 8: \"04F with Mark Williams: I took this class because I thought it would be an interesting way to fulfill my art distrib. It COULD have been, but Prof. Williams was HORRIBLE. His lectures were bland, disorganized, and unstimulating, which is really bad for a 3a. His quiz and test questions are unclear and use a lot of convoluted wording. He is very full of himself and unpleasant to talk to.\"",
            "review 9: \"04F with Mark Williams: Williams is a prick. writes horrible essay questions that can hardly be made into a coherent essay. bad about getting assignments back to the class, and when he does there's no indication of why you recieved the grade you did.\"",
            "review 10: \"04F with Mark Williams: I took this class for two reasons. One, as you can probably guess, was that I needed an ART distrib. The other was that I love watching TV and movies, and wanted to learn to appreciate them at a deeper level. I'm not sure whether I'm disappointed in the course. The readings were basically common sense with labels, and the quizzes and exams asked completely random questions that the average person reading the material/studying lecture notes would never guess he would ask, and thus would not be able to answer well. The average quiz grade was between 50-60%. But I also came out of the class somehow seeing Tv and movies differently, noticing how shots were framed, composed, and ordered. So despite working hard and not feeling academically rewarded, I did learn something for myself.\"",
            "review 11: \"04F with Mark Williams: The films were good. Unfortunately, the readings were ultra-dense academic gibberish, the quizes were arbitrary as heck, and the professor deliberately and studiously avoided direct, simple answers to even the most banal of questions. However, in the end, if you gots ta take it, you gots ta take it, and the workload is pretty nice, as long as you can deal with the reading.\"",
            "review 12: \"04F with Mark Williams: The class wasn't very difficult, but was interesting. The films were good, and the readings were informative, though sometimes redundant. The subject material was interesting, and Prof. Williams is very knowledgable about the subject, though he can be somewhat arrogant and annoying in lectures. Short quiz each week that's easy if you do the readings, and one short paper. Overall an interesting class and not too difficult class with an okay prof.\"",
            "review 13: \"04F with Mark Williams: I needed an art distrib and the movies were fun. Weekly reading quizes were a bit annoying but were fair and easy if you kept up. Overall, it was a fairly painless way to get my ART out of the way, and I even found myself having fun sometimes.\"",
            "review 14: \"04F with Mark Williams: I dreaded going to class because of the prof. but outside of class he was much more responsive. we watched some good movies. The readings were long.\"",
            "review 15: \"04F with Mark Williams: Considering its title, \"From Script to Screen,\" I thought this course would be about the filmmaking process-- some combination of technical and literary analysis. Film studies, I discovered, is more like a lit course than anything. Much of class time, therefore, was spent screening films and analyzing them according to standards described in the lectures. Homework involved readings about the films or about literary theory and studying for the six reading quizzes. There was a midterm, a final and a 2-3 page paper that included some sketches. The grading was easy, though sometimes the reading quizzes expected you to recall obscure information. The subject matter was interesting, and the class was fairly large but engaged. My main gripe: the lectures were conducted in sort of a free-wheeling manner. Professor Williams began with a concept, often wrote it on the board, and then asked a broad question that would elicit 20 minutes worth of student answers. As a result, it was hard to separate the stuff he actually wanted us to know and the crap that spewed from the students' mouths. I personally prefer to distinguish more sharply between lecture and discussion. A more controversial gripe: Professor Williams is obviously enamored with postmodernism and critical theory. This is fine and often interesting; however, we spent the vast, vast majority of class drawing distinctions between modernist/postmodernist elements in films with the classical films. Yet we never saw a prototypical classical film, which made such comparisons a little meaningless. The other thing about postmodernism... its jargon and long-windedness can take you far away from the source (the movie). When I studied for the final, I realized how I could have as easily been studying for a lit theory class as for a film class; there was little about the medium specifically. A little disappointing. That said, though, it's fun, easy and interesting.\"",
            "review 16: \"04F with Mark Williams: I took this class as an interesting way to get my art distrib. Bad choice. Prof Williams's quizes are extremely hard, on things mentioned once quickly in class or minute points in the readings. His lectures consist of him throwing questions at the class, and then responding with, \"hmm, maybe.\" When asked a question, he won't answer, rather he will say, \"what do you think\", making it very hard to actually learn anything from him. Some of the movies were good, but not enough to make up for the prof. Find another class for the art distrib.\"",
            "review 17: \"04F with Mark Williams: I liked this class...my only complaints were the long hours (though we were just watching movies for some classes, so if you didn't want to be there you could always watch the movie later) and some of the 'stupid' questions on the quizzes (put there to make sure we had read). I found Prof. Williams to be pretty good: unlike some people who complained about him, i would rather not have knowledge crammed down my throat during lectures, and the way he teased information out of the class was fine with me.\"",
            "review 18: \"04F with Mark Williams: This was the most horrible class I have EVER taken at Dartmouth. This man is a nut, avoid him at all costs. In class: His lectures are ineffective, he's pretentious, he does not answer questions in a straightforward manner and no matter how much interest you try to demonstrate: you will be stuck with a bad grade. Outside of class: he is a nice guy: always available for office hours etc, but he just can't teach to save a life. He just loves freshmen and hates everyone else: lucky kids. He ruined my otherwise great GPA.\"",
            "review 19: \"04F with Mark Williams: A lot of people complained about this prof, but I thought his lectures were very engaging. He encouraged a LOT of class discussion, which let students get to know each other better and made a pretty big class feel more intimate. He'd respond to almost every question you asked with \"What do you think?\" and to every point you made with \"Perhaps,\" or \"Maybe.\" I didn't mind this generally, because it made you think about and defend your ideas, but it could be kind of frustrating when you just wanted something defined. There's a good amount of reading for this course, and you can't really read \"selectively\" if you want to do well on the quizzes--although you can postpone Monday's reading until the night before Thursday's quiz. The class average on most quizzes was something like 5 out of 10 (he counts the best 5 out of 6 quizzes), but it IS possible to do well if you read thoroughly. The movies are really interesting, but you have to be pretty open-minded to appreciate the more experimental ones. If you are genuinely interested in film, this is a great class.\"",
            "review 20: \"04F with Mark Williams: prof was not clear about what he wanted or what types of interpretations seemed relevant\"",
            "review 21: \"04F with Mark Williams: Occassionally, Williams is known to say funny or intellegent things. However, that does not make up for his general failure to effectively teach the course. He took approximately 3 weeks to grade a midterm which consisted of 3 few sentence answers and one fairly short essay. He took off points and did not cite why on anyone's paper! It was the worst midterm grade I ever received and there was no comment why I was deducted a single point. When I went to see him, he had no desire to explain why I had lost points or explain how I could do better in the future. I could go on and on, but I'll just stop here: don't take a class with Mark Williams.\"",
            "review 22: \"04F with Mark Williams: This class covers interesting material (the textbook was great for once), but the professor brings it down. Prof. Williams is a good guy, but not particularly good at teaching the class. He is real big on using Socratic method, but that isn't such a good idea for a large intro film class. He would be better off presenting an organized lecture. Also, if you are not a film major, consider this as a good class to NRO.\"",
            "review 23: \"02F with Mark Williams: Professor Williams delivers extremely soporific lectures. The material in the first half of the course is interesting, but the second half is incredibly dull. Papers and quizzes go ungraded for weeks, little feedback is available. If you love movies please don't take this class.\"",
            "review 24: \"02F with Mark Williams: This class was a great class to take, especially if you've never taken any film classes before and are interested in movies. Prof. Williams really loves movies, and it really comes through during the lectures. He also likes teaching, which makes the class much more fun. He encourages class discussion, and if no one speaks up will make the class stretch together. The movies we saw were interesting, and the readings were all relevant. You do have to do the readings though, as there are weekly quizes. The one thing that I didn't like about the class was the size of it (it is a large lecture class), but if you can get over that than and are interested in movies and studying them here then I would say definately try this class.\"",
            "review 25: \"02F with Mark Williams: arrogant professor but fun class. it gives you a different view of film, it's not that hard, the professor doesn't teach much but that doesn't really matter. you do a lot of modernism and post modernism, don't take it if you don't like them.\"",
            "review 26: \"02F with Mark Williams: dont take this class. no matter how well you think you will do, the grading is completely random and you have 3 hour boring lectures once a week about random stuff that is completely unrelated to film\"",
            "review 27: \"02F with Mark Williams: First half of the course establishes all of the fundamental topics of film, everything you wanted to know about how movies go from script to screen (hence the name.) Mostly pretty technical stuff. Second half focuses more on intense exploration of theme, symoblism, meaning, subjectivity, modern and post modern cinema, and other similar \"dense\" subjects. This class was everything i wanted in an introductory film class. Williams was a great lecturer most of the time, keeps the excitement going even when talking about something as bland as genre. The course profoundly changes the way you'll watch and process movies, and the discussion of each film that you screen is usually pretty mindblowing. On the other hand, if you aren't interested in often very artistic and philosophical discussion, you will probably lose interest halfway through the course. I enjoyed the balance and would reccomend this course highly.\"",
            "review 28: \"02F with Mark Williams: yes...mark j. williams is unbelievable. he is such a dynamic speaker and the course material is so interesting. i never wanted the classes to end. take this class -- it is fabulous.\""
        ],
        "Amy Lawrence": [
            "review 1: \"18F with Amy Lawrence: Not the layup I thought it would be. 5 essays made up the grade for the term. Each one was graded somewhat harshly and for the first few you're kinda on your own for how to write it. Prof. Lawrence is obviously passionate about the subject and teaches well, but provided little guidance on how to write the papers. With no expectations to base writing off of, I'm pretty sure most of the class has about a B. It remains to be seen whether the grades get curved up at all.\"",
            "review 2: \"11F with Amy Lawrence: Course: NOT an easy A class. Every x-hour is technically used, although we were occasionally released early if watching a movie (this means typically three hours spent in class on Mondays - usually movie-watching time, sometimes lecture). Interesting in that we did not focus on classic movies but rather movies of various genres that I probably wouldn't have found or thought to watch on my own. Professor: Very difficult paper grader in the sense that what seems to be appreciated is direct repetition of the prompt and listing of the technical aspects of the film - centering papers around a theme or thesis outside of the film techniques not exactly appreciated... Workload: Readings important for quizzes (at least for the first half of the term); several papers throughout the term (occasionally with scene/shot drawings that take quite a bit of time) and a final paper. Most difficult paper was one based off of \"film-events\" outside of class. These films were shown at the Hop/Loew with the director present, and it typically wasn't possible to view them more than once.\"",
            "review 3: \"11F with Amy Lawrence: Made me lose interest in film. repetitive and boring lectures\"",
            "review 4: \"11F with Amy Lawrence: Lectures are pretty straightforward. Quizzes can be a bit nit picky, but your grade is mainly determined by papers. She's a tough grader but definitely fair when it comes to the papers. Professor Lawrence is incredibly intelligent, tough, fair, very well spoken, and passionate about the subject matter. Take any course you can with her, just be prepared to do the work.\"",
            "review 5: \"08F with Amy Lawrence: Could have been really interesting, but it was just OK. Neither professor gave very interesting lectures. It seemed like a lot of the students were film majors and the class definitely caters to them. Considering this is an introductory course, it should have been more accessible to those of us who haven't taken a film class before.\"",
            "review 6: \"08F with Amy Lawrence: took for an art distrib. would not recommend. lawrence is miserable. class is geared too much toward film majors.\"",
            "review 7: \"06F with Amy Lawrence: This course was really interesting. You watch movies about every other class, which are sometimes hard to stay awake through, especially as the term progresses. Not because they are boring movies, but becuase of the 10A time period...you're bound to be tired. The assigned papers can also seem hard, because they are different than your normal essays from writing classes. She also does not really explain how to write the papers very thoroughly. She kind of just throws you in the deep end, and does not grade very easily. However, I didn't talk to her much about the papers, usually just wrote them last minute. So she might've been very helpful if you had the time to go in and speak with her about the papers. Overall I'm glad I took the class because it did give me an overview of film studies.\"",
            "review 8: \"06F with Amy Lawrence: This class was OK. I learned a lot about the basics of film, which is why you should take it. The class was for my own personal enjoyment, and I think i got out of it what I put in.\"",
            "review 9: \"06F with Amy Lawrence: Lawrence tries to make this class more important than it is by grading overly hard (median was a B) and requiring attendance. Boring lectures, bad prof, don't take this class with Lawrence.\"",
            "review 10: \"06F with Amy Lawrence: The lectures were great. Prof. Lawrence did a really good job putting them together and interspercing film clips and relating the movies we watched with the material we were learning. The grading was a little tough, and I'm not sure why. Papers were also difficult, becuase it would be analyzing a 30 second clip of a film and writing a 3-6 page paper about that clip and every minute detail of it (the mise-en-scene, the sound, the editing, etc.) Being at 10A, it was difficult to pay attention throughout the class, especially after pulling all-nighters writing the papers (but there were only 3, so that actually wasn't too bad) Overall, it was a good class. I'd recommend it to anyone interested in film.\"",
            "review 11: \"06F with Amy Lawrence: less time consuming than other art credits but a pain\"",
            "review 12: \"06F with Amy Lawrence: The ups of this course are that you get to watch a movie about every week and they represent a pretty broad range of genres and time periods. However, the papers you have to write are somewhat of a pain in that instructions are fairly vague and grading is somewhat harsh, at least from my perspective. However, you will certainly learn much about the technical aspects of film and the process of going from start to finish, which I knew next to nothing about before I took this course.\"",
            "review 13: \"06F with Amy Lawrence: The course material is very interesting, and you watch a lot of really cool films. Even though prof Lawrence could be a tough grader, she still gave good lectures. The only frustrating thing was that there were only 1 or 2 copies of each film we watched to be shared with the 50 person class, so it became nearly impossible to check them out when each paper came around.\"",
            "review 14: \"06F with Amy Lawrence: This course is very interesting and you learn a lot without doing a ton of work. Professor Lawrence gives easy quizzes. The paper topics were easy enough but Professor Lawrence's grading is questionable. A lot of people I knew were dissatisfied. There's something weird about writing 4 pages over the suggested length and then being marked down for not writing even more. You can re-write papers usually if you get a C+ or below, but even then your grade might only improve by 1/2 a step (aka C+/B-). The course is definitely worth taking for someone with an interest in film, but maybe a different professor would be better to take with.\"",
            "review 15: \"03F with Amy Lawrence: As Professor Lawrence said in the first class: \"If you want to eat popcorn and watch lots of fun movies, go join the Film Society.\" For people who like discussing movies in depth, this is a great course to take, not because you will be discussing the movies in class, (it's a lecture class, so there isn't any real class discussion,) but because you'll learn WHAT makes a movie great. \"Sure, this movie had good music, but why did that music work so well?\" That's the sort of thing you'll learn.\"",
            "review 16: \"03F with Amy Lawrence: About the course: The ORC gives a pretty accurate description of the material covered in Film 1. You learn about all the basic elements of filmmaking, a little bit about how to describe movies in cinematic terms, and the processes behind making a movie. Cinematography, mise-en-scene, editing, screenwriting, and sound are all covered, although only to the extent that you can analyze and talk about them intelligently. There's also a lot about behind-the-scenes jobs, like the producer, the key grip, the gaffer, the best boy, the script girl, etc. The level of depth is what you would expect out of a survey course. About the professor: Professor Lawrence gives fairly standard lectures, so they can get boring sometimes. She's very well-organized and definitely knows what she's talking about. However, the main reason I would recommend taking this class with her over some other professor is that she shows some very good, relatively unknown movies that you probably would not see otherwise. I can't guarantee that you'll like these movies, but personally I loved them. The quizzes that she gives are very easy if you take good notes in class. She grades the papers fairly hard though. Overall, it's on par with other survey classes I've taken in terms of difficulty.\"",
            "review 17: \"03F with Amy Lawrence: if not a film major, this is not an easy class just because it is introductory\"",
            "review 18: \"03F with Amy Lawrence: The class seemed really interesting at first, but it wore off with time. Prof. Lawrence doesn't really care about her students, and she seems really bitter for some reason (you'll notice that when you get a graded paper back). The class is good overall, but the paper topics are really strange and unclear. Take it to fulfill the art distributive. (Not an easy A anymore).\"",
            "review 19: \"03F with Amy Lawrence: I thought this was a great first term class. Prof. Lawrence isn't spectacular, but she's a decent prof. The workload was definitely pretty light, too. I think this class is good not just for majors, but for people who want to learn a little more about the industry.\"",
            "review 20: \"03F with Amy Lawrence: I thought this class was a good introduction to film. The papers and readings were reasonable and interesting, and they covered a wide range of topics in film. Plus, you get to go to class and watch a film once a week! An over all relatively positive experience.\"",
            "review 21: \"03F with Amy Lawrence: Interesting Prof. Lawrence isn't the frendliest after or before class, but she teaches with sincerety for a subject she is overly attentive and devoted to. Her care to explain the filmmaking process is somewhat inspiring. I learned to appreciate films more now than before, whether good or bad. Not as hard as some say.\"",
            "review 22: \"03F with Amy Lawrence: If you are a movie-buff, but don't know much about the process, this is a pretty cool class. Learn the basics of lighting, sound, acting so you can better appreciate it in the films you see. Not a slack course, it takes tiem to analyze scenes for a paper, but not real hard.\"",
            "review 23: \"01F with Amy Lawrence: Prof Lawrence seems to care more about film than she does her students. I was afraid to talk to her after class. She always seemed too busy to chat. Prof Lawrence expects her students to hand in detailed, critical analyses of the films we watch in class, but doesn't give her students ANY clue as to how to write a critical essay, OR how to even go about analyzing a film. You have to pull a lot of the paper from your own imagination, and 1/2 the time, she takes points off because you failed to see something that was incredibly obvious to her. This class needs serious revision.\"",
            "review 24: \"01F with Amy Lawrence: Some of the lectures were tedious, as were a couple of the movies. But I gained a real understanding of what goes into making a film. I can't watch a film now without noticing the camera angles, editing, and soundtrack. Some of the readings were long and sleep-inducing, but the quizes weren't tough, especially if you take adequate notes. The papers weren't too tough either.\"",
            "review 25: \"01F with Amy Lawrence: Basically, you watch clips of movies 2 days out of the week and take notes. There is usually one day a week where you watch a featue film, and none of the films you see suck. The readings are there, but most are supplementary to the lectures and she barely ever tests you on them. Nevertheless, the class is quite interesting and I urge anyone who is even thinking about Film as a major to take this class, or even if you just like to watch movies. Amy Lawrence is a decent instructor, but her office hours are few and far between so don't expect to get a hold of her when you need something. She is very intelligent, but not particularly inspiring, but the subject is interesting enough to inspire itself. Great course overall though.\"",
            "review 26: \"01F with Amy Lawrence: I had expected more from this class.. sure the material was interesting, but I don't think Prof. Lawrence was very interesting in lecture. The stuff on the quizzes and required for papers weren't in the textbooks either; the textbooks were kinda like junior high level books that you would read when you're bored.\""
        ],
        "Jodie Mack": [
            "review 1: \"22X with Jodie Mack: Super easy with her, wouldn't recommend the other professors though. weekly movie storyboards and I didnt even watch the movies were all participation based and a couple questions, and then a midterm for summer of soul that we all chose a film aspect to write about , and final we all just split a movie into minute and a half sections and recreated our portion.\"",
            "review 2: \"20F with Jodie Mack: This class really wasn't that bad. Not a super easy layup, but definitely didn't take all of your time, and not difficult to get an A. Prof Mack can be a little unpredictable but is honestly just entertaining. The only thing that kinda sucked was that she used a lot of X hours for film screenings or discussions.\"",
            "review 3: \"20F with Jodie Mack: Prof Mack is really cool - definitely an amazing prof! Range of films watched: Sorry to Bother You, Watermelon Woman, Do the Right Thing, The Wonders (2014), some silent films, experimental films... There was two assignments each week: Production and Consumption (completion based). Aprox took me 1 hour for production and 4-5 hours for consumption to do work I was proud of - could do it in less if you just wanted to get a completion grade. Then there was a midterm (film review website) and a final (each student made a 1 minute section of a recreation of a 16 minute film Ballet Mécanique). Prof. Mack is super talented and super passionate - if you invest yourself, you can definitely learn a lot and develop as both a film maker and consumer!\"",
            "review 4: \"16F with Jodie Mack: Professor Mack was pretty decent but sometimes can be a little unpredictable. As long as you keep up with the journal and set aside some time for the papers which are super short this is a pretty doable class.\"",
            "review 5: \"16F with Jodie Mack: Mack is a genuinely nice lady. As long as you have respect for what she's teaching you and you speak up once in a while, you'll be set. Tuesdays were for going over slides the whole time and then Thursdays we watched a film. There were 2 papers and a journal, plus a midterm and a final. The exams were straight forward. If you knew the vocabulary you could get a near perfect score. As for the journal, do not get behind! It comprised most of the work in the class in my opinion. I would definitely recommend taking it with Mack. She's a lot of fun. Great course for first years as well.\"",
            "review 6: \"16F with Jodie Mack: Unfair grader. Totally unreasonable grading system as well. Take points off journal for not beautiful thumbnails drawings(i mean seriously? this is not a drawing class!). Very positive comments on papers but take points off for using one \"is\"(i get it that we shall avoid passive voice; but what if it's just a statement of fact and used in positive voice?). also not fair grading in participation. Even if you participated fully in class and raise your hands more than frequently. She'll give you more points if you are from her animation class. So if you want a high grade in this class, please take her animation class at the same time.\"",
            "review 7: \"16F with Jodie Mack: Professor Mack is incredible. She's super passionate about film, always makes class interesting, and really cares for her students. She doesn't like passive voice, but other than that I think she's a fair grader-- there are 2 main papers which are both very short (I think they were 2 pages max) and if you pay attention to what she didn't like about the first paper, the second should be graded much higher. As long as you come to class, even the ones that are just film-watching, and speak up every once in a while during discussion, the participation grade part should be easy. As a freshman, I felt like this was a super fun layup and I'm definitely going to try to take another class with Prof Mack.\""
        ],
        "Jeffrey Ruoff": [
            "review 1: \"09F with Jeffrey Ruoff: Overall, I recommend taking this course. We learned about all of the basic, technical aspects that go into making a film, from sound to editing to cinematography. We ended up covering 7-8 chapters out of 12 in our textbook. We had 3 tests and 3 papers. He drops the lowest test grade. The tests were all 50 minutes and were composed of 5 short answer questions. It's hard to b.s. the tests - you need to know the material. The first paper was 3 pages, the second 4 pages, and the third paper was 5 pages. Also, class attendance/participation factored into our grade. We watched a movie a week. He also used every x-hour. The only negative thing I have to say is that the tests and papers were graded a bit harshly - Professor Ruoff has specific answers in mind. If you don't answer according to his specific answers, you will definitely lose points. I felt he graded a bit too harshly. On the other hand, Ruoff is very knowledgeable about film and film history. He was always available for office hours. A lot of the class didn't take advantage of them, but they were very helpful. Overall, this is a good class and you will learn a lot, plus you get to watch a lot of interesting films. However, the class required more time than you would expect.\"",
            "review 2: \"09F with Jeffrey Ruoff: Professor Ruoff is a really nice guy and, if you're at all interested in film, this is a really easy class that's still worthwhile to take. You learn a lot and get to watch some great movies.\"",
            "review 3: \"05X with Jeffrey Ruoff: Honestly, Film 1 kept me sane. Ruoff is a great prof, and the course is definitely interesting. I felt that the readings and the in-class portions had nothing to do with each other, and the tests kind of leaned towards the readings, but it was fine for the most part. Although Ruoff grades hard on the papers and stuff, he gives extremely generous final grades. This will definitely boost your GPA. And it's fun to boot! Besides, if you know next to nothing about film, this is a great introduction. The Film Art book is an even better guide - you learn most of the big names and movements. Nothing makes you look more like a suave intellectual than a knowledge about Film. Take this course!\"",
            "review 4: \"05X with Jeffrey Ruoff: The readings and discussions of the films seemed almost disconnected. This made exams a bit tough, but he was a pretty easy grader. It was a bit more technical than I was expecting because we studied the details of making films and all the terms for different shots and people in the film business, etc. Ruoff is a really nice guy though, really approachable and you can tell he loves films. I would have preferred more discussion about the films themselves as opposed to the technical details but if you like this stuff, this is your course.\""
        ],
        "Paul Young": [
            "review 1: \"22F with Paul Young: Definitely a layup, definitely boring. I'm an aspiring CS-Film double major, and this class was honestly frustrating because I feel like there was so much I could have learned that I was simply not taught. The readings are long, but you only really need to note down the bolded terms in order to do well in this class. The class structure was: Mon - discuss reading, Wed - discuss film, Fri - weekly quiz covering the reading and the film and continue discussing the film. Despite the fact that there were 50 or so people in this class, the Prof insisted that the class should be discussion-based. As a result, we always got behind and often only discussed the week's film in the last 5 mins of class. Moreover, I didn't actually learn any real interpretations of the films besides the bits and pieces from students who didn't know what he was talking about. This class was such a layup that the Prof canceled the midterm (he'll say it was so that he can \"spend more time teaching,\" but I sensed it was because we didn't learn enough to fill an entire midterm exam.\""
        ]
    }
}