{
    "GRK030.09": {
        "Hakan Tell": []
    },
    "GRK030.08": {
        "Timothy Pulju": []
    },
    "GRK030.07": {
        "Lindsay Whaley": []
    },
    "GRK030.06": {
        "Roberta Stewart": []
    },
    "GRK030.05": {
        "Margaret Graver": [],
        "Neeltje Kuin": []
    },
    "GRK003.01": {
        "Michael Lurie": []
    },
    "GRK003.02": {
        "Hakan Tell": [],
        "Lindsay Whaley": [],
        "Timothy Pulju": []
    },
    "GRK087": {
        "Hakan Tell": [],
        "Lindsay Whaley": [],
        "Margaret Graver": [],
        "Paul Christesen": []
    },
    "GRK085": {
        "Hakan Tell": [],
        "Lindsay Whaley": [],
        "Margaret Graver": [],
        "Paul Christesen": []
    },
    "GRK029": {
        "Lindsay J.": [
            "review 1: \"02S with Lindsay J.: I strongly recommend Greek 29 to all interested in this beautiful language, regardless of how far you might be from your Greek 10 prerequisite in terms of time. Professor Whaley is great at inspiring thoughtful discussion and it is hard to estimate how much I have learned from him. New Testament Greek is not as hard as Homeric Greek, so relax. However, don't expect to rest on your laurels - koine can also be mysterious, and you will also be asked to write some papers, which will give you a wonderful chance to beome expert in constructing textual chiasms and much more.\"",
            "review 2: \"02S with Lindsay J.: Greek 29 was a treat to participate in. The course material was interesting, all of the students (about 8 of us) were engaged and engaging. Professor Whaley is an excellent prof.\""
        ],
        "Lindsay Whaley": [
            "review 1: \"23S with Lindsay Whaley: This is a great class. You dive super deep into each text (this term we read Mark, Galatians, 1 Peter), examining things at an almost verse by verse level. The three essays are all really interesting to write and make you consider things you probably haven't thought about before even if you're pretty familiar with the NT. There is also a translation project (which was probably my favorite assignment I've done at Dartmouth) where you pick a short chunk of verses from anywhere in the NT and write your own translation with a commentary defending your decisions, which can be super fun if you pick a passage whose translation has historically been controversial. There's also a film review, which I kind of disliked, but it's easy. For the final paper, you basically can write about anything related to the NT / early Christianity, which can be fun if you pick something cool. When it comes to these written assignments, Whaley seems to appreciate comprehensiveness so make sure to cover all the bases you can when writing about a passage rather than only focusing on a few examples, and don't be afraid to exceed the word limit. As far as upper level language classes go, Biblical Koine is probably the easiest dialect/genre you will read here, especially if you've read any of the NT in English before - heck, I took this class at the same time as Greek 3 and found everything readable. Would definitely recommend taking this class - would be a shame to leave without doing so.\""
        ]
    },
    "GRK028": {
        "Margaret Graver": [
            "review 1: \"09F with Margaret Graver: This class, like pretty much any other course Graver teaches, is all about philosophy. If you love philosophy, this course is designed for you. If you can't stand philosophy, either take Homer instead or suck this up the best you can. The Greek itself in 'The Republic' is not horrendous, but the philosophical content makes it much more difficult to really understand. Graver is accommodating and available outside of class as always, although she seems to have become a harder grader over the years-particularly with essays and in-class participation, as she basically docked us points if we came to class with errors in our translations. If you put a lot of work into this class, you'll do well, just be prepared for lots of hours with Greek philosophy that will at times have you cringing.\"",
            "review 2: \"09F with Margaret Graver: Nice balance between Greek and content.\"",
            "review 3: \"07F with Margaret Graver: Professor Graver did an awesome job inspiring students to think seriously about the greater philosophical dilemmas in Plato's Symposium. I was encouraged to see that there are still classes at Dartmouth where you can think and ask questions about important life questions. That said, the workload was brutal, and it made my senior fall one of the toughest times I've had at Dartmouth yet. It's both quantity and quality of work that are demanding. Professor Graver is extremely helpful and available at even the most absurd hours.\""
        ],
        "Christine Thomas": [
            "review 1: \"02W with Christine Thomas: Greek courses and philosophy courses (of which this is a smart combination) both tend to have good, comfortable, and motivated atmospheres -- pretty much everyone in them has interest and background in the topic. This course, because we translated lots of greek every day, didn't allow so much time for going so deeply into the philosophical material, but we always got to note the major issues, much of which would never become obvious when reading the material in translation or on one's own. Prof. Thomas has a good sense of humor, realizes the oddness of the study, but has some of the most genuine interest in the topic.\""
        ],
        "Hakan Tell": []
    },
    "GRK026": {
        "Paul Christesen": [
            "review 1: \"04F with Paul Christesen: This course is a ton of work, much more than any other course I have taken at Dartmouth. Professor Christesen demands a lot from his students, gives daily quizzes on the translation assignments and readings, and holds every x-hour. Still, I learned a ton in this course. The hard work that I put in definitely paid off. Professor Christesen is also an amazing professor. He cares deeply about teaching and makes the class very dynamic and interactive. If you are willing to put in the effort, you can get a lot out of the class.\"",
            "review 2: \"04F with Paul Christesen: The course was a lot of work, and there was a quiz every day. But the classroom environment was extremely easy-going, and the professor was always energetic and excited to be there. If you get a chance, I definitely recommend taking this course or a course with this professor. But be prepared to work!!!\"",
            "review 3: \"04F with Paul Christesen: This class was extremely difficult. Christesen sets an almost impossible pace, and races through the material. He is, however, an excellent professor, and I looked forward to this class each day. He was extremely helpful in office hours (even if they were held at inordinately late times), and in general a kind and helpful man. My Greek improved greatly throughout this course. Christesen really focuses on the grammar aspect. Herodotus is dull; as Christesen says, his goal is not really to have the students read Herodotus, but to get the students to the point where they can read Greek outside of class whenever they'd like. I think this class really accomplished this goal.\""
        ],
        "Tarik Wareh": [
            "review 1: \"04S with Tarik Wareh: Thucydides is a very difficult author to read in the original Greek. But Professor Wareh assisted us in tackling the difficult Greek and inspired much curiosity in the process. The prof is so knowledgeable, it's unfortunate that he was only here for a year. I definitely recommend reading the historians (Thucydides and Herodotus) because of the part their writings play our understanding of Greek history.\""
        ],
        "Afroditi Manthati-Angelopoulou": [],
        "Bryce Walker": [],
        "Michael Lurie": []
    },
    "GRK024": {
        "Michael Lurie": [],
        "Simone Oppen": []
    },
    "GRK022": {
        "Hakan Tell": [
            "review 1: \"07W with Hakan Tell: One of my favourite classes at Dartmouth! Tell is the best (as always) and it was a really interesting class. We just read tons of ancient greek lyric poetry & the exams were based solely on translations that we had done together--no grammar, no vocab, no site translations. He also made the presentation non-graded and there was just the one paper (on any topic). X-hours were used every week for discussions about the material and for student presentations--none of which was required for the exams. He's very fair & takes the emphasis off grades. This is my 3rd class with him. He has a facebook fan club, too.\""
        ],
        "Margaret Williamson": [
            "review 1: \"03S with Margaret Williamson: Lyric Greek is a very tricky area of Greek. Most of the readings are fragmentary and in dialect. I took this class after taking Iliad the previous fall and high school Greek. It's very different, and very difficult. That said, the poetry is beautiful and you get a good look at a period that is often glossed over: the generations between Homer and the golden age of Athens.\""
        ]
    },
    "GRK020": {
        "Hakan Tell": [
            "review 1: \"20F with Hakan Tell: Prof. Tell is an amazing prof! If you are interested in the Iliad definitely take this course! It is a lot of work though, so be prepared for that.\"",
            "review 2: \"08W with Hakan Tell: This course was a great introduction to Homer, and by the end of 10 weeks you'll be amazed at how much you've improved at reading Homeric Greek. However, I can say that this was the most difficult course I have taken at Dartmouth. The workload wasn't completely unreasonable throughout the term, but if you want to do well on the midterm and final you will have to put in a lot of extra hours reviewing the Greek. Professor Tell is great and wants to help you learn the material, but the actual material is quite difficult and will require a signifcant amount of work.\"",
            "review 3: \"06S with Hakan Tell: Homer is not easy. Most of what you thought you knew about Greek vocab and forms gets thrown out the window within the first few days. The translation and the other readings are generally interesting, though. Prof. Tell does a good job balancing translation and outside readings. We did translation 3 days a week and read a paper for x-hour. Everyone in the class had to do a presentation during an x-hour, and write a final paper.\"",
            "review 4: \"06S with Hakan Tell: homer's iliad is an amazing piece of literature, so when studying it, you can't help but enjoy yourself. professor tell is da bomb. he goes out of his way to be available, is super enthusiastic, and runs the class efficiently. he's very responsive to feedback, so it's easy to address anything that isn't working. i'm not sure about the effectiveness of the presentations we had to give, and the readings were informative but long. still, would definitely recommend taking this class.\""
        ],
        "William C.": [
            "review 1: \"02F with William C.: It's an awesome class. Greek is very cool, and Homer is the peak of Greek coolness. Of course, a class like this is very much made by the professor. He rocked this term, but he retires, so reader of review, check something else by next year's prof.\"",
            "review 2: \"01F with William C.: I would like to recommend this course to anyone who is patient enough to survive two first weeks of breakdowns over the Homeric language. I can't deny that at some point I was considering dropping this course, even though professor Scott handed out vocab lists to help us with our work and make it go quicker. Yet, my perseverance paid off; later on, we started moving on with less effort and even were able to focus more on the interpretative part. We went deep into the Odyssey and instead of telling a story, we tried to analyze motives and goals of the characters. Professor Scott is absolutely crazy about Homer and it's contagious. I think that it was the most rewarding course I have taken, even though I am still a bit scared of Homer himself... It should stay this way, for he deserves to be looked at with awe. Take this course if you like torturing yourself and struggling a little to feel stronger in the end. As a matter of fact,I love it.\"",
            "review 3: \"01F with William C.: I rate this course as one of the best 3 that I have taken at Dartmouth (I am an '02). I rate professor Scott as one of the best 3 professors from whom I've taken courses. The course far surpassed my expectations and was very interesting from many perspectives - from the perspective of the Odyssey as literature; of the Odyssey as history; of the Odyssey as language and structure; of the Odyssey as an ancient Greek text. Professor Scott allows for the student to pursue his own interests in the term paper, and thus the course has the potential, depending on the student, to be interdisciplinary to a degree. Professor Scott is readily available to meet with students and discuss topics of interest. Next Fall (2002): Homer's Iliad - last chance to take a course from Professor Scott.\""
        ],
        "Afroditi Manthati-Angelopoulou": []
    },
    "GRK011": {
        "Irene Kacandes": [
            "review 1: \"07W with Irene Kacandes: At the beginning of the course, Prof. Kacandes explained that the book wasn't great, but that it's good because it's long, so if we want to continue in Greek, we can. That was the downfall of the entire course. The book was terrible, and she had to photocopy bits of other texts which were obviously better, just from seeing those little bits. A much better way of doing this would be to get a book that will help us learn, and if we want to continue in Greek, we can get another book. Now I don't want to continue because this book was so terrible and my command of Greek is so weak because of it. So if they're still using \"Greek Today,\" you may want to think twice.\"",
            "review 2: \"05W with Irene Kacandes: This course is basically Rassias 1-3 for most other languages in terms of all the grammatical structures we covered - I feel like we covered an insane amount of material in a very short time. It honestly took an hour or two each day just to keep it all together. While this is really cool, at the same time it means that I expect my retention rate to be a bit lower than I'd like. Also, we focused a lot more on grammar and grammatical structures than on vocabulary. Overall a really good class - if you're willing to spend some time after the class re-learning what you didn't have time to cover, you get an awful lot of learning in a very short period of time.\"",
            "review 3: \"05W with Irene Kacandes: Modern Greek is a tough language to learn, but professor Kacandes makes it interesting and relatively easy to learn. The textbook is a little weird, but you always have a good idea about what will be on the quizzes and the exams (midterm and a final). She is also happy to meet outside of class and go over anything you do not understand. There is also a drill for the class, but its not too bad. If you want to have a basic understanding of Greek, take this class and understand that you will have to put in a little bit for it.\""
        ]
    },
    "GRK010": {
        "Samuel Findley": [
            "review 1: \"05S with Samuel Findley: Findley was visiting, so this class will never be offered again. He was none too inspiring and given to esoteric digressions on linguistic topics. It seems this class is always given to an erratic visitor.\"",
            "review 2: \"05S with Samuel Findley: Prof. Findley is not coming back next year.\""
        ],
        "Hakan Tell": [
            "review 1: \"05F with Hakan Tell: From the Grk 10 perspective, it certainly takes extra application to get yourself up to speed in translation and a fair amount of work outside of class on grammar. Must be rather self-motivated in this respect. Not a class to take as a fourth... Nevertheless highly recommended.\""
        ],
        "Margaret Graver": [
            "review 1: \"07F with Margaret Graver: This class was taught concurrently with Greek 28, which made it substantially harder for the students enrolled in Greek 10. Prof. Graver did a good job of trying to cater to each individual student's needs by having everyone submit a porfolio at the end and allowing everyone to pick and choose what assignments and quizzes they did. The Symposium is not the hardest Greek out there, but Greek 10 is a big step from Greek 3, so be prepared to do a lot of work. Your Greek will definitely improve with this class, but you will have to put a lot of effort in to make the transition.\""
        ],
        "Margaret Williamson": [
            "review 1: \"08S with Margaret Williamson: Prof. Williamson provided a lot less guidance in class that I was used to, but that really forced me to learn to put translations together on my own. She was extremely helpful in office hours - I wish I'd discovered that sooner in the term than I did. The quizzes were pretty tricky, and required learning a lot of verb forms in short periods of time. I wish we'd done more grammar review in class, but if you take the time to go over things on your own you should be fine. Certainly not the best grade I've received in Greek classes, but I definitely think I learned the most in this one.\""
        ],
        "Mary J.": [
            "review 1: \"06S with Mary J.: Mary Wilson is fantastic! Friendly, approachable, extremely knowledgeable, loves to inspire discussions amongst the students, and just generally a great prof.\""
        ],
        "Afroditi Manthati-Angelopoulou": [],
        "Bryce Walker": [],
        "Lindsay Whaley": [],
        "Michael Lurie": []
    },
    "GRK003": {
        "Antonia Syson": [
            "review 1: \"08W with Antonia Syson: Not as fast paced as Greek 1 (which seemed ridiculously fast-paced to me), so it gives you a chance to consolidate the stuff you are supposed to know. That being said, there is still a lot of new grammar in Greek 3.\"",
            "review 2: \"08W with Antonia Syson: I love Prof. Syson. She is so bubbly and fun in the mornings that it was almost (almost!) fun to get up for class. The class was really small (I can't imagine there are many people wanting to take Intermediate Greek) which really helped with the learning process. I think I (and all of us) really improved this term. All in all, a great class and professor.\"",
            "review 3: \"08W with Antonia Syson: No worries if you have Greek with Syson - do a little memorization and some thorough translations and you'll be fine. This course is run almost exactly like GRK 1, but this time the homeworks are optional.\"",
            "review 4: \"08W with Antonia Syson: It definitely would have helped if we had spent more time on grammar in class - most of it was learned through homework, and the sentences assigned weren't all that useful. However, we spend a ton of time on reading and translation in class, which taught me much more than just focusing on grammar could have.\""
        ],
        "Edward Bradley": [
            "review 1: \"05W with Edward Bradley: Greek 3 is Greek 3. Lots of forms and memorization and deadly dull exercises Professor Bradley is overbearing, if nothing else. He talks constantly in class. even when his students are talking. his means that you can get away with not knowing things too terribly well because he will sort of take over your stumbling misadventures in Greek. He will also force his opinions down your throat in office hours. However, if you can get him to talk about things that are not Greek, he is fabulously interesting. Just get him started on Peter Abelard, I tell you. These are the prerogatives of one who has been on staff for the last 42 years, I gather.\"",
            "review 2: \"05W with Edward Bradley: While Greek is definately harder than latin, or almost any other language, professor Bradley is really enthusaistic, and the class is pretty small (7 people) so you can't slip thru the cracks. Also, Professor Bradley sometimes takes a day of from teaching and just talks about random stuff. It is necessary to always be prepared and not to miss class, as the final is on translation done in class.\"",
            "review 3: \"05W with Edward Bradley: This shouldn't be taken as an insult, but it's like Prof. Bradley is truly a relic from another time! The wealth of knowledge and information in this man is amazing, and while you will certainly enhance and truly refine your Greek skills, his tangents will provide you with just some of the neatest tidbits about languages in general. He's probably been here for about 50 yrs or so, and I don't know how much longer it is before he retires; but please take at least one class with him. He has a good sense of humor and is definitely not dry, and he will make sure you are confident in the grammar skills he wants you to know and will test you fairly.\""
        ],
        "Hakan Tell": [
            "review 1: \"08S with Hakan Tell: This was one of the classes I've had to work the hardest for in two years here. At least 2hrs of HW a night, unless you have a natural knack for Greek. The fact is, is that there is just a ton of material to learn. There is no way around that fact, and it's not any fault of the prof that there was so much work--there had to be. So if you take this class, be prepared to work. Professor Tell is great. He's really nice, and if you attend every class, which you probably should anyway, that will count for a lot of your grade. Professor Tell let us take the final early so we could start reading original Greek so GRK 10 wouldn't be so hard, which was a great idea. I'd recommend taking GRK 3 if you want to go on to 10. For just a language requirement, it's difficult and time consuming, and you'd be better off in something with a drill that covers less material. But if you're a major, try to take this class with Tell, because he's really great. Just be ready to work alot.\"",
            "review 2: \"07S with Hakan Tell: I mean, if you like Greek you'll like the class, and if you don't you won't. If you're taking this you've already taken Greek 1. It's pretty much the same thing. Professor Tell doesn't teach so much as answer questions and reinforce a few things; you teach yourself most things at home. But it's not complicated, it's mostly forms. Just a lot of memorization.\"",
            "review 3: \"07S with Hakan Tell: This course was the transition between Greek 1 and upper-level Greek literature. The first half of the course was the same format as Greek 1, and towards the end it was more reading-oriented. Professor Tell is great and really cares about his students. It was a lot of work doing the exercises and translations, in addition to having class everyday, but overall it really wasn't that bad in the long run, and your work will be amply rewarded.\""
        ],
        "Katherine Kretler": [
            "review 1: \"09S with Katherine Kretler: I am a recent convert to the classics, having had such a wonderful and enriching experience learning Greek under Professor Kretler and other professors in the Classics department (but especially Prof. Kretler!).\""
        ],
        "Kevin G.": [
            "review 1: \"03W with Kevin G.: Intensive Greek was all a philhellene could dream of! Most students thought it was too fast-paced and actually turned them away from continuing with Greek, so it's probably not the best course to take if you're not interested in continuing with Greek. On the other hand, it satisfies the language requirement in a single term, with no drill. The fast-paced nature of this course can either inspire you to continue studying Greek (as it did me) or to dissuade you altogether.\""
        ],
        "Lindsay J.": [
            "review 1: \"06W with Lindsay J.: this is just the next step from greek 1. not harder, just more of the same.\""
        ],
        "Afroditi Manthati-Angelopoulou": [],
        "Jennifer Lynn": [],
        "Lindsay Whaley": [],
        "Michael Lurie": []
    },
    "GRK001.02": {
        "Hakan Tell": [
            "review 1: \"23S with Hakan Tell: This class is not for the faint of heart. You can't fall behind and with such a small class size and an almost entirely cold-call teaching style, it shows if you do. Each day you meet twice, except for Thursdays which is just a morning block, and the morning is used for the daily quiz, yes there is one every day, and the afternoon is used to cover a new chapter. The grind never stops in this class. You truly eat, speak, and breathe ancient Greek for ten weeks straight. However, what the class takes from you it gives back every bit and more in one of the best learning experiences at Dartmouth. When Tell says he will take you from nothing to Plato in 10 weeks, he means it. In regards to Professor Tell, no one else can or should teach this class other than him. He is an amazing, kind, and attentive professor who wants nothing for you but the best, and that you learn Greek. Know that he will challenge you, but he is also a fairly lenient grader on the quizzes and is always available for help. I wouldn't recommend taking this class alongside 2 others but it is possible. This class is a once-in-a-lifetime experience, to say the least, but it is up to you whether it is a good or a bad one.\"",
            "review 2: \"22S with Hakan Tell: I have friends in orgo who worked less than I did just to barely keep up in this class. Full stop. That being said, intensive greek is pretty remarkable. To go from not even knowing the alphabet to strong proficiency in the language and decent translating in ten weeks is insane. Don't think this class is a shortcut though. It meets every day of the week in the 9L and then four days a week sometime in the afternoon. Quiz every morning (yes every one). Expect to spend a massive amount of time on daily homework and review just to try and keep up. Class is basically all cold calling and skip it at your own peril. Tell is the only professor who could possibly teach this course. His energy and passion for the subject and the care he has for his students is second to none that I've encountered at this school. He is kind, exceptionally generous with his time and patience, and fair in his grading. However, his expectations for you as a student are massive and this class demands a workload that I haven't encountered academically or professionally before and likely won't encounter again. There are no tricks in this class: he'll tell you exactly what is going to be on the quizzes, midterm, and final, but you'd better pray you can manage to cram all of it into your head. I've never studied more for anything in my life than I did for the final and I still couldn't remember some forms. I think it goes without saying but obviously don't do this class just to get your language requirement done in one term, it's not worth it. Also, don't take two other classes in addition to this one thinking it will only be as much work as one class, it's at least three classes of work in itself. However, if you're good with languages, have a strong classics background, or are just fucking crazy, you won't find a more rewarding class at Dartmouth. ἴθι εὐτυχής!\"",
            "review 3: \"22S with Hakan Tell: Extremely hard yet extremely rewarding class. I have not yet seen a better professor than Tell. He goes over and above.\"",
            "review 4: \"20S with Hakan Tell: This class will kick your ass, but it is one of the most rewarding intellectual experiences I have had at Dartmouth. To go from not understanding the alphabet to being able to read Plato in the original language in 10 weeks is an insanely unique experience. Tell is a world expert in Ancient Greek Grammar and will make sure you can become one too. He will stay for an hour every day after class to review the homework with you and make himself available at almost any time for impromptu office hours -- which you will want to avail yourself of. Study every day and for the love of god do not fall behind. If you complete the class too, it will be my pleasure to meet you on the plains of Elysium.\""
        ],
        "Lindsay Whaley": [],
        "Timothy Pulju": []
    },
    "GRK001": {
        "Antonia Syson": [
            "review 1: \"07F with Antonia Syson: This class is ridiculously fast-paced, but not all that difficult as long as you stay on top of things. At times, it can be hard to keep up with everything, and nearly impossible to retain everything, just because it moves so quickly. Although the class is a 9, Antonia Syson somehow manages to keep her energy level high with her embarrassing (yet somehow inspiring) acting out of in-class reading exercises.\"",
            "review 2: \"07F with Antonia Syson: Prof. Syson is a bright and cheerful lady (even remarkably so while acting out Greek at 8:45 AM), but her class becomes monotonous and tedious at times. The homework consists of ten Greek to English and five English to Greek sentences due four times a week plus memorization for frequent quizzes. This isn't so bad when you are only supposed to know twenty words and one verb tense, but the class progresses so quickly that there's little to no time to reinforce old concepts before taking on the new. The format is the same--using the textbook for homework and quiz prep and using a different reader in handouts in class--basically every day. Also, as in most beginning language classes, every single x-hour was used. Prof. Syson introduced what was in the text for maybe ten minutes each class period, and the majority of the time was spent reading as a group. A lot was left to personal learning from the text, and the workload to keep your head above water is a bit much at times. However, the quizzes usually mimic the homework exactly, and it's not hard to do well on them. After dropping three and only having to take a 15% final (which was a relief during finals week), in the end the quizzes don't look that bad even if they are a lot of work during the term.\"",
            "review 3: \"07F with Antonia Syson: I really liked Prof Syson. While we were all half-dead at 8:30 in the morning, she was bouncing around acting out the Greek and really getting us into it. I loved the in-class readings that we did; I feel like they really consolidated my knowledge of Greek. And as annoying and embarrassing it was to read the Greek aloud, I feel like that also helped me to feel comfortable with the language. If you've got to learn ancient Greek, this class is the way to do it.\"",
            "review 4: \"07F with Antonia Syson: Syson is a load of fun and a great intro professor. Having never taken Latin I was a little more lost than many of the other kids in the class, but the prof made it easy to understand the material. No midterms and an extremely easy final, but a lot of quizzes that make attending class regularly a must. Overall though, Syson is very understanding and flexible about abscences. Work-wise there is little homework but to get a good grade a lot of memorization of vocab and verb tenses are required. Interesting for a term if you just want to try it out, but I wouldn't necessarily recommend it to those not interested in being Classics majors.\"",
            "review 5: \"07F with Antonia Syson: Professor Syson is wonderful - always energetic, and extremely helpful outside of class. She doesn't always spend enough time in class going over the grammar we're supposed to learn that day, but she was always willing to explain stuff in greater detail during office hours. You really need to spend time studying - just doing the homework is not enough to learn the material. There were 10-15 sentences to translate for each class, and it was really tempting to rely on the vocab lists and verb charts in the book. This approach won't prepare you for the quizzes, though. We spent a lot of time doing readings / translations in class. These were helpful for learning what concepts we should worry about the most, and it was encouraging to be able to read Greek so early on in the class.\"",
            "review 6: \"07F with Antonia Syson: Professor Syson is great! She's engaging even at 8:45 and makes Greek mildly interesting. There's daily homework for this class which you really should do, even though it doesn't count for your final grade. Quizzes twice a week and a final at the end. Since Greek is done in two terms, the pace is very fast, and you're expected to learn your grammar very well. It's worthwhile to learn all the vocab when it's assigned so you don't get stuck learning several hundred words at the end of the term.\"",
            "review 7: \"06F with Antonia Syson: I pretty much picked Greek at random; wanted to try something new. Its a difficult language, but there was something fun about memorizing declension after declension and verb form after verb form. Know what you're getting into. Its a lot of work and don't do it if you don't have an hour or two a day. If you're in it to get rid of the language requirement quick, take Latin. Also, 9 can feel really early. Prof. Syson is very very animated in class. She's a nice person, and she has a cool British accent. We do this thing where she goes around making each person translate a sentence of a reading. It's fine if you're good, but if you're unsure it can really suck. She makes it rather clear how she thinks you fit into the rest of the class in terms of ability and preparation. She might be trying to be nice to people who enjoy the translations less, but it can be pretty demeaning. The grading isn't bad. 17 quizzes - 2 a week - worth 75 percent, and 1 exam. You get to drop the 3 worst quizzes, and if you miss one it counts as a drop. She tells you what's on the quizzes in advance, so you know what to study.\""
        ],
        "Lindsay J.": [
            "review 1: \"05F with Lindsay J.: Most intense class I have ever taken at Dartmouth. I spend 2-3 hours of homework/studying every night minimum, 5-6 at the beginning. If you can make it past the first half of the course the second half is much better! Prof Whaley is an awesome prof, he knows the material is hard and the pace is fast but still challenges the students to press on and we learned an incredible amount in 10 weeks because of it. Bottom line: You better WANT to learn Greek, you better have the time to study it, and to keep your sanity you must have a sense of humor when receiving your quiz scores.\"",
            "review 2: \"04F with Lindsay J.: ...which means tons of memorization. The pace of the course is a bit fast, as you whip through new tenses/voices/long paradigms without stopping to catch your breath. Other than that, it's Greek one. Beware of chasing horses off the road into the countryside! (And other such oddities)\"",
            "review 3: \"04F with Lindsay J.: Greek 1 was very hard. At times, it was very frustrating. But Prof. Whaley was awesome. He's a really nice, helpful, friendly guy who made the class enjoyable. The class was paced quickly and there's a lot to learn, but it was also a small class with a good prof.\"",
            "review 4: \"04F with Lindsay J.: Word to the wise: don't get behind. There's no time to catch up.\"",
            "review 5: \"04F with Lindsay J.: This class is definitely a lot more work than your average class. If you've never studied a language like Latin or Greek before, the first half of the class will be a lot of work just getting the concepts down. The entire class is very fast-paced, and you should expect to spend significant amounts of time every day studying and doing your homework to keep up. With that said, it is a great introduction to Greek, and you come out of it with a firm grasp on the essentials of the language. Professor Whaley is an excellent instructor who keeps very good track of where each student is in the class and making sure they are following. In summary, don't take this class if you're looking for an easy way to fill your language requirement, but if you really want to learn Greek, this is an excellent class, but a lot of work.\"",
            "review 6: \"04F with Lindsay J.: Always remember that there is a pretty brisk pace to this course, and missing a class most definitely means missing a lesson. If you are interested, it's definitely helpful if you are quite familiar with the differences between the verb tenses and general cases. Prof. Whaley is a great resourse with an obviously impeccable memory, but you need to know that you need to invest a good amount of time into memorization and review. The class is somewhat laid back, but always come prepared.\""
        ],
        "Hakan Tell": [
            "review 1: \"07W with Hakan Tell: If you need to satisfy the language requirement, Greek is great because there is no drill and you only need two terms of it. However, the material is very fast-paced and you really need to stay up with the homework in order to do well in the long term. The regular quizzes weren't overly difficult, but you definitely need to put a good amount of work in for this class. Professor Tell is great and makes the subject totally worth learning. He really loves to teach and read Greek and is a good resource. Even if you're unsure about this class, take it with him because he really cares about each student doing well.\"",
            "review 2: \"07W with Hakan Tell: Greek 1 was a very intense class...we learned about 2/3 of Greek grammar in one quarter. But Professor Tell was a great professor and tried his best to be available outside of class for those students that needed extra help on a particular lesson. If you need an easy class, I would not recommend Greek 1. Take it because Greek is interesting!\"",
            "review 3: \"07W with Hakan Tell: The course isn't as bad as it's made out to be, but expect to do plenty of work outside of class. Professor Tell is one of the nicest profs at Dartmouth.\"",
            "review 4: \"05W with Hakan Tell: i feel like i got a lot out of this class with minimal stress and workload. professor tell was awesome and made the class very interesting.\"",
            "review 5: \"05W with Hakan Tell: This was a fantastic course! Professor Tell was great. I would definitely recommend this class to anyone, especially Classics majors who need Grk or Lat 3 as a prereq. Advice, however: if you take this class, treat it as 2 courses. Take only ONE other course, not two.\""
        ],
        "Jennifer Lynn": [
            "review 1: \"21W with Jennifer Lynn: Professor Lynn is the best introductory language professor in the classics department, full stop. Greek is hard, make no mistakes about that, but Professor Lynn wants students to succeed and leads classes very effectively in the zoom era. Biggest piece of advice for this class: go to Helpdesk. Guaranteed A on the homework, and your greek will be better because of it.\"",
            "review 2: \"21W with Jennifer Lynn: This class is very, very work-intensive. You learn all the material outside of class via recorded lectures, and then in-class time is small-group work on assignments. Professor Lynn does a great job of making a very difficult class as enjoyable as it can be, and is all-around a great and approachable professor. There's a lot to be gained from this class if you're passionate about Classics and language, but I recommend that you take it during a term which is otherwise pretty easy for you, since this class meets 4 times a week and gives out 3-5 hours of work every night. I would also recommend that you take it after taking Latin, since Latin provides a much easier introduction to many of the complex linguistic systems of Greek.\"",
            "review 3: \"21W with Jennifer Lynn: I've spent at least 10 hours per week doing just homework for the classes. If you count memorization of different verbs and nouns forms it will add extra 5 hours. It starts easy but after the week 2 you will feel like the load is piling up. I took CS1 and GOV class in the same term. I have spent majority of my free time doing Greek. Dare to take it.\""
        ],
        "Florencia Foxley": [
            "review 1: \"23W with Florencia Foxley: Foxley is a pretty good teacher. Greek can be tough though, and even though this isn't Intensive and we stopped earlier in the textbook than she had planned, this class covers a solid amount of content at a quick pace, so be prepared to memorize a lot. But if you like learning languages, it can actually be pretty cool, and if you stick with it, you will learn a lot.\"",
            "review 2: \"23W with Florencia Foxley: This class was awesome. It was super small and filled with people who were there because they were ready to do the work. Professor Foxley is great; she really really cares about each of her students doing well and gives extra attention and opportunities to make up points to students who are struggling. We had a mini quiz every day, a larger quiz about once a week, three exams that would replace the larger quiz for that week, and a final. We also had nightly homeworks. This class is a ton of work and will take up a lot of your time and energy. If you put in the work, you will do well, but if you get behind it will be very difficult to catch up. Because it's accelerated, it moves very quickly. We learned hundreds of vocabulary words and much of the basic structure of the language in only one term. Words in ancient greek change a lot from endings and augments, and frequently become hard to recognize because of this. If you are going to take this class, it should be your hard class for the term. Do not take this class when you're going to be splitting your time between it and a very difficult stem class for example. Do the work, go to office hours, utilize greek help desk, and study with other people. Make a study guide that you add to every day with all new words and forms, and you will be fine. Don't expect this class to be a layup, and recognized that accelerated means accelerated. Take this class - it's great.\""
        ],
        "Katherine Kretler": [
            "review 1: \"08F with Katherine Kretler: This is one of the best language classes I've taken in Dartmouth. Professor Kretler is very didactive and energetic! Furthermore, she is also strict. For example, she insists that the student should pronounce Greek with the correct sounds and accents reconstructed linguistically rather than simply let the student go along with the \"American pronunciation\". She also insists that students should read Greek aloud, and one of the task of the term is to recite a piece of poem aloud in front of the entire class. And wonderfully, all students read Greeks just the way Homer himself did! (She made sound tracks for us to imitate though) Generally, Greek is much harder than Latin. (My friend agrees with me, and we both got \"A\"s). The verbal forms grow \"exponentially\", yes literally, 2, 4, 8, 16... And the contracted verbs... The Greeks simply made so many exceptions in there language! You must really put tons of works in order to get a ideal grade for your quizzes. There are quizzed for almost every week, but not everyday though. You are expected to DO your home works! (never lag behind!, the textbook's title is INTENSIVE GREEK, and it means it) The mid-term is a fairly easy one, yet the final would be much harder. But, have fun if you are really devoted to it. After all, that's the only way to get ideal grades. Take it with Kretler! She really makes a differnce!\""
        ],
        "Sarah Mccallum": [
            "review 1: \"16F with Sarah Mccallum: The workload is a lot and there's a lot of memorization. However, if you have a good memory and really love language, this is for you. Prof. McCallum is probably the sweetest woman to ever exist; she'll do everything in her power to help you along.\""
        ],
        "Afroditi Manthati-Angelopoulou": [],
        "Lindsay Whaley": [],
        "Michael Lurie": [],
        "Sarah McCallum": []
    }
}