{
    "HUM003.07": {
        "Antonio Gomez": [],
        "Klaus Mladek": []
    },
    "HUM003.06": {
        "Susannah Heschel": [],
        "Tarek El-Ariss": []
    },
    "HUM003.05": {
        "Nicolay Ostrau": [],
        "Petra McGillen": []
    },
    "HUM004.01": {
        "Klaus Milich": []
    },
    "HUM004.02": {
        "Randall Balmer": [
            "review 1: \"22X with Randall Balmer: A highlight of my summer term. Balmer is a great lecturer and a fun-loving prof. He's clearly passionate about what he teaches, and weaves his own expertise (religion, evangelical history) into the lectures. Quizzes and discussion posts (weekly) and the two major papers of the term (one book review, one film review) were all manageable and interesting. Reading and writing for this class hardly felt like a burden because it was all so reasonable and well-curated. I learned a ton about the Sixties — Balmer focuses a lot on music, which none of my previous History professors had — and will definitely remember this course as a gem at Dartmouth.\"",
            "review 2: \"22X with Randall Balmer: One of the most interesting and fun classes I have taken. It is a lecture class where each week covers a different year or two from the sixties. You get to learn about the culture and history surrounding the era. My favorite part was listening to the top songs of each year at the end of lectures. Grading is based on 8 quizzes (96 points total), 8 discussion posts (80 points total), the book review (read a book and write 5-7 pages on it) (90 points), and the pop culture review (watch a movie and write 3-5 pages) (40 points). Just come to class and take good notes and you will be fine on the quizzes as they are open note and taken on Canvas. For the papers, just make sure you include references to some of the readings and lecture materials from the class. I lost a couple of points for not doing that but you'll get an \"A\" either way. Overall, it is a great class to take over the summer.\"",
            "review 3: \"22X with Randall Balmer: If I could recommend one class to take at Dartmouth it would be this one! Professor Balmer is not only a great lecturer but also just such a sweet person; I have such a hard time waking up in the morning but I dragged myself out of bed every single Tuesday and Thursday because I genuinely enjoyed going to this class. As some of the other reviews mentioned, each week we learned about a different year in the 1960's (its history, politics, culture, sports, fashion, and popular media), and Balmer played the top songs from that year for us. He assigned some really cool articles and movies for homework, so it's worth it to get through the assigned material if you have time, but Balmer is also great about covering everything you need to know in class, so as long as you go and take notes you'll be all set for the short weekly quizzes. We also had weekly discussion posts, which were graded pretty leniently and didn't take much time to write, and a couple of essays (also graded leniently and not too long). I truly cannot speak highly enough of this class and Professor Balmer.\"",
            "review 4: \"19X with Randall Balmer: Completely attendance based, you MUST come to class to succeed!! But super fun. Balmer is a great teacher and very passionate\"",
            "review 5: \"19X with Randall Balmer: If you take this course, show Balmer some love and show up to class. It was frustrating to see students show up and take the quizzes then leave — he even gave an attendance quiz at the end of one class to try and combat this. He's an engaging lecturer and puts a ton of time + effort into making interesting classes. I really liked the readings — he assigned a reasonable amount and then we would usually have quizzes on them in class, so definitely read and take a few notes so you remember what they were on. I took this class with a few friends and we had a lovely time, could not say better things about Balmer or The Sixties!\"",
            "review 6: \"19X with Randall Balmer: Take this class over sophomore summer! Professor Balmer is so chill and its an underrated layup (aka take this and not Jews 11). There are weekly pop quizzes but if you do the readings (which are arguably more interesting than his lectures) and come to class you will be fine. Sometimes he gives the quizzes at the end so you kinda have to stay for the whole thing, but the class is enjoyable and you basically watch videos and listen to music. He frequently lets class out early and there is no midterm or final, just 3 short papers.\"",
            "review 7: \"19X with Randall Balmer: TAKE THIS CLASS OVER SOPHOMORE SUMMER. While you have to come to class (pop quizzes) they are super easy. There's only three short essays throughout the term that you have a lot of freedom on. If you skim the reading every night, you'll get 100s on the quizzes. The essay prompts are so broad that you can write about pretty much anything and get an A on them. Balmer is also a super nice guy - get to know him! Especially if you sit towards the front and at least TRY to be engaged during class, he will like you. Lots of music in this class, some short videos, and history. When I think about it this is mostly a history class. Your notes will serve no purpose. Overall, definitely a layup and a pleasurable class to go to.\""
        ]
    },
    "HUM003.02": {
        "Gil Raz": [],
        "Roberta Stewart": []
    },
    "HUM003.01": {
        "Mark Williams": [],
        "Samuel Levey": []
    },
    "HUM002": {
        "Ellis Shookman": [
            "review 1: \"09W with Ellis Shookman: Humanities 2 is basically the same as Humanities 1, but the difference between the two lies in the discussions. During hums 1, I could tell that most people in my discussion group had been used to being the number one students in high school. Suddenly, they found themselves surrounded by equally intelligent people-- and here lay the problem. To compensate for this, they tried to sound as smart as possible when they spoke, which only caused them to talk a lot while saying nothing. I think I can honestly say I learned nothing from discussion during hums 1. In Humanities 2, on the other hand, the people in my discussion group had gotten over the initial shock of being at Dartmouth. This made the discussions infinitely better, and I can recall many interesting ones that we had. In addition to this, Prof. Graver was excellent at guiding and moderating debates. She normally teaches in the classics department, so she was especially good when we were reading the Aeneid and Seneca's Phaedra. Unfortunately though, you can't control which prof's discussion section you'll be in. Just know that you are very lucky if you get Prof. Graver. As far as the assignments go, there was one 4-5 page paper and a final ten page research paper. My one complaint was that they gave us about a week to write the final paper, which sort of encroached on studying for other finals. Try to make sure your other classes aren't intense at the end as well; otherwise, you could end up in quite a crunch during the last few days of the term.\"",
            "review 2: \"09W with Ellis Shookman: Lots of reading but fun discussions and good lectures. Prof. Shookman rocks!\"",
            "review 3: \"09W with Ellis Shookman: Good exposure to \"classic\" books\"",
            "review 4: \"05W with Ellis Shookman: first term humanities was amazing. I had professor shookman and he did nothing but inspire interest and excitement. During Humanities two I had Professor Tarnowski and I could not stand her, which made the class significantly worse. She talked way too much and did not seem interested in students learning. There was also a ridiculous and unmanageable amount of reading.\"",
            "review 5: \"05W with Ellis Shookman: much like humanities I. reading is faster paced and much more complex/dense. not for slow readers. fall behind and die.\"",
            "review 6: \"05W with Ellis Shookman: Compared to the first term of the Humanities sequence, this second term was much more fast-paced and intense. The readings were varied and ranged from the \"foundational texts\" (Genesis, the Aeneid, the Inferno) to more contemporary readings, which made the class more applicable to the present. The lectures were good (I particularly liked the ones by Professor Tarnowski, but both Professor Shookman and Brown also had interesting lectures; the combination of the 3 profs from 3 different departments provided a good variety of perspective and expertise). Overall, Humanities provided a great intro to \"the classics\" and was really interesting. Even though it was a fair amount of reading, it is definitely worth it!\"",
            "review 7: \"05W with Ellis Shookman: Brown is really rough. She is really scary during one-on-one meetings and she structures discussions in a really uneffective way. Our styles did not jive. And she grades hard. Shookman (whom I had first term) is witty and smart but mostly just lets the students do their discussing. There is waaay more reading second term and at a faster pace. Keeping up is not totally necessary, but helpful, and it is quite a struggle. The books are worth it though. Verdict: Great books, not-so-great professor...Pray that you get Shookman!\"",
            "review 8: \"05W with Ellis Shookman: The texts (Genesis, Aeneid, Inferno, Sufferings of Young Werther, Persuasion by Austen, Mrs. Dalloway, Omeros by Walcott) made the course worthwhile. Some of the best moments were having very involved discussions with classmates about them. Professor Brown, who led my discussions, often enjoyed micromanaging discussions by commenting, nodding, pointing, writing large words on the blackboard-- superfluous comments and literary commentary through pantomime. This made the discussions less that what they could have been. Furthermore, her commentary and criticism of student essays was often detail-oriented and picky. Admittedly, this helped me to improve my writing, but this can be done in ways that are a little less... self-important. Still. Some pretty cool stuff in these books.\"",
            "review 9: \"05W with Ellis Shookman: My first term of humanities was overwhelming--second term definetly made up for it. Your experience depends on which professor you have for your discussion group. First term, I found Saccio to be challenging and inspiring, but a bit too demanding. Second term, I was able to really get into the novels. I was happier with the works we read second term. I admit that I grumbled the whole way through first term and much of second term (aprox. 9 novels in 9 weeks is demanding!) but what other course offers you a survey of the greatest works of our time? I wasnt going to read the Inferno, Homer, Faulkner, and Goethe on my own! Once I was able to get a handle on the reading, I thoroughly enjoyed humanities. Just be aware of what you're getting yourself into :)\"",
            "review 10: \"05W with Ellis Shookman: We read Genesis, Virgil's Aeneid, Dante's Inferno, Goethe's The Sufferings of Young Werther, Austen's Persuasion, Woolf's Mrs. Dalloway, Faulkner's Absalom, Absalom! and Walcott's Omeros. The readings were very intriguing and represented a good sampling of the Western canon. I was disappointed by the class dicussions and lectures. The dicussions were redundant, and repetitive. Fellow students didn't have a good enough grasp of the reading materials, and Professor Shookman did not guide the discussion enough. The lectures were irrelevant and only inspired yawns. In fact, they seemed assembled at the last minute, and did not instill a sense of why the works we read are \"classics.\" Overall, the class did little to earn it's subtitle of \"The Classical Tradition.\"\"",
            "review 11: \"05W with Ellis Shookman: Yeah, Prof. Brown isn't easy on the grading alright, but she gave me a lot of help on how to be a better writter. In comparison to Prof. Wine, who's my first term teacher, Brown is definitely a lot better. I don't know about how Shookman is because I never had him. To speak honestly, I would've taken a gov or econ class instead of humanities just cuz. But the class is alright, and you'd definitely like it if you are a literature person.\"",
            "review 12: \"05W with Ellis Shookman: Humanities 2 was much better than Humanities 1, I found the books to be very interesting and they covered a variety of subjects and formats. Professor Shookman was also excellent. He was approachable for help and was a very good discussion leader. He is very thourough about correcting grammar and syntax in our papers, however, he doesn't really commment on the subject which can be a little annoying.\"",
            "review 13: \"05W with Ellis Shookman: I am so so grateful I got into Humanities 1 & 2 for my seminar. Honestly, I can't imagine what my 1st 2 terms at Dartmouth would have been like without it. This is truly an excellent course. It gives you a great foundation in the classics of western civilization, but more importantly, it's taught by brilliant but nice and accessible professors, and the kids in the class are interesting, enthusiastic, & intelligent people. It's kind of a bizarre format for a seminar. Unlike other seminars, where you have class with the same professor and 15 other students every day, this course alternates between a lecture given by one of the three professors team teaching the course to all 60 students, and 20 student discussion sections, each led by 1 professor. 2/3 of your classes each term are discussion sections, and you keep the same professor & classmates the whole term, so the discussion sections really get a chance to bond. I liked the format a lot. Discussions and lectures were both interesting, and it was nice to have the variation in schedule. Some of the lectures, particularly Saccio's and Shookman's, were absolutely brilliant, and they were all informative & helped us understand the books better. And I learned at least as much in class discussions. It's really cool, when everybody actually likes the class and does the reading (as they did in this class), discussions are fascinating. Everyone looks at things from a slightly different angle, & sometimes you get into ridiculous debates over nerdy things like the moral (if there is one)of Bacchae, whether Werther is a hero or an antihero, & whether Aeneas really loved Dido. The professor you get for discussion section is really important to how much you like the course. I was lucky & got Shookman 1st term & Tarnowski second. (Unfortunately, no one gets Shookman for both.) Professor Shookman is the coolest professor ever, really soft spoken & unintimidating, but also brilliant & with a hilarious dry wit. He's an incredibly nice person, really cares about his students, & is extremely helpful during office hours.(a warning on his grading, though: the only thing he corrects is your grammar, but his final grades on papers definitely take content into account too.) His discussion sections are really cool, because he mostly just lets us talk. He'll steer the discussion & sometimes ask us to clarify comments, but it's mostly us discussing these works with each other. One day in the midst of a discussion on Phaedrus, we wandered completely off the topic of the book & onto philosophy, religion, science, & the meaning of life... Coolest class ever if you have Shookman. Professor Tarnowski is also an excellent professor. Her teaching style is very different from Shookman's & a little hard to adjust to if you get her right after, but she's also enthusiastic, nice, & really really smart. She doesn't let students discuss things amongst themselves as much; instead she replies to pretty much everyone with her own comments. She makes excellent points, but it's kind of nice just to be able to talk with each other, without having to worry about the teacher's evaluation of our points. She's a very fair but tough grader. She doesn't \"curve\" essays, & is very willing to give everyone bad grades if that's what we deserve. However, she's very lenient with extensions if you talk to her in advance, & she's extremely helpful (more helpful than Shookman, who never really commented on content) if you talk to her about your essay. Her grading may be a little bit hard, but her comments are always fair & accurate, & she's a really nice person, very willing to help anyone who goes to ask her questions, & very interesting to talk to. All in all, this is a wonderful class. You learn so much, meet some of the most interesting, intelligent kids in the class, & get excellent professors excited about the material they teach. There's a lot of reading & writing, but it's completely worth it!\"",
            "review 14: \"05W with Ellis Shookman: Where else are you going to read the Aeneid, the Inferno, The Sufferings of Young Werther, Mrs. Dalloway, and other great classics o' western lit? I think the Humanities program is the best thing you can do for yourself in your freshman year at Dartmouth: you learn to read a lot of material--quickly, at that--and what you're reading is some of the best stuff you'll read in college. Sometimes it's not really possible to entirely understand a work before you move onto the next one, but you never have any work besides reading the books and, occasionally, writing one of the three essays (which aren't graded very harshly). The professors are all very much into the material, and the discussions are intereresting. Youuuu should take the class. Even though if you're reading this you probably have already taken Hums 1, and don't need to be told that. Well, it's basically the same as Hums 1. And that class was sweet, right?\"",
            "review 15: \"05W with Ellis Shookman: Humanities 1 was HORRIBLE for me--I had professor Wine, and it was not pleasant. This term, however, prof. shookman led my discussion group, and it was great: he was relaxed, created a comfortable environment, had insightful (though terse) comments, and by the end, i felt like the discussions had grown in maturity. And the essay-grading was very straightforward. You had to write well (and with a coherent structure), but other than that, it was an easy grade.\"",
            "review 16: \"05W with Ellis Shookman: Don't take humanities. My god, don't take humanities. if you are about to take humanities 2, just switch into a different seminar. the readings are much longer than in hum 1. the books are much worse than hum 1. taking humanities 1 and 2 was a huge mistake. i really regret it. all these classics were wasted on me. unless you are really interested in this material, don't take the class. you'll just regret it. professor shookman is incredibly nice. people tell me that he was one of the best profs around. i am not sure why. he didn't really inspire me. i put in less and less work as the term went by. hes a really nice guy, but just a decent prof. to all his adoring minions- i'm sorry. i just didn't click with the professor. thank god i'm done with this class. wow- what a relief!\"",
            "review 17: \"05W with Ellis Shookman: I had Shookman as a discussion leader and I thought he did a great job of encouraging people to consider and reconsider their reactions to a work. I liked the lectures better in the first term, but these weren't bad. I felt that the material in Humanities II was better overall than that of Hums I. Although the connections between the works seemed a little weaker than in Hums I, the course really did have a nice flow. I didn't like all the works, but I'm glad I read them. That's really what I wanted from this course -- to read the greats. I think my writing improved a lot with Shookman. It's true that he is really concerned with grammar. At first, it felt like he was reading for that rather than for the point of an essay, but looking back, I think he was looking for content as well. I think he's a great guy and I'm really happy I had him for discussion. If you get the chance, take a course with him! You'll be glad you did.\"",
            "review 18: \"05W with Ellis Shookman: I really enjoyed this course despite not keeping up with the readings, but staying up to date makes the experience much deeper. The works we read were (almost) all fascinating, but that doesn't change the fact that they take a lot of time to read. In the end, 8 full works were too much for the amount of time we had, and I felt like we didn't devote the time to some of them that they deserved. I think they're thinknig of hortening the list, which would improve the course endlessly. Shookman and Tarnowski are great lecturers (Tarnowski is also really lax about deadlines), Brown is interesting but so scattared it's hard to follow and easy to fall asleep. In the end, I'm very glad I took these courses, but I'm also glad they're over.\"",
            "review 19: \"05W with Ellis Shookman: This course requires a LOT of reading, but it's mostly good stuff and I think it's worth it. It's actually not that much work since there are only three papers in a term. I highly recommend this class.\"",
            "review 20: \"05W with Ellis Shookman: Humanities II is more of Humanities I: wonderful reading, great lectures, discussion sections etc. I had Proffessor Brown for discussion. While not being awful, she was not very good at leading discussion. She is also a VERRRRRRRY hard grader, although I am sure her grading vastly helped me improve my writing.\"",
            "review 21: \"02W with Peter C.: While the readings for this course are interesting and exactly what I had in mind when I signed up for the course, the total experience is heavily related to your discussion prof. Saccio is a good lecturer, but that was all I saw of him, b/c I had Prof. Ulrike Rainer for discussions. She is not as knowledgable about the works as Saccio or my section prof from first term (Prof. Ellis Shookman, who was wonderful!) She also tends to talk a lot rather than facilitate discussion between the students, and she was not very accepting of discussion on ideas that she found contrary to her own. If there is the possibility that she will be your section prof (i.e. she is one of the three professors for the class), then don't risk it...avoid the class altogether. (But if Shookman is one of them, then definitely take the class...his lectures alone are worth it, even if you aren't in his discussion group!)\""
        ],
        "Peter C.": [
            "review 1: \"02W with Peter C.: Lectures were informative, and papers were not oppressive. Discussion was unfortunately limited by course design, but reading material was very interesting.\"",
            "review 2: \"02W with Peter C.: The course itself is wonderful... in theory. The class time is split between small group discussions and lectures, the quality of which depend entirely upon the professor. I was thoroughly impressed by Professor Saccio, who, as always, gave interesting and insightful lectures. I was fortunate to have him as my discussion group leader for Humantities 1, so I have confidence in saying he truly knows the material. For Humanities 2, I had Professor Brown as my discussion leader. Small and energetic, Professor Brown appears to love the books that we covered. Unfortunately, none of her enthusiasm for the class rubbed off on me. Her lectures were boring and the quality of class discussions varied. Professor Rainer was funny and nice, but I my only experience with her was in lecture, so my opinion may not be very qualified. As for the course material, I must say that I greatly enjoyed reading the majority of the books assigned. There were more comedies this term than in Humanities 1. It was a welcome relief. I was somewhat vexed by the fact that we were assigned to read the books so quickly and were not able to devote much time to analysis and discussion. It was disappointing to only devote two classes to the discussion of such works as Dante's Inferno and Austen's Emma. I felt as though the class was very rushed and somewhat unorganized. The discussions were essentially led by students, with the professor occasionally posing questions or attempting to guide the discussion. Overall, I do not regret taking the class. I think I learned quite a bit from the experience.\"",
            "review 3: \"02W with Peter C.: She was not a great section leader. The discussions she lead were ineffective and very boring. I though that the reading was more difficult and less interesting than Hum 1. Students who take this course must be confident of their liking the course material. This course did help my writing skills, but is definitely not for non-majors.\"",
            "review 4: \"02W with Peter C.: The course promises an amazing reading list, but one that is far too long. The topics and discussions are very intersting, but we fly from book to book so quickly it's almost impossible to achieve in-depth understanding of each work. The course is about 1/3 lecture and 2/3 discussion section, with a written response for each of nine books and four major papers. If you enjoy English and reading, though, you will love this class.\"",
            "review 5: \"02W with Peter C.: While the readings for this course are interesting and exactly what I had in mind when I signed up for the course, the total experience is heavily related to your discussion prof. Saccio is a good lecturer, but that was all I saw of him, b/c I had Prof. Ulrike Rainer for discussions. She is not as knowledgable about the works as Saccio or my section prof from first term (Prof. Ellis Shookman, who was wonderful!) She also tends to talk a lot rather than facilitate discussion between the students, and she was not very accepting of discussion on ideas that she found contrary to her own. If there is the possibility that she will be your section prof (i.e. she is one of the three professors for the class), then don't risk it...avoid the class altogether. (But if Shookman is one of them, then definitely take the class...his lectures alone are worth it, even if you aren't in his discussion group!)\"",
            "review 6: \"02W with Peter C.: I'd certainly recommend the Humanities cycle of two courses for any freshmen even remotely interested in literature. The readings are top notch (especially the works in the second term) and Professor Saccio is incredible. The biggest weakness with the courses is the pair of porfessors who round out the teaching team. While I was lucky to have Professor Saccio as my discussion group leader during my first term, this last term I had to endure the rule of Professor Suzanne Brown. I'll leave it at that. So for one of the most enjoyable and worthwhile Freshman Seminars consider Humanities.\"",
            "review 7: \"02W with Peter C.: Humanities 2 definitely expanded my reading base to include a much broader range of works than before I took the course. We read all of the books that everyone should read in their lifetime. I really enjoyed the breadth of the course, and, while we did not get to spend enough time on some of the material, we covered a lot of ground in a term. I strongly recommend this class to anyone interested in reading a lot of really good literature quickly. Don't take it if you don't plan on doing the work, but if you put the hours in you will get a lot out of this course.\"",
            "review 8: \"02W with Peter C.: Humanities is great for anyone who likes to read and can read reasonably quickly. My only complaint is that the reading for Humanities 2 was not as good as the reading for Humanities 1.\""
        ],
        "John Kopper": [
            "review 1: \"08W with John Kopper: Humanities was nowhere near good enough a class to warrant taking it for two terms. Under no circumstances should you take this class, I only read two books I enjoyed out of 14+, and didn't get the grade I wanted for either term. I also don't feel like my writing really improved. TAKE ANOTHER SEMINAR! You will probably regret taking this one. I do.\"",
            "review 2: \"08W with John Kopper: The discussions made this class lame, but that was mostly just the students being shy or withdrawn - not all the classes were like that, and they got better further in the term. The lectures were very interesting, and really my favorite part. Some of the books were great, others not at all. Also, it's hard to be in a seminar for 2 terms.\"",
            "review 3: \"08W with John Kopper: The course was overall pretty boring, but a good freshman seminar, I guess. I really like that we read classics so I can know what everyone's talking about when they discuss them, now. The essays were annoying, but doable. The lectures are pretty hellishly boring, but the seminar discussions are usually pretty interesting. I LOVED The Handmaid's Tale and am really glad I took Hum just so I got exposed to the book. The rest of the readings are so-so. It was cool that the profs got one of the poets we read to come in and give a lecture, but it kind of sucked that her poetry was really dense and hard to understand.\"",
            "review 4: \"08W with John Kopper: All other complaints aside, the sheer logisitics of this course (two terms, two different teachers, two different class groups) made it pretty frustrating at times. I enjoyed most of the reading and I had really great teachers (Syson and Stamelman), but this class lacked the coherence and specialization which makes other seminars interesting. I suppose I'm glad I took Humanities because it made me pick up several warhorses I otherwise would not have ventured to read, but for those with less patience for a \"great books\" course, take something else.\"",
            "review 5: \"08W with John Kopper: I found that the books that the professors chose for this course were very good. I really ended up loving many of these books that I otherwise may not have read. Also, I think it's valuable to take Humanities so that you get exposed to a great many \"books you should have read\" and can know what you're talking about. That being said, the class had its flaws as well. The professors had a very narrow view of what should be talked about in an english class like this. Instead of relating the books to their wider historical/philosophical/personal context, the professors were OVERLY concerned with keeping all discussion/paper writing \"inside the text,\" which I found baffling. No work of literature is an island, and I found it appalling that attempts to relate these books to larger, non-prototypical english class themes and philosophies were squashed. I brought up this point, only to be told that there wasn't adequate time in the D-plan to have these kind of discussions. In that case, this course, which has SO MUCH potential, could be made great by taking a few books out of the syllabus so that meaningful discussion could occur. Also, the weekly lectures were absolutely horrendous. They mostly consist of a wikipedia-esque summary of \"significant dates\" of whatever author, which is absolutely irrelevant to anything whatsoever. If this was the professors' way of \"putting the books in context,\" they need to try harder. Knowing when/where/how so-and-so's mother died in childbirth really has nothing to do with the reasons that the novel is famous and important.\"",
            "review 6: \"08W with John Kopper: Overally, Humanities 2 was pretty much the same thing as the first one. The books were slightly better, though I didn't read them all. I had Professor Boggs. She is a cold woman who reeks of Ivy League snobbery. Couldn't relate to her at all. She's a tough grader, too, but once you get to know what she likes it's not too hard to please her. Don't take the Humanities seminar unless you're really, really into books. There are so many better seminars out there. Just read the course reviews like crazy and find the good ones.\"",
            "review 7: \"08W with John Kopper: The books this term were a little more unusual and modern than the books in fall term. It was a nice change. It does get a little tiring to be in the same class for a second term, doing the same things. I was a little concerned when I first chose to take humanities that I wouldn't learn how to write a research paper, but the professors added one for this term. Unfortunately, with such a fast schedule they didn't give much instruction on how to write one, so we had to try it out on our own. Professor Kopper was a little eccentric but very intellectual. Stamelman seemed like a very interesting and nice professor.\""
        ],
        "Suzanne Brown": [
            "review 1: \"07W with Suzanne Brown: there's a lot of reading, and not all of it is interesting. The lectures are overwhelmingly dull. There were 3 papers, they were pretty fair.\"",
            "review 2: \"07W with Suzanne Brown: Good books, good continuation of Humanities 1. Enjoyed having some old and new faces in my discussion section. Good diversity of books/authors/styles. Thought-provoking essays.\"",
            "review 3: \"07W with Suzanne Brown: The quality of this class depends so much on your discussion section and section leader. I enjoyed the class far more this term since Professor Williamson led organized and productive discussions and the students in the class seemed engaged and willing to participate. Some of the books we read were excellent, while others were not enjoyable at all. In spite of this, I think the selection was good for helping us understand the whole idea of the \"Classical Tradition.\" The paper topics this term seemed overly restrictive and not terribly engaging. Professor Williamson seemed more concerned with composition and style than what we were actually trying to prove or interpret in the essay. Because of this, the rewrite opportunities seemed more like a chance to fix little mistakes and get a better grade rather than a chance to actually think about and develop your ideas and argument. While her feedback in conferences was helpful, I don't think it led me to a better understanding of the material. In spite of these rather meaningless assignments (including an identification section on the final that seemed far too random to actually measure our comprehension), I think I learned a great deal in our class discussions and had the opportunity to explore books I might not otherwise have read. It's definitely worth putting up the essays and taking the class simply for the opportunity to engage with and debate the readings.\"",
            "review 4: \"07W with Suzanne Brown: Some of the lectures seemed a bit superfluous ... I guess they just struck me as slow in comparison to the discussion sections, which were fun and very sort of invigorating. I had Prof. Brown, who I thought was great both at analyzing the works we read and at leading our discussions. I was very impressed with her ability to provide insight into a topic or issue while acknowledging its complexity. She taught me to hate oversimplification. The one-on-one meetings to talk about our essays were pretty intense, but she does warn us beforehand that some students find them traumatic--and she gives lots of really valuable criticism and advice.\"",
            "review 5: \"02W with Peter C.: I'd certainly recommend the Humanities cycle of two courses for any freshmen even remotely interested in literature. The readings are top notch (especially the works in the second term) and Professor Saccio is incredible. The biggest weakness with the courses is the pair of porfessors who round out the teaching team. While I was lucky to have Professor Saccio as my discussion group leader during my first term, this last term I had to endure the rule of Professor Suzanne Brown. I'll leave it at that. So for one of the most enjoyable and worthwhile Freshman Seminars consider Humanities.\""
        ],
        "Laura Edmondson": [
            "review 1: \"23W with Laura Edmondson: Edmondson was a fantastic prof for this course. During discussion, she was incredibly respectful of everyone's opinions and made sure not to carry the conversation. Sometimes, she would look for you to say something that she was specifically thinking about, but she never acted as though anyone who didn't see things her way was incorrect (which my Hum 1 prof did). Sometimes I did wish she offered her insight more, though. We read quite a few plays in this course, and she is in the theater department. I think she would have had some especially interesting things to say about these works we covered. Overall, Edmondson was very kind, and I additionally feel that she graded fairly.\"",
            "review 2: \"23W with Laura Edmondson: I jumped into this course from a WRIT5 and honestly, I don't regret it. It may have scared me off from ever taking a class in the HUM department again, but that's just because sometimes I felt like people were giving me some intense bullsh*t during discussions (not really the professor, moreso my dearest peers). Overall, though, I feel like I learned how to write better within my own style of writing. The works we read were definitely cool, and you can always take the ones you don't like as much as a challenge to understand. If there's a reading or analysis that you judge pointless, just defy yourself to find meaning in it by yourself. I don't think that's something you can do in every writing class, so it made HUM002 really cool for me. There's also a lot of thought going into the choice of the works in the syllabus, and they're meant to connect in cool ways, and reflect the specialties of the professors teaching the sections. Edmondson was a very sweet lady. She's helpful, gives extensions and holds a good amount of office hours, and her grading is well explained (she's got a worksheet for grading!). She is very good at leading discussion as well, making sure to let people be heard, but also, offering her own insight when she judged it necessary. All the love for her. <3\"",
            "review 3: \"23W with Laura Edmondson: Your experience in Humanities will HUGELY depend on your instructor - happily, Laura Edmondson is a choice professor. Her way of leading the discussion group felt very much engaging, and not at all judgmental or sterile (like some other section leaders). She is also genuinely an incredibly wholesome person, she grades reasonably, she is very good about extensions, she's always available for office hours, and crucially, she is always understanding about the fact that students have personal lives. But that's just one half of the equation, the other being the readings themselves. I must say, in this regard too, I much preferred HUM2 to HUM1. The works ranged from Montaigne and W.E.B. DuBois to Shakespeare and Milton, with some more obscure names and other artforms thrown in there - a great variety, but also very engaging works that really make you think about grand concepts through simple narratives. My excitement slightly petered off by the end of the term, as we moved into a more contemporary curriculum, but fortunately the classics still had their time to shine for the majority of the ten weeks. Overall, if Edmondson is involved and you see at least one or two books on the reading list that interest you, I highly recommend you take this class. It is certainly unconventional, but it's a whole lot more fun than any first-year seminar, that's for sure.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"06W with Ulrike Rainer: Hum 2 was MUCH better than Hum 1. The organization by the professors was much better and the lectures were vastly more interesting and relevant. Rainer gave the weakest group lectures, but she was a great discussion leader. The books we read we're really good, some of the greats of Western literature (ex. The Odyssey, Kafka, Austen), but the amount of reading per class was sometimes lengthy; as long as you pace yourself it shouldn't be a huge issue. The papers were not difficult, they got lengthier as you went along (3 in total), but that may be attributed to the fact that Rainer seemed to be an easier grader than some of the other profs. The midterms and finals were no slouch, esp. the IDs. A good way to cap off the Writing Seminar, if they make Hum 1 as good as Hum 2 for next year the sequences would be one of the best seminar choices.\"",
            "review 2: \"06W with Ulrike Rainer: the pace was better than hum 1 this year, a little slower, or at least with shorter reading selections. i hated the emphasis on women and gender studies. a lot. i had fodor as my section leader... his lectures were the best lectures out of the 6 humanities profs this year, but in class we failed to really approach the heart of the books, why we cared about them and the themes within. At the same time, he was really fun and interesting, and inspired interest in the class for me. The three papers were diverse and interesting, i liked both the more open style from hum 1 and the more focused approach this term. papers varied in length and in style, for example we were required to compare two books in one. the other two profs gave fairly boring and downright awful lectures that i feel could have been better replaced with 5 minutes on wikipedia.\"",
            "review 3: \"06W with Ulrike Rainer: the final was ridiculous- a paper, a rewrite, and an exam. but overall, definitely worth my time, excellent overview on western lit.\"",
            "review 4: \"02W with Peter C.: While the readings for this course are interesting and exactly what I had in mind when I signed up for the course, the total experience is heavily related to your discussion prof. Saccio is a good lecturer, but that was all I saw of him, b/c I had Prof. Ulrike Rainer for discussions. She is not as knowledgable about the works as Saccio or my section prof from first term (Prof. Ellis Shookman, who was wonderful!) She also tends to talk a lot rather than facilitate discussion between the students, and she was not very accepting of discussion on ideas that she found contrary to her own. If there is the possibility that she will be your section prof (i.e. she is one of the three professors for the class), then don't risk it...avoid the class altogether. (But if Shookman is one of them, then definitely take the class...his lectures alone are worth it, even if you aren't in his discussion group!)\""
        ],
        "Margaret Williamson": [
            "review 1: \"03W with Margaret Williamson: The Humanities sequence was a great opportunity for me, a science major, to sample some of the great literature of Western Civilization. My prof was Andrea Tarnowsky, not Williamson (the class was slpit into 3 sections) and while sometimes she dominated the discussion a bit too much she was definitely a very competent professor. The paper topics inspired thought and the grading was not very harsh.\"",
            "review 2: \"03W with Margaret Williamson: more good books as a continuation of hum1, professors not as stellar, but williamson was a pretty good discussion leader and gave helpful criticism on papers. not fantastic but i'm still glad i took the class.\""
        ],
        "Petra Mcgillen": [
            "review 1: \"23W with Petra Mcgillen: I actually enjoyed this class a lot more than HUM 1. Tbh I think it was definitely the prof, McGillen was exceptional both in her leading of discussion sections and with her feedback when grading papers. I wasn't too big a fan of the works we looked at in class this term, with Milton's Paradise Lost and Montaigne being the most unpleasant, but you can get by pretty easily in the class if you pick your battles. Most of the discussion posts are able to be done with some quick skimming of the works and googling, if you don't want to read the full thing, and discussion in class you can play by ear and either comment on what someone else said, or pick up the gist of the work online and go off of that. For most of the class I would play minesweeper while listening passively to the discussion, then chime in when I thought of something to say. There are 3 essays throughout the entire course, which means you have to choose three works which you'll actually read and stick with, much more manageable than the 9 or so pieces of media that they assign you. Some of the works were fun, though, I particularly enjoyed Bruegel's Fall of the Rebel Angels, and A Portrait of a Lady on Fire. All in all, if you're comfortable in your writing skills, and have sufficient experience from high school in intelligently talking your way through seminar style classes without reading the book, this'll be a pretty light class. I didn't read about half of the books we spoke about and ended up with an A, and had fun talking in class. If you're looking for a deep rewarding course about literary analysis, HUM 2 also serves as that, depending on the amount of work you put in.\"",
            "review 2: \"23W with Petra Mcgillen: McGillen is sooooo awesome and I love her so much. She cares about her students and their success a lot and was just so excited to teach about the humanities. We read a variety of works for the class, with everything from Montaigne to a 2019 lesbian film. I thought most of the works we read/watched were pretty good although the syllabus changes each year so be aware of what works they are offering in the future to decide if you want to take the course. The class is an easy A if you can write an essay because that's pretty much all you are graded one (2 five page essays and 1 ten page essay). I particularly enjoyed the museum visits to the hood we did periodically throughout the term where the curators at the hood made special exhibits just for our class which was very fun. Also if you take this class with McGillen, go to her office hours or take her to lunch and get to know her outside of class; she is truly one of the coolest profs I've met at Dartmouth and even if you don't need help with anything her office hours are a nice time to just sit and have a chat. I definitely did not regret taking this class over a first year seminar and there are usually spots for people who didn't do HUM 1 so I encourage writing 5 folks to try out the class!\""
        ],
        "Jonathan Smolin": [
            "review 1: \"21W with Jonathan Smolin: This was a great course. Smolin was engaging, slightly more on material he liked. Although good, his help on improving student writing wasn't always the best, which was the focus of the class.\"",
            "review 2: \"21W with Jonathan Smolin: Smolin was great and discussions in this class were good. He was really excited about some of the materials we read/watched which made class more fun. HUM 2 really is HUM 1 with different books so you should know exactly what you're in for.\""
        ],
        "Kristin O'rourke": [],
        "George Edmondson": [
            "review 1: \"11W with George Edmondson: I am so glad I took this course. It's a lot of work but so interesting. Fascinating discussions and generally worthwhile readings... Take it!\""
        ],
        "Kenneth Walden": [
            "review 1: \"21W with Kenneth Walden: First of all, I absolutely loved this class. Walden challenged me and my writing definitely improved. He's very knowledgeable across many disciplines so you will feel engaged. Some of the readings were difficult to understand but Walden did his best to dissect them in a way that's understandable. The class discussions also helped me greatly. Now, the papers. Walden is a tough grader. Our section definitely dragged down the median across all sections. You can't get away with BSing your paper. I think the median of our first paper was like 83% or something. I never tried so hard to write a paper but it paid off in the end. But if you are taking HUM2 you already know what you're signing up for. Also Walden's sense of humour is great. He's super nonchalant but somehow he's funny. Anyways, take it with Walden he is amazing but will grade you harshly.\""
        ],
        "Colleen Boggs": [
            "review 1: \"04W with Colleen Boggs: Ms. Boggs is an exceptional teacher. She is great at facilitating discussion and critical thinking.\""
        ],
        "Andrea Tarnowski": [],
        "Dennis Washburn": [],
        "Eric Miller": [],
        "Hakan Tell": [],
        "Israel Reyes": [],
        "Jane Carroll": [],
        "Julia Rabig": [],
        "Kristin O'Rourke": [],
        "Mark Williams": [],
        "Michelle Clarke": [],
        "Paul Carranza": [],
        "Petra McGillen": [],
        "Rebecca Biron": [],
        "Steve Swayne": [],
        "Timothy Baker": []
    },
    "HUM001": {
        "Ellis Shookman": [
            "review 1: \"08F with Ellis Shookman: This is definitely the most challenging and rewarding freshman seminar offered. I didn't know the course was 2 terms, so make sure you are aware of that before signing up. That said, my knowledge of liberal arts and classical works has increased 10-fold since taking this course. Shookman is witty and an excellent facilitator of discussion. I'd heard some bad things about wine also (who I had second term), but she turned out to be fun, smart, and very knowledgable unlike what I thought based on the reviews. BOOKS BOOKS BOOKS. You will probably have the most books out of anyone else when you leave wheelock books at the beginning of the term, and yes you will read all of them. Seriously worth it though; and the discussions are always intriguing.\"",
            "review 2: \"08F with Ellis Shookman: I really enjoyed this course! There was a ton of reading (The Iliad, Rape of the Lock, Bacchae, Death in Venice, Troilus and Cressida, Elements of Style, Cassandra, The Suffering of Young Werther, Phaedrus) but it was doable and interesting. The profs are great! There is a portion of the class devoted to lectures with all 70 odd students in attendance and another part with smaller discussion groups led by one of the three profs. It's a great system that lets students both learn from the experts and express themselves among their peers. It's a first year seminar and a two term course (once you're in for one term, you're in for the second).\"",
            "review 3: \"08F with Ellis Shookman: I think this a good choice for a Freshman Seminar, although the Trojan War might get a little old by the end of the second term. Professor Shookman is very good and cares about his students. I really liked how he included opera and artwork in our discussion sections.\"",
            "review 4: \"08F with Ellis Shookman: The course is taught jointly by 3 profs (Shookman and 2 others). They take turns giving lectures, all of which are interesting in a hmmm kind of way but really teach you nothing about the works at hand, most people stopped attending them after the midterm. Discussion is the meat of the course. My discussion section was under Prof. Brown, who knew the works but did not really direct the discussion well. Most of what I learned was from the books themselves (critical editions rock). Brown is a much harder grader of essays than the other profs, but the tests are very easy, completely objective and just about memorizing facts.\"",
            "review 5: \"08F with Ellis Shookman: A decent seminar, not a bad class to be taking freshman fall. The papers are very straightforward and easy to write. Being a voracious reader, however, does not guarantee you will enjoy the class, since the works can be somewhat dry. If you decide to take it, make sure you would have chosen to do so independently of reading the reviews in which people rave about the class.\"",
            "review 6: \"08F with Ellis Shookman: This was a great course for freshmen fall. However, it LASTS 2 TERMS!!! They don't really advertise this, so make sure you know. I really enjoyed this class and found it not too difficult. If you don't mind reading and showing up at lectures, you're guaranteed at least an A-. Easy if you do the work. Sparknotes helps a lot for the midterms, which are mostly plot/detail based. If they mention a date/name/work of art or music in the lecture write it down! Also make sure you know when the books were published. Irrelevant, I know, but it can be on the midterm. Scan the introductions of books for dates as well. Try to get Shookman. He set the bar pretty darn high by being one of my first college professors. It's not just that he exudes awesomeness, but that he is extremely knowledgeable. We were reading Death in Venice and he did not even mention he had written a book on it. Understated class all the way (and aviators). He pretty much lets the discussion run its course, while occasionally showing us an opera or historical side note. Always informative, always interesting. Even though he shredded my essays with his blue pencil (seriously, they were covered), I wasn't intimidated about going to the conferences. In case you think I'm exaggerating- other people feel this way as well. I'm in the second term and everyone who had Shookman for the first term just accepts that the second term isn't as good. Even if you pass up this course, find a way to take a class with him. Will you like this course? If you have background in classical works--YES If you do not and you would like to--YES If you get Shookman as a prof--YES If you hate reading and writing--NO If you are too fragile to see your essay shredded--NO If you like English, take this course with no reservations---HIGHLY RECOMMENDED!!!!\"",
            "review 7: \"04F with Ellis Shookman: this course was good but challenging. everyone in the discussion is very insightful and it's a little overwhelming because sometimes it feels like everyone else gets it and you don't! but it's also very exciting to be in such an intellectually stimulating environment. prof shook (or as i affectionately refer to him as eshook haha) is good at reconciling everyone's ideas during discussion and making sense of them as a whole. the discussions were very interesting usually, the students really make or break the class. the reading is a lot, but it gets better as you get used to it. also, the essays are a little daunting at first, but eshook's editing is really helpful and so are his office hours appointments. i think this course helped me form a better essay. at first, i didn't like eshook that much, but that also was because the readings seemed really disjunct and isolated. but then they all started overlapping and coming at the same themes with different insights and that's when it became interesting, and eshook ended up not bad at all! cool digs.\"",
            "review 8: \"04F with Ellis Shookman: It will take a lot of your time to read. But it will be a lot of fun to discuss. You will meet bright people, and your lectures will be interesting. Great course.\"",
            "review 9: \"04F with Ellis Shookman: while i've heard some humanities discussion leaders are uninspiring, shookman was quite the opposite. he led the group in a certain direction by raising a question or presenting an idea and then knew when to let the class take over. his lectures were usually interesting as well. the best part of the class was the other kids though, some amongst the brightest i've seen. discussion was stimulating EVERY class.\"",
            "review 10: \"04F with Ellis Shookman: i had saccio for the discussion.. he's great\"",
            "review 11: \"04F with Ellis Shookman: The books, discussions, and lectures are all great. However, I was warned about the load of work it entailed, and it is a lot, but doable. The essays can be a pain and depending on which professor you get the resulting grade may not be what you want. But the class itself is really great. If your not a super psycho about grades, I definitely recommend it.\"",
            "review 12: \"04F with Ellis Shookman: The discussions were simply amazing. They will expel any doubts you may have about the quality of the students or professors here at Dartmouth. The amount of reading is pretty intense, but the depth of the discussions are just as rewarding. As this is one of your first experiences writing for a college prof instead of a high school English teacher, you may have to adjust to higher expecations on your essay. Overall, the course is very rewarding, and I highly recommend it.\"",
            "review 13: \"04F with Ellis Shookman: This course was team-taught by Ellis Shookman of the German Department, Kathleen Wine of the French Department and Peter Saccio of the English Department. The structure of the course was approximately two discussions a week and a lecture. We read about eight works and some lyric poetry. We wrote three five page papers and eight one-page reactions. These, plus the final exam, constituted our grade. Professor Saccio was my discussion leader. This guy is a great teacher-- both in lectures and discussions-- first, because it's obvious that he lives and breathes literature, and second, because he's just very smart. Often, discussions are just an excuse for the blowhards of the class to spout off unfounded nonsense while the professor stares out the window, dreaming of tenure. Saccio really listened to what everyone said in the discussion and responded with just criticism. He's also pretty funny, too. Professors Wine and Shookman too were good, though I saw them only in lectures. Shookman's lectures were very dense, but if you paid attention, it was all valuable. He too used humorous interludes to pretty good effect. (like humor that's relevant to the topic at hand... \"it's funny because you read the material\" funny). Wine's lectures seemed a little less organized and penetrating, though perhaps this is because the other two were so very exceptional. I strongly recommend this course to anyone who has ever wanted to read the \"important\" works of Western Civilization. It made me a much better reader and writer. Though it is a fair amount of reading and writing, I certainly think it's worth it.\"",
            "review 14: \"04F with Ellis Shookman: This class is a lot of reading but it's pretty fun and the discussions are good.\"",
            "review 15: \"04F with Ellis Shookman: Awesome class with excellent discussion. Shookman is an excellent discussion leader. Lots of reading at times, and the papers can get interesting, but the depth and content of the discussion easily outweighs any negatives you may otherwise find.\"",
            "review 16: \"04F with Ellis Shookman: most people read the humanities because of the inspiration that they can derive from these classic works of literature. this class effectively injects such intellectual pleasures into your daily life, becoming more of a luxury than a burden.\"",
            "review 17: \"04F with Ellis Shookman: Interesting course... a bit of a commitment (two term seminar instead of just one), but worth it. You feel a little bit more cultured after reading all the material.\"",
            "review 18: \"04F with Ellis Shookman: This class was a great opportunity to read a lot of great works and to train myself with a classical background for future reading. While the class did go by at a very quick pace with lots of reading, I feel a sense of accomplishment at having read all that I did. The class is divided up in lectures and discussion sections. The lectures are given by Prof. Shookman, Prof. Wine and Prof. Saccio. I think that, overall, the lectures could have been better. Saccio's were the best considering that he was the most textual and there was a base to work from; he's also the best public speaker. Shookman's were very interesting but often too absract and riddled with definitions (literally from Webster's) alone; it was also difficult to hear him sometimes. Wine's lectures were awkward, often stated the obvious and felt like high school level. However, more time is spent in discussion sections, which are, depending on who's in your class, very interesting. I was in Saccio's discussion section and our class had a great time with him. He directed the discussion, but allowed us to talk about what we wanted to. He was honest about his own opinions of the material and acted as a clarifying force when our discussions got muddled. The workload is fairly heavy, but not undoable. With the exception of the Iliad, the pace is about a book per week and for each book you have to write a one page \"reaction\", which is a fun, informal writing exercise. There are three essays spread out over the term, all of which are 5-6 pages and pretty manageable. I haven't taken the exam yet, but I assume that will be pretty straightforward. I feel like I've accomplished a lot from the reading and from the writing. It's also highly satisfying to be able to spot classical references! I would definitely reccomend this class.\"",
            "review 19: \"04F with Ellis Shookman: This class is informal and a nice class to have as a break. Towards the end, the pace of the class slumped a bit and the discussions a bit stale (they focus on a book for too long) but still discussions were fun and you'll be friends with everyone in the class by the end.\"",
            "review 20: \"04F with Ellis Shookman: Humanities is a great class--the readings were diverse and interesting, the discussions were really intriguing, and the profs are incredibly inspirational. (Professor Shookman has a dry, witty humor that is really entertaining; Professor Wine has great insight into French lit; Professor Saccio is just amazing). There is quite a bit of reading, but it's pretty reasonable considering it's a humanities class. I highly recommend it!\"",
            "review 21: \"04F with Ellis Shookman: I took this course because I was disappointed with the other offerings for Freshman seminars...and because I felt that the books read in this course were the novels that you Go to college to read. The works we read this term were all interesting--but be prepared for lots of reading at a breakneck speed (Iliad anyone?). Also, we only spent a couple classes on each book, which meant we weren't really able to fully discuss any single novel. The course is taught by three professors from different departments. You meet in lecture groups (all 60 freshman) once a week, and then are divided into 3 discussion group sections (20 per group) that meet during the rest of the classes. Your experience with the course will depend heavily on which professor you get in discussion group--since they will be the one doing the grading. I had Prof. Saccio, and while I do believe that he was the best lecturer of the 3, I think that he did expect a great deal from his students (and probably more than Wine or Shookman did). While I'm glad that I read all the great works we did, it was a struggle to make it through each class...\"",
            "review 22: \"04F with Ellis Shookman: I'm so glad I took this seminar! The pace was a bit fast, and it was a lot of work, but very interesting and rewarding. Professor Shookman is brilliant and funny and nice, and really cared about how we all did in the course. I'm really glad to have taken the course and read all the works we were assigned, because they are all important works in the classical tradition, and worthy of study, but not necessarily the type of thing I would be able to motivate myself to read on my own. This has been my favorite class at Dartmouth, and I loved every aspect of it: the professor, the works assigned, and the other students, who were the type of smart, intellectually curious people that I came to Dartmouth to meet.\"",
            "review 23: \"04F with Ellis Shookman: There seems to be no middle ground. Either you will love this course or you will hate it for two terms!\"",
            "review 24: \"04F with Ellis Shookman: shookman was awesome, we were all sad to leave him in the end. if you participate in class it makes it about ten times worth your time.\"",
            "review 25: \"04F with Ellis Shookman: My ratings actually refer to Peter Saccio, who was my discussion section's professor. Saccio, worthy of his reputation, inspired great interest in the class with his insights, and often made us burst into laughter (more often than not, this occurred when the discussion was about sex--and there is a lot of sex in this course). As a freshman seminar, Humanities seems to me to be the best choice: it gives a background in great literature (and \"Letters from a Peruvian Woman\"...ugh) that I am sure will pop up in later English classes and quite often in life (Wouldn't you like to walk into a frat some night, and comment to your companion, \"This is quite Bacchic, no?\" Ha, well, I would, anyhow). The lectures are usually interesting, though a few nodded off during Professor Wein's speeches. I highly recommend the class to freshmen looking for a great background in literature: this is the best thing you can do for yourself.\"",
            "review 26: \"04F with Ellis Shookman: depends ENTIRELY on the prof you have for discussion group. its not a bad class...just a lot of writing and you really whip through the books. worth it in the end, but then again i still have another term of it. im not thrilled im stuck in it and im not sure if i had the choice again if id take it. get your sem out of the way in one term...\"",
            "review 27: \"04F with Ellis Shookman: I loved my Humanities class. Professor Shookman was great--he let us discuss until we were satisfied, and then said something to spark an entirely new discussion. Naturally, there was lots of reading, but this class centered around the type of intellectual material and discussion I would expect of an Ivy League education. I look forward to my second term of class.\"",
            "review 28: \"04F with Ellis Shookman: I thought this was a wonderful course, and my opinion is no doubt influenced by the fact that I was in Prof. Shookman's discussion section. Shookman never fails to be insightful and sensitive. He would often sit back in his chair during discussion, intently listening to us attempt to wrangle with the deeper significance of the material, using murky arguments that never escaped being superficial. Then, after listening to our ideas for a while, he'd politely offer a short suggestion, which seemed to sparkle with clarity and depth. For example, after we discussed \"Death In Venice\" with minimal guidance for about half of one period, Shookman flipped through his book and asked us to stick our finger in and select a page at random, and said we'd talk about that passage. We did, and he then proceeded to rip the random passage apart, laying the literary devices, motifs, and their significance all bare. I may end up taking German classes, just to have a class with him again--he's that good. The course itself was great, though there were problems. I actually wish we had written MORE papers; I didn't feel like I made much improvement over just three essays. I also thought Prof. Wine's lectures were quite boring and inconsequential.\"",
            "review 29: \"04F with Ellis Shookman: no\"",
            "review 30: \"04F with Ellis Shookman: Professor Saccio is an able discussion leader because he is engaging, and he expects students to support their observations with specific evidence. However, Professors Shookman and Wine read their lectures verbatim from printed scripts. This is a waste of time; they might as well just hand out their \"lectures\" to the students to read on their own time. The literature was interesting, but only two or three classes would be spent on some of the shorter works. This means there isn't enough time to discuss them in great depth. The poetry is also a waste of time because a grand total of 15 minutes is spent on each lyric poem. If you're interested in reading the books, think about doing so on your own time and choosing a seminar that will enable you to go into more depth on a specific topic -- and with an unquestionably good professor.\"",
            "review 31: \"04F with Ellis Shookman: For those people with high SAT and AP scores that need to take a seminar freshman fall, this is the one to take. Other seminars don't really focus on reading or writing and often aren't really places where you learn much. I think that Humanities if the best seminar because of the structure of the class. Many people say that it's a lot of reading, but I didn't find that it was a problem. You need to keep up with the reading though to make the class enjoyable. We had three different lecturerers and I thought that two of the three of them were amazing (shookman and saccio). I highly enjoyed my discussion sessionw with professor shookman because he let us guide the discussions but kept us on topic and made us think about different aspects of a text. Shookman was very readily available during office hours and I really enjoyed going there and talking to him.\"",
            "review 32: \"04F with Ellis Shookman: The Classical Humanities course is a good combination of lectures, seminars, readings, and papers. The class workload is not as hard as one would expect. Other freshman seminars often seemed to have a harder workload. As long as one keeps up with the reading and writes decently effective essays, one should do pretty well. It's definitely easier than English 5 from the rumors that float around campus. WARNING: Do not take if you are not interested in reading classic books. This course will bore you to death if you are not interested in classic literature that spans from Homer to Mann.\"",
            "review 33: \"04F with Ellis Shookman: I enjoyed the course! There wasn't too much reading and the class was exactly what it promissed to be. If you like the classical tradition, take it!\"",
            "review 34: \"04F with Ellis Shookman: an exciting class with a difficult but easily managable workload.\"",
            "review 35: \"04F with Ellis Shookman: I really wish I didn't take this class. Granted the material was interesting and I'm glad to have learned about the classical tradition, the discussion groups and the papers killed me. I have no complaints with the way Wine managed the discussion, but some of the kids were ridiculous--quoting this french philosopher, talking for the sake of talking, etc. And the papers, I think, were unfair. After spending weeks reading and discussing the Iliad, for instance, we were given our essay topic: pick a passage and write an essay in which you discuss the relevance of the passage. ! I don't know, the essay topics just didn't really relate to what we were doing in class; it was like in was in two classes. And Wine was a subjective, unpredictable grader. I could slave over a paper (and make it reasonably cogent) and get anywhere from an A to a B. Overall, it's just not worth it. Take another first-year seminar. You will have less work, and, while you might not get to read these books, you will enjoy your freshman fall much more. (Although this review was strongly influenced by Professor Wine, I'm displeased with the The Classical Tradition as a whole.)\"",
            "review 36: \"04F with Ellis Shookman: Of course it's a little difficult to make comparisons, but we read a lot of important works and kept pretty good pace. Lectures were genuinely interesting.\"",
            "review 37: \"04F with Ellis Shookman: Saccio led my discussion sections very effectively. He's the funniest man I've ever met, totally down-to-earth and willing to help you out. Saccio made the material incredibly interesting. I'm a better person for having taken this class.\"",
            "review 38: \"04F with Ellis Shookman: Great class, Saccio is a GREAT discussioin group leader\"",
            "review 39: \"04F with Ellis Shookman: Humanities is a great class. I was reluctant to take it because I had heard the workload was harsh, but I am glad I did. The books are interesting and historically important and Professor Shookman (whom I had for discussion) is a great professor. The lectures were good overall (especially Shookman's) and the papers were not too difficult and relatively short (about 5 pages). I truly feel that my writing improved over the course of the class. If you enjoy reading, Humanities is a great choice for a first-year seminar.\"",
            "review 40: \"04F with Ellis Shookman: Great class, ya'll should def take it, don't be intimidated by reading list\"",
            "review 41: \"01F with Peter C.: I didn't really know what to expect from this class for my first term here. I signed up for it because I always wanted to read the \"classics\" on the reading list, and it was a class completely different from my intended major. Turns out that I did better and learned more from this class that I did the other two classes I was taking for pre-reqs, and as a result, I am now contemplating going in another direction in school. I don't know if this really has to do with this class, but I think the topics discussed in here probably contributed to my new attitude. The class alternates betweens lecture days and discussion days. There are actually three teachers for the class, the other two being Prof. Ellis Shookman from the German Dept. and Prof. Margaret Graver from the Classics Dept. Each prof takes turns giving lectures, primarily with the works they are most comfortable with, and then when the class meets again, the profs act as discussion leaders for their section of the class (the whole class was about 60 students, so each section was about 20). In sections, you get to discuss the works more throughly and ask questions of both the prof and your classmates. I had Prof. Shookman for discussion, so that's why I couldn't answer some of the survey questions because they just didn't apply here. At first, the discussions intimidated the hell out of me, but fortunately, once you get past the \"whoa!-everybody-around-me-is-three times-smarter-than-me-what-I-am-doing-here\" kinda feeling, it starts becoming enjoyable and interesting. At least for me it did. This class takes a significant amount of self motivation and interest in order to enjoy it. Otherwise, I have a feeling it would go over some people's heads who just really don't care about it. As for the workload, the final was our only test we had to worry about. Instead, we had five, 4-5 page papers due throughout the term along with weekly one page responses on whatever work we reading. I heard a lot of people complain about the amount of writing, but I didn't think it was that bad. As a seminar class, there is a focus on writing, and I would have to say that my writing clearly improved throughout the term. Prof. Shookman would go through and correct everyone's papers individually and then would return them so everyone could turn in a revised version for grading. I thought this was outstanding, especially in junction with the times he was available for questions and advice on writing in his office hours. I'm not sure if Saccio or Graver did this as well, or if our section was just the lucky one. Yet, as I go on and on about how good the class was, there were some faults. One thing, it is able to get a decent grade in the class without going to the lectures. I didn't excercise this opportunity, however many of my friends did. I almost did after staying up until 2 one morning finishing the reading for lecture and then getting into class and having to sit through Prof. Graver ramble on about Yugoslavian oral tradition forever. I was not the only one who could care less about her lectures in particular. They often had nothing to do with the reading and seemed to pick out trivial points to expand on for the hour. Both Saccio and Shookman were also guilty of this on occasion. As I said before, the class does take some self-motivation. There are times when the ideas seem vague or the discussion loses focus and the profs don't define everything for you. This is when you have to look for the answers yourselves and interpret for yourself. I think this is actually a strength in a way, but if you aren't interested in spending the time to do it, I wouldn't recommend this class for you. All in all, I would say I enjoyed this class throughly as a freshman seminar. Compared to the horrific descriptions of other people's experiences with their own seminars (one girl was telling me she got stuck with a class on something like \"Food in the new world economy\"), I think was pretty lucky to be in here. I met a lot of great people in my discussion. It also helped to have three boys living on my floor, who happened to be in the class too, on those nights where we all run around looking for inspiration to write the night before a paper is due. We'll just see if I can say the same thing for next term after the sequel in \"Humanities 2\"...\""
        ],
        "Monika Otter": [
            "review 1: \"09F with Monika Otter: When I got placed into this class after not getting my first two FYS choices, I was a bit worried because upperclassmen said it was a lot of work. It turned out to be a lot of reading, but there wasn't as much writing as other FYS, so I think it balanced out. This class also teaches you how to read. With 300+ pages of reading due some nights, you have to learn how to skim and pick out the important passages, which is useful for other classes. Otter is fantastic, really interesting, and really nice. She was understanding about things like deadlines and work from other classes, and I feel like her conferences actually helped me become a better writer. The other two profs, though, Katz and Brown, were rather dull during lectures. So, basically, take this course if you're interested in Classics. Don't worry about the supposedly heavy work load, it'll all work out in the end.\"",
            "review 2: \"09F with Monika Otter: This Humanities Seminar was ok. The readings were pretty good but some, especially St. Augustine, really dragged. The professors were extraordinarily dry and dull. Take it but with caution and hope that different professors teach it next year. The group teaching pt II are incredible so it really varies\"",
            "review 3: \"05F with Monika Otter: Do all the readings, take notes.\"",
            "review 4: \"05F with Monika Otter: I was very excited to take this class, but now I wish I hadn't. There is a ton of reading, but we very rarely finished any of the books. Instead we just read sections of each one. This class was taking up of all my time until I realized that I didn't really have to read any of the books. Since we weren't finishing the books anyway, I didn't feel like I was missing out if I didn't finish the part we were supposed to finish. Pretty much your whole grade is papers that you do not have to have read the book to write. None of the profs spoke English as their native language. Sokol did a suprisingly good job of teaching writing considering that English is her third language. Lectures are boring, and section discussions are all over the place. I still have no idea how to use the library, my writing isn't any better, and I've read parts of a lot of great books. I wouldn't take this class again.\"",
            "review 5: \"05F with Monika Otter: I enjoyed this class. The reading schedule was a bit overwhelming at first, but if you make it a priority to finish the reading, everything goes much smoother. Also, try not to procrastinate writing the papers, and don't be afraid to go to office hours. Some of the criticism of my papers was unnecessary and I won't use those tips in the future, but overall this class improved my reading and writing skills. I recommend it.\"",
            "review 6: \"05F with Monika Otter: This is a good course for the self-motivated. The professors (at least those during Fall05, they change every term) gave incoherent lectures, really strained to draw parallels and held the class's attention for only 5 minutes at a time. My discussion group, led by Sokol, was a mess - we'd spend each class coming up with 30 or so topics to discuss, and then spend less that 20 seconds on each at the rushed end. Critiques of essays were also very unhelpful. That said, I can't imagine any teacher could take away from the pleasure of reading Cervantes, Dante, Woolf, etc. So if you want to read the books that matter, take the course, do the readings, and pray you get lucky with the profs.\"",
            "review 7: \"05F with Monika Otter: This was a great seminar - interesting reading, a manageable workload, and really engaging profs.\"",
            "review 8: \"05F with Monika Otter: I decided to take Humanities because I didn't like the look of the other first year seminars fall term, and I thought some knowledge of classic literature would enhance my cultural literacy. Well, the novelty quickly wore off (right around when we had to read godawful Parzival), but for the most part, the class was enjoyable -- the papers were interesting, the final exam very fair, and the discussions engaging. I was in Professor Rota's section. He is a very cool guy. He always delved into the philosophical themes of the book rather than wallowing in why the author used certain rhetorical devices. Also, he encouraged class participation and was a very fair grader. The lecture aspect of this class should be replaced by more time in discussion section. To put it in mild terms, lectures are not fun. Also, note that you can take Humanities 1 for your LIT distrib and then switch into a first year seminar in the winter to fulfill your writing requirement instead of Hum 2. I did this because I wanted another distrib and a change of pace, but I'd still recommend Hum 1.\"",
            "review 9: \"05F with Monika Otter: we had one lecture with all three sections combined and two section discussion groups per week. the lectures for the most part were hard to follow therefore boring. the teacher's each had strong accents thatwere difficult to follow, which is why i think the lectures were difficult. one book per week was fast and choppy... i think the class is more about writing than about the books, although we did spend almost all of our time on book material. 4 papers (4-5 pages) with plenty of time to write them in. my section prof was sokol, and she graded hard and pushed me a lot. as someone who loves classical literature, the class was tremendously fun, and i even learned to enjoy writing papers.\"",
            "review 10: \"05F with Monika Otter: The class was a lot of work, but not too much. The papers were graded differently depending on which professor was your section leader. A good class to take, it'll make you feel like an \"educated\" person--afterall that's why you're at Dartmouth.\"",
            "review 11: \"05F with Monika Otter: The course was interesting except for the fact that we hardly had time to discuss one book before we moved onto the next one. We didn't really go in depth on any of them. The full group lecutres are hard to follow and then are never discussed. All the papers have rewrites so it's really seven papers not four during the course. Only take this course if you want to read a little of everything and wade through endless papers.\"",
            "review 12: \"05F with Monika Otter: As a non-major, but someone very interested in reading and literary analysis, this class was great. The reading selection was excellent and ideal for this course. The professors were generally competent. My professor was Rota, who is an excellent writing resource and a very intelligent lecturer and discussion leader. His points were always relevant and very interesting. The other two professors were only seen during lectures. Otter was a reasonable lecturer and seemed to be a good professor, but Sokol didn't really bring up many relevant points in her lectures, and seems to take very uninteresting and uninspired positions. Overall, the course is definitely worth it to ease into writing courses at Dartmouth.\"",
            "review 13: \"05F with Monika Otter: Although this class was offered as an alternative to the freshman writing seminars, I feel that my writing has actually gotten worse. I do not feel like I gained particularly deep knowledge of the texts, and the lectures and sections often strayed off topic.\"",
            "review 14: \"05F with Monika Otter: overall, this class was pretty good. i had rota for discussion, and he's very fun and a lot of fun. i thought that many of the lectures were dull/pointless and would have rather had discussion exclusively. frankly, the most excellent professors fairly teach first-year seminars, and all of the professor here were at least good. even though to fulfill freshman seminar credit it takes two terms, i think its a better course than most of the other seminars. you read a lot of great books, and there's no other course where you get the chance for this kind of survey. my main disappointment is that a number of the books we only read excerpts from, which defeats the purpose of the course in some ways. it was done to squeeze more books in but not overwhelm students with reading, but nonetheless reading the whole books would have been a better choice. the workload isn't too much, the papers are fairly easy (especially with rota, who doesn't grade too hard; other professors may be tougher. and, if you really hate this course (some people did) you can take the lit credit from first term and take a different freshman seminar second term for that credit. so don't worry about being trapped for the whole two-term sequence. i'm taking it next term too, so obviously i liked it well enough.\"",
            "review 15: \"05F with Monika Otter: With a few exceptions, we did not read books in their entirety, but rather \"generous samplings.\" The pace was much too fast, with a lecture and 1 or 2 discussions on a book before moving on. The texts were fairly varied and interesting, but assigned reading really saps the fun out of anything. The course depends on the professors, who probably change every year. My section leader was Rota. He's a nice guy who is intelligent and comfortable with the material. His grading, however, seemed arbitrary and lacked explanation. The lectures, particularly Sokol's, were excruciatingly boring, confusing, and entirely irrelevant. Discussions were more interesting. All in all, there is no reason to take this class. A seminar is meant to improve your writing, and this class doesn't do that. If you want to read books and discuss them, join a book club.\"",
            "review 16: \"05F with Monika Otter: The main word to describe this course would be work. I personally think that they attempt to cover way too much material in the timespan, meaning that reading assignments are typically really long (ie, all of Dante's Divine Comedy in three nights). I didn't do many of them (only enough to have one to write a paper on), and could still participate in class because discussions were often off topic and unfocused, certainly not requiring mastery of the text (which would probably be very difficult considering the length of daily assignments.) The papers were on pretty generic subjects (I can't look at the role of women one more time!), but doable. Monika Otter, my section professor, was a hard grader, but I thought that my writing imporved a lot and that the one on one time spent with her discussing my papers was the most worthwhile part of the course. Lectures are just torture; be sure you bring the crossword puzzle. I took this course for my seminar, but overall I wouldn't reccomend it; there are definitely more interesting seminars that you can take that aren't as much work!\"",
            "review 17: \"05F with Monika Otter: The best part about the class is being able to read the \"great books of Western literature,\" most of which are things I would never get around to reading if not assigned for a class. However, because we didn't read all of many of the texts, only large chunks, the reading was a little disjointed. My favorite readings were also the ones in which we did not jump around. Some of the reading is boring and difficult to get through, but there were also books I really enjoyed. The profs all seem knowledgeable, but none of them are particularly energetic or passionate about the subjects, so I found lectures to be dull and often hard to follow. However, I think the profs change from year to year, which could change the class a lot. I didn't particularly enjoy discussion sections. Sometimes they would be interesting, but often they would be off-topic and unfocused. The class did help my writing some, but I did not improve as much as I hoped to in my seminar. If you enjoy classics, you would probably like this class. Otherwise, look for other seminars.\"",
            "review 18: \"05F with Monika Otter: I am hard pressed to describe the course's myriad deficiencies in a review as short and limiting as this, though I shall try all the same. When I had first selected this class, I had hoped to receive some semblance of a classic curriculum from it, a grounding in Western Civilization, and instruction that would help me grow as a writer. I felt I received neither that grounding, nor an adequate understanding of the works that were read, nor even instruction that improved my composition. Instead, the class constituted merely a waste of time, and a constant nuisance, and though I received a very satisfactory grade at its conclusion, the experience was ultimately negative. The first discouraging facet of the course lay in the professors. All non-native speakers of English, and individuals whose speech was difficult to understand, these professors were nevertheless recruited to teach a course revolving around...yes, you guessed it, English Composition. Rota especially was incomprehensible, not only due to his thick accent, but also his roundabout manner of speaking, saying in 40 minutes what could have been stated in five, and mentioning little of substance. The lectures often provided one with little insight, and class discussions tended to be little better. Grading was usually arbitrary, at least with Alina Sokol, and if you hoped to do well with her, you had to toe the party line. In one especially piquant moment, she asserted that Dante's Inferno had absolutely nothing to do with religion. When not adhering to this opinion, essays on the Inferno were disembowled by Sokol herself. While the professors thus did much to sour the course, the curriculum itself also did not help matters. For instance, only modest excerpts of most works were read, and these excerpts were covered at such a pace as to make any in-depth look impossible. This was designed as truly a survey course, and even at that it failed. I got more insight about the books from the internet than from the actual class.\"",
            "review 19: \"02F with Monika Otter: I have never experienced an elation greater than that of the day I finished the Iliad (mostly because that meant the torture was over). By the end of the course, you look back at all the literature you've read, and you feel a very strong sense of achievement. Though lectures were often quite dull (unless they were given by Saccio; anyone who can wear a cape is, by definition, a great speaker), discussion were often provocative, and I often felt as if I wanted to continue the discussion long after class had ended. If you don't mind reading a great deal of literature, then take this class!!\"",
            "review 20: \"02F with Monika Otter: i took this class because it had a good reading list and i knew i would never get around to reading the books otherwise. it turned out to be a very rewarding experience and prof. otter is a good discussion leader and gives helpful criticism on papers. this class involved tons of reading, 3-4 papers (5-6 pages each) and a final. i'm glad i took it.\"",
            "review 21: \"02F with Monika Otter: Humanities is rough, but I'd say it's worth it.\"",
            "review 22: \"02F with Monika Otter: Good class, great prof.\"",
            "review 23: \"02F with Monika Otter: this course is a LOT of work but it was really interesting and this is the best place to study some of the most famous and beautiful works of western literature. discussion can sometimes be frustrating and lectures can sometimes be boring, but you will learn how to write better essays and all in all it was a good experience.\""
        ],
        "Peter C.": [
            "review 1: \"02F with Peter C.: Humanities 1 itself was an interesting course with interesting material. I was familiar with many of the works outside of class, and I was interested in listening to my professor speak about these great works. I was dissapointed, however, in Professor Saccio. I did not feel comfortable around him; in fact, I did not feel that he was helpful/encouraging when I visited him during office hours. Indeed, it seemed to bother him when I asked relatively few questions about my essays. I for this reason only, I caution future freshman from taking this course.\"",
            "review 2: \"02F with Peter C.: All freshmen should take this course. It's a great overview of western literature, and the readings should have surprises for just about anyone. The workload isn't very intensive, about one book per week with a one-page response to each book. There's four papers and a final that make-up your grade along with participation. Don't miss discussion! Professor Saccio is known as a Shakespeare expert, and he provides a lot of information in an interesting manner. He makes colorful comments that keeps the atmosphere light. Many students found his lectures to be first-rate. (That's probably why people pay money for cd's of his lectures).\"",
            "review 3: \"02F with Peter C.: Professor Saccio is an amazing lecturer; he simply blew away the other two professors teaching Hum 1. He is also a nimble and entertaining discussion leader. The reading for this class was wonderful; if you enjoy reading for the sake of reading, this class is heaven. After the Iliad, the reading gets easier to keep up with.\"",
            "review 4: \"02F with Peter C.: Saccio is amazing...perhaps the most interesting professor I have ever had. The reading selection was good, the discussions were good, and I found Saccio's comments about my papers to be constructive. Any student would be very lucky to find themselves in this man's class.\"",
            "review 5: \"01F with Peter C.: This course should be top of the list for anyone who wants to get exposed to some of the most significant works in the literary tradition of the world (while completing a hefty chunk of distributive requirements in the process). The lectures, for the most part, were very enjoyable and illuminating. All three professors (Saccio, Graver, and Shookman) had very unique ways of approaching the material. I was in Saccio's discussion group and cannot say enough about how intelligent and engaging he is as a professor. The discussion group sessions, after the first rocky few, were a pleasure to attend; they really did encourage some interesting dialogue. One complaint is that perhaps too much attention was paid to The Iliad at the expense of other works. Also, the syllabus for the course can be daunting at times. Overall, this class wa a pleasure to take and I look forward to Humanities 2.\"",
            "review 6: \"01F with Peter C.: Okay, so this class IS a first-year class that offers professors that are the utmost scholars in their fields and an AMAZING reading list. So what? You zip through the books so fast you barely have time to comprehend them (much less explore them at a non-superficial level), the lectures are usually dry and often do little to enlighten one on the book, and discussion sections usually serve as arenas where a few students attempt to impress the others with dazzling (or in most cases less-than-dazzling) philosophical comments. However, I did find that discussion sections allowed you to get to know other students (and my conversations with them about the texts outside of class were much more fascinating and in-depth than what is offered in class). The professors will be tough on your papers, but the grades are very reasonable. In retrospect, I do not regret taking the class, but as I was sitting through each class I could not wait for them to be over. The perks are definitely the high-quality professors and the spectacular reading list... unfortunately, neither are utilized to their full potential in this class. The best day of class was the plenary session on the last day where everyone picks their favorite quote from any of the books and reads it and explains why the quote has meaning to them. Sure, take the class. Over the course of the term, I managed to spend less and less time doing the reading and the writing for the course -- because you do so much of it that you are forced to improve those skills and get your work done faster.\"",
            "review 7: \"01F with Peter C.: I should start by saying that I had Professor Graver as my section leader. She was an obviously intelligent woman, but somewhat set in her ways. It took a lot of work to get her to agree with you, but it was possible. She was very demanding on her papers, and had little advice to offer spare her reccomending that we all purchase a writing manual of our own. Personally, it took my a while to get the swing of things, but once I did, the course became less demanding and more rewarding. Be prepared for a lot of reading, a lot of writing, and to figure things out own your own.\"",
            "review 8: \"01F with Peter C.: If you are prepared to do a lot of reading and writing, the Humanities seminar is very interesting. The readings, ranging from the Iliad to Thomas Mann, all brought a different voice to the class while continuing the same ideas throughout. Half of the class is spent in lecture with all the sections and the other half is with your discussion leader. The discussions were very helpful and make the course feel much smaller and more intimate. The course is a lot of reading and a good amount of writing, but I definitely feel that I've gained from it.\"",
            "review 9: \"01F with Peter C.: I didn't really know what to expect from this class for my first term here. I signed up for it because I always wanted to read the \"classics\" on the reading list, and it was a class completely different from my intended major. Turns out that I did better and learned more from this class that I did the other two classes I was taking for pre-reqs, and as a result, I am now contemplating going in another direction in school. I don't know if this really has to do with this class, but I think the topics discussed in here probably contributed to my new attitude. The class alternates betweens lecture days and discussion days. There are actually three teachers for the class, the other two being Prof. Ellis Shookman from the German Dept. and Prof. Margaret Graver from the Classics Dept. Each prof takes turns giving lectures, primarily with the works they are most comfortable with, and then when the class meets again, the profs act as discussion leaders for their section of the class (the whole class was about 60 students, so each section was about 20). In sections, you get to discuss the works more throughly and ask questions of both the prof and your classmates. I had Prof. Shookman for discussion, so that's why I couldn't answer some of the survey questions because they just didn't apply here. At first, the discussions intimidated the hell out of me, but fortunately, once you get past the \"whoa!-everybody-around-me-is-three times-smarter-than-me-what-I-am-doing-here\" kinda feeling, it starts becoming enjoyable and interesting. At least for me it did. This class takes a significant amount of self motivation and interest in order to enjoy it. Otherwise, I have a feeling it would go over some people's heads who just really don't care about it. As for the workload, the final was our only test we had to worry about. Instead, we had five, 4-5 page papers due throughout the term along with weekly one page responses on whatever work we reading. I heard a lot of people complain about the amount of writing, but I didn't think it was that bad. As a seminar class, there is a focus on writing, and I would have to say that my writing clearly improved throughout the term. Prof. Shookman would go through and correct everyone's papers individually and then would return them so everyone could turn in a revised version for grading. I thought this was outstanding, especially in junction with the times he was available for questions and advice on writing in his office hours. I'm not sure if Saccio or Graver did this as well, or if our section was just the lucky one. Yet, as I go on and on about how good the class was, there were some faults. One thing, it is able to get a decent grade in the class without going to the lectures. I didn't excercise this opportunity, however many of my friends did. I almost did after staying up until 2 one morning finishing the reading for lecture and then getting into class and having to sit through Prof. Graver ramble on about Yugoslavian oral tradition forever. I was not the only one who could care less about her lectures in particular. They often had nothing to do with the reading and seemed to pick out trivial points to expand on for the hour. Both Saccio and Shookman were also guilty of this on occasion. As I said before, the class does take some self-motivation. There are times when the ideas seem vague or the discussion loses focus and the profs don't define everything for you. This is when you have to look for the answers yourselves and interpret for yourself. I think this is actually a strength in a way, but if you aren't interested in spending the time to do it, I wouldn't recommend this class for you. All in all, I would say I enjoyed this class throughly as a freshman seminar. Compared to the horrific descriptions of other people's experiences with their own seminars (one girl was telling me she got stuck with a class on something like \"Food in the new world economy\"), I think was pretty lucky to be in here. I met a lot of great people in my discussion. It also helped to have three boys living on my floor, who happened to be in the class too, on those nights where we all run around looking for inspiration to write the night before a paper is due. We'll just see if I can say the same thing for next term after the sequel in \"Humanities 2\"...\"",
            "review 10: \"01F with Peter C.: I really enjoyed this course. It was a lot of work and sometimes I felt a little overwhelmed in Discussion groups. But overall it helped me to look for connections and important information when I read. I would recommend the course.\"",
            "review 11: \"01F with Peter C.: I simply thought this course was great. The lectures were inspiring; the materials interesting; the profs knowledgable, the discussions exciting; all this was clouded only by the difficulty of the writing assignments. This class is definitely difficult as far as English classes go, but I feel I am a better student for having taken it. Saccio is a captivating teacher and showed a genuine interest in helping the students. If you're willing to take on an interesting challenge I recomend taking humanities 1 for just that.\"",
            "review 12: \"01F with Peter C.: Sometimes I thought the title of this course shouldn't be \"The Classical Tradition,\" but rather \"The Meaning of Life in 60 Minutes or Less.\" This class was what I'd been waiting for my whole high school career. I wanted my professors once I got to college to be innovative, to be accessible, to be willing to tackle the tough stuff instead of beating around the bush. The lectures were wonderful--everything from amusing to astounding--and the discussion sessions were a genuine exchange of ideas from student to student as well as professor to student. If the purpose of this course was to make us more sensitive and more thoughtful human beings, I think it succeeded.\"",
            "review 13: \"01F with Peter C.: The class was not quite what I expected. Sacchio was a great lecturer, and the discussion sessions were great, but most of the lectures didn't seem to have that much necessary information. Also, this is an extrememly reading intensive course that takes up a lot of time outside of class. I wasn't that impressed by the course.\""
        ],
        "Ulrike Rainer": [
            "review 1: \"07F with Ulrike Rainer: There is a ton of reading. A ton. This term, we had a midterm exam but no final. It's a good idea to do all the readings and attend the all the lectures (lecture once a week, discussion groups twice a week) before the midterm. After the midterm, all readings and lectures become severely optional. The lectures do not help you understand the readings. Discussions do. Antonia Syson is a fantastic woman.\"",
            "review 2: \"07F with Ulrike Rainer: The class is really geared towards helping students understand and gain an appreciation for \"great literature,\" genres they possibly have not been exposed to before, and new ways of reading texts. It was certainly a great choice for me to take this seminar, get 2 literature courses out of the way, and read lots of great books that I would want to read anyway. Also, the writing for this class is not very intensive, and only 3 papers are required all term. These three professors were all great as well.\"",
            "review 3: \"07F with Ulrike Rainer: The course looks great on paper, as you probably know from reading the ORC description. However, not much is done with the great works of fiction studied in the course. Every week, there are two seminar discussions with a discussion leader and one lecture with all of the seminar groups. The seminar groups are basically just people debating about the various merit/bad points of the book, without much input from the professor. Generally, they're not very interesting. The lectures are terrible. All the professors alternated and they usually just read from a paper they had written on the book, which was terribly boring. Also, they went to straight to analyzing the finer points of the book without going over basic principles. Overall an easy class with good reading material, but rather boring because of lectures/ unproductive seminars.\"",
            "review 4: \"07F with Ulrike Rainer: I took this course because I wanted to get a good survey of western lit. Being forced to read books did indeed accomplish that, but I would have been better off reading them on my own. Lectures were pointless and rarely went beyond a basic historical context of the novels we read. Discussion was boring and uninspired--despite the class only being an hour long, I was always counting down the minutes waiting for it to end. In all honesty, I found Sparknotes more insightful than class. The papers are fairly easy and you can get away with not doing all of the reading, but it's still not worth signing up for. Take a more interesting first year seminar, even if it involves more work. I'm supposed to take this course next term because it's a two-term course, but I opted for a new first year seminar instead.\"",
            "review 5: \"07F with Ulrike Rainer: Lots of reading for this class, as you might expect, but not too difficult to follow. Only 3 essays with the chance to revise the first two, Prof. Kopper was available to talk with about essay topics, etc. As long as you stay on top of readings and doing the essays on time you should be set. Sometimes lectures/discussions were a bit boring, some of the things brought up seemed to be pointless things to be discussing, but overall an interesting course that allows you to read and discuss classic pieces of literature.\"",
            "review 6: \"07F with Ulrike Rainer: The course has so so so so so much reading, but if you can keep up with the reading (AND ONLY if you can keep up with the reading), the course is worth it because the discussions are interesting, the papers aren't SO difficult to write, and there is no research component so you are encouraged to speak your mind and write what you feel. But if you don't keep up with the reading, it will be a miserable 10 weeks for you.\"",
            "review 7: \"07F with Ulrike Rainer: This class has a lot of reading, and a lot of different subjects. I took it because I wanted a solid Humanities foundation in literature, and I think it has given me that and therefore I am satisfied with it as a first year seminar. I think it showed me that I am not a huge literature fan, in that I was so immersed in such a density of literature all the time from this class that it jaded me quite a bit. I would suggest that you only take this course if you are sure you want to. I do think it is probably more useful than other seminars where your topic range is so specific and focused and not very helpful in more everyday situations. As for professors, I think it's pretty much a toss-up whether or not you get ones you like and have good experiences. That is unfortunate, but I was lucky :).\"",
            "review 8: \"07F with Ulrike Rainer: I like reading, but I admit, I struggled through the readings in the course...in that I had to read them in time. I failed to read most of the books in time for discussions--I barely read them before the essays were due. I'm a good student, but the readings were too much back-to-back-to-back, with no time for breathers. Most of the readings were interesting, but the task of finishing a whole book in a weekend is a daunting task. PLAN WISELY! Plus, the fact that the Classical Tradition is a two term class for both FALL AND WINTER, REALLY REALLLY REALLLLLLLLLY causes problems--decide wisely if this is what you want to do. It is inflexible, and you're stuck in a course...and it'll be too late. The essays are interesting to write about, although if you're not trained to write, can (and will) prove to be a challenge. The group lectures, on one hand, were the most ineffective, I felt. The background information proved to be dull and lifeless, and many people simply zoned out or used the time to catch up on their readings. I felt like they could have eliminated the big lecture hall type lecture.\"",
            "review 9: \"07F with Ulrike Rainer: This course is a good introduction to the \"great books,\" and not all the selections were rigidly canonical and boring. Works just off the beaten track of traditional literary courses (e.g. The Metamorphoses, Orlando) added valuable and interesting perspectives on the central theme of personal transformation. However, we also read over-analyzed warhorses like The Odyssey and The Metamorphosis. Unfortunately, the weekly/bi-weekly combined lecture sessions were sort of a waste of time. All three professors were insightful lecturers, but often fell back on cursory contextual presentations which could have been easily (and more engagingly) introduced in the smaller sections. I felt I learned more, and enjoyed the class more, in the discussion sections. Kopper, Rainer, and Syson were all great professors--informed, personable, and communicative. Professor Syson especially is an exceptional teacher with an obvious passion for academic discourse.\"",
            "review 10: \"07F with Ulrike Rainer: I took this class because the book list interested me, but I found I didn't like the books as much as expected which really colored the experience for me. Also as part 1 of a first year seminar I expected my writing to improve and I don't feel like it did. For me no other seminar looked interesting but if one does to you take it not this!\"",
            "review 11: \"07F with Ulrike Rainer: The books that we read were great - very diverse, very interesting. The discussions were good and sometimes funny. The work is very manageable, and the papers are not too hard to write. Keep in mind that it's a two term seminar, and make sure you actually want to be in it for 2 terms.\"",
            "review 12: \"07F with Ulrike Rainer: This course requires a lot of reading. Most of it will be fairly interesting, and discussions could be fun (depending on the professor).\""
        ],
        "Suzanne Brown": [
            "review 1: \"10F with Suzanne Brown: This was a nice overview of Western literature and the choice of books was great. However, the first half of the course is a fair amount of work because you start with reading the Iliad very quickly and then you basically read a book or two a week, and the mid-term requires some detailed memorization of plot points, characters, and quotes. The second half is much easier (the books are shorter and you just need to write a final paper). I had Brown for discussion section and she was good at eliciting interesting discussion and drawing answers out of you. (I don't remember much about the other profs).\"",
            "review 2: \"03F with Suzanne Brown: I didnt have Suzanne Brown's section, but bc of the way the class works she, my prof and the other one took turns lecturing once a week. The lecture were terrible. The class is three sections of 20 kids who all assemble once a week or so for lecture and the two profs (Graver in Classics? and Brown) who were not my prof gave some of the most boring off-topic clearly-of-interest-to-themselves-and-no-one-else lectures i have ever heard. It was like a different class. I think this was as a result of this class being interdisciplinary and not fitting into any one category. Prof Kop's lectures were whimsical and almost painfully wonderful, like when you get that extremely shy ten year old to sack up and play the kick ass violin concerto you know he can in front of people. He puts things very, very well. He was off-topic too, but no one minded because his lecture were good. In class he was depreciatingly funny and a great prof. who really cared about the material and really wanted us to...in a kind of 'please like this precious material that i love, please' kind of way that was both endearing and easily ignorable. Wow, i am a bad person. There was a lot of reading, and it really is expected that you do all of it. The midterm had extremely random stuff on it (like the date that Shakespeare's first folio was published) that i thought was unimportant so i didnt study and got a D and was pissed until i went to office hours and he said ver quietly that the reason dates are on there is that they really want the history to come alive for you and it's hard to do that if you don't realize that Shakespeare's England and Austin's are really as disparate as the dates profess, as Aeschylus's Greece differs from \"Homer's\". So I was like yeah good point. I learned a good amount in this course, mostly that my writing didn't suck as much as my bitter high school teachers said it did and I read a lot of books that I never would have read or understood had I tried out of a class. You should take it. If you can get in.\"",
            "review 3: \"03F with Suzanne Brown: This course covers a ton of classic works, which is nice because it really gives you a good base in literature. But don't take this course unless you're really going to do all the reading, which amounts to about a book a week. I ended up only skimming parts of the works and primarily relying on sparknotes, which didn't really work. The only way to get a good grade in this class is to actually do all of the reading. Brown is a capable professor. She cares a lot about the material. I do feel like I've become a better writer as a result of this course.\"",
            "review 4: \"03F with Suzanne Brown: This crash course through the classics of Western literature was a really interesting seminar.\"",
            "review 5: \"03F with Suzanne Brown: Professor Kopper was awesome...the other profs, not so much.\"",
            "review 6: \"03F with Suzanne Brown: I thought that the way papers were graded in this class was not great. The professor was an excellent teacher, but the focus for the papers was not what it should have been in my opinion. Students were rewarded for writing simplistic papers that could be comprehended by a five year old. No attention was given to encouraging students to think complex thoughts in their papers or to developing their own unique writing style. The papers that were valued seemed predictable and homogenized. I am not saying this because I did not do well on the papers, only because I felt like I had to write not like myself for the class. I hope that I have not been influenced as a writer by this class. I felt like I had to sell out to a specific standard to get a good grade. I don't think I learned much about how to be a good writer in this class, which I think was largely the point of it.\"",
            "review 7: \"03F with Suzanne Brown: This course is GREAT!!!! if you can keep up with all of the reading, and paper writing. It moves very quickly from book to book and I would say that lack of time to get through everything is its biggest downfall. If you think you can handle it though, I would definitely sign up for this course. The professor really helped improve everyone's writing too.\"",
            "review 8: \"03F with Suzanne Brown: The course was taught by 3 profs and the satisfaction of each student depended on how well the styles of student and teacher matched. The profs are great and the course was interesting!\"",
            "review 9: \"03F with Suzanne Brown: Overall, I enjoyed this seminar. I was in Professor Brown's section, and I think that our class had pretty good discussions with her asking the pointed questions. Even though the lecture component was sometimes boring, I enjoyed them--all the profs obviously (to me, anyway) really knew their stuff and it made a nice break to just sit and listen sometimes instead of discussing. They didn't test us on the lecture material either; in fact, Brown told us not to dwell on something discussed at length in lecture in our papers. The papers were pretty tough, and are the reason I didn't take the second term. However, now that I've written them, I'm sort of proud of them. Brown schedules an hour to go over everyone's paper with them and gives you great feedback. She also lets you do rewrites for an additional grade. I'm not sure about the others, but I'm pretty sure they do too. I generally enjoyed the readings. I don't think they are really your standard classics list, but they are a pretty wide ranging group. The first half of the term was spent on the standard classics--we read Agamemnon, the Odyssey, and the Inferno, and wrote a paper on each. The next part was more interesting because the works were more recent and we got a break from papers. The only thing I really didn't like was Omeros, because I never knew what was going on. Damn vague epic poems.\"",
            "review 10: \"03F with Suzanne Brown: The lectures in both this class and humanities two are a total waste of time. After the first midterm, attending the lectures is a waste of time because you will probably fall asleep. Other than that the material is great and the papers engage the material pretty well. It's a course worth taking.\"",
            "review 11: \"03F with Suzanne Brown: This course basically forces you to read all those classics you've been meaning to get to for years and naver have and never will unless you take this class or others like it. The course has two parts: the bulk are small group discussions, the quality and interest of which depend on a large extent on the prof (I found Brown excellent, but be wary of Kopper), and the other third are larger lectures, uniformly dull and pointless. The papers are tough, and what you write will get ripped apart by the prof - fortunately, Brown rarely gives lower than B's, but A's are nigh impossible to attain. Let's face it, this class is about the books, which you will have to read, no way around it, so if you're looking for a bit of a challenge and the list of titles appeals to you, go for it.\""
        ],
        "Andrea Tarnowski": [
            "review 1: \"22F with Andrea Tarnowski: This class was not was I was expecting. Having to submit a separate application for this course along with the general writing essay had me convinced that this class would be something very special, but it was just okay. I found 6-7/9 of the works we covered to be particularly interesting, but I feel as if we had no time to really appreciate any of them too well because of how rushed the class is. A typical week is reading around 40-80 pages per class, writing a reaction post, attending two discussion and a lecture, then moving onto another work. Then, every three weeks you would have to write a paper that became increasingly harder to do well on. Tarnowski is an extremely tough grader, and although she does provide feedback I felt as if I was making no progress as a writer. The discussion environments vary per each prof, but Tarnowski's felt very claustrophobic. Instead of a usual student discussion where the prof barely intervenes and it is the students doing most of the talking, Tarnowski would only let one student speak then bring the point back to what she had to say, and then try to redirect to people who have been raising their hands for thirty minutes. I would only recommend this class if you truly do have a passion (and time!) for reading, and if you are already a very talented writer. Don't take this class just for the prestige.\"",
            "review 2: \"22F with Andrea Tarnowski: I would seriously think about whether you want to take this course. Don't get me wrong: I loved the lineup of books that HUM 1 had, and I was really interested in the overall idea or theme of the course. But the theory of HUM 1 runs into numerous obstacles when put into practice. First off: many freshmen, myself included, forget that you have to buy your own books in college. This course had like 10 books; the prices WILL add up. Everyone rushes to Still North Bookstore at the start of the term to get them asap; if they run out, you have to order it on Amazon and get it sent to your Hinman box but that can take time. So just think about whether you can afford that or look into getting in some other way (library, online trial, etc.). The class generally had the following structure: Lecture at the beginning of the week (Monday); seminars—discussing the book of the week—during the other two times we would meet later in the week (in our case, Wednesday and Friday). But events, unexpected things like a day of caring can throw the carefully crafted schedule into disarray. You might end up with only one seminar on a book. The lectures were hit-or-miss—most were bad or just all over the place. You basically read a book a week and then attend a \"meh\" lecture only to discuss it for like two seminars and then quickly move on to the next work. This tends to mean that you don't get to dive deep into the books you're reading; given the outstanding books we got to read, this was extremely disappointing. The seminars will vary a lot because of the professor leading the discussions; mine was Tarnowski and she had a tendency to speak for a bit too long while guiding the conversation in an overly structured manner (in my opinion). Freshmen will also be freshmen of course, so many people will try their best to impress (who? I don't know) and slightly turn it into a senseless competition that many others had wished to avoid in order to genuinely focus on the books. That freshman urge to be \"extra for the sake of competition\" or compete when there's no need is something a lot of people have carried over from high school; it will fade with their time at Dartmouth, so you hopefully only have to bear it for a bit. Do I regret taking HUM 1? I don't think so. At the end of the day, you get to read amazing books and you'll form little groups of friends that you can discuss them with. You write three papers and a discussion post for every book/movie, so the workload is not terribly burdensome. Keep both the good and the bad in mind and make your decision.\"",
            "review 3: \"22F with Andrea Tarnowski: I wouldn't recommend it. The readings were my favorite part. Like the other commenters said, the lectures most of the time didn't add all that much, and our discussions were static. Prof. Tarnowski spent most of the time sharing her own opinion—and considering it fact—instead of facilitating what I hoped would be an open discussion amongst the students. It felt often that we were all trying to impress her, rather than advancing the discussion in any meaningful way. Her grading was very harsh, and focused a disproportionate amount on writing style rather than the actual content of the papers themselves. Sometimes she would give feedback specific to a single word, and after you changed it to what she wanted, she would still take points off. This class was my least favorite of the three. I figured that because I had the opportunity to take it, I might as well, but I got very little out of the class.\"",
            "review 4: \"22F with Andrea Tarnowski: My biggest complaint about the class was that there was just too much material. With 10 texts (8 books, 1 movie, 1 poem) in 10 weeks and only 2 hours and 10 minutes of discussion per week, we didn't get into any meaningful depth about anything. Also some of the lectures just didn't make sense at all and didn't add any meaning to the text whatsoever. My other complaint would be that the professors really didn't have an in-depth understanding of all of the material. They were reading some of these books for the first time when we did! Which is kind of frustrating because it means they can't offer as much insight into the text. Finally, this might be a hot take but I really did like Tarnowski, even though I wish she had let discussions kind of free-flow rather than facilitating them so closely. Given the opportunity, I don't think I would have taken this class again, but I don't regret taking it.\"",
            "review 5: \"21F with Andrea Tarnowski: Tarnowski is a pretty tough grader. It seemed like our median on papers was a B+ compared to other sections being an A-/A. Discussions are alright. The readings were a mixed bag. Some of the lectures were absolutely awful and not at all helpful.\"",
            "review 6: \"19F with Andrea Tarnowski: Professor Tarnowski is kind of scary at first but she is a fair grader and just wants the best for everyone. She is my mom and I would die for her.\"",
            "review 7: \"19F with Andrea Tarnowski: Hum 1 is a great course in theory, but I thought it was often poorly or ineffectively executed. Bringing together a bunch of students who love English, want to participate in class, and be taught by a dozen different professors is a great idea. The individual works were all interesting, but not enough time was given to understanding how they can be related to each other. The lectures were often so rudimentary that it barely added to high school level content or were just boring. Discussions were often interesting, but Professor Tarnowski never facilitated the open discussion everyone wanted: we always just raised our hands (which no one wanted). Comparative to a Writing 5 class, Hum 1 has more reading but much less writing: three short-medium length essays total and a weekly discussion post. Tarnowski is a fair grader but disproportionately focuses on style than on content. I understand that this class is in part supposed to improve writing ability, but this aim was never given significant discussion time in class. Overall a good class because of the works and the other students (compared to my experience with a writing seminar the following term), but not a layup because of the expectations for writing and the often extensive readings (the amount varied with each work each week). So in summary, I can see the benefits of taking Hum 1 instead of Writing 5, but also opting for a seminar instead of Hum 2 was the best course of action considering Hum 1's experience.\"",
            "review 8: \"19F with Andrea Tarnowski: Professor Tarnowski is a good professor and fair grader who gives good feedback and makes discussions interesting. Would recommend.\"",
            "review 9: \"19F with Andrea Tarnowski: I greatly enjoyed HUM1 with Professor Tarnowski. Compared with my peers in writing 5, we had FAR less writing assigned but more daily reading. The course is structured to have 1 group lecture and 2 section discussions per week, and I found myself looking forward to discussion but apathetic about lecture. Often, I wished the lectures would go more in-depth rather than spending half the time giving a bio of the author. However, Tarnowski was an excellent section professor, a little scary at first, but ultimately thought provoking and even funny at times. Reaction posts are easy, essays are graded fairly and the deadlines are humane. Would recommend.\""
        ],
        "Margaret Williamson": [
            "review 1: \"06F with Margaret Williamson: This course is great if you absolutely love reading classics and deconstructing and overanalyzing them. As I do not, I found the class somewhat painful. However, discussion sections (my leader was Prof George Edmondson) were quite fascinating, it's a great way to meet new kids, hear different opinions, and truly discuss the (sometimes) extensive, (sometimes) complex, and sometimes profoundly weird material (in the case of Kafka and Freud).\"",
            "review 2: \"06F with Margaret Williamson: The workload was very light, especially compared to what I'd been told. It definitely did not give a comprehensive or intriguing overview of humanities, let alone world civ.\"",
            "review 3: \"06F with Margaret Williamson: the best part of this was definitely the discussion section. it was fascinating to hear what other intelligent people got out of the reading selections. just watch out for the final essay that's assigned over the week of thanksgiving. the only work was the reading (which MUST be done) and the 3 essays. fodor's section was loads of fun.\"",
            "review 4: \"06F with Margaret Williamson: This course was a great chance to read the books I've always wanted to read. I was in Professor Edmondson's section, and while he always had good insights into the reading, I wish he had directed the discussion a bit more, as it often got off-topic. The essay topics steadily improved throughout the course, and Professor Edmondson gave excellent feedback. I appreciated the opportunities to re-write the first two papers. It was a bit much to have both a midterm and a final exam, in addition to three papers, but none of them were too difficult. If you pay attention to the readings and leave yourself enough time to do everything, you shouldn't have any trouble.\"",
            "review 5: \"06F with Margaret Williamson: This class was enjoyable for many of my classmates, but it was rough for me. After high school, I think I was Westerned-out. Studying humanities probably wasn't the best decision I made, since this class basically had all of the best writers in the class (definitely not a self-call: i was not one of them). I dropped out of second term - it just wasn't for me, and grading on the essays was very tough. If you like Kafka, Shakespeare, or Beaumarchais, however, it may be for you.\""
        ],
        "Colleen Boggs": [
            "review 1: \"22F with Colleen Boggs: Biggest regret of freshman fall. please take writing 5 if you can. profs grade so unnecessarily harshly for a writing course which would be 10x easier if you took writing 5\"",
            "review 2: \"22F with Colleen Boggs: This class is not nearly as bad as other posts make it out to be. It is a lot of reading, yes, but with the preface that the professors literally email you in July to start reading the texts over the Summer. I knew so many students who complained about the readings and then when I asked if they had followed the directions and started reading during the Summer, they said no. Either way, I found the readings to be quite fascinating. If you don't have time to finish a book then most of the time you can get away in discussion (what I ended up doing with one book I just didn't like). The course has two books of literary theory/not actually literature in Decolonizing the Mind and Civilization and Its Discontents which while very dry, were absolutely necessary for understanding the other texts on a deep level. Then the rest of the works were split between 3 novels, 1 movie, 1 poetry collection, 1 epic poem, and a short story collection??? (I'm not entirely sure how to classify The Decameron). Professor Boggs was pretty easily able to help us connect the all the works despite them often being written thousands of years apart which I thought was pretty cool. Boggs is super knowledgeable despite specializing in 19th century literature so even when we were discussing something like The Oddessey she always had deep insights on the text. One thing I wish Boggs did better with was provide more support along the writing process because while the first essay goes through a draft process, she really pulls back during the second and third papers which made it hard to know if you were even writing a good paper to begin with. Still, Boggs is not a harsh grader; I turned in some wacky shit and still got A-'s and A's. Definitely take this class if you like literature or writing or just having a good discussion.\"",
            "review 3: \"22F with Colleen Boggs: The essays in this class were definitely tough, and the professors do grade harshly. If all you care about is getting a good grade, take writing 5. However, if you like literature and want to voice your opinions about classic lit in a room full of equally motivated individuals, this class is right for you. It will help you become more observant while you read and will make you a better writer overall, which will definitely help in other classes. Boggs always had an upbeat attitude and was truly engaged with the material. If you choose to take HUM1, try to take it with her.\"",
            "review 4: \"22F with Colleen Boggs: This course certainly lives up to its reputation - it really is a lot of reading. Happily, the selection of works is (mostly) classic, so you can certainly expect an incredibly enjoyable and illuminating reading experience. The lectures were fairly hit-and-miss; some of the lecturers were clearly very knowledgeable and engaging, while others seemed blatantly unprepared and seemed to ramble aimlessly about loosely connected quasi-intellectual topics. The discussion groups, similarly, offered a lot of insight some of the time, whereas other times they were incredibly awkward. For one, Prof Boggs is not only incredibly knowledgeable, but also a very pleasant person; you can really tell she's listening to each and every contribution to the conversation, while also adding to it and using it to steer the discussion. However, this can also feel a little bit more like a session in Parliament rather than a book discussion, as it sometimes feels quite restrictive. It doesn't help that, oftentimes, the people in the discussion group don't seem to have been educated in how to articulate their thoughts properly during high school, so it often has a habit of turning into a bit of rambling (~90% of the time about race or gender), which makes the proceedings slightly awkward some of the time. However, as hit-and-miss as the rest of the course is, the thing that really shines in this course are the books themselves. As cliche'd as it may sound, reading these great authors really does make you into a better, more well-rounded human being, and as such, I wholeheartedly recommend you take this course.\""
        ],
        "Roberta Stewart": [
            "review 1: \"22F with Roberta Stewart: Professor Stewart is a very intelligent and caring professor! She offered extended office hours when we had our writing assignments and pushed us to get to what we actually wanted to say even if we did not know it yet. She compared doctors with the modern gods when we were on our way to her car after office hours due to an appointment she had to run to. Professor Stewart is very passionate about the Odyssey and the experience of veterans and does work with real-life veterans reading the Odyssey (not in a conservative way). She also knows Greek!\"",
            "review 2: \"21F with Roberta Stewart: This class is the definition of freshmen who just got into the ~ivy league~ so be warned: it can give off some serious elitist vibes. Nonetheless, it was a really cool class and a great introduction to the canon and works from around the world. Professor Stewart gave good feedback, but I have to say I didn't really like her as a professor in general. She tended to be a bit abrasive and honestly out of touch with the students a lot of the time. Not the worst professor, but definitely made a class I loved into one I kind of just of dealt with.\"",
            "review 3: \"20F with Roberta Stewart: I enjoyed this class. Professor Stewart is sharp as a tack and pretty chill as long as you participate at least somewhat frequently. She definitely cares about making sure that students improve their writing, and she is very insightful too. Sometimes class discussions can run over the end of class but it's usually worth it. If you're willing to do a lot of reading of old and rather wordy literature, this is the class for you. The workload is pretty tolerable (3 essays, 1 weekly reaction post). Definitely would recommend if you like reading and discussing classic texts. 9/10.\"",
            "review 4: \"20F with Roberta Stewart: Love it!!!!! Prof Stewart is absolutely the best! There is quite a bit of reading, 3 essays and 1 weekly reaction post. Discussions are pretty chill and kinda fun. You can definitely get a good grade if you do the work.\""
        ],
        "Klaus Mladek": [
            "review 1: \"19F with Klaus Mladek: Prof Klaus was an extremely attentive teacher, well-read philosopher, and reasonable grader. HUM is a lot of reading (usually 1 work per week) but relatively lighter amounts of writing than other Writing 5 courses. We had 3 papers (ranging from 3-8 pages) and response posts (1-2 paragraphs) due 3x a week, except when there is a paper due. The course has 1 lecture and 2 seminars per week, and participation starts at a B for all students (how participation is graded is probably my least favorite part of the course, because you never know how you're actually doing). The course is a little more superficial than I would like, but that is the nature of a 10-week quarter and having to read and analyze so many works. HUM1 was incredibly Western-focused, as well, so no philosophical ideas from the East were introduced. I would recommend HUM to students who 1) enjoy fictional reading, 2) enjoy applying the fictional reading into argumentative essays and discussions/ arguing about philosophical ideas, and 3) understand the limitations of this course, in that it is more of a shallow survey-style class than an in-depth review.\"",
            "review 2: \"19F with Klaus Mladek: HUM 1 is organized into lectures and discussion groups. The discussion groups depend on what prof you get. Mladek was incredibly interesting and interested in the reading, so his discussion group was always really engaged and interesting. The lectures, however, were hit or miss: depending who gave them, they could be really interesting or incredibly boring. The course itself was a lot of reading, but very light on essays, esp compared to other WRIT5 courses. The class could be grating at times, but it all depended on your discussion group (90% of the class was with discussion groups).\"",
            "review 3: \"19F with Klaus Mladek: A fantastic introduction to the academic standards and writing style expected by many Dartmouth professors. Professor Mladek was an incredible professor and instructor during discussion. The large lectures with everyone were a drag because everyone was such a tryhard in those settings, and the work was somewhat intense, but I would say worth it if you want to put in the extra effort.\""
        ],
        "Devin Singh": [
            "review 1: \"22F with Devin Singh: Singh is a very interesting, intelligent prof and was always super approachable/willing to answer questions and go over ideas for the papers. I feel like my writing improved due to his high but reasonable expectations. I wish he had been a little bit more specific and helpful when it came to feedback on papers, as it wasn't always clear what he wanted. I also wish I had listened to what upperclassmen and other people had told me about Humanities and just taken Writing 5. Discussion could easily feel pretentious, surface-level, and kind of a waste of time. There isn't enough time to really dive into each text, and I don't think I got much out of this class as a result. The one thing that was better than expected was the workload-- the amount of reading isn't as bad as people say. The majority of the lectures weren't engaging or really on-topic with how we were analyzing the texts in section. If you're going to take Humanities, I would say Singh is a great prof to take it with. That being said, I wouldn't recommend Humanities as a whole.\"",
            "review 2: \"21F with Devin Singh: This class was somewhat interesting and required an average amount of work. The readings were often absurdly long but you could get away with skimming or skipping parts. The once-a-week lectures were great because we weren't responsible for any of the material. Some people regularly skipped them. Discussion was often surface level but was occasionally interesting. If this class had a heavy workload or difficult grading it would not be worthwhile, but thankfully it does not. The reading list changes every term, so if it really interests you, then take the class. Including the final paper there were three essays due for the whole term which required a large amount of effort, but since there were so few the average workload was not bad at all. There were also weekly reaction posts on canvas of a couple paragraphs but Professor Singh along with most other profs graded them for completion. The essays were not graded generously but the lowest grade the prof would give was a B-. The catch is that participation and the reaction posts were worth 35% of the final grade, which inflated the grades massively as basically everyone got 100% or close to 100% for both of those. Professor Singh was a great prof, he was kind and approachable and he made discussion as interesting as he could.\"",
            "review 3: \"21F with Devin Singh: Devin is the goat. Super engaging, very kind, and gives great feedback. It wasn't the easiest class, but with him I felt like my writing got much better.\""
        ],
        "Kenneth Walden": [
            "review 1: \"20F with Kenneth Walden: When Walden is your section lead, this class is chill AF. If you care, read the material, come to class with some insightful comments, and the course will breeze right by. You'll have weekly 1-2 paragraph \"reaction posts\" where you can essentially write whatever you want to about the weekly reading, and about midway through the course, Walden won't even care enough to give you feedback on what you're writing. The essays hold most of the course weight, so keep that in mind. When you're with Walden, the more specific you can make your thesis, the better. If you don't have strong prior writing experience, I'd highly recommend RWIT, because the grading can get pretty tough. Walden is actually the sweetest person on Earth despite his deadpan humor, and he will really help you during his office hours if you take the time for it.\"",
            "review 2: \"20F with Kenneth Walden: Professor Walden is lovely! Absolutely amazing section leader; always did such a great job of facilitating discussion among students without dominating the conversation. I love the way he graded my papers--his grading was maybe a bit harsher than what I was used to in high school (B+ or A- averages I think?) but always very fair. By the third paper (technically the 5th submission, I think, because we submitted drafts for two and got comments back) I felt like I could read my own paper and anticipate the comments he would leave, so I could fix them before submitting. My writing definitely improved in his class :)\"",
            "review 3: \"20F with Kenneth Walden: Hate Hum 1 – maybe because I'm not a literature/writer person, but Walden wasn't that approachable and his grading was harsh. The course flew so fast that you were barely even rewarded for reading for a course, because you would talk about an entire book in only 1 or 2 classes, so it felt like such a waste of time. Take a different first-year writing instead – Hum 1 is definitely not worth it. Not that interesting and super time-consuming, with so many papers.\""
        ],
        "Michelle Clarke": [
            "review 1: \"19F with Michelle Clarke: I love Prof. Clarke and want to be her when I grow up. Papers are not bad, readings are really interesting, class is really fun. Can't go wrong.\"",
            "review 2: \"19F with Michelle Clarke: Professor Clarke is the \"tough\" one out of the HUM 001 professors, but being in her class is such a rewarding experience. She's incredibly wise, articulate, and funny, and you can tell she wants to create the most productive and helpful learning experiences for her students. Her ability to guide conversations and raise thought-provoking questions definitely made every conversation in our section insightful and interesting. Her feedback is detailed, honest, and helpful. One of my classmates said she's like a female Gordon Ramsay, which I think is very true. The worst thing about HUM 001 was probably the big group lectures (the lectures themselves were good, but the quality of the audience participation was occasionally very sketchy...entertaining, sure, but sketchy).\""
        ],
        "Darrin Mcmahon": [
            "review 1: \"22F with Darrin Mcmahon: He is a kinda scary prof at first. He makes effort though, he is available and gives very useful feedback. Unfortunately, he is a hard grader though. But it gets easier the more you follow his expectations. You can't choose who get as a Hum 1 prof i guess but if you do get Darrin, be ready for some harsh days at first.\"",
            "review 2: \"20F with Darrin Mcmahon: This is a great class. The readings are well chosen and very interesting, though there's a lot of reading to do (and it's not easy). Prof. McMahon was a great professor. He was a hard grader and a very intimidating teacher at first (seriously, look him up if you haven't already), but he gave great feedback and was always open to meet with you if you needed more clarification/help. The workload is manageable (not easy, but not incredibly hard either)... 1 reaction post a week (McMahon graded them, some professors just gave credit for completion) and three essays of gradually longer length. Those essays were the real portion of the grade, so a bad grade on a couple reflection posts wouldn't doom your grade (though a bad grade on an essay could). Class discussions were very interesting, and McMahon was always there to provide interesting perspectives and interpretations. Overall, I'd recommend taking this class if you have the opportunity.\""
        ],
        "Analola Santana": [
            "review 1: \"21F with Analola Santana: To all the incoming freshmen, do NOT take this class. It is not worth the time and effort. Honestly, you get very little out of it, and the texts are only discussed on a very surface level. Further, Analola could not care less about helping students progress in their writing (which is supposed to be the course’s purpose). She didn’t give feedback on essays, and grades seemed to be completely random. Just take writing 5, get an easy A, and go on with your life.\"",
            "review 2: \"21F with Analola Santana: This course was organized into lectures on the text with the whole 100-person cohort and then discussions with the smaller 14-person class. The lectures were not that helpful-- especially when the professor of that text went too fast or hyper-focused on a tangent. The discussions were enjoyable and my class was genuinely brilliant/had interesting conversations. Grading is fair and reaction posts/participation inflates grades. Go to RWIT, ask questions, and you will do great on essays. There are three essays: a close reading of a passage in one text, a thematic reading of a whole text, and a comparative analysis of two texts. Professor Santana is sweet and understanding as well! I recommend this class.\""
        ],
        "Petra Mcgillen": [
            "review 1: \"20F with Petra Mcgillen: I loved Professor McGillen SO much!! such a sweet lady, and obviously very interested in the material. Overall, the class was minimal work, and the lectures were irrelevant. I literally napped through every lecture, and though the lectures enhanced the course, they were not necessary at all. 10/10 would recommend!\"",
            "review 2: \"20F with Petra Mcgillen: This class was my absolute favorite. I debated a lot with myself before taking this class because I heard there’s a lot of heavy reading. Yes, there is a lot of reading. We learned about approximately 8 texts (including ones by Nietzsche, Vergil, Adam Smith, Goethe, Gabriel Garcia Marquez, Boccaccio, etc.) and a few films (directed by Renoir, etc.) But you don’t read the entire book for many of the texts, only sections of it. So don’t panic. There’s less writing to compensate for the heavy reading. The workload consists of daily readings, weekly reflection posts that are completion based, and three big essays. There’s plenty of time to complete the essays--you turn in two drafts for each paper. Discussions are really the highlight of the class and are the most fun. It’s important that you participate! There’s a lecture usually once per week, and the professors take turns lecturing based on their field of expertise. Many of the lectures were interesting and really provided helpful background information or introduction to texts or movies. The BEST class I’ve taken in quite a while. Professor McGillen is the BEST. She’s a happy professor in the German department and knows a lot about media studies. She facilitates discussions of the best quality, makes sure everyone gets the chance to talk in class, acknowledges the contributions made by each student, and incorporates what’s been said into the discussion. Her expectations are very clear and her grading is incredibly fair. She’s the type of professor that you would absolutely want to meet in college and keep in touch with. She’s always more than happy to meet with you outside of class during office hours and gives incredible feedback on your essays. Also very understanding and willing to help if you’re taking a class from a different time zone or have an extenuating circumstance. Even if it’s not HUM1 that she’s teaching, do take her class because I ensure you that learning with Professor McGillen will be a very rewarding experience!\""
        ],
        "Lucas Hollister": [
            "review 1: \"20F with Lucas Hollister: A great teacher for this class! Super knowledgeable, kind, and relatable. Although a true academic and professor at his core, he defiantly let his fun personality enliven the class. A tough grader, but will push you to be a better writer. It is clear that he cares and is the best professor one could hope for if you need to take a class online (for COVID or other reasons); he almost always is on his computer so he responds super quickly and is always able to find time to meet with students. Gave us free donuts after the last class even though it was virtual (we went to Lou's to get them)\""
        ],
        "Antonio Gomez": [
            "review 1: \"19F with Antonio Gomez: The organization of this course is truly terrible and incoherent. There are new lecturers every week and the overall course themes (ours was \"love\") are way too broad. That being said, if you end up getting a good prof for the discussion section, the class is actually very enjoyable. Gomez was great at leading discussion and really helps your writing.\""
        ],
        "Pramit Chaudhuri": [
            "review 1: \"12F with Pramit Chaudhuri: Course: What's crucial to know is that this course is very classics-heavy, and they mean classics as in Greek and Roman literature, the ancients. Everything ties back to them (Iliad, Plato, etc.) so if you're only interested in literature in general and not necessarily classics, this may not be the course for you. That said, I was not particularly enamored with the greco-roman classics either, but I don't regret reading anything in this course. It really all boils down to what professor you are assigned for discussion section. Some, like Chaudhuri, are not as great at facilitating discussion between the students themselves (rather than with just him), but others I've heard have great discussions, so it all depends. You will, however, be guaranteed a group of peers in the class who really care about doing well and that rubs off - apathy is something that doesn't carry well in a class like Humanities 1/2. Professor: Professor Chaudhuri loves to tear apart papers. He admitted it himself. It took a couple times, but I think eventually most people in our discussion section were hardened to his criticism. In person, during office hours, he's markedly different, much... nicer, and he's usually fair in his grading - his expectations are very high and A's are scarce, but he'll reward improvement when he sees it. Workload: It's a lot of reading, and getting ahead on weekends and such is definitely advisable. Also, they give out pop quizzes on the lectures, so make sure to study those before every discussion section, especially key words like Greek terms, names of writers and works of art mentioned in lecture, etc. The papers are pretty spaced out though, so there is plenty of time to go to RWIT and talk it through with them once or twice or even thrice.\""
        ],
        "Udi Greenberg": [
            "review 1: \"22F with Udi Greenberg: Humanities 1 with Professor Greenberg was amazing. Our class discussions were free-flowing and provided the space for us to discuss with our peers, with Greenberg tying together the big ideas. Outside of our discussion sections, I found the class-wide lectures to be fairly disappointing for the most part. Overall I really liked the texts we read this term, but wish that we had taken the time to finish and discuss books such as Decolonizing the Mind more throughly. I think your experience in this class is largely dictated by your discussion prof. Personally, I learned a lot and grew as a writer during this course.\""
        ],
        "Phyllis Katz": [
            "review 1: \"02F with Phyllis Katz: This class was a great freshman seminar. A lot of people think it has an unmanagable amount of work assigned, however that is not true. The books we read were all very interesting, the discussions were fabulous, and the work load was not too hard. There were only 4 essays per term and Prof. Katz was always very helpful in giving comments on the papers. She's also very supportive of re-writes and gives you ample time to complete them. Take this class!\""
        ],
        "Dennis Washburn": [
            "review 1: \"16F with Dennis Washburn: Professor Washburn is absolutely incredible! He is an incredible lecturer and discussion leader. He rapped Lose Yourself and interacts with students on such a personal level. The course itself is great too- lots of great guest lectures, interesting (although sometimes dense af) texts, and a great group of students. A good alternative to writing 5 that exposes you to a lot of classic texts that you might not choose to read yourself but would be happy to have read in hindsight.\""
        ],
        "Levi Gibbs": [
            "review 1: \"21F with Levi Gibbs: I absolutely loved this class with Gibbs. He's a sweet and caring professor who never makes your opinions feel invalid. I also loved my group and we had a lot of fun with discussions. I found the reading amount to be reasonable and enjoyed the various readings we had to do. There were weekly lectures as well, which I felt was hit-and-miss depending on the professor that week. I recalled that a few lectures were absolutely amazing and informative on the book that we were reading. The papers had very open-ended and interesting prompts and I thoroughly enjoyed writing them. I would recommend going to RWIT if you are struggling with these papers. Overall, I am so glad I took humanities and was in Gibbs' section. I ended up taking another class with him and I probably will take more. Amazing prof, amazing class.\""
        ],
        "Paul Carranza": [
            "review 1: \"19F with Paul Carranza: Great discussions, great access to professors across departments. Professor Carranza is such a sweet and thoughtful man. Doesn't give a ton of feedback on essays, but what he gives is really helpful and he's a fair grader.\""
        ],
        "Alexis Dianda": [],
        "Andrew McCann": [],
        "Carolyn Dever": [],
        "Darrin McMahon": [],
        "Hakan Tell": [],
        "Israel Reyes": [],
        "Jonathan Smolin": [],
        "Lynn Patyk": [],
        "Petra McGillen": [],
        "Rebecca Biron": [],
        "Timothy Baker": []
    }
}