{
    "INTS017.07": {
        "Joseph Aguado": []
    },
    "INTS082.01": {
        "Anne Sosin": [],
        "Lisa Adams": [],
        "Ronald Shaiko": [],
        "Sienna Craig": []
    },
    "INTS017.14": {
        "Lawrence Kritzman": []
    },
    "INTS081.01": {
        "Donald Steinberg": []
    },
    "INTS017.12": {
        "Gerd Gemunden": [],
        "Silvia Spitta": []
    },
    "INTS017.11": {
        "John Kopper": []
    },
    "INTS017.10": {
        "Graziella Parati": [
            "review 1: \"21S with Graziella Parati: Lots of interesting reading. Only 2 papers. Come to class with a question or two. She’s an awesome prof who cares about each of her students.\"",
            "review 2: \"21S with Graziella Parati: Loved her! You guys should 100% take a class with Parati. While there was a lot of reading, she usually never really focused the class around it. Honestly, I stopped doing the readings after week 3 and still ended up with an A. All that really matters is that you participate in class and find a nice topic to write your two essays on. These essays can be on nearly anything and she lets you grade yourself on them!\""
        ]
    },
    "INTS017.09": {
        "Yuliya Komska": []
    },
    "INTS017.08": {
        "Annabel Martin": []
    },
    "INTS080.01": {
        "Henry Clark": []
    },
    "INTS018": {
        "Coleen Fox": [
            "review 1: \"21F with Coleen Fox: To begin, I entered this class very optimistic because Global Health is one of my desired fields of study at Dartmouth! The assessments in this class consisted of 2 Midterm Essays (8 total pages / 20%), Another Essay around week 6 (4 pages / 20%), A Global Health Forum Project due week 9 (20%), a Final Essay (5 pages / 25%), and Participation / Attendance (15%). The essay assessments for this class were graded rather rigorously; Professor Fox is looking for specifically cited informations from the readings, so be ready to prioritize those in your week to week studying. The Global Health Forum project was extremely fun and applicable to many spaces in global health academia, as Prof. Fox sets up the assignment like a Forum where groups of 3-4 people each make a poster on an emerging Global Health issue (with solutions) and publish it to the class to be assessed by peers and herself. I think a lot of students liked this assignment! Participation in class is simple as it is around a 50/50 lecture to small group discussion style classroom. Though this allowed us to chat about readings and also pick the professor's brain on the topics we are studying, it got a little boring, inarguably. Professor Fox, however, is a gem. Though she takes the class very seriously, she is extremely knowledgeable and researched in the field, and is open and caring to helping students who want to learn from this class. She also begins the class with a statement that she does not want students to gain any unnecessary stress from her course, and was understanding of extension request, from my experience. Though I would not necessarily call this class a layup, it is relatively easy to do well (get median i.e. A-), and with a little of time and demonstrated interest, an A is within reach! Definitely take this class with Prof. Fox especially if you are interested in Global Health!\""
        ],
        "Abigail Neely": [],
        "John Butterly": [],
        "Lisa Adams": []
    },
    "INTS017.04": {
        "Gerd Gemunden And Silvia Spitta": [
            "review 1: \"21S with Gerd Gemunden And Silvia Spitta: I wanted to love this class so badly. I thought the content of this class was fascinating and very important, and the profs did a great job selecting material. I actually really looked forward to doing the readings and watching the assigned films each week, even though it was a very heavy workload throughout. Profs Gemunden and Spitta were always super fun in class, and did a great job of consolidating and explaining the content. However, I'm not sure if it was because of remote formatting, but I found the class a tad unorganized and the expectations very unclear. A big portion of the final grades were weekly responses to the readings, which should have been a grade booster, but the response was often posted the night before and without any notification during class or through email to let us know that it was open for that day and needed to be done. Also, the midterm and final essay had zero instructions. None of us had any idea if we should be focusing on the migration aspect of the class or critiquing the literary and film aspect of the class in our essays, and asking them during class didn't make it any clearer. I'm genuinely hoping the structure of this class gets better after covid, because the content was genuinely great to learn about.\""
        ],
        "Gerd Gemunden": [],
        "Silvia Spitta": []
    },
    "INTS017.02": {
        "Graziella Parati": [
            "review 1: \"24W with Graziella Parati: Firstly she had to cancel the last two weeks of class because of personal reasons. She is truly an awesome lady and I hope to see her back on campus. It’s a big class 1 midterm and final both open notes. 5 questions max 3 sentences, impossible to get below a 95. Make sure she knows who you are because participation is a massive part of grade and she will give you like a 75 if she doesn’t know who you are. Overall pretty standard layup, hard to not get an A.\""
        ]
    },
    "INTS016": {
        "Coleen Fox": [
            "review 1: \"22F with Coleen Fox: This is a great class. Disclaimer, I am an INTS minor. However, even for a non-INTS minor, this is a great class just to get foundational knowledge of the state of international development today, and the progress (& lack thereof) that's been made throughout history. Fox is awesome. Her lectures are fast and the readings can be dense, but they don't feel overwhelming especially if you are interested in the material. Grades come from class participation (important to refer to readings/past concepts in contributions), one midterm (pretty straightforward but you HAVE to know the readings), your term-long SDG journal project, and a final essay. Definitely not a layup, but the work is engaging if you're interested in the material.\"",
            "review 2: \"21W with Coleen Fox: This is by far one of the most interesting classes I've taken at Dartmouth and I would absolutely recommend it to anyone interested in development. We have sunThere are A LOT of readings (maybe 40-ish pages per class) and you have reference all or most of them in midterm and final essays. However, this is the first class where I've actually looked forward to the readings. My one recommendation is do all the readings when they're assigned and take notes so you can easily use them on the essays. For example, our midterm had many mini essays that each asked us to incorporate direct elements from multiple readings and the final asks us to consider almost everything we've learned in the class. We also have to make a blog journal about a specific development goal in a country, which I think it interesting but a lot of work. Professor Fox has high expectations but is understanding and a fair marker.\"",
            "review 3: \"21W with Coleen Fox: This class was super engaging, with interesting readings and discussions. The major downside is that the readings are long and sometimes hard to digest. Also, lectures were not very interesting and felt tiring (plus they aren't very relevant to the midterm/final). However, Professor Fox made her expectations very clear, and grading was fair throughout the course. Not to mention the fact that she was one of the most understanding profs given the online format. Take this class for sure.\""
        ],
        "Susanne Freidberg": [
            "review 1: \"21F with Susanne Freidberg: I thought I was going to be taking this class as an interesting layup, but I was unforutunately mistaken. The content is interesting, although some of the readings are quite long and dry. Professor Freidberg's lecturing style is not engaging really. You sit for an hour and listen to her talk. There is a midterm for this class that was graded pretty harshly (as are the rest of the assignments in this class) and is a big chunk of your grade. Then, there is a large final project, which you then write an essay for. After that, you still have a final essay to write. I did not find Professor Freidberg to be especially warm towards her students when they were asking for help, or at least it wasn't evident. Take this class if you're interested in international development and are willing to work hard and sit through tiring lectures.\"",
            "review 2: \"21F with Susanne Freidberg: Course Structure: 5%: A 2 page reading response paper 25%: Midterm exam, graded harshly 30%: 8 Post Research journal and summary essay. Focuses on a SDG and development project of your choice 20%: Final Essay 10%: 3 Pop quizzes (lowest dropped) and Perusal reading annotations 10%: Participation Thoughts: Very challenging course workload wise. There are plenty of readings for each class, and although you can get away with not doing all of them the day of you will eventually need to at least skim through them in order to succeed in the midterm and final essay. Do pay close attention in class and in the readings of case studies. I found the content engaging due to personal interest, even with this Freidberg did not feel like the most open and warm Professor even in appointment office hours. Lectures were decent and there was a discussion or participation component each class. Very little feedback was given throughout the course as mentioned in previous reviews @ GEOG006. In the end, I did learn a lot especially about how to look and think about development projects, which I find very useful.\""
        ]
    },
    "INTS015": {
        "Christianne Hardy": [
            "review 1: \"23W with Christianne Hardy: I honestly can't say enough good things about this class. It is difficult and the readings are challenging but I learned more from this class than most other classes I've taken. If you're interested in conflict/ international relations, take this class! It's really fascinating and if you put in the work, you will enjoy it. I really love this class and I really like Prof Hardy. She's tough, but she will make you think about conflict in different way and she's super smart. You will learn and Hardy keeps it interesting. I also like the balance between lectures and group activities in this class. If you don't do the ready, Hardy won't get on you about it but she does expect you to invest in the structure of the class. Great class.\"",
            "review 2: \"23W with Christianne Hardy: Super interesting class. On the easier side but still not a layup, you definitely have to put in the work and show her that you have understood the readings. She is a toughish grader and will want you to earn every point. Take this class if you are at all interested in war, international, relations, and politics. However, be warned that class rarely touched on current events which was a disappointment to me. Grades: 10% participation, 10% short paper, 25% midterm 1, 25% midterm 2, 30% final paper.\"",
            "review 3: \"22S with Christianne Hardy: Super conflicted about this class. Hardy is really nice and knows what she is talking about, but spent a lot of lecture making pretty simple points that didn't require a ton of critical thinking or class discussion. Wasn't a layup but also wasn't terribly difficult (readings that you didn't really have to do, 2 midterms, 1 750 word response, research paper).\"",
            "review 4: \"22S with Christianne Hardy: Hardy is wonderful but certainly plays favorites. She liked me so not too much to complain about but I heard from other students who had a much tougher time while still producing work that was the same quality as mine. Closed book remote midterms x2 and a final project/paper with a short paper mixed in. VERY heavy overlap with Gov 5 so plus if you're looking for something familiar, but also super repetitive. Honestly pretty interesting if you buy in, but no need to put in crazy work. Would recommend.\""
        ],
        "William Wohlforth": [
            "review 1: \"21S with William Wohlforth: I really loved this class. I learned a lot and Professor Wohlforth made it super easy to research topics that you were interested in. Class makeup was: 25% Midterm 1 - all short answer, about 50 1-sentence responses in 50 mins. Super time pressed and very curved. 25% Midterm 2 - half short answer and 3 essay questions, far more reasonable. 30% Analytical Paper - about 3000 words, argumentative paper on any class-related topic that you were interested in 10% Short Paper - about 750 words, exposition-style news article on a topic related to class 10% Participation - easy to ace as long as you are engaged with readings Before each class, Wohlforth assigned readings for the topic of the day that could take between 1-2 hours to properly read and digest and gave a series of questions to think about. Occasionally there were posted lectures to view prior to class as well. In-class time was all discussion between students with Wohlforth occasionally contributing. This class really forced me to think about violence and international security in a way that I hadn't before. Could be repetitive if you've taken GOVT5, but still approached topics from a different lens.\"",
            "review 2: \"21S with William Wohlforth: This was a great class with a medium time commitment. Definitely a dense amount of readings for each class, but I'd say you didn't need to read them all super thoroughly to be prepared. However, I'd recommend doing so because the midterms really depend on them. The midterms are the only thing I'd change about this class. There were so many essay questions within a short period of time, I didn't finish the first one and barely finished the second one. Midterms were open note but due to the time you really need to know the material. Even though I didn't do great on the first one though I still ended up with a decent grade. Wohlforth is great though, one of the best profs I've had at Dartmouth. Made the class really engaging and was always available for office hours and was really helpful with final papers. This class got me into the INTS minor so if you're interested in it I'd totally recommend, as long as you're willing to put in the time.\""
        ]
    }
}