{
    "JAPN049": {
        "Allen Hockley": []
    },
    "JAPN045.01": {
        "Sachi Schmidt-Hori": []
    },
    "JAPN062.02": {
        "James Dorsey": []
    },
    "JAPN061.08": {
        "James Dorsey": []
    },
    "JAPN061.07": {
        "Dennis Washburn": [],
        "Linda Galvane": []
    },
    "JAPN062.01": {
        "Sachi Schmidt-Hori": []
    },
    "JAPN063.02": {
        "Sachi Schmidt-Hori": []
    },
    "JAPN061.06": {
        "Sachi Schmidt-hori": [
            "review 1: \"17S with Sachi Schmidt-hori: Really engaging, interesting class. Hori-sensei is a sweetheart and incredibly interesting professor who brings really cool insights into class discussions. Not knowing an Asian language is definitely fine and won't put you at a disadvantage—Hori-sensei actually loves when students without much experience with Asian languages participate in class. Not a lot of work at all—daily, short readings that you can skim, quick Canvas responses to the readings, two midterm essays (4-5 pages) about a reflection on what we've discussed in class, and a final essay reflection paper (6-7). Everything was graded leniently. This class is definitely a lighter class that inspires thought and interest, and I heavily recommend it as a third class or just out of interest!\""
        ],
        "Sachi Schmidt-Hori": []
    },
    "JAPN059": {
        "James Dorsey": [],
        "Jessica Smolin": [],
        "Jonathan Smolin": []
    },
    "JAPN043": {
        "Ikuko Washburn": []
    },
    "JAPN042": {
        "Ikuko Washburn": [],
        "Linda Galvane": [],
        "Sachi Schmidt-Hori": []
    },
    "JAPN041": {
        "James Dorsey": [],
        "Mayumi Ishida": [],
        "Sachi Schmidt-Hori": []
    },
    "JAPN033": {
        "Mayumi Ishida": []
    },
    "JAPN032": {
        "Ikuko Washburn": [],
        "Mayumi Ishida": []
    },
    "JAPN031": {
        "Ikuko Washburn": []
    },
    "JAPN023": {
        "Ikuko Washburn": [],
        "James Dorsey": [],
        "Sachi Schmidt-Hori": []
    },
    "JAPN022": {
        "Ikuko Washburn": [],
        "James Dorsey": [],
        "Mayumi Ishida": [],
        "Sachi Schmidt-Hori": []
    },
    "JAPN011": {
        "James Dorsey": [],
        "Sachi Schmidt-Hori": []
    },
    "JAPN010": {
        "James Dorsey": [],
        "Sachi Schmidt-Hori": []
    },
    "JAPN003": {
        "Ikuko W.": [
            "review 1: \"07S with Ikuko W.: Prof. Watanabe teaches both sections this time. She also lets us switch sections from day to day, so you should look at the reviews for both sections. She grades much less harshly on the kanji quizzes (which do not happen during class anymore) and ends class on time and doesn't pack too much into the tests without giving us as much extra time as we need (if we have another class, but aren't yet done, she'll tell us to take the test with us, finish it later, and drop it off at her office); on the other hand, the prof has this habit of sending out important announcements over email, and class is much less serious and ... class-ish. There's still drill. Fortunately, it's only three days a week (though which days changed every week, which was really annoying). Just remember to keep demanding an afternoon drill section. We only did two non-textbook readings, but we spent like maybe three weeks total on them. There were random guests, and a skit at the end (which didn't require that you jam as many new vocab and grammar structures in there as you could, thank goodness), of course. The skit was fun, and my group's was awesome, but I felt like we'd put too much time and effort into it when we found out that 30% of the skit grade was going to be class participation after other people's skits. I mean, I don't regret spending hours and hours and hours working on the skit; it's just that finding that out at the last minute was kind of a letdown.\"",
            "review 2: \"04S with Ikuko W.: Never will you ever see an energitic Professor like Watanabe!!!!\""
        ],
        "Dennis Washburn": [
            "review 1: \"05S with Dennis Washburn: this class was awesome not only were the professors awesome but our nihongo class students got reaalllly close and now are ready to go on the nihongo lsa program although it's a heavy burden to wake up every morning at 7:45 i dearly enjoyed having watanabe and washburn sensei together\""
        ],
        "Ikuko Washburn": [
            "review 1: \"20S with Ikuko Washburn: Great class with a great professor! This was my first class at Dartmouth, and I have proven bad at learning new languages before, but I went further than ever with the Japanese sequence because of both the Rassias method and Watanabe-sensei's (she goes by her maiden name) incredibly supportive and understanding demeanor, not to mention her sense of humor! She notices when students are struggling (like myself) and invited them to her always-open office hours which she spends almost exclusively practicing and going over material with students. There is a lot of work, and drill is way too early, but overall JAPN 1-3 was very valuable for me. I couldn't recommend it enough. The only stumbling block is, Japanese is not a n easy language to learn for people unused to similar ones. But Watanabe-sensei will strive her hardest to ease it into your brain. It is a wonderful language, and by learning it you learn a lot about the extremely interesting Japanese culture too. I only wish I could've gone on the LSA+ :/\""
        ],
        "James Dorsey": [
            "review 1: \"04S with James Dorsey: Prof Dorsey is a very approachable, jovial teacher who bases a lot of his classes on the core conversations, but doesn't really expect you to memorize them like Ishida sensei, which is good. The 50 minutes of Japanese go by rather quickly.\""
        ],
        "Mayumi Ishida": []
    },
    "JAPN002": {
        "Mayumi Ishida": [
            "review 1: \"08W with Mayumi Ishida: If you've done well in Japanese 1 and you like the material, get ready for a rollercoaster in Japanese 2. You learn a great deal of vocab and kanji (125) plus new sentence structures. If you struggled through Japanese 1, think about putting in twice the time and effort because that's what you'll have to do in Japanese 2. There was also a wiki project where you research a prefecture and make a presentation on it to the class. Overall, this course goes by too quickly so if you're going to take it, make sure it's the only difficult class you're going to take, unless your THAT good with Japanese.\"",
            "review 2: \"08W with Mayumi Ishida: Listen all you Japanese Anime fanatics, Language buffs, and Badminton players: Japanese is tough. Monstrously tough. It will break you, and suck up all the free time you thought you had coming into this class. For me, Japanese was much more work than all of my other classes for the term COMBINED - which in turn, provided for the most stressful term of my Dartmouth career (and I've had...4 terms so far). I don't think any of the other languages at Dartmouth are taught entirely in their native tongue - they usually start off with English instruction. Japanese is the exception here. There's just so much work required in Japanese for so little payoff (and yes, you Economics majors, I'm counting opportunity costs as well). The Major/Minor in Japanese aren't exactly the most marketable degrees in the world and furthermore, the intensive Japanese sequence requires that you sacrifice many classes in order for you to just achieve the Minor (3 Introductory classes, 3 LSA+ classes, and then STILL a few more classes). Plus...my friends in Chinese and French enjoyed better grades and had fewer time commitments than I had. The class is composed mostly of Anime fanatics from East Wheelock (for at least 2 straight years, the Dartmouth Japanese Program has had a large EW contingent). After about 2 terms, I decided to give up the Japanese Program - and that turned out to be the best decision I have ever made here at Dartmouth (for in the Spring term, I took a 3rd class in place of Japanese 3 which turned out to be extremely pivotal in my Dartmouth career). I know people who are so far behind now in their majors because they committed to the LSA+ (one of them even dropping out of all of his major classes entirely). It's just not worth it. If you're thinking about this class, make sure you're passionate about Japanese language and culture. If you're just another Anime fanatic...well...just get Rosetta Stone instead.\"",
            "review 3: \"07W with Mayumi Ishida: This class is effectively self-taught (though you still have to come to class because the prof takes attendance). About the only thing we do in class is to practice speaking, not actually learn new stuff. If you can't handle teaching yourself everything from the textbook, this course is not for you. What I did not find out, however, until towards the end of the class is that this class is SUPPOSED to be like that, but they didn't bother to include that little caveat on the syllabus. At least we had afternoon drill, so basically if you had morning drill and you overslept/had homework to finish/needed to skip it for some other reason, you could (and were probably expected to) go to the afternoon session. If the prof ever says that they chose not to have afternoon drill because of lack of interest, that is a total and complete lie. Poll your classmates and DEMAND it. That's what one of my classmates did at the end of last term, and it worked. The end-of-term project this time is a presentation instead of a skit. It's a page long and you have to memorize what you've written and present it to the class with pictures or other visual aids. Just be prepared to have to present during reading period, which is what we had to do. We also had to come in and take a kanji quiz (this class doesn't have any other kind of quizzes) during reading period. I don't think either of those things is allowed, but you shouldn't find that surprising because the prof seems to think that Japanese is special and not subject to the rules that every other class is subject to.\"",
            "review 4: \"07W with Mayumi Ishida: Dartmouth de wa, Nihon-go no jugyoo wa totemo muzukashikute hayai desu yo. The Japanese program at Dartmouth is hard and fast. For those of you who have taken Japanese 1, that class seems almost leisurely compared to Japanese 2, and that's saying something. Ishida is a hard teacher and a hard grader. She expects you to know all of the material in the reading before coming to class, including memorization of dialogues in Japanese, new vocabulary, and new grammatical forms. She'll talk to everyone in class several times, and if there's one thing you didn't study or can't remember, she'll find it. For much of the term, my hard work was inspired pretty much by fear. It also doesn't help that about a third of the class comes in with prior knowledge of Japanese, giving others something of a disadvantage. That said, you'll learn more in this class than in other language classes. The teaching is very effective.\"",
            "review 5: \"06W with Mayumi Ishida: Both Ishida-sensei and Watanabe-sensei are great professors; they know what they're doing. Japanese 2 feels more accelerated than Japanese 1, and it's definitely easy to get confused with all the new kanji and grammar flying at you. But as long as you keep up with everything, doing a little everyday, then it's fine. And it's fun being with the same bunch of people you know from Japanese 1.\"",
            "review 6: \"05W with Mayumi Ishida: The material is not too tough, but the class goes really quickly, which makes the class a pain in the ass (but worth it). Professor Ishida is nice, and she gives really effective lectures.\"",
            "review 7: \"04W with Mayumi Ishida: This course is excellent!!!!\""
        ],
        "Ikuko W.": [
            "review 1: \"22W with Ikuko W.: A wonderful class with a wonderful prof. Because of her understanding and hilarious demeanor, her class is significantly less stressful for me than Ishida Sensei's was in Japanese 1. I really enjoyed Ishida Sensei because she was very charismatic and the very high expectations helped me learn a huge amount and learn it well, but Watanabe Sensei's slightly more relaxed (but still demanding) class is all I could take to be able succeed academically while doing a musical this term. If you have a lot of extracurriculars or another time consuming class, I highly recommend Watanabe Sensei. (Also, she's so nice? She invited us all to her office at the end of the term for homemade matcha) Class format: Tests about every two weeks, two short take-home kanji quizzes per week, one 3-4 page homework assignment per week, a few new kaiwas every day.\"",
            "review 2: \"05W with Ikuko W.: Watanabe Sensei is crazy/a lot of fun. The class is tough and goes really quickly. If you feel discouraged taking the course, don't give up. Japanese 3 seems much less mechanical than the Japn 1 & 2.\"",
            "review 3: \"05W with Ikuko W.: Japanese is just a ton of fun. The professors are really great. Can keep me awake in the mornings.\"",
            "review 4: \"05W with Ikuko W.: Team taught by Watanabe-sensei & Ishida-sensei, the same format as Japanese 1, so you don't have to worry about what class you get put into - the students and the teachers will be shuffled around. A lot tougher than Japanese 1, so if you're taking this as your language requirement be sure that you're willing to put in the time commitment and stick it out until the end. I imagine Japanese 3 isn't going to be any easier. It's a great course, great professors, & friendly/cool kids taking it. Plus, I feel like I'm actually learning to speak another language, which is great. Drill is a bit of a pain (four days a week from 7:45-8:30 - there's no afternoon option), but on an up note it's a nice time to bond with your peers.\""
        ],
        "Ikuko Washburn": [
            "review 1: \"23W with Ikuko Washburn: The nicest prof ever. She is so kind but still kept her standards. Our class consistently would not read the kaiwas (lol) and she grew to not mind at all. Her class seems to emphasize the useful parts of Japanese (speaking, not Kanji) and was overall really fun.\"",
            "review 2: \"20W with Ikuko Washburn: Great class with a great professor! This was my first class at Dartmouth, and I have proven bad at learning new languages before, but I went further than ever with the Japanese sequence because of both the Rassias method and Watanabe-sensei's (she goes by her maiden name) incredibly supportive and understanding demeanor, not to mention her sense of humor! She notices when students are struggling (like myself) and invited them to her always-open office hours which she spends almost exclusively practicing and going over material with students. There is a lot of work, and drill is way too early, but overall JAPN 1-3 was very valuable for me. I couldn't recommend it enough. The only stumbling block is, Japanese is not a n easy language to learn for people unused to similar ones. But Watanabe-sensei will strive her hardest to ease it into your brain. It is a wonderful language, and by learning it you learn a lot about the extremely interesting Japanese culture too. I only wish I could've gone on the LSA+ :/\""
        ]
    },
    "JAPN001": {
        "Mayumi Ishida": [
            "review 1: \"23F with Mayumi Ishida: This is a difficult and time-consuming class, so do not take this class if you are going to be taking other difficult classes or have other intense time commitments! Ishida Sensei is very nice, but her tests are harsh (I always ran out of time before the end). There are a lot of homework assignments graded on completion which cushions your grade for the tests (of which it was not uncommon for the lower score to be in the 50s). As someone who is naturally bad at learning languages, I always felt like I was a step behind the rest of the class, although about a third of my class dropped because they were struggling so much, leaving mostly just the people who already knew some Japanese coming in. Despite the stress this class put me through, I did learn a lot and will be continuing to Japanese 2.\"",
            "review 2: \"22F with Mayumi Ishida: A very fun, engaging, and worthwhile experience. However, DO NOT take this if you are planning to take other hard classes in the same term. Japanese 1 does not conform to the \"language classes are easy\" generalization. Firstly, 8 meetings a week (5 classes, 3 drills) is quite a commitment. Secondly - although I will say that the work itself was not particularly hard IF you pay attention in class and at least skip the textbook - assignments are plentiful and can really add up even if you manage your time correctly. Lastly, the Japanese language requires a lot of memorization (Hiragana, Katakana, Kanji, long form/short form conjugation, and kaiwa - conversations to be memorized for each class) so it is challenging and time-consuming in that way. Despite all this, Ishida-sensei was a fantastic teacher and super nice, and I am impressed at how much I learned in only 9 weeks. If you want a quantification of work, it was 1 sheet of character memorization per weekday (Hiragana, Katakana, or Kanji), listening practice and homework sheet weekly-ish, and quizzes weekly or sometimes twice a week. Four exams and a final exam, all timed. Ishida-sensei was a fair grader so pay attention and do the work and you'll reap the benefits.\"",
            "review 3: \"22F with Mayumi Ishida: NOT a layup at all with Ishida. The class is heavily split up into sections for exams, quizzes, homework, in class participation, drill, attendance, etc. This is definitely not an easy language course simply because Ishida grades pretty hard. We learn so much through the Hiragana, Katakana, Kanji and actual course material so there's a lot to keep memorizing throughout the term. That being said, exams were very fair and if you could keep up in class and read Ishida's Japanese textbook, you could get 95+. It would be kinda annoying asking questions in class because sometimes Ishida just deliberately would pretend to not understand you--so just use Jinglish and try your best. Drill was extremely annoying with how Ishida mandated the drill instructors to dock attendance grades just downright ruthlessly. Other than that, if you want to learn as much Japanese as possible within 1 term, I'd recommend this class with Ishida.\"",
            "review 4: \"21F with Mayumi Ishida: I took this class during my first term at Dartmouth, and it was undoubtedly my favorite. Ishida-sensei is super fun and engaging, and overall teaches this complex language very effectively. Also, I was able to create some really close bonds with my classmates because of the amount of time we spent together though class 5 days a week, drill 3 days a week, and doing homework. My classmates were all super funny, friendly, and different from each other, which will probably be true every year, and took the class for lots of different reasons (yes, beyond anime). The struggle came in with self-directed study outside of class. The workload is intense and there are currently no tutors, so if you're coming in knowing no Japanese (like I did) you'll need to work hard and may want to ask your more experienced classmates for help. In my experience this last year (2021), there were at least two take-home quizzes every week and remote, timed tests once every two or three weeks.\"",
            "review 5: \"18F with Mayumi Ishida: Very good language class. You learn a lot, but the workload is pretty large. Its not in big spikes though, its spread out. Uses every x-hour and has morning drill four times a week. Ishida-sensei can be intimidating, but she's actually really friendly and just wants to help you learn.\"",
            "review 6: \"17F with Mayumi Ishida: Ishida sensei is great, BUT it is so unfair that Watanabe sensei's class was allowed to take home quizzes, mid-terms while we need to finish everything in class with time constraints. If two classes have vastly different teaching styles and expectation, then the two classes should not be graded together. It is an unfair curve.\"",
            "review 7: \"15F with Mayumi Ishida: Having taken two different languages at Dartmouth, I could not more strongly recommend the Japanese department. Ishida-sensei has high expectations, but her class's workload is about equal to that of other department. Moreover, since the department is fairly small, the profs are very available and willing to get to know students.\"",
            "review 8: \"12F with Mayumi Ishida: Course: Fast-paced! It was my first term at Dartmouth with the whole 10-weeks thing to get used to, but still, the amount of material covered is super impressive for language learning. But the class is GREAT -- usually very small, and the prof is always directly engaging you and your classmates (often via conversation with you) every minute of the class. It's fun and very low-key in class (lots of silly sentences result). Almost all of the material is initially self-taught via homework that usually just tells you to look at the textbook (it'll be pretty obvious in your small class the next day if you didn't do it)--and the textbook is free and online. The major drawback to the class is that the only drill section is 7:45am. Yikes. But in my class at least we went to breakfast together afterward in the time between drill and class, which was fun. Oh, did I mention that after the first day you don't speak English in the classroom anymore? (Don't worry--somehow it all works out.) Professor: Ishida-sensei can seem a little intimidating at first, but she really wants you to succeed! And she's excellent in the classroom. The one thing is, if you want to ask her questions in ENGLISH, you have to go to office hours (or you can ask your drill instructor). She is very generous grading most work (quizzes can sometimes be harsh if it's fill-in-the-blank and there can't be partial credit, but if there is a partial credit opportunity, she has been known to take off one-tenth of a point for a mistake, just to give you an idea). Workload: Because class is 5 days per week, there's a LOT of time invested in nightly homework (most of which isn't turned in, but it is immediately and painfully obvious if you didn't do it, and it'll be a nightmare catching up for the next quiz or test since they happen on a pretty regular basis). That said, if you keep up every night or almost every night, there's not going to be a single day when you're crushed by the workload from this course--it's pretty well spaced out and constant (with new material every two days), so even though I spent the most time outside of class on Japanese versus my other two courses, it wasn't the direct cause of any near-sleepless nights.\""
        ],
        "Ikuko Washburn": [
            "review 1: \"21F with Ikuko Washburn: She is hands down the best teacher I've ever had. Japanese is a daunting task but she makes it easy and enjoyable. She also grades very easily; she only cares that you are learning. She is also very quick to respond and will provide extra practice sessions beyond office hours if you ask. Would 10/10 recommend to fulfill the language requirement and also just to learn another language.\"",
            "review 2: \"19F with Ikuko Washburn: Great class with a great professor! This was my first class at Dartmouth, and I have proven bad at learning new languages before, but I went further than ever with the Japanese sequence because of both the Rassias method and Watanabe-sensei's (she goes by her maiden name in class) incredibly supportive and understanding demeanor, not to mention her sense of humor! She notices when students are struggling (like myself) and invited them to her always-open office hours which she spends almost exclusively practicing and going over material with students. There is a lot of work, and drill is way too early, but overall JAPN 1-3 was very valuable for me. I couldn't recommend it enough. The only stumbling block is, Japanese is not a n easy language to learn for people unused to similar ones. But Watanabe-sensei will strive her hardest to ease it into your brain. It is a wonderful language, and by learning it you learn a lot about the extremely interesting Japanese culture too. I only wish I could've gone on the LSA+ :/\""
        ]
    }
}