{
    "JWST020.01": {
        "Michael McGillen": []
    },
    "JWST015.02": {
        "Susannah Heschel": []
    },
    "JWST011.02": {
        "Moshe Naor": []
    },
    "JWST060.02": {
        "Veronika Fuechtner": []
    },
    "JWST007.02": {
        "Klaus Milich": []
    },
    "JWST053.01": {
        "Irmela von der Luehe": []
    },
    "JWST013": {
        "Eli Rosenblatt": [],
        "Shaul Magid": []
    },
    "JWST042.11": {
        "Susannah Heschel": [],
        "Tarek El-Ariss": []
    },
    "JWST015.01": {
        "Andrew Caplan": []
    },
    "JWST010.05": {
        "Edwin Seroussi": []
    },
    "JWST005.01": {
        "Sergei Kan": []
    },
    "JWST044.01": {
        "Andrew Simon": [
            "review 1: \"24S with Andrew Simon: Retweet whatever the 23F review says and more. Take this class YOU CANNOT GO WRONG. You'll learn an incredible amount of context and history about the Middle East, both part and present; about political efforts to rewrite history and how states have manipulated narratives over genocide, colonialism, the US invasion of Iraq, etc. I'm not someone who speaks in class usually, but I genuinely really enjoyed engaging with the material. (It did get depressing at times because the films were so heavy on violence and suffering.) Prof Simon can really command an audience and facilitate discussion. Workload is moderate, at times felt a bit heavy - you have to watch a film for each class, sometimes readings too, and in the first half of the term we wrote weekly discussion posts. The final project is a lot. But the class in totality is absolutely worth it. Take this class - you will not regret it!!!\"",
            "review 2: \"23F with Andrew Simon: Wow. I am simply blown away. Today was our final class and I am honest to God emotional about it. This is a truly special class. Engaging, provocative, challenging (intellectually not workload wise) with an exceptional professor. Professor Simon reminds you why you pay the big bucks to go this school. He literally was in Cairo for Arab Spring -- the man is brilliant and funny and captivating to listen to. This is without a doubt the most I have learned in a Dartmouth class. The structure goes like this: two movies assigned per week plus some readings (and a discussion post). A couple students lead a discussion based on those materials and the whole class engages. Sounds simple yet it's quite effective. Beyond that, it's just a final! Not too shabby at all! You can write a 18 page paper, make a podcast + a 4 page paper, or do an art piece with an 8 page paper for that final. The last day of class, he brought us pizza and gave a little speech about how important this class was to him. I legitimately teared up. He is one of those professors that is intimidating, not because he is scary or intense, simply because you crave his approval. He is so eloquent and kind and just exactly what a professor should be. A+++++ for this class. I am a senior year and I am so happy I took this class. Wow. I am genuinely sad it is over.\""
        ]
    },
    "JWST040.06": {
        "Daniel Behar": [
            "review 1: \"21W with Daniel Behar: This class was fascinating. Prof. Behar (who I believe is leaving soon for the Hebrew University of Jerusalem) assigned historical, cultural, religious and artistic readings to paint a good picture of both the Jewish and Muslim history of this holy city. We learned about the Temple Mount, the later destruction of the Jewish temples, the building of al-Aqsa mosque and its place as a \"usurper\" of the previous site, and later Christian interpretations. We read widely, but the readings were not too long. I could almost PICTURE Jerusalem through taking this class. Prof. Behar will be missed. There were a few papers, but Behar did not grade harshly, and focused more on original \"takes\" and ideas. Previous knowledge of Jewish studies or travel in the Middle East is helpful to understand this class.\""
        ]
    },
    "JWST007.07": {
        "Andrew Caplan": []
    },
    "JWST024.06": {
        "Daniel Behar": []
    },
    "JWST066.04": {
        "Daniel Behar": []
    },
    "JWST066.03": {
        "Ezzedine Fishere": [],
        "Klaus Milich": []
    },
    "JWST028": {
        "Susan Ackerman": []
    },
    "JWST007.05": {
        "Michael McGillen": []
    },
    "JWST074.01": {
        "Deborah Forger": [
            "review 1: \"20S with Deborah Forger: Very interesting class, despite taking it during our first remote term. Prof. Forger made sure we were engaged in the material but was also understanding to our personal situations. The course material was definitely interesting, and she even sent us samples of ancient writing tools which further brought to life the course material. Prof Forger had very well organized lectures which fully contextualized the life and influence of Jesus. Would recommend to anybody from any religious background who has an interest in the life of Jesus and his early followers.\""
        ],
        "Lily Vuong": [
            "review 1: \"23X with Lily Vuong: Interesting class at first but it gets a bit boring because most of it is history heavy/text parsing. Vuong is a great lecturer, she tries her best to make it engaging. The class structure seems a bit disorganized. Definitely a layup though- midterm, final, and two short-ish papers. And she’s a very nice grader.\""
        ]
    },
    "JWST075": {
        "Susan Ackerman": []
    },
    "JWST014": {
        "Sina Rauschenbach": []
    },
    "JWST045": {
        "Andrew Simon": []
    },
    "JWST007.06": {
        "Rachel Greenblatt": []
    },
    "JWST044": {
        "Andrew Simon": [],
        "Seth Anziska": []
    },
    "JWST012.01": {
        "Francois Guesnet": [],
        "Rachel Greenblatt": []
    },
    "JWST036.02": {
        "Israel Yuval": [],
        "Jeremy Cohen": [],
        "Shaul Magid": [],
        "Susannah Heschel": []
    },
    "JWST027.02": {
        "Alan Lelchuk": [],
        "Dennis Washburn": []
    },
    "JWST007.01": {
        "Steven Kangas": []
    },
    "JWST085": {
        "Shaul Magid": [],
        "Susannah Heschel": [],
        "Veronika Fuechtner": []
    },
    "JWST080": {
        "Susannah Heschel": [
            "review 1: \"02W with Susannah Heschel: I was a bit reluctant to take this course because I've had so much Holocaust education in the past, but I was sadly mistaken: I knew nothing about the Holocaust compared to what I know now. Prof. Heschel is a true scholar of Holocaust studies and of all the events surrounding and leading up to the genocide. She posses insights which I had never before contemplated and she was able to convey her thoughts to the class clearly and effectively. I highly recommend the Jewish studies program and, specifically, it's chair, Susannah Heschel.\"",
            "review 2: \"01F with Susannah Heschel: Professor Heschel is an amazing, brilliant prof. She is passionate about the material and if you are interested as well, you will really benefit from the course. Additionally, she is one of the most amazing people I have ever met and I regret that I did not get to know her sooner. If you can, try to take a course with her because you will experience a great scholar and a gret individual. As for the material, this is not a gut. This course required a great deal of reading, and was difficult to stomach at times (due to its graphic nature). I've heard this is typical of her courses, but the material is such that you can't just skim one book- you need to put more effort into it. She is not the most difficult grader (papers were the only required assignments, none of great length), but you must have an opinion and argue it, presenting both sides of the argument won't cut it. In short, take a course with Prof. Heschel- it will open your mind, make you a better person, and allow you to study with a respected scholar. Don't bother if you just want an easy course though, she doesn't respond well to students who aren't willing to put time into her courses.\""
        ]
    },
    "JWST072": {
        "James Wright": []
    },
    "JWST070": {
        "Patricia McKee": [],
        "Susannah Heschel": []
    },
    "JWST066.02": {
        "Nadav Samin": []
    },
    "JWST062": {
        "Shaul Magid": [
            "review 1: \"23W with Shaul Magid: This was my favorite class of the term for sure. Firstly, the work load is so light, there is about 5 papers in all, 4 being two pages double spaced, the last being 4 pages double spaced. Secondly, the topics being taught about are super interesting. To be honest, you do not even need to do the assigned readings per class, because the prof will spend the entire next class talking about them completely. 10/10 class\"",
            "review 2: \"23W with Shaul Magid: Really awesome class, very light in terms of writing. I think there were 5 papers in total; the first was a one-page single-spaced imitation paper, the majority were 2-page double-spaced responses to readings, the second to last one was 3 pages double-spaced, and the last was 4-5 pages double-spaced. Magid was awesome and lectured the entire time. Readings could be difficult but he'd go over them the following class. Overall definitely recommend, super interesting stuff.\"",
            "review 3: \"19F with Shaul Magid: A really interesting class. A couple of people didn't do well but that's because they never showed to class. If you show up and put even a tiny bit of effort into the readings it's very manageable.\""
        ],
        "Ehud Benor": [
            "review 1: \"09S with Ehud Benor: Haha I didn't really know how to answer the above questions because this class was unlike any other class I've taken before. It's super easy in that there is really no work required out of you- you basically do two short papers or one long paper and it's on whatever you want and is however long you want and due whenever you want. That being said you can put as little or as much into the class as you want and you'll probably get out of it a corresponding happy feeling. Aside from being ridiculously easy in that there was really little work, (also you never know what your grade is so if you're someone who worries about that type of thing it may be a little anxiety-inducing), it's a really revolutionary course in a lot of ways. Benor's lectures are FASCINATING. He'll completely dive into seemingly random topics in insane amounts of detail and then elegantly pull them together in this beautiful construction of genius. He also is insanely well read in a lot of different disciplines and routinely pulls together tons of connections (AHHH GO TO OFFICE HOURS THIS MAN IS A GENIUS). Benor also completely challenges the way you read. He'll spend all class lecturing on two sentences. He's really good at emphasizing slowing down and really taking in and wrestling with what is being said. That being said, the class is sort of like listening to a brilliant man lecture about really random things and it's hard to keep in mind what ideas are connected to what because the timeline Benor mentions is very loose and he doesn't really give big picture ideas as much as lots and lots of random detail. He also assumes basic Jewish knowledge which I did not have at all so was a little lost in the beginning. I think that if you're not interested in the topic this class would be really boring, but if you're interested it will blow your mind. Just getting to know Benor is such a treat. But don't expect him to \"assign\" you things or \"explain\" why he focuses on what he does. Tying the class together is sort of on you.\"",
            "review 2: \"07W with Ehud Benor: Forget the readings and lectures. You wont understand them. No, you can try to do the reading, and then maybe you'll have a better crack at understanding the lectures, which are delivered without notes and they ramble across subjects and centuries. There are interesting nuggets in them, its coming from a brilliant man for sure. But you wont understand Kabbalah until you pick up some other books not assigned in the course, like Scholems Lectures. Then you can begin to understand whats going on. There is no introduction to Jewish mysticism. You go write into 5th gear from Park, so pick up some other books and go into office hours and he'll answer all your questions if you want to learn this subject. theres no homework. only a couple papers due at the end.\""
        ]
    },
    "JWST061": {
        "Susannah Heschel": [
            "review 1: \"20F with Susannah Heschel: One of the best professors at Dartmouth. Make sure to do the readings because classes are mainly discussion-based. Workload can be a lot at times, but nothing too crazy. If Heschel sees that you are engaging with the material, she will give you a good grade.\""
        ],
        "Shaul Magid": []
    },
    "JWST057": {
        "Theodore Levin": [
            "review 1: \"08W with Theodore Levin: Levin is a pretty easy grader, and relatively uncritical. The guest artists and lecturers were really really cool. The class is not a lot of work and there are not any huge surprises. Take the class to learn material that you would never see in other classes.\"",
            "review 2: \"08W with Theodore Levin: Both profs were obviously very intelligent and the music we listened to and analyzed (Mid East, Central Asia, N Africa) was unusual but very enjoyable. Enhanced my conception of the term \"music\"\""
        ]
    },
    "JWST053": {
        "Rachel Greenblatt": [
            "review 1: \"24S with Rachel Greenblatt: my god this class fucking sucks - she is literally schizophrenic you cannot listen to her for more than a few minutes at a time or your brain will literally liquify. If you're taking this for the course material I literally do not understand you and you're in for a horrible time. If you're taking this for a layup she implemented midterms which she grades absurdly arbitrarily. Horrible fucking class and had to waste an nro on it. NOT A LAYUP!\"",
            "review 2: \"24S with Rachel Greenblatt: Ok so it's a 6B and we all know that it is going to be a very painful experience. With that being said, the class is still very painful because she doesn't have slides and basically just talks to the wall for 3 hours straight. She kinda pulls the midterm material out of thin air, which is scary but she gives you a review sheet which is basically the same thing. Weekly homework is just LESS than 150 work discussion posts (she's a G for that). There are some interesting videos and discussions in class, but I usually just did homework for my other class during that time. She's very passionate and kind, but so disorganized it makes you want to pull your hair out, but if you know that going in and just accept that's how it's gonna be you will be fine. I got a 75 and a 90 on the 2 (20% x2 midterms) and she somehow rounded me up to an A for the class. so despite the suffering I got my distrib, learned something, and raised my GPA, so I was happy.\"",
            "review 3: \"23S with Rachel Greenblatt: I am glad I took this class! The time obviously sucked (6b) but we had no class all of week two and three because of Passover... which in a class that only meets once a week is huge. The workload is incredibly light (like basically one reading a week, which sometimes would be as short as two pages), so if you need a TMV and have other classes with lots of work, I'd do it. Greenblatt is also so sweet and truly cares so much about her students and what she's teaching. Yes it was boring at times (what wouldn't be after 3 hours on a Wednesday night?), but her passion and care make so much of a difference. Overall good class, glad I took it.\"",
            "review 4: \"23S with Rachel Greenblatt: First day of class she said this wouldn't be a layup but it turned into one anyway. Maybe two hours max of work a week to read the required readings or watch a movie. The entire class was pretty much participation based so if you did all the work you got an A. The time sucked but you can sit close to the wall and do other things in class if your laptop is turned away. I learned a lot unintentionally because of the way she'd teach and I'm pretty happy I took this course.\"",
            "review 5: \"23S with Rachel Greenblatt: Okay so idk what happened to the person who wrote the review below me but i LOVED this class. Yes I agree she can be a little boring at times... but its once a week and she means well (she genuinely cares about you if you speak to her). The midterms are fine if you somewhat do the readings (MAX is 2 hrs work a week, but its usually less than 1) and also just go to office hours a few days before the exam and she helps you out a lot. Honestly its way less work than writing a paper and you can get away with not fully knowing the content. you have to get a 95 for an A so can only loose 5 point over the three exams (they are /20, /20, /30) but its not that hard, she also give a lot of extra credit opportunities that you can use to boost the grade. If you want an A you can get it with a little bit of work, or if not an A- is easy to get.\"",
            "review 6: \"22S with Rachel Greenblatt: She is sweetest professor ever and genuinely cares about the wellbeing of her students + is super accommodating. People need to speak up more during class it honestly doesn't matter if you have no idea what's going on just please say something--it sucks when she asks something to class and no one responds but the same few people and she tries to get other people to speak up. Took this for the distribs but honestly a super interesting class and I actually did the readings. Greenblatt is just a great human being all around\"",
            "review 7: \"20X with Rachel Greenblatt: This class was very interesting and fairly engaging. Professor Greenblatt is clearly very knowledgeable and passionate about Gender and Judaism. I had never taken a Jewish Studies or a WGSS class before and, even though this is a pretty specific and specialized class, I didn't feel out of my depth at any point. As was mentioned in another review, Professor Greenblatt tends to go off on tangents pretty often, some are more related to the class and others not so much. Regardless, if you can deal with the philosophical discussion model, the grading for the remote summer term was not difficult at all. There was only one medium-sized research paper at the end of the term which we worked on throughout the summer. Greenblatt was also very accommodating regarding pandemic related issues and conflicts and she is a genuinely nice and caring person. I recommend this class if gender studies or Judaism interest you at all, it was a very interesting time and a great TMV distrib!\"",
            "review 8: \"20X with Rachel Greenblatt: Prof Greenblatt is really interesting, really passionate, and really chill. She was by far my most considerate and accommodating Professor this term, and managed to keep us engaged despite lessening our workload considerably. Her style is a bit (a lot) digressive, so I wouldn't take her class if you thrive on lectures or linear structuring, but if you're interested in the course she has a lot to say, and we've had some really good (if not particularly course focused) discussions. I can't speak for a normal term, but her online grading is very lenient and it's easy to do well as long as you complete the work.\""
        ]
    },
    "JWST051": {
        "Veronika Fuechtner": []
    },
    "JWST042": {
        "Lewis Glinert": [
            "review 1: \"13F with Lewis Glinert: Course: I thought the course was interesting and gave me a different perspective on the Arab-Israeli conflict. However, I took it for a layup and I found the work to be more than I expected and the subject matter to be rather dry. Professor: I thought Professor Glinert was engaging, but I didn't thing he was a fair grader and when I asked him for further explanation, he was particularly unhelpful. He was fairly eccentric, and discussions in class tended to be random. Workload: The workload was manageable but more than what I expected. The readings were dry and the movies ranged from interesting to downright painful.\""
        ]
    },
    "JWST041.03": {
        "Steven Kangas": []
    },
    "JWST040.03": {
        "Daniel Rubinstein": []
    },
    "JWST040.01": {
        "Ezzedine Fishere": [
            "review 1: \"24W with Ezzedine Fishere: Fishere is a great prof and challenges students to thing critcally. He grades harsh and arbitrarily which is unfortunate considering there are 3 graded group submissions a week (2 reading respones and 1 film review). Only take this class if you plan on speaking in class because if you don't your grade will drop signficantly like mine did.\"",
            "review 2: \"17W with Ezzedine Fishere: Fishere is interesting. I feel like a lot of his grading is arbitrary and slightly biased. Normally participation would bring you up, but the average participation grade was a 50% for my class despite everyone participating every day. He's not super clear in lectures either. Despite all of this, you'll probably do just fine in the class. Just don't assume you're going to do well just because you work hard.\""
        ],
        "Shaul Magid": [
            "review 1: \"23W with Shaul Magid: Biggest layup I have ever taken at Dartmouth. I didn't even go to class most of the times and got an A. We had only three assignments/assessments: a take home midterm, a film review (that I think everyone got an A), and a take home final. If you want a really easy class and get some distribs done, just take this class. The class is really interesting too, and you do learn A LOT. He is not a very good lecturer to be honest, very confusing and tends to go back and forth a lot. But you don't really need to learn a lot to succeed. Also if you don't get in it, try to email him the first day of class because that's how a bunch of people got in.\"",
            "review 2: \"22W with Shaul Magid: shit was fr vibes 💯, we were chillin and hangin out all day on god, my dude was mad chill and built us up like the young kings and queens we are\""
        ],
        "Abigail Jacobson": [],
        "Bernard Avishai": [],
        "Seth Anziska": []
    },
    "JWST037.02": {
        "Irene Kacandes": []
    },
    "JWST037.01": {
        "Samuel Kassow": []
    },
    "JWST036.01": {
        "Christopher MacEvitt": []
    },
    "JWST034.02": {
        "Susannah Heschel": []
    },
    "JWST026": {
        "Lawrence Kritzman": []
    },
    "JWST024.02": {
        "Lewis Glinert": []
    },
    "JWST024.01": {
        "Nurit Ben-Yehuda": []
    },
    "JWST022.01": {
        "Michael Bronski": []
    },
    "JWST021": {
        "Andrew Caplan": []
    },
    "JWST016": {
        "Lewis Glinert": []
    },
    "JWST011": {
        "Susannah Heschel": [
            "review 1: \"19X with Susannah Heschel: This class was not what it was made out to be. While it was definitely not hard material, the quizzes had really specific and irrelevant material which actually made it somewhat difficult to do well in the class without excessive amounts of studying random dates. If you were good at memoizing and putting in a lot of time, it was possible to get the grade you wanted. But if you are looking for a layup--this is not really one. Also, there were three professors that switched off throughout the term which made it annoying and they were often condescending and aggressive (to be expected with a 200 person class though).\"",
            "review 2: \"19X with Susannah Heschel: Oof, what a terrible class. Extremely disorganized and way too big to have any kind of serious discussion. The quizzes were often more difficult than the in-class lectures. Heschel is an arrogant, self-righteous prof who puts as little effort into the class as most of the students. She is easily one of the worst profs I've had at Dartmouth. I cannot stress enough how much I regret taking this course. Don't make the same mistake as I did.\"",
            "review 3: \"19X with Susannah Heschel: Was not much of a layup during sophomore summer since you have to put a lot of work into the class to get the grade you want. ESPECIALLY with the \"3 to 4 minute reading quizzes\" as they were called in the syllabus, which ended up being 25-minute unit quizzes and tested on really specific information. Homework is easy and pass/fail, you need to attend 2 discussion groups, and there's a pretty big final. Other than that, Heschel is a super engaging lecturer and a wonderful prof.\"",
            "review 4: \"19X with Susannah Heschel: As a normal class, I guess it was pretty easy, but this was a terrible layup. Weekly quizzes that are super specific (remembering 20+ dates down to the day?), along with pointless homework assignments, a lot of reading that no one does, and a take home final. I wouldn't recommend this to anyone that just needs an easy distrib.\"",
            "review 5: \"19X with Susannah Heschel: Thought it'd be a layup and although the material wasn't hard it was a lot and took forever to get through. Do not take this class if you're expecting to do nothing.\"",
            "review 6: \"19X with Susannah Heschel: This class was weird this summer. 2/4 quizzes were hard and you had to produce information that you didn't expect to have to produce (dates of events down to the month or the day). Heschel didn't lecture much, which is disappointing since she's a hugely important scholar in the field. If you showed up and took good notes, you only needed to spend a few hours the evening before studying for each quiz. It was just annoying because our lectures were very analytical about our topics but the quizzes were just spitting out info. It wasn't really a layup. I found some lectures really interesting and others boring. If you're looking for a random layup for the summer, maybe choose another class, since it seems like the profs intentionally made it weird and unpredictable to change its layup status.\"",
            "review 7: \"17X with Susannah Heschel: I'm torn with this class. It's definitely a layup, but you only have so many courses at this school... some parts of this class honestly felt like a waste of time. Heschel is a lovely person, but her lectures were extremely disorganized. She often tried turning our 100 person class into a discussion, and then ridiculed the class when no one would speak up. Obviously, people didn't speak up because there are 100 people in the room, but Heschel seemed to think that no one would speak because no one did the reading. Of course some students did not do the reading, but I mostly think that people were just so scared to talk. 4 quizzes, and you definitely need to study a bit for them. The midterm was also hard, but there is Extra Credit opportunities. You can easily get the grade you want, but I think very few people leave this class satisfied. Unless you're dying for an A and an easy class, I would recommend taking some more interesting, better organized.\""
        ],
        "Daniel Behar": [],
        "Eli Rosenblatt": [],
        "Francois Guesnet": [],
        "Rachel Greenblatt": []
    },
    "JWST010": {
        "Rachel Greenblatt": [
            "review 1: \"24W with Rachel Greenblatt: Great class--60% of the grade was participation but I also learned a lot. It's easy to not do the work and get a good grade but if you put a little bit of work in, you can actually learn a ton about the foundations of Judaism. Highly recommend if you're okay with doing a term of a 6B.\"",
            "review 2: \"23W with Rachel Greenblatt: W class, W professor, W layup. Highly recommend. 👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍\"",
            "review 3: \"23W with Rachel Greenblatt: Avoid Greenblatt. Although the course is super easy and a total layup, she is so disorganized and unclear that it makes it painful to sit through class. She is never prepared and seems to know very little about Jewish history in depth, so she instead discusses Jewish religious traditions that are irrelevant to the study of Jewish history. Greenblatt has pretty clear expectations and a good Canvas page, and she tries her best – she is also super nice — but the course is really boring for anyone interested in Jewish history. Try taking a course with Magid or Ackerman instead.\""
        ]
    },
    "JWST007": {
        "Michael Bronski": [
            "review 1: \"08F with Michael Bronski: Bronksi was an awesome teacher! He genuinely cares about his students and he made sure that we were assimilating into the Dartmouth culture as freshmen even as he taught us about jewish women. There is alot of reading for this course but you can really pick and choose what you think is necessary. Papers were doable, especially because we were able to turn in first drafts which is more than can be said for other seminars. However, don't go in thinking this will be a class all about sarah silverman and betty boop. they are mentioned but this class focuses far more on their predecessors.\"",
            "review 2: \"08F with Michael Bronski: I took this class because it had fantastic reviews on this site. I don't think it lived up to those reviews. The class discussions often lacked direction, and we rarely discussed the readings much, so most people (including me) rarely bothered to do them. However, Bronski is a really caring and passionate teacher. He was committed to helping us all the way through the writing process, and gave us the opportunity to revise our papers before putting an official grade on them. I do think his class has given me a greater understanding of what it means to be a woman and to be Jewish in America, and of the minority sensibility in general, even though before this class, I had been skeptical of such minority studies.\"",
            "review 3: \"08F with Michael Bronski: Professor Bronski is great. He is really enthusiastic about the course and really wants to help his students. Is very available for meeting outside of class or offering help via blitz. Some of the readings are lengthy and a little uninteresting, but not at all difficult. He grades fairly and often gives rewrites. Really improved my writing! Great seminar; definitely recommended!!\"",
            "review 4: \"06F with Michael Bronski: I would not have taken a course on this subject otherwise, but it was interesting. Bronski is a really good guy.\"",
            "review 5: \"06F with Michael Bronski: This class was pretty interesting and fun. We watched a lot of movies and listened to comedy recordings. Class discussion was boring sometimes as it seemed like no one had much to say (probably because this was a 10A freshman fall for all of us). Bronski is a great teacher and an even better person. He was so helpful during office hours--let us re-write anything. He is also a genuinely nice person and took an interest in our lives outside of class.\"",
            "review 6: \"06F with Michael Bronski: I watched some absolutely lousy movies for this class (we got to choose which movies to write for very short response papers), meaning I got to watch the type of entertainingly bad cinema that you love to watch for fun, and got graded for it. it was fantastic. then again, i love pop culture, so it was my cup of tea. bronski is a very easy grader and loves to see you at his office hours. he is very flexible with deadlines and open to extensions. TAKE THIS CLASS! oh, also, i never did ANY of the readings. seriously.\"",
            "review 7: \"06F with Michael Bronski: Prof Bronski is an incredible teacher. He made Jewish Women in Comedy an incredibly interesting topic, even for a gentile. Most importantly, Prof Bronski was always available outside of class, and allowed us to write roughdrafts for all our papers. His lectures were interesting, the workload was reasonable, and the class was enjoyable... Great Success!!!!\"",
            "review 8: \"06F with Michael Bronski: This class was pretty low-key and very interesting/entertaining (how could it not be--just look at the title!). Sometimes, it was a little rough going through it all for two hours in the morning, but I always learned something in every class. Prof. Bronski is obviously very enthusiastic and knowledgeable about the material, and he had a pretty good sense of humor. At first, he assigned a couple of pretty arduous books about the history of Jewish women in America, but after a few weeks, he dropped them completely and we didn't have to read them anymore. He was pretty picky in grading the papers, but since it was a freshman seminar, we did second drafts for all our papers (he didn't count the first drafts toward our final grade), so it was pretty easy to get good grades on the final drafts. He commutes to Dartmouth every week, so his office hours aren't that flexible, but I was able to blitz him the first draft of my final paper and helped me out a lot on it over blitz, even though he didn't technically grade the first drafts of our final papers like he had for all of the other essays.\"",
            "review 9: \"04S with Michael Bronski: Mr. Bronski was very interested in getting students involved in the material. He made it a point to connect with kids outside of class every couple of weeks, and he was willing to do outside research if someone had a question he couldn't answer. At first, there was far too much reading, but when students brought the issue to his attention, he quickly adjusted the syllabus. The final paper allowed everyone to pick almost any subject we'd mentioned and that they wanted to learn more about, so it was a great learning experience.\""
        ],
        "Terri Ginsberg": [
            "review 1: \"04F with Terri Ginsberg: I was hoping for some enlightenment on aspects of the Judaic and Jewish culture. Instead, I read lots of boring articles that were never discussed in class, and didn't learn any concrete knowledge. The lectures were not particularly interesting; I was bombarded with abstract connections that confused me about the subject even more. My writing skills improved only slightly in organization.\"",
            "review 2: \"04F with Terri Ginsberg: this seminar was ceratinly interesting, but i have a feeling we didnt learn what we were supposed to. writing research papers for instance, that doesnt happen... the professor knows alot about what shes teaching and feels very strongly about certain issues, which is a good thing, but she can sometimes be overwhelming. if youre not looking to bolster your research paper abilities and have any slight interest in Judaism, this might be a good course to take. all in all, i was glad to be done with the course, but it was a welcome relief from my 2 other classes which were large lectures (this class was very discussion based)\"",
            "review 3: \"04F with Terri Ginsberg: didn't fit the title as we went outside the 20th century. the prof is very liberal and this is shown in the material and discussion so if that would bother you don't take this course. grading was fair but you had to think outside the box.\"",
            "review 4: \"04F with Terri Ginsberg: This class had a few interesting moments surrounded by a lot of very boring stuff. A few of the books and films we covered were good, but the rest were deadly. I learned a lot about several areas of Judaism that didn't interest me at all, and not as much as I'd hoped about more relevant stuff. I don't think my writing really improved all that much. I think Professor Ginsberg has the ability to lead a good discussion group when the class is interested, but we were usually too bored to participate. She might be more effective teaching a film class.\""
        ],
        "Alan Lelchuk": [
            "review 1: \"02W with Alan Lelchuk: I did not like this class at all. The prof was too opinionated and there was not enough class discussion.\"",
            "review 2: \"02W with Alan Lelchuk: This course looks good on paper, there is no doubt about it. That's why we took the course. We were warned, but that blurb in the seminar listing just looked so good. And truth be told, the material is very interesting. I was amazed at the things I read, by the genius of the authors we studied. What destroys any possibility of enjoying this class, though, is Alan Lelchuk. The man is unbearable. Where to start? He is absolutely arrogant. Yes, he knows the material, but he is unwilling to compromise during a discussion. If he disagrees with what you say, he will simply cut you of mid-sentence with a resounding \"No.\" He loves to tell personal stories (by the way, this is a good way to get him on an hour-long tangent: ask a personal question) like when he had dinner with Saul Bellow or when he was in Israel with Grace Paley. He is of the opinion that only someone at his level can understand this literature. What he says is right and what we think is wrong. The man tries to pit students against each other in class. Rather than be the bad guy, he preys on us. e.g. \"Dan, what is wrong with what Mary just said?\" He's downright rude. He calls students by patronizing names like \"Krissy.\" No less than three times this term he called me anti-Semitic for expressing an ill opinion of one of his beloved authors. He told me he hopes I am unhappy in life because he disagrees with my aspirations. He thinks the South is backwards and back-woods and that Saul Bellow is the only saving grace of American Literature. He is narrow-minded and will not hesitate to share his biases, but heaven forbid you should express any. Still want to take the class? Go ahead, it's do-able. After all that, he did say that my work was ingenious, and I am looking at an A-/A in the class. Just remember some vital advise. (I know this review is getting really long, but you will thank me later.) -Speak in class, don't wait for him to call on you. He will be impressed with your willingness to share, and after all, you have a better chance of saying something \"right\" if you say a lot. -Keep up with the readings and offer specific comments so he knows you did them. For that matter, make sure you know what the reading is. Lelchuk is vague, so pin him down at the end of the class and get from him exactly what you should read for next time and exactly which books you should bring to class. -Get all assignments in writing. He gives spoken instructions, so it is up to you to demand a syllabus and written essay prompts. This is crucial. On more than one occasion, the essay topic changed between the time it was assigned and when it was turned in. -Don't diss classmates. He will try to make you take sides, but it is essential to remain respectful. Preface your arguments with, \"I like John's point about xyz, but I also think...\" Students in the class will get through it by uniting against Lelchuk, so don't alienate anyone - that's his job. -Listen to Lelchuk's criticism, remember not to make the same \"mistake\" on the next paper, and most importantly, laugh it off. Don't take it personally, it's not you, it's him. Good Luck. Brace Yourself.\"",
            "review 3: \"02W with Alan Lelchuk: The course didn't really meet expectations. Although one of the main objectives of a seminar is too improve your writing, practically no work was done in this area. Students weren't given enough personal attention and opportunities to meet with the professor to discuss their writing and go over papers just completed. How much can you really expect to improve in your writing if you hand in a final draft of a paper, and get back a grade with minimal comments and no follow-up on it? The course material was fairly interesting. However, we were often told to read over 100 pages up to 275 pages for the next class period. It was one of those classes where the professor assumes you have infinite time for his subject alone. I would fairly recommend the course if it was not taught by professor Lelchuk. He was neither accomodating nor personable. He had a habit of making large negative comments on each students work in front of the whole class, and generally had a negative attitude. He wasn't very enthusiastic about the class, and it seemed like he kind of felt it was a burden to him. Many students were sick with a variety of this winter's large amount of communicable diseases, but none were met with much sympathy, just anger for \"copping out\". One student even cried when he snapped at her in the middle of class for her pinkeye! Overall, I haven't heard from a single person who received a grade that they felt to be a fair assessment of their work. I know a few people who have cried over his comments to them, and everyone in the class seemed to have an abnormal amount of grief compared to any other class. In short, IT'S JUST NOT WORTH IT.\""
        ],
        "Ana Merino": [
            "review 1: \"07F with Ana Merino: This course is ridiculously easy, you read comic books, enough said. However, the Prof. Merino is very opinionated and any comment that doesn't fit her exact beliefs is met with a half hour rant. While this is Jewish Studies, everything leads back to Spain, Latin America and the gypsies. Her accent is understandable after some time, but her grasp of the English is elementary at best - not exactly what one would expect for a writing seminar class. Also you barely write at all, which makes the class even easier, but if you are looking for a seminar that will prepare you for writing essays and researching, good luck.\"",
            "review 2: \"07F with Ana Merino: Easy class. Readings were very light (only one graphic novel a week) and papers were very easy, all with multiple drafts. Class discussions were unfocused and often uninteresting. I did enjoy learning about modern graphic novels, though, and did learn to appreciate them as literature.\"",
            "review 3: \"07F with Ana Merino: The class is very interesting even if you have no interest in graphic novels or Jewish studies. Many interesting authors of books we read came in to talk to us, and we also went out of the classroom a lot. Professor Merino has her ups and downs, at times she seems biased against views she doesn't hold, which in a class based on open discussion makes it a little harder if you feel you are conflict with the teacher. On the other hand, she is incredibly knowledgeable on the comic aspect of the course and knows many artists which makes for interesting lectures in this regard.\""
        ],
        "Steven Kangas": [
            "review 1: \"05F with Steven Kangas: This cource will teach you everything you ever wanted to know about the Temple in Jersulam. There is minimal nightly work but there are three papers.\"",
            "review 2: \"05F with Steven Kangas: Some profs are good at seminars. So far I've never heard of one who is, but they have to exist, right? Kangas is certainly not one of them. He's ok at lectures, though he taught as if we had a background in archeology/art history. But the discussions he led were so dull and pointless. None of us knew enough to really discuss the course material, so we'd have these random philosophical musings about religion in general or whether the people of ancient times were really so different from people today. He made us purchase 4 books, then in addition assigned several readings from course reserves. By the end of the class we had all stopped doing the readings because we discovered we could do just fine on class discussions without them and we didn't actually need them to write our papers. There were only 3 papers, which was nice, but we had to present the last and that was a total waste of time. Kangas should stick to Art History lecture courses.\""
        ]
    },
    "JWST006": {
        "Ehud Benor": [
            "review 1: \"17F with Ehud Benor: Definition of a layup. All lectures are optional and posted on Canvas. The only graded assignments are two, <500 word essays and a take-home final. As long as you attend office hours these are very easy.\"",
            "review 2: \"09S with Ehud Benor: its easy but far to boring\"",
            "review 3: \"09S with Ehud Benor: This is quite possibly the best third class ever. Ehud Benor is the man. He just philosophizes all class, and whether you appreciate it or not, you have to admit he's a genius. If you want to be interested in the subject, his class is the place to be. And also, if you want a chill third class with no work, this is great for that too. Like I said, I spent 1 hour a week on this class. One two page essay, one take home final...who can complain.\"",
            "review 4: \"07F with Ehud Benor: I took this class after being told that Prof Benor was a friend's favorite professor. I was not disappointed. His lectures were thought-provoking and concise; he's not the kind of prof who goes off on tangents. There's not much work required for this class; all you really need to do is show up to the lectures. I thought that this course was about tangible Jewish tradition, like the things that they do to keep kosher, etc., but instead it was about the tradition of Jewish thought and how it (and interpretations of the Torah) evolved over the centuries. Nevertheless, the alternative interpretations of the Torah and how that relates to the conceptualization of God made me stop and think about how much about religion I take as fact simply because someone told me that that was the way it was. It kind of blows my mind how one word, or even one letter change can completely change a passage's meaning. I would highly recommend this course.\"",
            "review 5: \"07F with Ehud Benor: I personally didn't read the books, although someday I might pick them up and read through some of the stuff he mentions in class. I would suggest taking this with a friend and then switching who goes to class every other day and then borrowing each others notes. About 80% of the test and papers are based on the lecture.\"",
            "review 6: \"07F with Ehud Benor: If the subject interests you, then sure-- go and enjoy. That is, if you can stay awake as the professor talks in a very slowwww voice for the full hour and 5 minutes. He used every x-hour, too. But there really is no hw. I wish I hadn't bought the books. The papers are easy (there are just 2 of them, 2 pages each, and I did find them interesting). The midterm and final can be done without much trouble if you are creative.\"",
            "review 7: \"07F with Ehud Benor: This class requires no work outside of going to class and doing the 2 short essays. Really. You don't have to do any of the reading at all. In fact, I didn't. I was really interested in the subject but just had a crazy busy term, so I didn't do any of it at all yet, but I'm glad I have the books because I do want to read them at some point. But you DO have to go to class. Benor is a genius, and you have to actively pay attention to follow his lectures. But if you do, you can get a sense of how he analyzes things and attempt to apply the same process to the 2 essays. They are really short, 2 pages max, but you really do have to think a ton before you start writing. They aren't research papers, you shouldn't attempt to encorporate the readings into your essays, you should just review your notes and and think about your response. That's it. The midterm and final are both in class tests where there are several one-sentence questions that require a ton of thought, but just a 2-3 sentence answer. Benor is a big fan of brevity, he really only wants the right answer and no BS. You may not know the right answer, but studying won't really help, just understanding the material and being able to apply it to something new is the point. And you'll probably get some credit for something that shows knowledge of the material even if it's not the right answer. And to help even more, you don't have to answer all the questions--3 of 4 on the midterm and 5 of 9 on the final. Each graded assignment is weighted equally, 25% for the two exams and two essays. I really enjoyed this course. It was one of the few courses where I put almost nothing in outside of class but still learned a ton. The ideas discussed in class really made me think, and I found myself talking about the philosophical stuff randomly throughout the term. This course is NOT what you're expecting. It really shouldn't be titled \"Intro to Judaism\" it should be \"Intro to Philosophy and History of Jewish Thought\" If you're looking to understand the religion, this wont' really help much. It's about the way the religion transformed over the past 4000 years based on the way Jews relate to biblical texts and to the rise of other religions--mainly Christianity and Islam. Anyway, I really enjoyed this course, and I would recommend it to anyone who enjoys philosophy even a little, regardless of your interest in religion or Judaism.\"",
            "review 8: \"07F with Ehud Benor: Following Benor's lectures can be somewhat trippy, they're all over the place and have you doing some deep thinking...if you remain focused through the whole class. But not to worry, if you're not, you'll be alright. There's two 2-page double spaced papers, a midterm, and a final, each worth 25% of your grade. The readings are largely superfluous, if you take good notes during the lectures you realistically don't have to do any of them. A good third gut class.\"",
            "review 9: \"07F with Ehud Benor: I took this class because I needed a TMV that wouldn't be too overwhelming and the material seemed like it would be interesting. This class was great. I attended almost all the lectures and this was completely fine to get me through the class. The reading was very similar to the content of the lectures. We had two short essays (2-3 pages), a midterm (literally took 20 minutes), and a final. The grading is a little arbitrary, since the ideas are so abstract, but overall I think the grades Benor gave were very fair. Definitely a good class to take if you need a third class, a TMV, or just want something new to think about.\"",
            "review 10: \"07F with Ehud Benor: This was a good class. It is strange, at times I found myself wondering whether what we were studying was fascinating or painfully boring. I certainly felt both over the course of the class. Benor is a great professor who certainly knows his stuff. His lectures are very carefully crafted and usually pretty interesting. I did all the reading the first few weeks but soon found it was too much and that it didn't really matter that much anyway. Some of the reading was interesting and good to read, some was just too difficult and seemed pretty unimportant. Understanding his lectures is the important thing, especially to do well on tests. Go to office hours for help on the essays, because it was sort of difficult for me to pinpoint exactly what I was supposed to be saying in them, and he gives clues as to what he wants you to say. Good class-take if you think you're interested.\"",
            "review 11: \"07F with Ehud Benor: Gut. Reading not necessary. Decent idea to attend the lectures but all information was made available on blackboard right before the final. Ehud Benor is the man. All he wants you to do is think. The course is very philosophical. Which is cool if you can understand what he's talking about. Unfortunately, you come out of the course with basically no facts about Judaism that you didn't have before.\"",
            "review 12: \"07F with Ehud Benor: This class doesn't match its description (it's more about philosophy, not the history of Judaism), but it's very interesting. Take it. Benor is amazing.\"",
            "review 13: \"07F with Ehud Benor: I was really interested in the subject of this class but found that it was not quite what I expected. The professor focused on Jewish philosophy and very detailed, abstract conceptions thereof. He seemed extremely knowledgeable and intelligent, but the class was purely lecture. No matter how hard I tried, if I slept nine hours, if i had caffeine, I didn't stay awake for the entirety of even one class. I tried very hard because the material was interesting, but it was impossible. Very little work though-only two short papers and two shorter tests.\"",
            "review 14: \"06F with Ehud Benor: I went to about half the lectures before the first exam. I did none of the readings gave little attention to the lectures. After figuring out that he gardes easy, I did not return to class until week 10. I turned in the essays online and did none of the reading. This class is the definition of a Gut. The essays are mostly subjective and the identification choices were ridiculous. If you have 0 time to devote to a class, take this one and enjoy the ride. This class both excited me and depressed me at the same time. I have always wanted a Gut class to take at Dartmouth but it really was a waste of time. Prof. Benor seems very knowledgable but is often hard to follow in lecture. He told the class on the first day \"I write at a graduate level, I don't expect you to be able to understand my writing perfectly\".\"",
            "review 15: \"06F with Ehud Benor: Benor's thinking was not on the plain that I thought Intro to Jewish Studies would be - it was way above it. It wasn't names and facts - it was all philosophy and thought. Therefore, I made the mistake of skipping lecture, or sleeping during them, thinking that there was no way that I was going to understand the material. However, when I actually paid attention, the lectures were very thoughtfully crafted and interesting. I also skipped pretty much ALL of the reading, which I ended up liking when I had to read for the papers. In the end, this class can be whatever you want it to be. If you really want to know about Judaism, you will learn about the religion on a level above what most people know. On the other hand, if you want a gut class, you can not do any of the reading except for the papers and still get a good grade (I would suggest going to class because half of the tests are based on lecture). If I could take the class over, I would put way more effort into it because Benor really was a great professor and a truly original thinker.\"",
            "review 16: \"06F with Ehud Benor: Benor is an absolutely brilliant lecturer and scholar. His lectures were works of art with not a single word out of place. He obviously puts incredible thought into what he teaches. The work is manageable. There is a lot of reading, but I doubt anyone gets through all of it. The 2 papers require a lot of thought, but Benor is a fair grader. The midterm and final each have a short in-class definition and a paper. The course is almost entirely skewed toward philosophy and reasoning rather than history. This is not a timeline type class where you move through important dates and people. Rather you move through different schools of thought and how they relate to each other in shaping the religion. The more you put into this course, the more you will get out of it. Pay attention to the lectures, try to do a lot of the reading, and talk to the professor. He will take you to a different plane of thought.\"",
            "review 17: \"04F with Ehud Benor: Prof. Benor's lectures are appealing to those who like big words and who can follow a story for a full 65 minutes. Most are interesting but some can be difficult to follow. His lectures are recorded though and accessible for the exams, which are very leniently graded. Class attendance is essentially optional, but getting to know Prof. Benor is highly encouraged. Work load and reading is also very manageable, and this course is optimal for an interesting, relatively easy 3rd course.\"",
            "review 18: \"04F with Ehud Benor: Interesting stuff, not your average religion class. Lectures a bit tough to follow, as Benor works with little more than a simple outline and jumps around a bit. I never did any reading, literally, and should get a B+, so easy grading.\"",
            "review 19: \"04F with Ehud Benor: i signed up for this class because i thought it would be interesting, and the classes i actually attended were very interesting. the workload is minimal, there is one short paper, one take-home midterm and one take-home final. none of them are very difficult, and prof benor provides a very helpful study guide for both tests. prof benor is a very interesting lecturer and a great storyteller. this was a great class for senior fall--not too tough, and rather interesting.\"",
            "review 20: \"04F with Ehud Benor: A very interesting course. Professor is great.\"",
            "review 21: \"04F with Ehud Benor: lectures were too fast and too much to handle much of the time. it was hard to keep up with the lectures, and hard to digest anything there is no need to read or do any work, just go to class\"",
            "review 22: \"04F with Ehud Benor: take home midterm and final if you do better on the final than the midterm the midterm doesnt count\"",
            "review 23: \"04F with Ehud Benor: Despite his obvious passion for the subject matter, Benor fails to engage his students. From what I could tell, most kids (of those who attended class) sort of sat in a quasi-coma, drifting in and out of consciousness, for 10 weeks. Some genuinely found the material to be inspiring and were, thus, more amenable to Benor's lecture style. This class was not particularly challenging. Practically half of the defensive line took this class if that serves as any reasonable indiction of its difficulty. So, take this class if you're moved by the philosophy of Judaism and are willing to endure some painfully boring 1-hour lectures. Just know what you're getting into when you decide you want an easy grade.\"",
            "review 24: \"04F with Ehud Benor: I took this course because I was looking for an easy course outside of the subjects I usually take courses in. I went to the majority of the lectures, took good notes, but never did any of the reading assigments. I still did very well in the class. You really do not need to do the homework at all as long as you go to the lectures. The lectures are interesting, but can seem very long at times. There is only one short paper, a take home midterm and a take home final. Overall, this course was very easy, no stress, and definitely a good class to take if you are looking for something different, but don't want the stress of another hard class. Also, the professor was very nice and responsive to all students.\"",
            "review 25: \"04F with Ehud Benor: I wasn't entirely thrilled with this course, but it wasn't awful. It was definitely interesting, and as a person who knew NOTHING about religion, I learned a lot. However, Professor Benor wasn't the greatest professor. His lectures are often very hard to follow, and he speaks in such complicated sentences that you can't really grasp what's he's trying to get at. A word of warning, take thorough notes during lectures. The tests are based nearly entirely on the lectures, and not on the readings.\"",
            "review 26: \"04F with Ehud Benor: The lectures were given with a very philosophical outlook. Prof Benor's grading policy is harsh.\"",
            "review 27: \"04F with Ehud Benor: The material in the course is not what I expected according to the ORC. It is the philosophical and theoretical aspects of Judaism spoken in 'Benor' language. He is brilliant and inspires interest in the subject. The readings are not necessary for the exams, but pay careful attention to his lectures. Overall it was an interesting course and I'm glad I took it.\"",
            "review 28: \"04F with Ehud Benor: Prof Benor did a great job giving us an insider's perspective of the Jewish faith. His lectures are challenging- they're very deep and philosophical, and stretched my brain in a lot of ways. If you pay close attention in class, though, you should be set, and don't even have to do the reading. The exams are open-book on Blackboard, and he is a generous grader.\"",
            "review 29: \"04F with Ehud Benor: I took this class because it came highly recommended to me from friends. So imagine my surprise when I found myself falling asleep in nearly EVERY single class! The problem isn't really Professor Benor -- he's amazing in his field, and that comes across in his lectures. The problem is that the ORC description doesn't tell you that this is a philosophy class, plain and simple. A better title for the class would be \"The History of Philosophy of Judaism,\" in which case I would have steered clear. If you're into philosophy, then you'll probably be able to follow Benor's lectures. But if you're like me and simply can't handle a philosophy class, then don't bother. The work is easy, and it's not hard to get a great grade, but your time is better spent in a class you'll stay awake in.\"",
            "review 30: \"03F with Ehud Benor: Ok so you can tell right from the beginning that prof Benor is a really nice guy who really likes his subject matter and is extremely intelligent. That said, I rarely understood a word he said. He spoke in such complicated sentences that it was hard to wrap your head around anything he said. He presented such complicated ideas that even when fully concentrating I couldn't keep up with what he said. Ii got the median in the class only becuse I psychotically took notes and then regurgitated them on the take-home tests.\"",
            "review 31: \"03F with Ehud Benor: Professor Ehud Benor made the course what it is. His lectures challenge your mind to its utmost potential.\"",
            "review 32: \"03F with Ehud Benor: The material in this course isn't exactly for the faint of heart, but if you devote yourself to doing the readings and paying careful attention in class, you will be richly rewarded by a fascinating intellectual experience. Professor Benor is an amazing teacher, in terms of both knowledge of the subject and engaging lecture style, and if you're interested and engaged in the course he'll keep your attention piqued throughout the term. I enjoyed seeing some interesting correlations between the religious themes and concepts in this course and my own personal faith experience, so I was definitely thrilled by this course. It's one of the best I've taken here at Dartmouth, and fits my idea of what a good college course should be.\"",
            "review 33: \"03F with Ehud Benor: The lectures are the most important part of this course. Professor Benor has a unique style which can seem like rambling at times but he always ends up getting his point across in the end. You must attend class.\"",
            "review 34: \"03F with Ehud Benor: Benor teaches it like a straightforward religion course but there's some solid theology mixed in if you listen for it.\"",
            "review 35: \"03F with Ehud Benor: I happened to love the material of the class, even though it was far more philosophical material than one would expect from the ORC. However, Behud's lectures were frequently extremely boring, as were the readings. Fortunately, the readings are totally superfluous and are unneeded for the two take-home tests, one of which didn't count because I did better on the second. The class is basically no work, but the take-home exams are very challenging and graded somewhat unfairly. Overall, it was an ok class\"",
            "review 36: \"03F with Ehud Benor: This class is quite interesting, although after paying attention to class and going to all but a few of the lectures, I'm not sure how much I learned after all that. But it's really not Prof. Benor's fault. It is because I, and most everyone else at this school I would guess, are mental midgets compared to him. His lectures are quite interesting, and he is extremely articulate, but most of all, they are highly intellectual. Prof. Benor just operates on a higher plain than most everyone else, except for high intellectuals. That makes it very hard for us lowly undergrads to follow and retain the class material, fascinating as it is when presented by Benor. Fortunately, the prof only assigns a midterm and a final, and grades pretty fairly. You do not need to understand his level of understanding to pass, just to get an A. So if you're interesting in a class that is VERY mentally challenging, but not at all time-consuming, take this class (and NRO it).\"",
            "review 37: \"03F with Ehud Benor: I had been to a reformed hebrew school for several years, but did not know much about the details of the religion or the foundations and Benor did an excellent job of informing the class on these subjects.\"",
            "review 38: \"03F with Ehud Benor: There were many days when this class made my brain hurt. Professor Benor is an amazing container of knowledge, but his presentation, though eloquent, can get a little wordy and it's sometimes difficult to figure out what he's trying to tell you. Very little in this class is clear-cut: he goes into a lot of philosophical interpretations etc. It's really, really interesting stuff, not what i would have expected from an intro class. The only assignments are two take-home exams, which i found really help pull together what you've learned. You definitely have to go to class though, and take notes to prepare for the tests, unless you want to spend multiple days in the library trying to find something resembling what he lectured about. All in all a worthwhile class; I only wish I could have absorbed more of all the ideas he offered.\"",
            "review 39: \"01F with Ehud Benor: The material was great, but the Prof brought it to life. The first day he predicts that the last two days of class will bring the whole experience together and that is absolutely what happens. This class is not about what it means to keep Kosher; it is about Jewish thought, from Old Testament to Kabala. The “minimum to get by” is almost nothing, but the rewards for those who do the readings and go to class is an experience that will be compelling and powerful. The Prof is what other teachers should aspire to be, and the class has good enough material to come along for the ride.\"",
            "review 40: \"01F with Ehud Benor: First of all, this class was NOT what i expected it to be. At first i was lost with professor Benor's slow speaking and deep thoughts about the Talmud, but once i got into it i found the class to be extremely interesting. The prof is a genius and my respect grew for him as the class progressed.\"",
            "review 41: \"01F with Ehud Benor: Prof Benor is amazing. He is so incredibly knowledgeable about the material. His lectures ooze with intelligence. HOWEVER, Prof Benor speaks as though he were writing his dissertation. His language isn't complicated, but his sentences are. He creates highly detailed sentences that leave the listener wondering where he began, where he's ending, and what it all means. I don't think Prof Benor is trying to teach above our level, but he certainly stretches the brain. The pace of the class is too quick. You cover so much material SO quickly, it becomes a little too difficult to understand. Also, you don't really learn about modern Jewish people. Just about the philosophy of Judaism and historical Judaism. Which is a shame in my opinion. I was hoping to learn about modern Jewish trends. NEVERTHELESS, it's a great class, and you will learn a lot.\"",
            "review 42: \"01F with Ehud Benor: Minimal amounts of reading outside of clas because all of the material comes in class. he is an amazing lecturer. the material is incredibly interesting. I highly recommend taking any class with him. It might be helpful to tape record his lectures because almost all of the matieral is from what he says, an sometimes he's hard to be engaged and take notes.\"",
            "review 43: \"01F with Ehud Benor: I went into this course thinking that i was gonna come out of it with a much better understanding of the Jewish religion; you know, their holidays, history, traditions, etc. BUT NO, I didn't learn any of that. I ended up being faced with a whole bunch of philisophical, abstract, mystical jargon that made close to no sense. The prof started out the term by telling us that he didn't expect us to know what he wanted on exams, which should have tipped me off. The only good thing is that there is absolutely no reading you have to do, there's one midterm that's take-home and the final is a take-home too. He gives you the review questions beforehand for both and encourages you to work in groups to figure them out. if you like philosophy and abstract concepts then you'll probably like this class but if you're a science/math kind of person (liking anything CONCRETE) I suggest you stay away from it. There is no mention of hanukka, matza, or dredels here.......\"",
            "review 44: \"01F with Ehud Benor: As I described to a friend, you learn about rabbinics and medievel philosophy, not about dreidels and menorahs. A real mind-bender with a very pensive prof. Exciting course that has previously been larger---though better small for intimate lectures. Anyone who wants to think could appreciate the course, an intro, but majors would probably get the most out of it.\""
        ],
        "Shaul Magid": [
            "review 1: \"21W with Shaul Magid, Heschel: Professors Magid and Heschel taught this together. This by no means is an introductory class, however. Knowledge of Jewish and Christian biblical history is needed and if you ask a question because you are unfamiliar with the foundation of these religions, the professors scoff. The class was disorganized and readings were changed twice a week which didn't allow for a lot of time to prepare ahead. There were two essays and two exams due during midterms and finals weeks, respectively. They alternated who graded what but either no feedback was presented or a lot was, and this didn't exactly allow for growth during the course. Definitely not a layup. Grading was arbitrary.\"",
            "review 2: \"21W with Shaul Magid, Heschel: The class was ok; as previously noted, sometimes the professors could be dismissive of questions. Both are obviously quite bright, but possibly to the detriment of the course - dumb questions (like mine) weren't really appreciated. Magid is also kind of a boring lecturer. Neither profs were great at achieving student engagement, largely because they tended to favor lecture anyways, but it was often total crickets when they would ask a question. Also, this might be wack of me but I wish there had been more assignments. I really only learn when I have to synthesize the material, which I really only did for the midterm and final, so biweekly or so short assignments, with the same level of feedback would've been better personally. Maybe a layup? Depends on what the median turns out to be, I suppose.\"",
            "review 3: \"21F with Shaul Magid: The class was super chill, and Professor Magid is super cool. If you know a lot about Christianity and/or Judaism you'll be good, and if you don't, just pay attention in class and do the readings when there's a paper coming up. Easy TMV distrib.\"",
            "review 4: \"19F with Shaul Magid: Not a layup anymore however very interesting class. It starts slowly but after two weeks it gets more interesting. Two in-class exams graded harshly. Two papers on the topic you choose. Almost mandatory attendance. The class size is huge for the JWST department. Median probably B+ and doesn't require an excessive amount of work though.\"",
            "review 5: \"19F with Shaul Magid: Definitely not a layup anymore. The class itself is pretty boring until the more contemporary stuff about acculturation. Workload: 2 papers + 2 exams (midterm + final). You can write the papers on pretty much anything you want. Exams are graded HARSHLY by the TA. Don't really have to do any work in the class but if you want an A you probably should.\""
        ],
        "Shaul Magid, Heschel": [
            "review 1: \"21W with Shaul Magid, Heschel: Professors Magid and Heschel taught this together. This by no means is an introductory class, however. Knowledge of Jewish and Christian biblical history is needed and if you ask a question because you are unfamiliar with the foundation of these religions, the professors scoff. The class was disorganized and readings were changed twice a week which didn't allow for a lot of time to prepare ahead. There were two essays and two exams due during midterms and finals weeks, respectively. They alternated who graded what but either no feedback was presented or a lot was, and this didn't exactly allow for growth during the course. Definitely not a layup. Grading was arbitrary.\"",
            "review 2: \"21W with Shaul Magid, Heschel: The class was ok; as previously noted, sometimes the professors could be dismissive of questions. Both are obviously quite bright, but possibly to the detriment of the course - dumb questions (like mine) weren't really appreciated. Magid is also kind of a boring lecturer. Neither profs were great at achieving student engagement, largely because they tended to favor lecture anyways, but it was often total crickets when they would ask a question. Also, this might be wack of me but I wish there had been more assignments. I really only learn when I have to synthesize the material, which I really only did for the midterm and final, so biweekly or so short assignments, with the same level of feedback would've been better personally. Maybe a layup? Depends on what the median turns out to be, I suppose.\""
        ],
        "James Wright": [],
        "Susannah Heschel": []
    },
    "JWST004": {
        "Susan Ackerman": [
            "review 1: \"21F with Susan Ackerman: This class was fascinating. Prof. Ackerman is an excellent lecturer and knows the material inside and out. Class went by quickly as Prof. Ackerman traced the history and literature of the Bible from the earliest origins to the Jewish diaspora thousands of years later. The class is highly secular: we study the Bible in the context of ancient Israel's regional and wider neighbors. Prof. Ackerman shows the profound influence of nearby religions/cultures on ancient Israel history and religion. But, for anyone interested in the history of Jewish or later Christian belief, this class is fascinating and can improve respect and admiration for the wide scope of the Bible. Due to the quick term, we could not cover everything, and Prof. Ackerman looks more closely at the first five books and Judges/Kings than the later texts. But overall, TAKE THIS CLASS. Prof. Ackerman, who has been teaching at Dartmouth since the 1990s, represents a traditional lecturer who knows how to keep her students engaged and thoughtful. She is friendly, too and holds lots of office hours to answer questions. Work this term was twice weekly discussion posts (~200-300 words) about the Bible readings. It also included two 7-8 page papers, one midterm exam and one final. The work was consistent, but never hard. Prof. Ackerman grades generously, too.\"",
            "review 2: \"07W with Susan Ackerman: This was an easy class. You can get by the class without doing the readings because Prof. Ackerman goes over everything in the class. Her exams are based on the lecture notes and she explains everything thoroughly.\"",
            "review 3: \"07W with Susan Ackerman: Ackerman is the kind of teacher I came to Dartmouth for. She is so knowledgable about ancient Israel but is by no means intimidating and simply loves sharing what she knows with her students. If you've never studied religion before, no problem. This is a great way to learn about the bible and to get you thinking critically about it if you do have a background in it. Don't do the readings (except for the bible), come to class (there's no reason not to), and just take it all in- you learn more than you need for the tests which means at times you can just sit back and enjoy the lectures, which are delivered with energy and excitement.\"",
            "review 4: \"07W with Susan Ackerman: This is a great class! Prof. Ackerman is brilliant and a great professor and the material is good.\"",
            "review 5: \"07W with Susan Ackerman: Professor Ackerman is the head of the religion department, and it shows. She knows the material back and forth, and you can tell she has a much deeper understanding of the subject than she can let on in a one-term course. The course has a strong focus on history, and I came out of this class feeling I know things about the Bible that many priests and rabbis aren't aware of. You can get by without doing the reading for the course, because Prof. Ackerman goes over everything important in class. She is not a diffcult grader. I strongly recommend this course to anyone at all interested in Christianity or Judaism, as it allows the student to understand where the Bible came from.\"",
            "review 6: \"07W with Susan Ackerman: Professor Ackerman was extremely knowledgeable in her field. She was a great lecturer who always responded to her students during class. Her insight was amazing, as was the fact that we were always made to think for ourselves. I would basically reccomend this course because of her. It's a very interesting class to boot, and extremely easy. Doing the readings is unnecessary, which is a good thing, because typically, they're not incredibly intresting. I would, however, reccomend doing all Bible readings. It helps on the exams and on the papers. I think this class is basically an easy A and a good way to fulfill a disrib.\"",
            "review 7: \"07W with Susan Ackerman: This class was the most interesting class I have taken so far. I would dare to say it is even the best class that I have ever taken. My friends in the class were iffy about it at first, but every one of them stayed with it and really enjoyed it at the end. Professor Ackermann is such a great professor too. She lectures well and holds your attention. Even when I was on the virge of falling asleep all throughout the day I found it easy to stay awake through her lectures. TAKE THIS CLASS. IT'S WORTH IT!\"",
            "review 8: \"04F with Susan Ackerman: This class is really interesting for anyone who wants to learn more about the Hebrew Bible from a non-religious school perspective. Ackerman does a great job of integrating historical information and archaeology into the reading of the Bible. Some people complained there was too much reading to know for exams, but if you just do the Bible reading and study your class notes (not the ones she puts on Blackboard) you don't have to do much of the scholarly reading.\"",
            "review 9: \"04F with Susan Ackerman: Take this course. There is a lot of reading, especially for one who has never touched the Bible, but you will learn a ton. All of the lectures are engaging and tied to the readings. Prof. Ackerman is very knowledgable and helpful. I never thought I would enjoy a religion class, but this was fun. It was really hard at first and I wasn't doing great, but things improved. Prof. Ackerman has very high expectations, but is willing to help people reach them. This was a challenging, but rewarding experience.\"",
            "review 10: \"04F with Susan Ackerman: If you want a good overview of the old testament take this course. Ackerman is a good lecturer but allows little room for an exchange of ideas about old testament theories. This class should be titled \"The indoctrination of skeptisism\". Students were discouraged from challenging Ackerman's skeptism by her grading. Basically if you want an A, just regurgitate what she says.\"",
            "review 11: \"04F with Susan Ackerman: A thoroughly engaging and fascinating class, expertly taught. Professor Ackerman has a real love for the subject matter, and presents it in a cohesive, compelling, and easily-understood progression. For those looking for a strict, scholarly approach to the writing of the Hebrew Bible, you will not be disappointed. For those of you from a Judeo-Christian faith background, you will not be insulted - prepare to have some of your assumptions about biblical history challenged by leading scholarship, but by no means your faith; if anything, knowing more about the true history of the bible can help to strengthen one's own appreciation of the messages one chooses to find in it. In a field so intensely personal and often volatile, Professor Ackerman manages to artfully present the material so that its scholarly integrity is uncompromised, and no religious sensibilities are affronted. A thoroughly enjoyable experience - highly recommended for anyone interested in the history of the piece of literature/scripture/history that has most affected the western world.\"",
            "review 12: \"04F with Susan Ackerman: I could not imagine a way one could improve this course. Riveting in its discussion of a text which is central to the Western world.\"",
            "review 13: \"04F with Susan Ackerman: I NROed this class becuase i was interested in the bible, and wanted to learn something about it before I left college. However, i was so interested in the course that i ended up trying to meet my NRO (we'll see if that happens). Ackerman is incredibly knowledgable about her subject and a very good lecturer. I recomend this course.\"",
            "review 14: \"04F with Susan Ackerman: This is a good class to take to fufill your PHR requirment if needed.\"",
            "review 15: \"04F with Susan Ackerman: This class was by far my favorite class of the term. Professor Ackerman is knowledgable and enthusiastic about the subject and her lectures are organized in a clear way, each one building up to make a strong point. While reading the Hebrew Bible assignments is crucial, the other reading almost becomes unnecessary (although worth reading in its own right) since Ackerman's lectures end up outlining specifically all you need to know. The class focus is extremely interesting and places the Bible in its Ancient Israelite context, giving you greater insight into the motives behind the writing of the Hebrew Bible. As a freshman, I had never taken a class that weaved together history and literature so seamlessly. The material itself is challenging and Ackerman's essay assignments and exams are equally so. You must write a rough draft before handing in your papers, both of which are looked over by writing TAs and one of which is looked at by Ackerman herself. There is ample time to complete the paper assignments (which are short -- 5-6 pages) and I personally felt a sense of accomplishment and better grasp of the material from writing them. Ackerman is a tough grader, but not unfair. My only complaint is that discussion in the class was either awkward or non-existant. I actually wish there had been an extra monthly/bi-weekly class time for discussions during an X-hour. I would strongly urge anyone considering this class to take it. It inspired me to take more classes in the Religion department and, more specifically, with Ackerman. So take it! And speak up in class discussion if you do so it doesn't get awkward!\"",
            "review 16: \"04F with Susan Ackerman: I needed to take this course to get a distrib done but it was actually really interesting. It wasn't too much work but the papers and exams did require some effort. Much of the reading seemed unnecessary especially when Prof. Ackerman didn't really use it during class. Prof. Ackerman really knows what she's talking about and gives very well structured lectures. Not a bad class.\"",
            "review 17: \"04F with Susan Ackerman: The course started out really difficult because it was hard just to keep up with the readings. It started out like 3 hours of reading per lecture class, but it evens out at the end, and you feel less weight for the second half of the material. Professor Ackerman was a really good professor- probably one of the most organized, prepared professors I've had at school. Her lecture notes were extremely important to the tests so even if you aren't always fully prepared for class, make sure you attend class!! She even put up her notes on Blackboard, which really helps you review them for finals, but don't count on using them because if you haven't gone to class, they'll look confusing to you. Take this class because you have an interest in ancient Israelite culture and the Hebrew bible- how it differs from Christian perspectives.. it's actually pretty fascinating.\"",
            "review 18: \"02F with Susan Ackerman: Ackerman truly makes this course interesting. Her lectures are engaging, well-planned and her animated teaching style helps you stay awake. She has a clear understanding of the material and makes herself available outside of class. I never thought I would be interested in Ancient Israelite history but by the end of the course I wanted more.\"",
            "review 19: \"02F with Susan Ackerman: Prof. Ackerman is by far the best professor I have had at Dartmouth. She is an outstanding lecturer - always very prepared with interesting lectures but was very flexible if the class had other questions or concerns. I was very unsure about the class material at the very beginning, but it turned out to be a great history and background to the Hebrew Bible. Readings were not too difficult, and midterm/final were very fair tests of what we had gone over. There is one paper, 6 - 8 pages, but you have 4 weeks to do it, with one draft that goes to the Prof/writing assistant. If you can fit it into your schedule, TAKE THIS COURSE!\"",
            "review 20: \"02F with Susan Ackerman: I really think that Professor Ackerman is the best teacher at Dartmouth. No kidding. She knows so much, is really smart, and is also funny. Her paper assignments and exams force you to think about the material in new ways and truly test your understanding. Her questions and comments during class do the same. Class discussions were uniformly great. Add to this the importance of knowing and understanding the Bible, and this class simply cannot be missed. No one should graduate without having taken it, regardless of her major.\"",
            "review 21: \"02F with Susan Ackerman: I never thought the bible could ever be interesting, but this class made this a good semester.\"",
            "review 22: \"02F with Susan Ackerman: Obviously this course is taught at a secular institution, so it draws very academic conclusions, but that's how it ought to be at a place like this. Ackerman is a good, engaging prof with lectures that ask a lot of questions and aren't just regurgitating the readings. If you want to know bible history, it's an ideal course. If you dont, then it'd probably be pretty boring.\""
        ],
        "Karen B.": [
            "review 1: \"08S with Karen B.: Professor Stern is INCREDIBLE! She was fun, gorgeous, and a fair grader. Unfortunately, she's a visiting prof, so I do not know if she'll come back to teach the course again. But, even with a different prof, I think the course would still be interesting. I had never taken a religion class of any kind before, so I found all the new ideas very interesting. If you need a TMV distrib credit, I would take this class.\"",
            "review 2: \"08S with Karen B.: She is super sweet, if you can take a class with her\""
        ],
        "James Wright": []
    }
}