{
    "NAIS087": {
        "N Bruce Duthu": []
    },
    "NAIS086": {
        "N Bruce Duthu": []
    },
    "NAIS081.04": {
        "Nicholas Reo": []
    },
    "NAIS047": {
        "Gordon Henry": [
            "review 1: \"22F with Gordon Henry: This class is taught by a poet, so don't expect it to be organized. We didn't get the syllabus until the second week of class and I never particularly knew what was expected or when things were due. Due dates were flexible because of this, although he didn't really grade stuff on time either. Was a pretty interesting class, although it got a bit long because it was a 2A without breaks. He brought in several guest lecturers which was really cool. Your experience in this class will really depend on the other students -- if everyone is interested and engaged, it will be a lot better (this term, we had a lot of interesting conversations because the class had several student poets). I went in to this class knowing nothing about poetry, and I don't particularly know a lot now, but I have a greater appreciation for it. Workload consists of reading ~40 pages of poetry and writing a 400 word stream-of-concious response per week, 4 1000-word essays (although we only ended up writing two essays and the other two turned into questions and a paragraph response for guest poets), and a 2000-word final paper. He grades really easy, so they don't have to be amazing essays. Overall, would recommend this class for a relatively easy (for a STEM person) LIT distrib and lots of interesting conversations about Native poetry and other issues affecting Native people.\"",
            "review 2: \"22F with Gordon Henry: Unorganized but good vibes. Other reviews are accurate. Probably a layup. Gordon is like a sweet grandpa.\""
        ]
    },
    "NAIS025": {
        "N Bruce Duthu": [
            "review 1: \"23F with N Bruce Duthu: Honestly the best layup I've taken at Dartmouth. All lectures which he made interesting and I didn't do a single reading and did well in the class. A few papers and essays for exams but very doable as they're open note. He's a great prof, very engaging and at times funny. He had a lot of guest speakers come to class which made it even better. Take this class if you can. I got a lot out of it.\"",
            "review 2: \"21F with N Bruce Duthu: This is a really interesting class with lots of readings assigned, but you don't really need to read them if you attend lectures and take decent notes as the 2 exams are open note essay questions. The only other two assignments were an article response of like 500 words and a final research essay. I would really recommend this class it is not difficult but really interesting and I learned so much. Take this class you will enjoy and probably get and A!\""
        ]
    },
    "NAIS014": {
        "Colin Calloway": []
    },
    "NAIS011": {
        "Madeleine McLeester": []
    },
    "NAIS008": {
        "Heid Erdrich": [
            "review 1: \"22F with Heid Erdrich: Guest professor, but easy class with interesting material. Would reccomend even if you are not a NAIS major.\""
        ],
        "Matt Hooley": [
            "review 1: \"24S with Matt Hooley: I want to be best friends with Matt Hooley. He is so funny and quippy. Basically you work on a keyword essay the entire term, where class is a discussion of readings. It was an easy class, very much you get out what you put in.\""
        ]
    },
    "NAIS085": {
        "N Bruce Duthu": []
    },
    "NAIS038": {
        "Colin Calloway": []
    }
}