{
    "PBPL053": {
        "Bernard Avishai": []
    },
    "PBPL082.08": {
        "Anne Sosin, Ronald Shaiko": [
            "review 1: \"22W with Anne Sosin, Ronald Shaiko: There's not a whole lot of information out there for this class, but basically it's a project-based class. You'll be in a team (ours were 4 people each), and work with a real-life organization/partner on a particular project involving the field research methods the class goes over. Because of this, the workload is very back-weighted. There's a literature review in the middle of the term (which is a decent bit of work), and some short completion assignments throughout the term, but the major workload is near the end of the term, when you're putting together your final scope of work (the detailed plan of what your research will entail), and presenting it to the profs and your organization partner. Overall, it's a lot of fun, and it's pretty cool that the projects are grounded in real-life work. Definitely take the class if this sounds fun!\"",
            "review 2: \"22W with Anne Sosin, Ronald Shaiko: Sort of a weird class. The other review summarizes it well. DIdn't exactly enjoy it, Sosin can be condescending, though I like Shaiko quite a bit. It was new so a lot of expectations were vague and uncertain. Did not appreciate Sosin's communication via email (emailed once about a health issue and she totally ignored the email) and she ignored other emails, too. Feel like I didn't learn a ton here and the readings were optional, at best. Also wasn't a huge fan of working in the same group for an entire term. A pretty meh class, not that much work at least, but just really didn't feel an impact.\""
        ],
        "Anne Sosin": [],
        "Ronald Shaiko": []
    },
    "PBPL083.01": {
        "Jennifer Jerit": []
    },
    "PBPL083.02": {
        "Jason Barabas": [
            "review 1: \"21W with Jason Barabas: STAY AWAY from this classs if you value your time and life. We started the first week with 8 students. The day after add/drop, we were down to 3. The people who had experience with public policy were the first to quit. Only the freshmen stayed as they did not know better. Worst class I have ever taken. Every Week: 400 pages of academic papers to read for the two classes you have to present on these readings, so you can't just do half of them Assignments: Class readings Class presentations Responses Mini essays Midterm Final Final Essay Project Any other assignment type you can think of, they are here. Be ready to spend 25+ hours a week on this course. Oh, you have other classes?, well that's too bad... sucks to be you.\""
        ]
    },
    "PBPL021": {
        "David Rezvani": []
    },
    "PBPL027": {
        "Melissa Herman": []
    },
    "PBPL046": {
        "Herschel Nachlis": [
            "review 1: \"18S with Herschel Nachlis: This is hands down the best class I’ve ever taken at Dartmouth. It was consistently interesting and engaging. I’d sometimes go to class really sad or down (too many terms on in a row will do that to you), and the class would make me feel a million times better. I would leave class feeling happier which is an awesome thing that I have not felt in a class so far. Herschel is the best professor I’ve ever had, the class is so incredible largely because of him. He actually cares about students and takes the time to get to know you. If you leave Dartmouth without having taken one of his classes you’ve made a grave error.\""
        ]
    },
    "PBPL091": {
        "Ronald Shaiko": [
            "review 1: \"21W with Ronald Shaiko: I cannot stress this enough--TAKE THE MONEY. Do not do this for credit, it's not worth it. The A median is deceiving--you have to do a LOT of work to get that grade. You will definitely learn a lot about your topic and testifying is cool, but this is absolutely not a layup.\""
        ]
    },
    "PBPL085": {
        "Herschel Nachlis": [
            "review 1: \"21F with Herschel Nachlis: I implore you to never take a class with Herschel Nachlis. He is EASILY the worst professor I have had at Dartmouth. We had to write a weekly 3-5 page memo based on the readings for this class and it took him six weeks to grade our first six memos. So we had no feedback whatsoever until the class was over halfway done. Also, he simply has no social skills and that made every \"discussion\" awkward and not beneficial to our learning. For the travel component of this class, since it was still COVID, we went to D.C. instead of going international. Based on what I've said so far, you can imagine how traveling and spending 12 days with this man might be. Complete chaos, obviously. Details about the trip like meeting locations, meeting times, per diems, etc. were changing constantly. And not due to external factors either, purely due to his incompetence. When we actually sat down for these meetings, he would not even introduce us or describe what the class was about to the people with whom we were meeting. He would just say we were excited to talk to them and the students would have to apologize for his ineptitude and actually run the meeting while he sat back, completely unaware of how socially inept he is. I can understand that some people just have no social skills and can't change that. And that's fine, but those people should not be in charge of leading students on a 12-day trip where we meet with important people. Nachlis is a horrible representative of Dartmouth College and I would be shocked if any of the people we met with ever want to meet with him again. HOWEVER, he is completely self-aware about how disorganized he is, he just chooses not to fix it. For example, at the end of the trip he offered to provide the email addresses of the people with whom we met in D.C. so we could follow up/network with them. When I asked him for the email addresses of the people with whom we met, he said (and I quote): \"As you might imagine, I didn't keep such a list.\" This guy is a horrible prof and it is my fervent wish that he is dismissed from Dartmouth as soon as anyone with any power to do so removes their heads from the sand and realizes how bad he is. At the very least, I hope he doesn't get tenure.\"",
            "review 2: \"21F with Herschel Nachlis: Nachlis has his quirks, but overall is a good guy. While he was disorganized at times during the class and the trip component, I learned a ton in the class and I am glad that I took it with him. He was really good about hearing student voices, and I thought he facilitated discussions very well. The discussions in this class were among the best I have had at Dartmouth, and although the weekly papers were sometimes a pain, they made sure that everyone did the readings and had something interesting to say rather than just parroting buzz words as often occurs in discussion-based classes. Sure, there were some things he could have improved upon (getting us papers back quicker, being more organized) and he is a little awkward (which he openly acknowledges), but he is not an awful person as the other review makes him out to be so I would take the harsh review above with a grain of salt. Our discussions with the speakers were great and they stayed and often had dinner with us, and we had a lot of room to ask them questions beyond just the class. I would take the class with Nachlis again if given the chance.\"",
            "review 3: \"21F with Herschel Nachlis: I agree with the latter positive review. The negative review was written by a particularly difficult student in the class, and reflects his own misgivings and issues rather than an accurate assessment of the course. I would gladly recommend this course and Professor Nachlis to future Dartmouth students.\"",
            "review 4: \"21F with Herschel Nachlis: I agree wholeheartedly with the positive reviews and echo that the first review was written by a difficult student. While this class was probably the most work of any class that I've taken at Dartmouth, it was worth it. The trip at the end was really fun and intellectually satisfying. We got to meet with some really cool people. Nachlis is great and it was fun getting to know him. Overall, a very rewarding experience.\""
        ],
        "Charles Wheelan": [],
        "Ronald Shaiko": []
    },
    "PBPL084.04": {
        "Herschel Nachlis": []
    },
    "PBPL084.02": {
        "Ellen Meara": []
    },
    "PBPL082.02": {
        "John Campbell": []
    },
    "PBPL082.01": {
        "Daryl Press": []
    },
    "PBPL081.09": {
        "Linda Fowler": []
    },
    "PBPL052": {
        "Linda Fowler": []
    },
    "PBPL051": {
        "Ronald Shaiko": [],
        "Tanya Jones": []
    },
    "PBPL045": {
        "Ronald Shaiko": [
            "review 1: \"22F with Ronald Shaiko: This class is meh but you have to do it if you want to work in the PRS. I don’t think Shaiko is teaching it again though, which may mean it’s better in the future. Shaiko is super picky about minor unimportant crap in your papers, which is a pain. I also don’t think he gives grades out other than A- no matter what you do. Don’t do the reading either because it’s worthless and highly excessive. Lectures are also just Shaiko talking for a full 2 hours. I don’t know how he does it. Know that all the projects are in groups, so if you don’t get good groups you’re kinda toast.\"",
            "review 2: \"21F with Ronald Shaiko: I greatly enjoyed the different kind of course structure. Other reviews have done a great job describing the grade structure and do be aware that nearly all of it is group projects, so your group members make a significant impact on your experience in the course. Shaiko has very open and flexible office hours especially in the lead up to a project, so I would strongly recommend bringing a copy in advance for him to take a look. Like his other courses, Shaiko grades a lot on formatting and other surface levels items, rather than substance. Pay close attention to the formatting and all his other requirements as they will not be mentioned anywhere on Canvas or anywhere except in class. Throughout the course I was never worried about receiving a B+ or lower, so take that as you want.\"",
            "review 3: \"21F with Ronald Shaiko: This class is fully project based which has its ups and downs. While this means that there are no formal midterms or finals on the assigned readings, it doesn't mean that the class is any easier. I wouldn't call it a complete layup because it definitely required a lot of input, research, and writing especially as the deadline of the project approached. Moreover, you only get to choose your group for the last project, so your experience can definitely vary depending on who you work with. Shaiko definitely has specific formats he wants us to follow, but he is always open and available to go over your work and give feedback. I recommend finishing a draft a couple days early and then presenting it to Shaiko because he will tell you what he wants. In class you don't really work on the projects, so the two hours is mostly lecture style. He had some really cool guest speakers and there was even a session on public speaking that was really helpful. Overall, I recommend this class if you're interested in the public policy minor, gaining real worl experience, and if you want to work in the public policy research shop in the winter and spring term.\"",
            "review 4: \"20F with Ronald Shaiko: This class sucks. It's super boring, it's a ton of work, and Shaiko is really inflexible and totally does not care if you have stuff going on outside of class. He gave me a B- on my final project (a partner project where groups are assigned--unfortunately i got unlucky and my partner didn't do anything) because I was sick during the class where he explained how he wanted the paper to be formatted and I did the formatting differently. He also refused to grade me separately from my partner. In terms of workload, we had hundreds of pages assigned for each class on top of three big policy research projects. The readings are totally irrelevant to class, so if you do end up taking this then don't buy the textbooks. The lectures are super dull and they go on forever. The guest lectures are very interesting and seeing students present their projects was cool, so I think I would have enjoyed this class if Shaiko wasn't the one teaching it. If you can find it with another prof, give it a try! If it's with Shaiko, it's honestly not worth it.\"",
            "review 5: \"19F with Ronald Shaiko: PBPL 45 is a pretty unique class—readings don't matter at all, and the lectures are basically substance-less and a waste of time (you still have to go tho bc there's an attendance grade). Your whole grade is determined by three major projects you do, one of which (project #2) is a real project for the Policy Research Shop. The first project is fake nonsense meant to get you writing and formatting in the style Shaiko wants for the PRS, and the third project is a Social Impact Practicum component where you do grant-writing for a real non-profit. It's cool that Projects 2 and 3 have real-world significance, but also weird that this class is really just a workshop for these different projects. The PRS is a cool opportunity, and if you're interested in doing it, you should take 45. But if not there's really no reason to take this class. It's weirdly hard to get an A bc Shaiko is very nitpicky about real minor stylistic things, but it isn't hard to complete the three projects (as long as you have good group members).\"",
            "review 6: \"18F with Ronald Shaiko: This class feels like what it is like to work in the real world. If you took Pubpol 5 for First Year Fellows and hated it, this class is so much better. Shaiko is much less of a hardo and there are no midterms or finals so all the \"required\" reading is irrelevant. Nobody does it so don't waste your time. The class is based on group projects with clients in the Upper Valley which are actually interesting and if your group is good (read: hard workers and easy to get along with) then you will be good. The workload is variable from week to week but not overwhelming at all. This class also allows you to work in the Policy Research Shop which you can get paid for and is a cool experience to have as an undergrad.\"",
            "review 7: \"13F with Ronald Shaiko: Course: PbPl 45 is not really like any other class I've taken at Dartmouth in the sense that nothing is really set in stone. Two group papers and a final individual paper are there, but besides that, there really isn't much to do. Readings look unreal, but there is no midterm or final, so in reality reading is kind of irrelevant. On the flip side, it makes you think like a researcher, and you work on projects that actually are given to you by State Senators, nonprofits, etc. It makes it pretty sick. Professor: This is my second class with Professor Shaiko, and he is still a mystery to me. He appears cold and uncaring, but if you put in the work, he will work with you. He's a man of few words, but he is super knowledgeable in public policy/govt. In this class, however, he does not help you so much as he designs the class so that you become adept in doing research yourself. Workload: Although the \"req. reading\" looks scary as shit, there is no midterm/final, so you don't really need to do it. At some points, specifically when projects are due, you work with your groups to get them done, but at other points, there is little work. It's a nice workload. Makes you work hard at some points, then lets you relax at others.\"",
            "review 8: \"09F with Ronald Shaiko: Professor Shaiko may be the best professor at Dartmouth. He is a very easy grader, always available outside of class, and knowledgeable about everything. The readings are completely unnecessary and class discussion depends on what Shaiko wants to discuss that particular day. Guest speakers came in a couple classes to mostly talk about state government. The policy briefs written in the class are tough and time consuming, but Shaiko is an easy grader and will always read your brief before and tell you exactly what to do to get an A. If you're looking for a class that will give you research experience but you can still show up hungover for without penalty, Public Policy 45 is it!\"",
            "review 9: \"08F with Ronald Shaiko: Shaiko is a wonderful professor, always helpful and interesting. This class was, as expected, heavily weighted towards your projects. When your projects are due, you really have a lot of work. But, there really wasn't that much work at all.\"",
            "review 10: \"07F with Ronald Shaiko: If you're a policy minor, this class is worth looking into...you spend most of the time learning about the research process and writing research reports. One advantage of this class is that you have some level of flexibility in all of your assignments- you get to choose or pick from a list of topics. Visitors to the class included state legislators and staffers, which provided interesting insights from their perspectives. There are a lot of readings assigned for the class, mostly in the first half of the term, but you could get by fine without doing any of them, since your grade is based on three projects. The only real crunch times were the week before an assignment was due, and the time went surprisingly fast between assignments. Shaiko is a good prof, knowledgable and responsive to questions.\"",
            "review 11: \"07F with Ronald Shaiko: So this is not your typical Dartmouth course... instead of writing papers or taking tests, students do actual public policy research for the Vermont and New Hampshire state legislatures. As this research is for real, Professor Shaiko has high standards. If you take this class you will spend a lot of time on your research projects... but honestly the research is pretty interesting. Don't do the readings... Prof. Shaiko assigns like 300 pages a week... boring and totally unneccesary. Overall a solid course that provides a nice change of pace from more traditional dartmouth course work.\"",
            "review 12: \"07F with Ronald Shaiko: If you like public policy, then this is a good class to take. You will learn a lot. It is a significant amount of work, however.\"",
            "review 13: \"07F with Ronald Shaiko: This class is a great class in that it is applied. You actually work on real problems facing the world, primarily in the form of reports for the NH and VT legislatures. However, the class general goes in short intense bursts. Periods of just lectures and discussions, and then lots of lots of work. And then calm. Then lots and lots of work. I didn't mind it, but if you're one to need a steady and predictable stream of work in a class, then this might be harder for you to cope with. Overall, a very good class, though.\"",
            "review 14: \"07F with Ronald Shaiko: A lot of courses I've taken at Dartmouth (e.g., in the Government Department) are very theory-based. While it is nice to occasionally delve into abstract issues to see which theoretical model fits best for an event, PBPL 45 was an extremely refreshing change of pace from all that. But before I can extol this course's strengths, some background information is necessary. The New Hampshire and Vermont state legislatures consist of part-time, unpaid legislators who generally have no staff. Many are retired, and a good portion never even attended college. Unlike other state legislatures (like California's and New York's), the NH & VT ones don't have always have the resources or expertise to delve into important policy issues. Thus they are more reliant on third-party groups to help supply that information. That's where the Rockefeller Center's Policy Research Shop comes in. The PRS is a non-partisan think-tank that provides non-partisan, objective research for the New Hampshire and Vermont state legislatures. A legislator requests the PRS to look into a topic, then groups of roughly three students work together to research the topic, the students work with Rocky staff to refine their skills, and then the students testify to the state legislature to present the results of their 10-page reports. In PBPL 45, you choose from a list of topics to take on, and work with classmates to begin research on the project. Topics this term included: highway funding, riparian zone protection, cellulosic ethanol, mental health in prisons, state broadband Internet access, financial literacy, and a few others. PBPL 45 also serves as a prerequisite to work in the PRS for future terms - for course credit, or for pay. So you technically start working for the PRS when you take the course, and have the option of continuing your work in subsequent terms. I found this class to be extremely practical for several reasons. First of all, you're researching real issues for influential people: there is no doubt in your mind that your research will help improve VT/NH state policies. Secondly, to maximize the value of the research you do, you have to work on your research, writing, and presentation skills - all three of which are always useful to improve. Thirdly, when applying for jobs, PRS experience is an amazing way to distinguish yourself from other people; after all, how many people can say they've done research for, and then testified to, state governments? Whether or not you want to work for a government-related career, this experience would definitely help you. Although the essence of the class is doing research on your given topic, we also had two peripheral assignments: updating an outdated policy paper, and writing a grant proposal. The policy paper update was a little trivial, but the grant proposal (which was due during finals period) was a fun, laid-back assignment. As the other reviews for this course suggest, the reading assignments throughout the class were manageable. I'd like to point out how this class pays much more attention to refining presentation skills than the average class. Not only do you get a PowerPoint & public speaking lesson, but throughout the class each student ended up speaking in front of the class four times (with only one of them having a PPT). After each time we spoke, there were multiple opportunities for feedback both on the substance and delivery of our presentations. The only downside to the class is that it is somewhat time-consuming. Contrary to what the number suggests, Professor Shaiko refers to PBPL 45 as a \"seminar-level class.\" We used most of the x-hours, and it always seemed like there was some assignment we had to fervently work on. Policy Project II (the one where you work for the PRS) was by far the most time-consuming part of the course, since it was the only group project, some groups received their assignments 1-2 weeks earlier than others, and some assignments were more difficult than others. For those who don't know him, Professor Shaiko is definitely a good professor. He's extremely knowledgeable about a wide variety of policy issues. He's also the most accessible professor I've ever had in terms of office hours - you can visit him in his office basically anytime throughout the day. He's more than happy to spend time talking to you and answering your questions. As assignment deadlines roll around, he also stays well past 5 PM, and even comes in on weekends. When Prof. Shaiko applied last year for PRS funding, the Ford Foundation realized the potential and granted $300,000 for the Policy Research Shop. If you're interested in making a difference and doing substantive work, then I'd suggest that you take advantage of one of the best opportunities Dartmouth has to offer.\"",
            "review 15: \"07F with Ronald Shaiko: This was a pretty good class. The lectures were usually interesting, and the paper/project topics were great--the opportunity to actually apply yourself to real problems is great when compared to other classes. My problems with the class were as follows--the readings were totally useless and incredibly boring. Luckily, everyone in the class realized that, and, as there are no tests, no one actually read them. Secondly, all of the work for the class fell into the second half of the term. During the first half, there was very little work. During the second half, there was A LOT of it. Still definitely worth it, highly recommended.\"",
            "review 16: \"06F with Ronald Shaiko: The course was extremely practical in gaining experience in the policy world. Professor Shaiko is highly experienced and provides the necessary information to get you started on policy research in an interesting and easy manner. The theoretical and background readings were completely useless- don't even bother buying the books. The class is really about the projects (one on Medicaid, one major group project on a specific policy issue, and one on grant writing and presenting). The group project was an enormous amount of work, but we studied with some of the best experts at Dartmouth and ended up presenting our findings multiple times to a committee in the NH House of Representatives (incredible experience). This class gave me the most invaluable information and experience I've had yet at Dmouth and beautifully prepared me for a future of policy research. Absolutely take it if you want to pursue pbpl research, but be prepared to work.\"",
            "review 17: \"06F with Ronald Shaiko: I learned more useful and applicable information and skills in this course than in any other at Dartmouth. A lot of the assignments seemed like baptism by fire - things that we had never done before and were working on strictly from former students' examples - but Professor Shaiko was extremely available and guided us through the projects. Most time outside of class was spent on assignments rather than reading, and the grade was made up of three assignment/\"paper\" grades and no exams.\""
        ],
        "Kristin Smith": [
            "review 1: \"23F with Kristin Smith: This class is only good for a pre-req for PRS but it honestly almost makes PRS not worth it. Structure is terrible--a Stata problem set, a secondary data analysis project and presentation (think Gov/Econ 10 term long project done in two weeks), your PRS proposal (which so little time is spent on), a grant proposal for an Upper Valley NGO (why?), and participation. The pre-req is any stats class but the exception was made for students and then anything coding was taught in Stata (so learning R was a waste). Every project is a group project except for the problem set which means one group member gets to do it all! Horray! This class is not the sharky-Gov/PbPl kids you've come to expect from these classes. Honestly, I miss those kids because at least they know stuff and get stuff done. There were so many kids in this class who didn't literally a single thing or were just so unknowledgeable about anything tbh. The entire class is dependent on what group you get and your project. Some of the grants, for example, were so hard to write because the NGOs changed what they wanted the grant for so often and some were so easy to write because they were for a specific purpose. Also, it's past finals period right now and over 50% of the class isn't grade. No presentation grades have been put in, and the presentations were HORRIBLE because of it. Every group went over time because there were no consequences. Grades are likely going to be all vibes because if not, there's going to be a B median. There is so much assigned reading that I just never did but that meant that I actually learning nothing besides from the assignments. Lectures were so pointless. Honestly overall you need this class for PRS but be prepared for it to be a grind and to not learn that much. I miss Shaiko :(\"",
            "review 2: \"23F with Kristin Smith: Before going into this class I was expecting to write a positive review, because anyone is better than Shaiko, right? For context, if Ron Shaiko has no haters, then I am simply dead. Now I wouldn’t say this class was worse than pub pol 5 but it was a slightly different kind of bad. Less of a hostile learning environment, more dull, but a similar lack of organization. The class was all based on group projects (so group members really matter!!) that have no instructions and the only feedback we got was illegible and 5+ weeks after we turned them in. First stats project was super broad and irrelevant to the rest of the class, second project was ok because you are actually doing something but grading was wild, third project was writing a grant for an NGO that doesn’t need it and serves some weird niche that frankly should not be funded. I also feel like I learned nothing in this class other than to never donate to an upper valley nonprofit. Every class was a waste of time and none of the readings were worth doing. In the end I got a good grade (class had A- median) but it also came out of nowhere (I haven't received over 20% of my grade as two of my three presentations, class participation, and an assignment worth 10% are still not graded on Canvas despite me having a grade on my transcript). PRS is a cool opportunity and Smith is a nice person but be prepared for a lackluster class.\""
        ]
    },
    "PBPL044": {
        "Jason Barabas": [
            "review 1: \"23W with Jason Barabas: Most haphazard class I've ever taken at Dartmouth. I had high expectations and hopes for this course, and I came away learning very little about polling practices. Lectures almost never stayed on topic and were frustrating when you had to be responsible for a lot of course material. Final project was interesting, but it was so similar to Experiments in Politics that I would recommend just doing that class instead\""
        ],
        "Mark Williams": [
            "review 1: \"07F with Mark Williams: You will never work as much for any class as you do for this one. Fortunately the material is interesting and I for one really enjoyed learning how to use iMovie. But way too much is expected in terms of readings, writing, and the video assignment. It didn't help that we couldn't even access a lot of the early readings off the online course reserves.\""
        ]
    },
    "PBPL043": {
        "Andrew Samwick": []
    },
    "PBPL042": {
        "Lucas Swaine": [
            "review 1: \"20F with Lucas Swaine: Super interesting course. Swaine is very prepared for class and created good lectures that you had to watch before each meeting that were discussion based in breakout rooms on Zoom. The readings and arguments were very interesting and the discussions were lively without being intimidating. There was a 1-hour open note midterm exam, a 7 page paper with a prompt Swaine gave, and an open note final exam that you could take in any 24 hour time block during finals week. Participations counted for your grade as well and it probably helped if you participated and went to office hours but you can do fine in the class without being overly involved.\"",
            "review 2: \"09F with Lucas Swaine: The material itself is quite interesting. The professor was helpful and knowledgeable, even if he was a bit quirky. Overall, I would recommend this course, as it gives you a good perspective on different arguments in ethics.\""
        ],
        "Julie Rose": []
    },
    "PBPL041": {
        "Julie Kalish": [
            "review 1: \"23S with Julie Kalish: Awesome course! You learn so much about the art of persuasion from law, psychology, art, film, philosophy, and so many other disciplines. Professor Kalish provides excellent feedback to help you grow as a writer and communicator. The students in the class were all extremely smart which could be intimidating at times during discussion but go to Prof Kalish (early in the term - whether it be after class or in OH) and ask her to look over drafts; you can replace your score on the individual paper with each latest draft. Workload definitely ramps up towards the end with the campaign project, so if you stay on top of your paper / campaign early on in the term you will have a less stressful end of term. The final deliverable is so satisfying to turn in as a culmination of all your hard work.\"",
            "review 2: \"23S with Julie Kalish: I liked this course but not as much as I thought I would. The readings and daily material felt disconnected at times from the culminating project. The assignments could pile up on certain weekends with those and big project deadlines. The course could have been better organized, but Professor Kalish is nice and helps the class feel engaging. It was a manageable end to the PBPL minor (especially as a lot of people already knew each other in the course, and there were good overall vibes!), but the course itself could be improved.\"",
            "review 3: \"23S with Julie Kalish: Loved the class - Professor Kalish is amazing and her class was such a highlight of my term. The work is manageable BUT it is not a guaranteed layup, which I learned the hard way. A few tips if you do take the class to avoid ending up with a stressful last few weeks (like I did): 1. Go to office hours, ask for feedback, submit drafts, etc etc WAY more than you think you need to. A big part of your grade is the “process grade” which can either bring your grade up or down a whole letter. The process grade is based on your performance beyond just assignment-specific numerical grade values. So things like class participation, timeliness with assignments, revision effort, division of work in your group, etc can be the difference between an A- and a B+. When in doubt, turn in a draft in advance. 2. Week 1 of the class you pick a campaign topic to work on for the entire term. Pick the least complicated, most feasible topic, even if it’s not the most exciting. The more research/work that exists already on your topic, the better. 3. You’ll be asked to rank your choice of topics and to request group members, and then to say which of the two is more important to you. Best advice would be to say group members are more important. This is *the* most popular senior spring pubpol class for a reason (it’s usually a layup) so make sure you’re in a group with people who are on the same page as you about how much work you plan to put in for the class (best bet is other seniors).\"",
            "review 4: \"22S with Julie Kalish: This was a great course, whether it be for interest, an art distrib (particularly if you are avoiding traditional art classes), or for Professor Kalish. A lot of seniors take it, and it's a nice class community because of the many class discussions. A lot of the weeks had a lighter workload, but the policy campaign paper and media campaign were time consuming. It was neat doing work that seemed applicable to the real world, such as (in groups) writing a letter to the editor, creating a media campaign (creating social media, website, flyers, etc), writing a keynote address, and a strategy memo and campaign timeline. This class reminds me of ENGS 12 project 6, but you are focusing on policy specific issues, and it is a lot less work. It was satisfying to turn in the binder with all the campaign materials at the end. It's a fun class, and Professor Kalish is one of my favorite professors at Dartmouth. She provides lots of feedback and is always available during office hours./\"",
            "review 5: \"21S with Julie Kalish: This is a great course. Professor Kalish is easily one of my favorite professors I've had at Dartmouth. The term is dedicated to an issue campaign in small groups, which means all the work is related to the campaigns (i.e., writing a keynote speech, making video ads, writing op-eds, media, etc.). It is a lot of fun and very rewarding when the campaign is done at the end.\"",
            "review 6: \"19S with Julie Kalish: I freaking loved this class. It was so much fun and doable. There is reading, which I would recommend doing, but you can make your way without doing it. The class is one big project with a group but it's a fun project but it can be a lot of work. I would say if you need a class, whether it's a layup or out of pure interest, just take this class. You will not regret it.\""
        ],
        "Nancy Crumbine": [
            "review 1: \"07S with Nancy Crumbine: ok...nancy crumbine is a complex professor...she does not grade anything! and at times I wonder if she even reads our papers...i was a bit disappointed at the wirting assignments as they pertain to public policy..we had to rewrite all of our papers about 5 times...but the papers did not cover a broad range of public policy areas..but rather only one area that we focused on..and our papers were not samples of what *real* public policy papers are about.. She is very helpful outside of class and we were required to meet with her twice, but you could meet with her more...and goes a great job facilitating discussion in class as well as bringing up interesting issues..so make sure to TALK!... she is a very spacey..and forgets what we have to turn in.. all i can see is be very cautious..SHE HANDS NOTHING BACK, DOES NOT GRADE ANYTHING...but i think her spaciness is what my the class a good expereince\"",
            "review 2: \"07S with Nancy Crumbine: the class isnt really on any specific material that is really interesting. you basically come up with a policy proposal and write about it in a bunch of different formats--which gets very redundant--throughout the term. but, the point is to improve writing, and i think its a good refresher course for the basics of good writing.\""
        ]
    },
    "PBPL040": {
        "Charles Wheelan": [
            "review 1: \"20X with Charles Wheelan: Unbelievable prof + super interesting class. As others have said, you explore a broad range of topics that are highly applicable. One of the most applicable classes to life after college at Dartmouth. Definitely a challenging workload and Wheelan is a fairly tough grader, but if you're willing to work hard and accept that an A is necessarily guaranteed then I would highly recommend.\"",
            "review 2: \"20X with Charles Wheelan: Incredibly worthwhile and relevant class. Honestly not as much reading as the other reviews say. Even doing a light reading will give you the necessary information to complete the video quizzes. There is one exam that you need to study a decent amount for, and other than that all assignments are written. The books and articles are interesting so the reading doesn't feel like a burden. Additionally, Wheelan is an incredible lecturer. I really wish I could've taken this class in person.\"",
            "review 3: \"20X with Charles Wheelan: This was a great class, but a LOT of work. If you are not super interested in the class or are taking other hard classes, do not take this class in addition. However if you are willing to dedicate the time and effort, I highly recommend this class. Professor Wheelan is a great lecturer, and he made himself available for student questions. The class makes you a more worldly person through a greater understanding of the public policy process and important policy issues (ex. education, US healthcare, taxes, environment, income inequality, budget crisis, etc). The class is a LOT of reading. Class layout (during virtual term) was 1 midterm, 1 policy proposal, 6 video quizzes, 1 group policy proposal, and 1 book review.\"",
            "review 4: \"19X with Charles Wheelan: This class was really good! I wouldn’t call it a layup per se, but Prof. Wheelan is one of the best lecturers and professors at Dartmouth! I learned so much about the intersection of economics and public policy! The class also had a manageable workload, although there was about 3-4 hours of reading for each class meeting (twice per week since PBPL040 is generally a 10A). It consisted of one pop quiz per week on the reading (worth 15 percent of our grade collectively), a midterm (25 percent), a group presentation (10 percent), a final exam (25 percent), and a policy memo (worth 25 percent of our grade, but students could do a rewrite and the final grade was an average of the two grades). It’s also very manageable for students - like me - who have not previously taken econ. Definitely don’t miss this class during sophomore summer if economics or public policy interest you!\"",
            "review 5: \"19X with Charles Wheelan: Everyone is right that Prof. Wheelan is a great guy. However, I wanted to add a comment that's not glowing for once for this class (shocking I know). I did fine in the class and really enjoyed each class because he's a very interesting lecturer and the material is fascinating, so this isn't coming from resentment because of a poor grade. First, the class is ALL lecture. If that's your thing, great! But he has a very specific planned out lecture and often asks the class questions during each class (where it can often feel like a competition of who is smartest and quickest to raise their hand-- I noticed a lot of the people on the shy side never speak up because of this which was sad) to which he has a VERY specific pre-planned answer in his head that he wants the student to regurgitate. He has a few examples that he uses to illustrate things in his various books (which are quite good) but isn't very receptive to new points of view or discussing the topic in question. Instead, he wants you to see it the way that he does and use the examples that he keeps coming back too. The midterm and exam are extremely tricky and frustrating because even if you understand everything well each question is short answer (aka long paragraphs) and you can receive up to 5 points. In order to get all 5 you have to read his mind and think like he does-- mention the examples HE likes, be very specific, cover everything that he wants you to touch on, etc. It's essentially playing a mind game with him which I personally really dislike, but I know some people prefer that. The policy memo is flexible and pretty fun! I didn't NOT like this class but it's really tailored to a specific type of student and how well you can suck up (he definitely plays favorites, even though it's not with bad intentions), it was just not quite as amazing as I thought given all of the incredible reviews. Oh, and also the \"pop\" quizzes are super easy they're just to make sure you did the reading (which can be a ridiculous amount honestly) but he makes them very very simple which is nice. Hope this helps :)\"",
            "review 6: \"08X with Charles Wheelan: This class was amazing. The professor really got everyone interested in the topic and discussion was great. Tr and take a class with Wheelan during sophomore summer...it was the best class I have taken ever, and I learned more than I ever imagined, plus the work was not hard at all!\"",
            "review 7: \"08X with Charles Wheelan: Very interesting class....really lets you analyze the policies politicians put forward and see how most of the time they are nonsense....assessments were very fair...most of the work was reading which I found relatively interesting\"",
            "review 8: \"08X with Charles Wheelan: best class ive taken. approaches lots of current policy issues from an economic perspective, such as environment, education, etc. very interesting. wheelan is by far the best prof ive had. he was entertaining and a great lecturer. he did a good job of facilitating discussion in a relatively large class. take a class with him!\"",
            "review 9: \"08X with Charles Wheelan: This class is really amazing. You learn a ton of very interesting stuff about issues that affect everyone. Professor Wheelan is a great lecturer, very responsive to students' questions and remarks in class and is great at keeping attention during the long 2A. He is also very careful to look at both sides of every issue in a very level headed and moderate fashion. Lectures are very entertaining and interesting and the readings complement them very well. I've never done anything with public policy before, but this class served as a great intro to it and many issues surrounding it. I would highly recommend the course as it has been very valuable to me and I learned a ton from one of the smartest and interesting professors you'll ever hear from.\"",
            "review 10: \"08X with Charles Wheelan: Prof. Wheelan is great; the class discussions are interesting, but real economic concepts are glazed over and too many topics are discussed to really get into anything in depth. Tricky midterm that can really mess up your grade.\"",
            "review 11: \"08X with Charles Wheelan: Prof. Wheelan rocks... its just that simple. He is funny, engaging, and wickedly brillant. I totally enjoyed going to class. The subject matter we covered was facinating. Each week of this course focused on a different major policy area (ex. health care, education, poverty, trade, etc). Lectures were really thought provoking. Warning: Prof. Wheelan assigns a ton of reading that you actually have to do because he quizzes reading weekly... so do not take this class if you plan not to read or not to go to class. Also, the midterm is a bit tricky (he's a tough test grader) but the final paper was really easy. Take this class if you have any interest in the big issues of our generation... seriously one of the best classes I've taken at Dartmouth.\"",
            "review 12: \"08X with Charles Wheelan: Professor Wheelan is a great professor. it sucks this class is a 2a, because there's a lot of readings. very easy class though and interesting. midterm can be tricky, not really something you can study for though.\"",
            "review 13: \"07X with Charles Wheelan: I'd recommend this class to anyone who is interested in politics regardless of his/her major. It really helped me to understand a lot of current issues such as social security and education reform. Professor Wheelan invited us all over to his house for dinner, and I felt like I really got to know my classmates. There is a lot of reading in the first half of the class but a much more manageable amount during the second half.\"",
            "review 14: \"07X with Charles Wheelan: This was one of the best classes I've taken at Dartmouth and the only class I've ever been disappointed to finish. Professor Wheelan is fantastic, he's down-to-earth and genuinely interested in his students (he invited our entire class to his home for dinner with his family). His vast experience, knowledge, and creativity make him an exceptional teacher. The course itself provided a broad yet inclusive overview of the major issues that are being addressed in the '08 election. I feel like the class left me incredibly well-versed on the policy issues and with practical economic concepts.\"",
            "review 15: \"07X with Charles Wheelan: Both the material and Professor Wheelan made this course one my favorites. As a non-major, I learned a great deal about important issues in our society. The final paper allowed for in depth analysis of a presidential candidate. It was due a week before finals period, making for an easy end of the term. The course had a lot of required reading (which had to be done for the sake of pop quizzes), but all of it was well worth the time, and the two-hour long lectures flew by. There was also a fun group presentation and a midterm exam. One of the highlights was reading Wheelan's own \"Naked Economics.\" Though Prof Wheelan is a Dartmouth grad, he is not a full-time professor at Dartmouth and only teaches during the summer. Take a class with him if you have the opportunity to do so!!!!\"",
            "review 16: \"07X with Charles Wheelan: wheelan is really great. he was a writer for the economist before becoming a top-rated prof at UChicago's public policy graduate school. he is a dartmouth '88 and he is just a greta prof who is very moderate and practical in his explanations of issues and he really brings out the economic issues of everything that is pertinent to current politics.\"",
            "review 17: \"07X with Charles Wheelan: Wheelan's an awesome prof-- very approachable, a good lecturer, and just a really cool dude. The class itself was very interesting, because we focused on a few issues and sought to understand them. Each issue could have made its own class, so in a sense this was a survey class; still it didn't feel too rushed, and we did actually go relatively in-depth.\"",
            "review 18: \"07X with Charles Wheelan: This was one of my favorite classes so far in Dartmouth. Professor Wheelan is a great lecturer, and just a very funny person in general. The readings were pretty intense (esp. over the weekends because this was a 2A), but you did end up learning a lot from them. It's a lot of information to take in but the prof. makes it very interesting. There's some economic concepts involved, but the prof. explains them very well so even if you're not a big econ buff, you'll understand it fairly easily. I'd recommend this class to anyone who has a slight interest in public policy.\""
        ]
    },
    "PBPL028": {
        "Herschel Nachlis": [
            "review 1: \"23S with Herschel Nachlis: I cannot recommend professor Nachlis (and this class specifically, if you are interested in law) enough. He is genuinely one of the smartest people I have ever met and cares about all of his students. That being said, take this class as your \"hard class\" of the term. The readings are long, but they are rarely redundant and almost all of the articles he presents to you say something different, engaging, new, and relevant (you should read to do well on his exams). He really wants you to learn. He sticks to the B+ median as all govt professors do, but he rewards improvement over the course of the term. This year we had a midterm W5 and a second \"midterm\" week 9 that was 1/3 cumulative and 2/3 material from the second half of the course. Because of that, we didn't have a final and there was no final paper. In addition to the readings (about 120 pgs/week) there were 7 weekly \"reflections\" (~3-4 pg papers) that you write about the readings. Obviously, this requires a lot of time out of class, but class itself was engaging, entertaining, and productive. You spend a lot of time in class talking about interesting current events related to law. If you are considering law school but can't decide if you would want to pursue it, this is one of the most impactful classes available for you at Dartmouth. Seriously, I cannot recommend this professor enough.\"",
            "review 2: \"23S with Herschel Nachlis: I second what was said before. He is undoubtedly an amazing professor, and the class was very interesting. The weekly reflections were 3-4 pages long and needed to touch upon the readings (which were pretty intense). With that being said, you only needed to submit 5 (6 if you wanted him to drop your lowest grade). The two midterms were very fair as long as you studied, but they were long. He responds to emails quickly and is available for help during office hours. The class discussions were always interesting and engaging. Yes, it is a lot of work but you learn so much and it was 100% worth it in my opinion. I do not recommend taking this with other heavy classes though.\""
        ]
    },
    "PBPL026": {
        "H Gilbert": [
            "review 1: \"18S with H Gilbert Welch: Professor Welch is so. Much. Fun. He is an extremely engaging lecturer, and I genuinely had fun in his class every day. This class isn't really that difficult. The first two weeks include a bootcamp to familiarize yourself with excel skills and some information about Medicare/Medicaid and the basics of the US healthcare system. 4 assignments per week due at 10pm on Canvas before class, which is pretty brutal. They're time consuming assignments, but they definitely taper off in frequency and time commitment as the course continues. You read Welch's book, which is a super easy read, and you don't have to engage with it much in class. This class has no essays - only assignments and exams. Exams are really easy. The title of this course is a bit misleading - you don't learn much about health policy outside of Medicare/Medicaid and all you learn about clinical practice is over-diagnosis and over-treatment. It gets a bit repetitive towards the end but this class is definitely worth taking, especially if you want a lively prof.\"",
            "review 2: \"12S with H Gilbert: Course: I would highly recommend this course. Learn a lot of useful analytical skills. Course is relevant for everyone whether you are pre-med, interested in health policy, or just interested in the class, since we are all consumers of health care. Really changes how you think about health care and evaluate it. Best class I have taken at Dartmouth. Professor: Best professor I have had at Dartmouth. Very engaging lecturer. Makes a strong effort to make class exciting. Very knowledgeable on the subject and nationally recognized. Pretty funny as well. Workload: Constant workload, but nothing too crazy. A lot of excel assignments early in the term and a consistent workload of supplemental videos and readings later in the term.\""
        ],
        "H Gilbert Welch": [
            "review 1: \"18S with H Gilbert Welch: Professor Welch is so. Much. Fun. He is an extremely engaging lecturer, and I genuinely had fun in his class every day. This class isn't really that difficult. The first two weeks include a bootcamp to familiarize yourself with excel skills and some information about Medicare/Medicaid and the basics of the US healthcare system. 4 assignments per week due at 10pm on Canvas before class, which is pretty brutal. They're time consuming assignments, but they definitely taper off in frequency and time commitment as the course continues. You read Welch's book, which is a super easy read, and you don't have to engage with it much in class. This class has no essays - only assignments and exams. Exams are really easy. The title of this course is a bit misleading - you don't learn much about health policy outside of Medicare/Medicaid and all you learn about clinical practice is over-diagnosis and over-treatment. It gets a bit repetitive towards the end but this class is definitely worth taking, especially if you want a lively prof.\""
        ],
        "Herschel Nachlis": []
    },
    "PBPL005": {
        "Ronald Shaiko": [
            "review 1: \"23W with Ronald Shaiko: Not a bad class at all with Shaiko. 2 exams, 3 Assignments, CANNOT EMPHASIZE ENOUGH THAT YOU SHOULD GO TO OFFICE HOURS OR EMAIL HIM TO LOOK OVER IT BEFORE SUBMITTING. However, some people still got bad grades after going to office hours so that doesn't guarantee anything either. Use the examples that he provides and hope for the best, I guess. Midterm and final require copious amounts of studying because there's just a lot of content, but besides that, there's not much work on a day to day basis in the class. Please please please write your exams in bullet format, I promise you will get a better grade. Never bothered paying attention during lecture, but I got all the information I needed to study during the review sessions held by 25s. Skim birkland for the vocab, you don't really need to read the other books unless you want to and have extra time, which you probably don't. He goes on super long tangents, as you probably have already learned from reading the other reviews, and talks more about his own experiences on the hill rather than getting to the point. Lots of try hard students which makes the class entertaining at times. He's retiring, so not sure how helpful this review will be but I did learn a lot about policy making and the inner workings of the branches of the government from having to study for the exam.\"",
            "review 2: \"23W with Ronald Shaiko: Decent class - Shaiko just retired so not super sure how applicable the reviews will be since a lot of the notable things about this class are specific to him. I found the 2nd half of the class (post-midterm) to be a lot more interesting/grounded in history and current events, which is really nice if you're interested in a specific domain of policy. Honestly wasn't that much work, especially if you're good at cramming material in before exams since the projects didn't really require you to apply the content of the class. Classes would be either very interesting or very boring - honestly I think even though you don't HAVE to read the books, some books were good reads and helped me understand/become more interested in the class material (Fragmented Democracy, Trade Offs were good). I'm surprised that a lot of the reviews are pretty negative, since I don't think this class was particularly bad or anything (just might be boring if you don't really like the structure/ultra specifics of policymaking, or are unsure about public policy in general). Agree that kids in the class are sweaty asf\"",
            "review 3: \"23W with Ronald Shaiko: This is not a class on public policy, this is a class on American government, and a VERY bad one at that. Some things I have learned (too much) about in this class: the Maxwell School of Public Policy at Syracuse, the best offices in Congress, just how big Shaiko’s ego is, how much vodka he used to drink, that he thinks he would make an excellent member of Congress, random and highly theoretical models of government that Shaiko invented but no one else seems to know of or use, to never do any readings (of the SIX books) he assigns, that he grades based on “gut feeling”, and his sister’s tax evasion. It took a lot of effort to even distill this irrelevant information from his lectures because they have no organization whatsoever. The assignments were oddly focused on formatting, writing out the word “percent” instead of %, and creating fake organizations as opposed to actual policy analysis. What I have not learned in this class: what public policy even is even though there was 600 pages of reading just to not define it, “the Nature of Public Policy, Making Public Policy, the Policy Players, and the Policy Game” (PBPL 5 course description). Somehow each of the 25s could teach more in their 1 hour review sessions than Shaiko could teach in an entire term (maybe because they could go 5 mins without trauma dumping or talking about working for USAID). Overall, the workload wasn’t even that bad, just the teaching was ABSOLUTELY ABHORRENT. I know this review won’t help anyone because he is leaving Dartmouth, but it was pretty cathartic to write.\"",
            "review 4: \"23W with Ronald Shaiko: Fun class. Really competitive students which I looovveeeeee. Super hard to follow lectures with long and verrryyyyy valuable tangents which was exactly what I was hoping for when I signed up for this class. Maybe my favorite bit of it was how much less enthusiastic I now am about public policy! It takes a good class to make you love something, but a really special class to make you hate it!\"",
            "review 5: \"23W with Ronald Shaiko: Have a great retirement, Shaiko! From a first-year fellow to everyone else, this class is hard but you learn a ton. Not sure who will teach it in the future and what the quality will be like, however, I do know that FYF is going to continue, so do well in class and set yourself up for DC!\"",
            "review 6: \"23W with Ronald Shaiko: This class is just a waste of time, but you have to power through it if you're interested in Fellows/the pub pol minor. Shaiko is an interesting character but not a good lecturer/teacher, not that it matters since he's leaving anyway. The workload isn't actually terrible, more so the atmosphere of the competitive kids gunning for Fellows, the stress when exams come up, and the general experience. Upperclassmen are super helpful so ask them for study tips/go to their study sessions. Good luck with Nachlis taking it over as I've heard he's even more disorganized than Shaiko was...\"",
            "review 7: \"23W with Ronald Shaiko: With Professor Shaiko leaving, there's not much to say that will be helpful but general advice for this class in the future. To contextualize, people hate this class because they don't see the value in it. The people who are taking this class are the ones who want to/need to know what levels and pay grades the bureaucracy has and what a college degree does. You know the people who complain about never learning taxes in school but then complaining about when they learn about how to file taxes? Yeah these are those people. If you want to apply to First Year Fellows but it's a half-effort because you really don't love public policy, I'm going to save you your GPA and time and tell you to not take this class. This class especially but the Pub Pol minor too is build for people who want to go into government. And, the limited number of fellows means the people in it may be more likely to get it. This isn't to say that you can't if you're a STEM kid, but it's something that you need to put effort into and actually care about. So if you don't really want it, there will be people who do and you will end up miserable, disappointed, and mad you waste your time. But if you have an interest in public policy or want to know how government REALLY works, this is the class and program for you. This is where you learn to do your taxes (figuratively).\"",
            "review 8: \"22W with Ronald Shaiko: I thought the lectures were really interesting and enjoyable. They’re pretty fast-paced and not very organized (i.e. he often jumps between multiple topics in one lesson), but if you are a good note taker you should be able to make sense of them and isolate important pieces of information. I also learned a lot from the readings in this class (read Trade-Offs, read Birkland, DO NOT read Essential Readings, if you have time read a chapter or two of Judging Statutes, Fragmenting Democracy, and Art of Policymaking, but you don’t need to). The professor is picky when grading exams, and he doesn't say why you lost points. Go to in-person office hours and ask questions during (literally while you are taking) the midterm/final. He will tell you things to change, things he’s looking for, clues/hints, etc. Some formatting things he prefers for the writing assignments: always justify your margins, write the word “percent” out instead of using the symbol %, etc.\"",
            "review 9: \"22W with Ronald Shaiko: Overall: I think this class is annoying, but honestly a good class to take. DO NOT DO ALL THE READINGS! Skim tradeoffs for the paper, and definitely read Birkland, but don't read the rest; they aren't necessary. I slacked off but I do think you can get an A-/B+ if you put in some effort. The three papers were really quite interesting to right, but the midterm and final were very content based, so make sure to start studying early. His lectures are all over the place and he tends to go off into many tangents, but you don't need to take notes on everything he says. Papers: They were fun to write honestly. LOVES format- go to him in office hours and he will help you. For the third assignment, do an amicus brief. Trust me; it seems they got the highest grades and were easier to write with the little outline/ info he gives on the papers. Do not do a memorandum - he wants it in a super specific manner and was super harsh on grading. Final/midterm: These were annoying. 1hr 5min for the midterm and 3 hours for the final (the same length - 3/4 short answers and 1 essay). He loves loves loves examples, so when studying for the midterm and final make sure you know examples of the committees and associations. I did better on the midterm because I studied more and paid attention (and binge read Birkland which helped a lot). The final was all about the policy domains so know those!!! This class was interesting and good to take, and I'm saying that as someone who ended up with a bad grade.\"",
            "review 10: \"22W with Ronald Shaiko: did not like the class. the bad reviews are bad for a reason. Shaiko is highly unorganized (although you kind of get used to it) and the lectures are all over the place. you only have to do the birkland readings and i would recommend going to office hours\"",
            "review 11: \"22W with Ronald Shaiko: As others have said, this class gets an unreasonably bad reputation. There are three writing assignments and a midterm and a final exam. The class is entirely lecture based. His lectures are definitely all over the place but you can extract what you need to as long as you pay attention. The homework is reading and pretty heavy but I only read the Birkland text which was sufficient. I wouldn't bother reading the other books. The papers are very interesting and fun to write -- you can essentially choose any current policy issue or interest group you are interested in and frame your paper around that. Shaiko will read over your paper and give you feedback in office hours which is very helpful. His assignments aren't super in depth but if you go to office hours he will be very straightforward with whether or not you're writing to what he's looking for. The midterm and final were both a little sketchier, the questions aren't easy per say but you can usually sketch out some form of an answer. Overall I would take this class even if you aren't interested in First Year Fellows, it's very interesting.\"",
            "review 12: \"22W with Ronald Shaiko: Because the layuplist reviews and hearing from upperclassman I thought that this class was going to be awful and just something that I had to get through, but overall I actually really liked the class. The stories about people being kiss ups and competitive are true, but if you have friends people in the class who you're friends with you'll bond through the shared hatred for these people. Cannot stress enough how important it is to go to office hours for all of the assignments. He doesn't really grade on content because he has like 100 assignments to go through, so formatting is everything (and he has a specific way he likes it). In terms of the midterm and finals, it's a lot of material, but if you get a start on reviewing it early do it!!! WRITE YOUR SHORT ANSWERS AND ESSAYS USING BULLET POINTS AND OUTLINES. I know people who I did better on the midterm and final on who we talked about the exact same material, but I got a higher grade since I used bullet points. for the midterm, know the heuristics models really well, for the final, know the policy grid really well. Overall, if you go to office hours for assignments and somewhat?? do the readings you should be more than likely to get at least an B+/A- in the class, which is all you need for fellows now that Shaiko isn't on the selection committee.\"",
            "review 13: \"22W with Ronald Shaiko: Honestly, Public Policy 5 gets a bit of a bad rep on layup list but the class is not that bad. To reiterate previous reviews, you do not need to do all the readings. That being said, Birkland is incredibly helpful, so make sure to read that one. Shaiko doesn't give rubrics for his 3 assignments, so it can be very frustrating to try and figure out what he wants for each assignment....it's especially frustrating bc he is really nitpicky. I found out too late in the term that he is willing to read over your paper; DO THIS. A lot of people in the class who do well just straight up get him to look over their papers during office hours and he'll tell u what he's looking for. Lectures are a bit all over the place at the beginning but become clearer at the end of the course. Honestly, I really enjoyed this course overall (I hated it around week 3-5 but that was just because his expectations are hard to meet) Side note: I'm sorry in advance for the freshmen trying to get into First-Year Fellows. It's annoying as shit being in this class if you just want to learn about public policy, but it's manageable/less annoying if you sit with someone who is chill and not competitive about the program.\"",
            "review 14: \"21W with Ronald Shaiko: This class was a little confusing to navigate, but overall it was not too bad. First of all, Shaiko assigns a LOT of readings, but I found that not all of them are actually super useful. The readings I would recommend at least skimming through are Birkland (probably the one you should actually read in-depth) and The Art of Policymaking. Don't buy the Essential Readings: the book costs a lot, and I didn't end up reading/using it at all. In terms of class structure, there are 3 short assignments, a midterm, and a final. The short assignments are not too bad--as long as you talk to Shaiko and understand what exactly he is looking for, you should be okay. On the other hand, the midterm and final were a little more challenging. The midterm wasn't too bad if you studied, but the final was a lot more than expected, even though we were given three hours (3 short 250-word answer qs with approx. 6 parts each, 1 400-word longer essay). Honestly, if you put in the work, an A- should be very achievable. However, getting an A is slightly more challenging. Overall, you come out of the class with a pretty solid understanding of how U.S. policymaking works.\"",
            "review 15: \"21W with Ronald Shaiko: This was a weird class. Way too much reading that I thankfully didn't do 75% of. Reasonable and interesting writing assignments. All over the place and difficult to focus on lectures. You have to take it for the Pbpl minor or for FYF and it's not the worst to get through, but I definitely breathed a sigh of relief when I knew I was done. A- very manageable; A a bit more difficult because Shaiko's grading is super picky and he takes points off for nitpicky formatting errors. Summary: not the worst, not the best.\"",
            "review 16: \"21W with Ronald Shaiko: This class was not a layup because of how many readings he assigned. Although I found them interesting, and its a more in depth look at what Shaiko casually mentions in class, they were not necessary for the essays and slightly useful for the exams. Since the class was so big, Shaiko kept the essays really short. And you get a lot of creative freedom with them, so they were pretty fun to complete. The class was all lecture, and almost everything he covers in class is on the exams. There were a few guests, like the author of the book we had to read, and that was really cool. You're definitely going to learn more about the policy domains (health, environmental, education etc.), and the overall policy process. Shaiko is extremely knowledgeable and will frequently talk about his experiences in Congress which I thought was really interesting. He also held virtual lunches for us during his x-hour and would tell more stories. So yes this class has its bad parts, but it has a lot of good parts too. There is no attendance nor participation requirement and the lectures are recorded. That being said, I would still recommend attending class so you don't miss anything before he starts the recording (Shaiko was not too apt at Zoom).\"",
            "review 17: \"21W with Ronald Shaiko: This class was simply horrible. Shaiko gave terrible lectures that weren't relevant to course material and weren't organized or easy to follow. He also assigned an exorbitant amount of reading work, a lot of which wasn't necessary or beneficial. I felt as if I was fully teaching myself the course content, and time in class was being wasted regularly. We had three writing assignments, none of which were long in length, but Shaiko explained the rubric and what he was expecting after we already had the essays submitted. I consistently found that I would get positive feedback on the content aspect of all of my writing assignments, but would get much lower grades because of unnecessary, specific details in the formatting of each assignment (Failing to include a mailing address for a fake and made-up interest group, not using subheaders when there was no explanation that it was required on the assignment, etc.). Exams were frustrating as well, because Shaiko would expect us to answer ten questions in one response, but only allow us to write 200 word responses. This restricted my ability to go in depth and fully answer the questions, and my grade would suffer. I understand Shaiko lowering the word amount to allow himself to have less work to read, but he simultaneously expected his students to cover a lot of content with very little words to do so, and that was angering to me. This class is obviously a necessary prerequisite, just be prepared for an awful ten weeks.\"",
            "review 18: \"21W with Ronald Shaiko: This class is a rite of passage for a lot of Dartmouth students interested in Government/Public Policy. Important stuff to keep in mind: you don't have to do all the readings! Figure out which ones are relevant/cover relevant topics. Shaiko likes to go off on tangents a lot, not everything is relevant so don't feel like you have to write everything he says down. There are a lot of kids who think that by participating as much as possible they maximize their chance to get into First-Year Fellows - they are wrong, the kids who speak the most often don't get in. You don't have to speak at all outside of small group discussions, most people don't talk during lectures as there is no participation grade. Let your work speak for itself. With that being said, this class is not too hard (relatively speaking) if you show up to class and do the work on time. The most time-consuming part of it would be the readings, so make sure you are being efficient with them. Not too easy to get an A normally, 21W is probably an anomaly because it was online so apparently grades were inflated a bit. An A- is probably achievable without too much stress for most people who do the work. TLDR; watch out for tryhard freshmen, do only the readings that matter, show up to class, A- achievable with some effort, A takes a bit more.\"",
            "review 19: \"21W with Ronald Shaiko: Very strange class, especially with the online format. It's huge - over 100 people - and mostly just Shaiko lecturing about various policy topics. Generally felt unstructured and that Shaiko was largely just talking about what he felt was relevant/wanted to discuss. The reading assignments are very heavy, but a lot of it wasn't helpful in the end, so don't feel like you have to do it all. The \"Essential Readings\" book was just an overpriced collection of dense and largely useless papers on policy theory, and the important parts are covered in the Birkland book, so don't bother with that. The assignments are more interesting, although how he grades them seemed rather arbitrary. The exams seemed even more arbitrary. Don't expect to get an A often. That being said, I think it would have been hard to get a truly bad grade assuming you don't totally slack off. As long as you do your work and don't mind having to occasionally roll your eyes at the hyperambitious kids who are dreaming about how to get into fellows and can't shut up, you'll be fine.\"",
            "review 20: \"21W with Ronald Shaiko: Lord, this class is something else. Readings are extensive and Shaiko is great but lectures tend to go all over the place. However, you do learn a lot and if you want to get into government this class would be an amazing asset towards those goals.\"",
            "review 21: \"21W with Ronald Shaiko: Lectures are all over the place and readings are not assigned thoughtfully (e.g. week 7 readings lining up with content that we read about in a separate book in week 3 and entire books are thrown into the syllabus and then never once referenced in class). Don't bother reading the Theodolulou/Cahn book (some of the readings are interesting and you might enjoy them for enrichment purposes, but otherwise pretend it was never assigned) and only skim the Birkland book/pay attention to areas that overlap with lecture materials. Despite these shortcomings, the assignments for the class have been very interesting and leave a lot of room for creativity, although I would definitely suggest having Shaiko read over your essays in office hours before turning them in because otherwise his grading will come off as subjective and unfair. You will definitely find yourself complaining about this class a lot throughout the term, but will walk away from it feeling like you learned a lot.\"",
            "review 22: \"21W with Ronald Shaiko: I liked this class alot! It made me want to be a PBPL minor. If you're at all interested in American politics, you'll really enjoy it. Shaiko is the greatest human ever and goes on long tangents in class that are super interesting. Go to office hours and pick his brain a little- you won't regret it. Also, you don't need to do the readings at all because he goes over everything on the midterm and final in class.\"",
            "review 23: \"21W with Ronald Shaiko: Talk with an upperclassman PBPL minor before taking this class—they'll have tips. The \"Essential Readings\" book is irrelevant to lecture material. Cross reference Birkland with your lecture notes when reviewing. Go to office hours. Really no need to keep up with the reading schedule on the syllabus. To echo another student's message: \"Let your work speak for itself.\"\"",
            "review 24: \"21W with Ronald Shaiko: This class was interesting but also frustrating at the same time. Odds are you are trying to do fellows if you're taking this course, so you don't have a choice there. I'm a government nerd, so Shaiko's lectures were interesting, but they also went all over the place... don't try taking notes on everything. Shaiko himself has seen everything... so get to know him during office hours if you are interested. There is an exorbitant amount of reading assigned, but you really only have to do Birkland (the main textbook) and the books assigned. The essential readings book had a lot of papers that were interesting if you wanted to read them, but they were not necessary. My major complaint with this class was grading. I get that Prof. Shaiko has a 110 person class, but the feedback I was given was opaque and unnecessarily nitpicky even when it was positive. These problems could be solved by having him read over your work in office hours... but even then he would still find things wrong with it. Exams were no better... I distinctly remember that I received more feedback on the questions I did better on than the ones I did worse. Overall, I enjoyed the class because I like the subject material, but it is frustrating, and you have to prepare yourself for that.\"",
            "review 25: \"21W with Ronald Shaiko: Easy while on Zoom. Never read any of the assigned readings and still pulled an A. Take good notes in lectures, and you'll be fine (if the class is still online). I can't imagine this class being this easy in person.\"",
            "review 26: \"21W with Ronald Shaiko: 5 major assignments (2 10% essays, 2 30% assessments, 1 20% final essay). Did not really do the readings tbh but was super attentive in lecture and managed to get an A (on the border). Class was a grind when it required it AKA during midterm/finals and before essays (Shaiko is super meticulous and wants things done a certain way--> go to Office Hours when you can). Only reading that I would say is a must is Birkland, everything else I did not pay attention to. Lectures were not really engaging but the material was very interesting and Shaiko definitely has a lot of experience. Class was more front heavy but if you pay attention to big themes, you will generally do well (minimum B+). Not as bad as people say it is but a pretty uneventful class. Worth it if you are considering a PBPL minor and/or FYF. Definitely a hardo class though (I was on mute, no video entire class; only really knew 20 kids that talked whenever possible to impress Shaiko- fun to watch lol). I think the class was easier online too.\"",
            "review 27: \"19W with Ronald Shaiko: Great class if you're interested in public policy at all. Shaiko is a great teacher, and you can tell how he really loves the class (and politics in general). It is A LOT of work but it's interesting and you can really get a lot out of it. He recycles parts of old exams so can be helpful to get your hands on those. HAVE TO go to office hours. It's a big class and while he does try to get to know everyone in the class, going the extra mile and meeting him in office hours is definitely a good move. Especially for papers, Shaiko will help you a ton. I literally watched him tell a kid what to take out and what to say. A- definitely manageable.\"",
            "review 28: \"18W with Ronald Shaiko: Good class overall. It covers a lot of stuff, so it definitely helps you become more knowledgeable about public policy. His lectures can be confusing and unorganized from time to time, so it may be hard to keep track of everything. On the other hand, his writing assignments are fun to do, and it's not hard to get good grades on those if you go to office hours with questions and drafts. Shaiko is a really nice person outside of class, and he is always available to meet with students.\"",
            "review 29: \"18W with Ronald Shaiko: I love politics and government. Yet somehow this class stressed me out b/c the course wasn't interesting, and the material wasn't cohesive as a previous review said. I preferred the second half of the term to the first half since it was more applicable/ tangible. I wouldn't really recommend this class unless you are sure you want to minor in public policy. Shaiko isn't a bad person. It's just that his lecturing goes on tangents and it's not clear what you shouldn't/ should be taking notes on.\"",
            "review 30: \"17W with Ronald Shaiko: This is the best course I have taken at Dartmouth thus far. I would highly recommend it for anyone interested in any sector of policy or with a general curiosity about the inner-workings of Washington. Professor Shaiko is an outstanding lecturer and always willing to meet with students, despite this being a large course.\"",
            "review 31: \"17W with Ronald Shaiko: Great Professor. Go to office hours for essays, they will help increase your grade. For the midterm and final memorize study guides and pay attention in lecture.\"",
            "review 32: \"17W with Ronald Shaiko: OK: you're probably taking this for Fellows. There will be try-hards who raise their hand to show Shaiko how smart they are (don't even get me started). If you can look past them, the class is okay. It's a rec for the PBPL minor, so I'd suck it up and take it if making policy at all interests you. Lectures are dry but it's a gateway course. If you're taking it: (1) don't buy the books, (2) don't get caught up in the politics of the course. Best of luck!\"",
            "review 33: \"16W with Ronald Shaiko: Interesting material, draining learning environment. All prospective First Year Fellows take this course, which means your classmates will be hyper-ambitious, competitive freshman bending over backwards to impress Professor Shaiko. (Ironically, those who do the most kissing up almost never get picked for FYF). The assignments are straightforward (policy memo, paper, exams) but the exams are challenging and there’s very little personalized attention because it’s a large lecture class. Unless you’re dying to be a Fellow, I’d recommend taking this class as a sophomore or junior once you have more perspective and can chuckle at the over-eager students without feeling intimidated by them.\"",
            "review 34: \"14W with Ronald Shaiko: Don't take this class if you can avoid it (most people only take it cause they wanna be First-Year Fellows). Part of the reason I didn't like the class was a mismatch of expectations about the material. I expected the class to focus on prescriptive public policy--what should the government be doing, what are the effects of particular policies and alternatives to them, what's the state of politics in America. Instead, it's just descriptions of how different groups come together to influence and form policy. But no matter what you expect, Shaiko's a bad prof\"",
            "review 35: \"13W with Ronald Shaiko: Course: Interesting course but challenging to follow at times. Great guest speakers. Professor: Extremely knowledgeable prof! But sometimes, too knowledgeable. At times Prof Shaiko assumes you know things you may not if you have never taken a policy course before. Come with an understanding of prominent, current governmental policies. Workload: Definitely manageable.\"",
            "review 36: \"12W with Ronald Shaiko: Course: Ok course, gets better as term progresses. Class lectures are sometimes unorganized and it is hard to grasp what is actually important to understand. Also sucks that the class is so big. I would only recommend this class if you have an interest in public policy. If you do, you'll enjoy parts of the class. If you have no interest in public policy and are just taking it for the first year fellows, you probably won't enjoy it. Professor: Good professor, but not the best lecturer. No power point slides, just talking most of the time. Quite knowledgeable about the subject though and enjoyable to talk to outside of class. Workload: Lot of reading, but you don't really need to do all of it. A couple of papers that weren't too bad and were made into somewhat interesting assignments like policy memos.\"",
            "review 37: \"12W with Ronald Shaiko: Course: It does provide a good background on the policy process, though there are lots of tangents along the way. Some of them can actually be interesting though, since Shaiko spent a lot of time in Washington and talks about his experiences there. In 2012, it was 123 people which was huge, even for that class. Around 55 interviewed for first year fellows, so it's not like everyone in the class applies, but I would only recommend taking it if you need to. That being said, I did first year fellows and it was an amazing experience! Very worth it. Also, this class serves as a prereq for the policy research shop (and PBPL 45) where you do real work for the VT and NH legislatures. It's a good opportunity (and pays!), so this class does have practical applications even if the material can be theoretical/dry. Professor: Shaiko is an interesting guy and very helpful in office hours. Go to him before you hand in a paper- he's very open about giving feedback. He literally corrects it for you sometimes, which is very helpful. Make sure you get to know him if you're interested in first year fellows. Not in an annoying way, but just so he recognizes you and your hard work. Workload: If you're dedicated to doing well in the class, it can be a lot of work, but as I said, it's worth it. The policy one-pager and Supreme Court amicus brief are interesting since you get to choose the topic (tip: make sure they look real with the design and everything, he cares about that). Readings and midterm/final were less so.\"",
            "review 38: \"11W with Ronald Shaiko: I say hopefully the worst class I take because I can't really imagine a class being worse. Where can I even start? Everyone comes into this class excited, wanting to learn about public policy, thinking that this class will be their calling to become a policy maker, but everyone leaves disappointed. First of all, I can't imagine a prof worse than Shaiko. Hopefully with all the money we're paying for tuition, Shaiko's just one bad egg. His lectures meander and are one segway after the other, so that when he gets to the actual stuff you're supposed to learn, you don't know it's important because you think it's another segway. Even if you come in committed to take really good notes, you'll find yourself cleaning out your blitzes or playing mini golf on your computer because the lectures are just that hard to follow. You only realize what's important from the random shit he says when you spy it on the exam. Also, he assigns a shitton of reading. This isn't a really big complaint of mine, because some of it legitimately was interesting, and at least I could learn from the readings if I couldn't learn from the prof. The thing is you're going to feel like the readings have NOTHING to do with his lectures, but you still are expected to know the shit from the reading.\"",
            "review 39: \"11W with Ronald Shaiko: This is a really competitive class because of the internship, so don't take it unless you need to. Shaik is not a great lecturer at all, so class is pretty worthless. Just do the reading and it's an easy class.\"",
            "review 40: \"11W with Ronald Shaiko: this class ruins your interest in public policy. dry boring info, horrible/unrelated/dragging/monotonous lectures. lots of pointless reading. shaiko, smh.\"",
            "review 41: \"09W with Ronald Shaiko: I was really excited about this course, but Professor Shaiko managed to take a very interesting topic and make it deadly dull. He is an extremely uninspiring lecturer. His lectures have no direction or organization, and he speaks very softly, even though it's a big lecture class. Also, he assigns a TON of reading, most of which isn't really necessary. If you read Trade Offs, The Art of the Game, and skim everything else, you'll be fine. That said, you need to take this class to do the First Year Fellowship, which is a great opportunity.\"",
            "review 42: \"09W with Ronald Shaiko: If you're looking for a good third class, don't take this one. If you have to take this class because you either a) want the First-Year internship or b) want to minor in Public Policy read some outside material to supplement his lectures on the policy sectors, listen in class and you'll do fine.\"",
            "review 43: \"09W with Ronald Shaiko: Professor Shaiko is an excellent lecturer. He is very knowledgeable about the subject material and is willing to talk to students on any topic. There is a lot of reading for the class making it feel like an advanced course. The readings are manageable and interesting.\"",
            "review 44: \"09W with Ronald Shaiko: Course gives you a real understanding of how policy is actually made in each branch of government, and which actors are involved, as well as an overview of the major areas of policy. Lots of empirical studies are discussed. Writing prepares you for an internship in DC (memos, briefs, one-pagers). A must-take course if you ever want to work in government. Lots of reading, but the reading is either very useful or very interesting - case studies especially help make the abstract concepts real. Prof. Shaiko has a lot of experience from his lobbying days and spends most of class giving useful overviews of the reading and then supplementing it with real examples, often from his own experience or those of other people he knows.\"",
            "review 45: \"09W with Ronald Shaiko: Professor Shaiko gives pretty interesting in class lectures though they sometimes don't have much to do with what is going to be tested. He does have a wealth of experience though and he is able to incorporate that into whatever he talks about. There are 3 paper assignments, a midterm and a final. The papers range from 1 to 3 pages (single spaced) and are pretty straightforward. The nice things about the papers is that they seem like they could be practical if you decided to pursue a career in public policy. The tests have 4 short answer (each worth 20 points) of which you pick 3 to do and a longer essay worth 60 points. The assignments are spaced pretty evenly so you will always have to focus on something every 2 weeks. Professor also assigns a lot of readings of which not all is necessary. A couple of books are supposed to be helpful for the papers though not totally necessary. Don't even bother reading the Essential Readings book as I don't think it adds anything unless you are really interested in the subject and just want some more perspectives. All of the test questions pretty much come from The Art of the Game so that is the only book I recommend reading thoroughly. Also be warned that you will encounter a lot of political junkies/kids who are going to try really hard in order to get the Washington DC fellowship.\"",
            "review 46: \"09W with Ronald Shaiko: Alot of the students in this class are trying to get the First Year Fellows Program. The class was pretty standard. You need to do all the readings. Essential Readings, however, is not necessary, just skim through, unless you're really interested in the scholarly aspects of public policy. Essential Readings is covered in the other text. Prof Shaiko is ok.\"",
            "review 47: \"08W with Ronald Shaiko: There is, as everyone has said, a LOT of reading. Lots of books, which are really expensive, and they are all assigned cover to cover. That being said, you really only need maybe 60% of the assigned reading to do well on the tests (The Essential Readings book is utterly unnecessary, don't even bother buying it). Much of the reading is theory-heavy, while the lectures are pure application and largely anecdotal. Shaiko knows his stuff, but he does talk a lot during lectures about unnecessary stuff. Papers are graded fairly easily, and are interesting assignments (policy memo, lobbyist one-pager, etc). Midterm and final are a bit harder. Each have short answers and a long essay, but you get a choice of questions and they're not too bad.\"",
            "review 48: \"08W with Ronald Shaiko: I was really excited for this class & the 1st year internship, but my enthusiasm quickly faded. He has no structure for his lectures/notes, which is highly irritating. There were A LOT of readings, we had 8 books in total & read them all. Most of them were painfully boring & I was selective about which I actually read. Some of the shorter books were directly applicable to the essays on the exams, but the others were just dry, theoretical stuff. I def felt a time crunch on the exams. There's just so much info, & half the time he doesn't end up asking the stuff I actually knew. Also went off on tangents about specific laws/dates/ his life that weren't on the exam. The one redeeming quality is that the writing assignments were really interesting & he graded generously. Most of the time I was very bored/frustrated. I rarely enjoyed the work, which sucked b/c there's so much. Shaiko seems like a decent guy & has had a really interesting career/knows his stuff. But the intro class was just painful.\"",
            "review 49: \"08W with Ronald Shaiko: Shaiko was amazing!\"",
            "review 50: \"08W with Ronald Shaiko: Public Policy 5 seems like a pretty standard introductory course. Unfortunately, there were an insane amount of readings, which was really overwhelming at first. I was told we didn't need to read everything, which was good because I don't know how it would have been humanly possible to read everything without sacrificing significant amounts of fun/sleep. Professor Shaiko is a decent guy, and he provides a lot of time out of class where he's available to meet. He's quite dry, though, and lectures often deviated from readings and went on many different tangents. Overall, it was only all right, but unfortunately necessary for any further study in public policy. I also began to intensely dislike the American political system as a result of taking the course.\"",
            "review 51: \"08W with Ronald Shaiko: Ultimately I am happy I took the class, because I think I did in fact learn valuable information about the practical side of how the federal government works, but during the term I really disliked it. The lectures were good at the beginning but after the midterm they got really boring. The writing assignments were pretty interesting, but they were not like normal papers. They were more about practicing the types of writing used in day to day government business. Also, there was a TON of reading. DO NOT BOTHER to open the green book--I think it is called the Essential Readings. They are really dense and I think the vast majority of the class didn't read them. Shaiko is a really nice guy, and he seems to have a lot of interesting first hand experience with policy-making that I wished he had talked about more.\"",
            "review 52: \"08W with Ronald Shaiko: SO MUCH READING--8 books total I read all of the books--but it did not really help. I was unhappy with my grade He is sort of an arbitrary grader. very intelligent guy lectures are very random and don't follow the reading I only took the class to qualify for the internship.\"",
            "review 53: \"08W with Ronald Shaiko: it's not a bad class but nothing spetacular either. lots of reading. lectures are interesting but it's easy to get distracted. and if you do, it's really hard to follow shaiko once you lose him for even a few seconds\"",
            "review 54: \"08W with Ronald Shaiko: Shaiko's lectures weren't great- but you need to take notes because he asks questions about his lectures on tests. Don't kill yourself doing all the reading--- you'll be fine if you read the books he talks about in class. Reading is interesting. Shaiko wants the class to do well take advantage of office hours.Tests are straightforward and easy. Good class overall with a moderate amount of work.\"",
            "review 55: \"08W with Ronald Shaiko: The only reason most people take this class is for the internship opportunity. The reading is repetitive and ridiculous but Shaiko can be interesting. His lectures are a bit unorganized and hard to follow though.\"",
            "review 56: \"08W with Ronald Shaiko: This was a very interesting course. The readings and lectures were not too hard to comprehend and were also very helpful with learning the subject. Ronald Shaiko is a really good professor. Though this is a big lecture class, Shaiko is very good at getting across to students. Also, he is very flexible with office hours, WHICH YOU SHOULD DEFINITELY GO TO! Shaiko is the man! He always knew my name from the beginning and always gave feedback on how I could improve my assignments before I had them in. Some Negatives to the Class: - A good number of intense people take this class, because more than half the class is trying to get the First-Year Fellowship. However, if you do not let them get to you then you will enjoy the class. - He doesn't make thorough remarks on papers because it is such a huge class, so you should go to office hours to talk about the papers. - YOU DO NOT NEED TO READ ALL THE BOOKS! Talk to upperclassmen about which books were useless, because there are some useless (but expensive) books that are on the booklist. OVERALL, THIS IS AN AWESOME CLASS SO SIGN UP FOR IT!\"",
            "review 57: \"08W with Ronald Shaiko: DEATH. This is the word that comes to my mind when I think of the 3 hours every week I spent listening to Prof. Shaiko lecture...but I can't call it lecture...maybe spew? Yeah spew...thats probably the best word for it. Every class Shaiko would spew out information on the policy topic of the day. No structure. No organization. PPT? Please...Shaiko's old school...he breaks out the overhead projector on occasion. Am I a massochist? Is that why I continually forced myself out of bed to go to class at 10 am? I think I had the perpetual hope that the class would magically switch formats and actually inform me of something! Anything! But it never did. Actually, the spewing in the last class on welfare policy was kinda informative. But until then...at the end of every class I would look at my few lines of scribbles in my notebook and be completely bewildered about how I could have just sat through an hour talk and not learn a single thing. It was truly a marvel...a wonder. I like Shaiko a lot. Really I do...he is a great guy who spent lots of time in Washington and knows everything there is to know about public policy...certainly everything we needed to learn in this intro class. I'm sure his upper-level policy courses are much more productive. But he seriously would just stand up there and spew things...99.9 % irrelevant at that. You learn the course material from the readings which are simple to understand though the most boring things the world has ever seen. Ironically every book besides \"The Essential Readings\" is essential to the class and learning about the policy process. While expensive, I don't know why anyone complained about too much reading...there really was not that much. If you know you want to go into government or minor in policy then take this course (or want that internship). You will learn about how Washington works...I feel like I've benefitted from the material...just not the actual class time. Someone else in the department needs to take over this intro...Shaiko is just not cut out for the structured kinds of lectures needed for this type of course. Before I end my review I have to comment on previous reviews. A few of my peers said the class was interesting??!!!???!!!!!!!!!! To them I say you must simply be living in a different universe than me. Interesting?? Really?? I wish I knew who you are just so I could talk with you and meet people that are so fundamentally different than me. I dutifully went to every class and did all the \"non-essential\" readings. Interesting would seriously be the absolute last word I would use in the English language to describe Public Policy 5. I'm not a political buff to say the least, but if you are you will find this class redundant, and if you aren't then you are faced with probably the most boring information being taught at the college or possibly the world. While you may think this is exaggeration...just take the course and enjoy.\"",
            "review 58: \"08W with Ronald Shaiko: There was a lot of reading for this course, but you don't have to do all of it. You have to take this course if you want to be a PBPL minor and it certainly will tell you whether or not you want to go through with the subject.\"",
            "review 59: \"08W with Ronald Shaiko: Easy to do ok; very hard to get an A. Shaiko is a highly subjective grader. Go to office hours as much as possible and you'll do much better. Decent class, fun if you're interested in the subject, good stuff to know if you're not. TAKE IT FRESHMEN YEAR. I knew some sophomores who took it having taken like five other gov/pp classes cause they needed this for their policy minor ... and they were sooo bored.\"",
            "review 60: \"08W with Ronald Shaiko: Just for the internship? don't take this course. There were so many people in the class taking this course for the Rocky internship. Everybody worked so hard, and it is so hard to get an A in this class! For the first midterm, only 4 people out of about 80 people got an A. He assings a book for a weekend. so much reading to do every week! There were 8 books to read. He assigned from the beginning to the end for every single book. Three papers are relatively easy and ok..! Prof. Shaiko is more generous when he grades the papers. Most people ended up not doing the reading. You learn a lot.. many specifics..! If you are so serious about Public Policy, If you are ready to work hard, If you really really really want that internship, I wouldn't stop you.\"",
            "review 61: \"08W with Ronald Shaiko: Shaiko obviously knows what he's talking about, and his lectures constantly are incredibly interesting. The books, though many in quantity, are also for the most part very interesting and helpful in understanding the material, which is varied and occasionally scattered.\"",
            "review 62: \"08W with Ronald Shaiko: So the only reason I took the class was because it sounded remotely interesting, and I wanted to do the first year initiative program. Beware that the First year Initiative program is extremely competitive (there are about 80 people in the class for 20 slots), and this class is extremely dull. If you took AP american government or gov 3 before this class, most of it will be review. It will be boring. I almost died in class all term. That being said, you do learn stuff in this class, and prof shaiko is a pretty nice guy. The reading's really boring. I would still stay away from this class though.\"",
            "review 63: \"08W with Ronald Shaiko: Make sure you keep up with the reading or the course is overwhelming. This class is a huge time commitment. Professor Shaiko is very knowledgeable, but his lectures are not well-coordinated with the readings. They are meant to supplement, not review the material. Know the material well for the exams, there were surprises on the final.\"",
            "review 64: \"08W with Ronald Shaiko: Overall the class was very interesting. Don't get discouraged at the beginning. The readings will get better. And don't bother reading the Essential Readings - they're not so essential. I really encourage you to get to know professor Shaiko better. He is a great guy and very friendly although it might not seem so in class.\"",
            "review 65: \"08W with Ronald Shaiko: This course is a basic intro to public policy. Very straightforward overview of the field without must focus on specific case studies (besides 2 different books about Safe Havens and the ADA law). It reminded me a lot of gov 3--similar concepts and themes, but with more of a focus on the policymaking process. If I had taken this as a freshman, it might have been more interesting. As a senior government major, it ended up as more of a review of what I already knew. That said, Professor Shaiko is great and really knows his stuff, so take the course if you have any interest in public policy and/or don't know much about US government.\"",
            "review 66: \"08W with Ronald Shaiko: As I said in the title, a lot of reading. The midterm had about 800 pages worth total and I imagine the final (not cumulative) had about that much too. This also means a lot of books and a lot of money. You learn to cut corners in readings and determine what's important and what's not, but you have to keep yourself motivated because there's no homework to keep yourself accountable (just 3 papers, 2 exams). Shaiko knows a lot, it's just that he's had a lot of experience in public policy so he tends to teach from experience instead of from the text. He doesn't really brag about what he's done, but it's definitely not the totally traditional stuffy academic type class. If you're interested in public policy, can read a lot on your own, and can take good essay tests, take this class.\"",
            "review 67: \"08W with Ronald Shaiko: I don't know, the course was okay. I don't think public policy is really my thing. Keep up with the readings or you will feel lost around midterms and finals. Shaiko's lectures often don't line up well with the readings, which I found frustrating. If you are strongly considering the public policy minor, definitely try to take the class freshman winter. If you aren't too sure, maybe stay away from it and try a class in the GOV department instead.\"",
            "review 68: \"08W with Ronald Shaiko: I thought this class was a lot like an introductory government class. Some things were interesting, but it was a little boring too. The prof is a nice guy and is helpful, but fails to really inspire. I would recommend taking the class. It is not too hard, but is useful to know.\"",
            "review 69: \"07W with Ronald Shaiko: Prof. Shaiko is a really great guy, but this course suffers from what many intro courses suffer-it breezes over a lot of material and focuses on the basics rather than on the interesting.\"",
            "review 70: \"07W with Ronald Shaiko: This class was very reasonable. Its funny to watch the first years freak out over small, little things, its probably all that worrying that brought the curve down. You really only needed to read two of the seven books assigned to score the median, as the exams were relatively easy. Prof. Shaiko isn't demanding, he just wants you to learn the big broad concepts of public policy and expects you to describe the process, which is easy enough if you did the right readings. Very reasonable course. Very good professor, who really knows his stuff and is very knowledgable. He's very accessible too, and welcomes students into his office whenever he's not busy.\"",
            "review 71: \"07W with Ronald Shaiko: Overall, I didn't think the readings helped me much for the midterm and final. Shaiko is an interesting professor and he knows his political stuff. Not recommended for non-minors because it's pretty tough and tedious.\"",
            "review 72: \"07W with Ronald Shaiko: This is easily the best class I have taken at Dartmouth. Prof. Shaiko is the coolest prof. This class will give you a great overview of public policy, and the assignments give you a feel for what it would be like to be a lobbyist or member of the President's staff, etc. They are actual things that Washington players do, not boring essays or anything like that. Shaiko's lectures are awesome, especially because he has spent a lot of time in the Beltway and speaks from experiance. In short, I cannot recommend this class more highly. TAKE THIS CLASS!!!\"",
            "review 73: \"07W with Ronald Shaiko: Prof Shaiko is the man-he is incredibly smart and knows a ton about public policy. He is interesting to listen to, but his lectures often rambled. The tests were fair, and the readings were helpful and interesting but only some of them were necessary. I'd recommend this class.\"",
            "review 74: \"07W with Ronald Shaiko: This course was awesome!! Despite being a fairly large class (around sixty people), Shaiko always stopped for all questions and kept students involved. He is always available outside of class and is willing to go the extra mile to help you both with in class material and out of class stuff like finding internships, etc. The material covered was also really interesting. If you are trying to decide between gov 3 and this, definately take this class. The only draw back is the large reading load. Some of the books were well worth reading, others were just plain dry. But, you really only need to do about half of the reading anyways to be successful in the class.\"",
            "review 75: \"07W with Ronald Shaiko: Professor Shaiko is a very good teacher. Very helpful, very accessible, a good public speaker, knowledgeable, etc. I was impressed with Professor Shaiko. However, I thought the class was very mediocre. Prof. Shaiko assigned a massive amount of reading. None of it was ever needed for the test, essentially meaning that it was a complete waste of time. Now, that seems like a good thing, but Prof. Shaiko had made it seem like the readings were crucial and would be needed to answer the exams. Nope, not at all. In fact, I had to go out of my way on essay questions to try and use information from readings. Basically, this was the format of the entire class. He would present new information in class, make it seem like it was important, so I (and others presumably) would dutifully take notes and study it, then the exams doesn't mention it at all. Save you time for a class that is upfront about what you need to know, and doesn't mislead you about the expectations for the exams.\"",
            "review 76: \"07W with Ronald Shaiko: An easy class, but unfortunately rather dull... I usually enjoy the subject area, but just the way lectures went... it was boring and definately difficult to take notes in.\"",
            "review 77: \"07W with Ronald Shaiko: It's required for the public policy minor so there's no room to get around it. Overall, the class isn't bad. Shaiko's lectures can be dry but he's helpful outside the classroom and a relatively easy grader. The main issue with the class is that it's not very focused and there are seven books you have to read related to the class, which means spending lots of money at the beginning of the term. Hopefully, he'll change this though.\"",
            "review 78: \"07W with Ronald Shaiko: Prof. Shaiko does a solid job of providing an introduction to public policymaking. The class covers all the branches of government plus informal players and relates them to the policymaking process. There's a substantial amount of reading to do, although not all of it is necessary to do well in the class. Expect to write a few papers, mostly practical assignments pretending you are addressing Congress or the President. The tests seemed more difficult than the grades turned out to be...which may suggest that Prof. Shaiko is not a harsh grader. If you plan on minoring in policy or have any interest in government without wanting to major in it, take this class and find out.\"",
            "review 79: \"07W with Ronald Shaiko: Overall, it was pretty good. My major criticism is that there was too much reading. In addition, the reading at times seemed rather unconnected to each other and the real world, and at other times very dense. It did, however, achieve its stated purpose of providing a good foundation for understanding public policy.\"",
            "review 80: \"07W with Ronald Shaiko: okay, so the books for this class cost A LOT, but don't worry- you don't really have to \"deeply\" read all of them. the papers aren't bad and the tests are do-able, as long as you put in some studying time.\"",
            "review 81: \"07W with Ronald Shaiko: This class was interesting, well organized and well set-up. I enjoyed lectures- Shaiko knows what he's talking about. Both a final paper and exam, which was a little annoying but overall not too much work. Basic government knowledge is helpful.\"",
            "review 82: \"07W with Ronald Shaiko: I definitely would not take this course again. It was very basic material on U.S. public policy. There was a lot of reading assigned although much of it wasn't really necessary; in fact, we were never tested on two of the books. My biggest gripe with this course were the evaluations. Shaiko graded papers pretty hard and he graded exams even harder. The way he graded seemed very arbitrary. There were two exams composed of all short-answer questions and 3 papers. A lot of unneccessary work for an intro. class. When Shaiko graded the short answer exam questions he didn't even have a rubric. When I asked him what made a good response he didn't really know. He just said it was relative to what other people wrote. The public policy department (if you can even call it that) seems rather weak to me--if I'd known better, I would have steered clear. A very freshman course!\""
        ],
        "Charles Wheelan": [
            "review 1: \"20W with Charles Wheelan: This course was so much fun and super interesting! Wheelan is an amazing prof who is also super sympathetic to students—ended up getting rid of assignments and moving deadlines when he thought that we had too much work (20W was a 9-week term instead of 10). Grading is relatively straightforward in that it is possible to do well; Wheelan is a little picky about writing, being precise, having good ideas, etc. but since he is picky to everyone and the course is curved, it still evens out. Overall, I would recommend the course to people who can handle large amounts of reading (sometimes 80-100 pages per class, 3x a week), the weekly quizzes, a midterm that comes out of nowhere, and people who enjoy policy and want to minor in it. Those who are just doing it for FYF end up disliking the class but still trudging along, those who are taking it just to see ended up dropping, I think.\"",
            "review 2: \"20W with Charles Wheelan: Great class overall. There are a lot of students in the class who are taking it for First-Year Fellows and they try to suck up to the professor a lot, but Wheelan is very good at shutting them down and not letting them speak for hours. The memos are a bit tricky at first but if you figure out what Wheelan likes (concise sentences, clear arguments, interesting formatting that isn't just walls of text) you'll do fine. His office hours are also super helpful so definitely go to those. The lectures are super interesting but there was a large amount of reading for each class so be prepared for that. I recommend taking this class if you're interested in policy or government. Definitely worth it.\"",
            "review 3: \"20W with Charles Wheelan: The class was such a great and interesting class. Wheelan is an awesome professor who literally knows everything about everything. Go to his office hours and ask questions and he will give you more than what you expect. He is also a super caring professor and is pretty lenient with extensions. Most quizzes are on Friday unless he says otherwise. For the quizzes, be able to understand the vocab and apply the concepts.\"",
            "review 4: \"20W with Charles Wheelan: This is my favorite class that I have taken at Dartmouth so far. Wheelan is a great lecturer and amazing prof, and I always looked forward to going to class. He is also super open to questions and his office hours (though they can sometimes be hard to get into) are always really helpful. Most of the class is built around readings, weekly quizzes, and memos. The memos can seem daunting at first but if you have any experience with writing about policy (Model UN, debate, etc), they are actually pretty straightforward and everyone gets the hang of them pretty quickly. The fact that he assigns really interesting and relevant topics for the memos make them a lot easier (I wrote about the Dartmouth greek system for one of mine). It is true that A LOT of people just take this class for First-Year Fellows. Given that there is no participation grade, it can be fairly obvious that the people who talk the most are trying to get on Wheelan's good side for FYF, but I will stress that this competitive atmosphere SHOULD NOT stop anyone from taking the class. You will find that a lot of people in this class are really motivated and type-a, but Wheelan does a great job of lessening the feeling of competition. Because people are so motivated, this also means you get a lot of really smart, passionate people who contribute a lot, making the quality of discussion really good. Wheelan is also a super reasonable grader and is always willing to help if you don't do as well as you want to/have questions. The reading can be a lot, especially during the first half of the term. There is one midterm in the class, so leading up to that it is super important that you do all of the readings and take notes on all of them. This can be a lot (even over 100 pages for one class), and it is really time-consuming, but it's essential for the midterm (which was definitely one of the harder tests I've taken at Dartmouth). However, after the midterm, the course winds down a lot and you can get away with not taking extensive notes on the readings and skimming a lot of them (quizzing was less frequent at the end of the term too). The final is a group project which was pretty manageable. Overall, fantastic class. Not a layup, but if you have any interest at all in politics/current events, Wheelan does a great job of making the course super interesting so all the work seems worth it and can be fun.\"",
            "review 5: \"20W with Charles Wheelan: This class was amazing. Wheelan is an awesome professor who is a great lecturer, great at keeping students' attention. He is very helpful if you go into office hours, giving help on memos and insights to the reading. His dog is also often at office hours. There is a good amount of reading for the class, but the quizzes based on them often can be predicted or he will just tell the class when they are. The midterm relies heavily on the reading, but the final is a group project that is enjoyable and gives students a chance to choose any topic.\"",
            "review 6: \"20W with Charles Wheelan: Great class great prof. Readings are always on topic. Sometimes he assigns more readings than he goes over but still 100% recommend the class\"",
            "review 7: \"20W with Charles Wheelan: This a great class for anyone interested in the social sciences and who wants to explore a new area taught by a great professor. Overall, the class is extremely interesting, although I found that the material after the midterm was more boring. It's helpful to have taken a class on microeconomics but other than that the class is a completely level playing field and you will learn so much about policy analysis. Wheelan brings in several policy experts, activists, or former politicians to speak to the class as well. Other profs or staff affiliated with the Rockefeller Center also come to speak about several programs. Wheelan is a very active, funny, and enjoyable lecturer who asks a lot of questions to keep everyone engaged. I think many people are hesitant about this class because of its rigor and the number of people competing for First-Year Fellows; neither of those should be a deterrent. With Wheelan, the most challenging part of the course is writing concisely and effectively in the memos (he didn't provide examples which was very frustrating because he was not clear with his expectations, but I assume if he teaches it again he can use memos from 20W). Once you have the structure down, the memos are interesting assignments to complete. Commit to the readings (he does semi-random quizzes) and prepare for a relatively tough midterm and you'll be fine. There will be the people applying for Fellows trying to get Wheelan's attention, but he made a point of saying in class that he has no say in who gets it which calmed everyone down.\"",
            "review 8: \"20W with Charles Wheelan: Professor Wheelan is one of my favorite profs at Dartmouth. Shaiko usually teaches this class, so I'm not sure if Wheelan will ever teach it again, but if he does: take it. Amazing lecturer, super interesting material, and relevant to so many other classes/just life in general. It's definitely not a layup and there's a fair amount of reading and memo-writing assigned, but if you stay on top of it and are actually interested in what you're learning, it's worth putting in the extra work.\"",
            "review 9: \"20W with Charles Wheelan: Excellent class, by the far the best one I've taken at Dartmouth. Professor Wheelan is incredibly interesting and great at keeping our attention with actually educational anecdotes from his own work experiences. The guest speakers he brings in are also amazing and relevant to the topics in class. I learnt so much not just for applicability in this class but for so many others. Professor Wheelan is also super helpful and understanding, often willing to extend deadlines and even ended up scrapping readings and assignments for the entire class when he felt there was too much work for the 9 week term that 20W ended up being. This was the also the only course where I looked forward to most of the readings, as they were super interesting and helpful to understanding the concepts taught in class, and almost always were relevant to our in-class discussions. The only complaint I have with Wheelan is that he assigned his own work for readings a little too much, but the majority of those were still interesting reads so I'm okay with it. Aside from that, some of the other students were clearly just there for the First-Year Fellows program, and tried to kiss ass a bit too much (like guffawing at jokes that only really warranted a chuckle) but Wheelan usually did well in containing them. Overall, an excellent class. It made me decide to minor in Public Policy. However, I have heard different stories from people who took the class in earlier years, when Professor Shaiko was teaching it. I've heard he was a bit dry and less engaging, though still teaching the same kind of interesting and important material. But if Professor Wheelan ever teaches it again, I firmly recommend signing up for it asap.\""
        ]
    }
}