{
    "SART017.24": {
        "Zenovia Toloudi": [
            "review 1: \"22F with Zenovia Toloudi: Zenovia is lovely and super flexible on assignment deadlines. Just engage with her during class and show some interest, and this class will be really quite enjoyable.\""
        ]
    },
    "SART017.23": {
        "Tricia Treacy": []
    },
    "SART017.22": {
        "Christina Seely": []
    },
    "SART017.20": {
        "Mary Flanagan": []
    },
    "SART017.19": {
        "Jodie Mack": []
    },
    "SART017.03": {
        "Mary Flanagan": []
    },
    "SART017.01": {
        "Pamela Thompson": []
    },
    "SART017.16": {
        "Daniel Heyman": []
    },
    "SART017.18": {
        "Viktor Witkowski": []
    },
    "SART017.17": {
        "Jodie Mack": []
    },
    "SART017.14": {
        "John Wilson": []
    },
    "SART017.13": {
        "Louise Hamlin": []
    },
    "SART090": {
        "Enrico Riley": [],
        "Graziella Parati": [],
        "Jay Hull": [],
        "Soo Young Park": []
    },
    "SART077": {
        "Brenda Garand": [
            "review 1: \"02S with Brenda Garand: Brenda is a good professor. She makes you work hard. You not only do paintings or whatever, you also learn about contemporary artists and how to talk about art. These are good things to know.\""
        ],
        "Karolina Kawiaka": [
            "review 1: \"05S with Karolina Kawiaka: This class was awesome. I really like Karol...she's fun and keeps the energy going. The assignments are really student-focused and she makes the classes fun. Senior seminar is hard to teach and I have to give Karol credit for keeping us engaged. Maybe more in-class crits would help us get to know each other's work more. Overall I had a great experience.\""
        ],
        "Christina Seely": [],
        "Colleen Randall": [],
        "Gerald Auten": [],
        "Jennifer Caine": [],
        "Katharine Cholnoky": [],
        "Pamela Thompson": [],
        "Soo Park": [],
        "Tricia Treacy": [],
        "Zenovia Toloudi": []
    },
    "SART076": {
        "Enrico Riley": [
            "review 1: \"06W with Enrico Riley: If you're taking seminar, then you probably already know the profs. Enrico is awesome if you've never had him. He's a painter, so he thinks like a painter... just know that. He has two assignments for us... an erotic art assignment and a systems art assignment... theyre both great. (i only liked one of them, but i think other people got stuff out of each one) we also did artists statements which were surprisingly good and meaningful and got us to understand and think abotu eachtoher and ourselves in significant depth.\"",
            "review 2: \"05W with Enrico Riley: Overall, the class was run as to be expected of a studio course. We were given the freedom to work at our own pace with frequent meetings with the prof. Enrico was amazing, insightful, and patient. I highly recommend taking a course with him.\""
        ],
        "Jeneen Piccuirro": [
            "review 1: \"07W with Jeneen Piccuirro: Not too much to say, all art classes are demanding. The prof as funny, and nice. Often helpful.\""
        ],
        "Thomas Ferrara": [
            "review 1: \"07W with Thomas Ferrara: Prof Ferrara is really laid-back, but he gets mood swings and will attack you randomly....not to your face, but through a huge blitz during the weekends. He's really nice, but i don't really understand him. THe class is not intellectually stimulating. He's all about the aesthetics of art, and he doesn't seem interested in the theoretical or conceptual aspects of art. This was a senior seminar though, he's much better in non-seminar classes.\""
        ],
        "Brenda Garand": [],
        "Daniel Heyman": [],
        "Gerald Auten": [],
        "Jennifer Caine": [],
        "Karolina Kawiaka": [],
        "Louise Hamlin": [],
        "Thomas Beale": [],
        "Viktor Witkowski": []
    },
    "SART075": {
        "Virginia Beahan": [
            "review 1: \"06W with Virginia Beahan: the prof is wonderful, color photo is great, the only problem is the short short length of the term and the difficulty in creating a portfolio that quickly. the darkroom is also always on the verge of collapse, but the class is worth it. take it!\"",
            "review 2: \"05F with Virginia Beahan: The best thing about this class is Virginia. She is so dedicated to her students! We went on optional class field trips which everybody wanted to attend, she tries to be available outside of class as much as possible, and just does everything she can to inspire her students. She is pretty easy during crits, so if you don't take crticism that well she's a good prof for you. She is also really knowledeable and tries to push you to learn as much as possible.\""
        ],
        "Brian Miller": [],
        "Christina Seely": [],
        "Eva O'Leary": [],
        "Hannah Nelson": []
    },
    "SART074": {
        "Jennifer Caine": [
            "review 1: \"24W with Jennifer Caine: Great class- easy to make whatever you want if you've made it to print 3. Jen can be either super hands off or hands on depending on what you want. Would recommend intaglio to anyone who likes drawing.\""
        ],
        "Daniel Heyman": [],
        "John Lee": [],
        "Joshua Dannin": [],
        "Louise Hamlin": [],
        "Sarah Amos": [],
        "Sharon Lindenfeld": [],
        "Tricia Treacy": []
    },
    "SART073": {
        "Brenda Garand": [
            "review 1: \"04F with Brenda Garand: not a fan of sculpture\"",
            "review 2: \"04F with Brenda Garand: Overall, the class was rigorous. Prof Garand had a lot of great insights, recommended studying contemp sculptors, but was spare in her compliments. She often associated how well you were doing in the class with the amount of times she saw you working in the studio during the day. Grades are a big question up until they are posted. But the class is awesome in helping you discover why you make art and what is consistent in your work.\""
        ],
        "John Lee": [],
        "Matthew Siegle": [],
        "Silke Rehberg": [],
        "Soo Park": [],
        "Soo Young Park": [],
        "Stina Kohnke": [],
        "Thomas Beale": []
    },
    "SART072": {
        "Benjamin F.": [
            "review 1: \"07W with Benjamin F.: This class was really enjoyable. At times Ben forgets to talk to students for long periods of time and it also becomes clear that he has favorites in his classes that he enjoys talking to more. He can also go on and on about senseless things and enjoys name dropping. But he is very helpful when it comes to improving art. He makes intelligent suggestions on possible improvements and new methods that coudl be used to help with the art and gives interesting artists to look at. Every week 5 paintings are due, but he is not too strict about this. If the paintings are very large and detailed he will generally allow this instead. It is a lot of work but also a lot of fun and really beneficial. Overall a good class and I would recommend it if you have an interest in painting\"",
            "review 2: \"04F with Benjamin F.: Ben Moss is an okay prof once you get used to him. He doesn't give a lot of feedback, he just tells lots of random stories, and doesn't seem to care a whole lot about teaching. Once in a while he'll take an interest in your work, but there's no consistency to the reviews/critiques. There were no assignments, we just painted whatever we wanted. It was nice to have lots of freedom, but would have been nice to get more feedback.\""
        ],
        "James Bohary": [
            "review 1: \"05X with James Bohary: Prof. Bohary doesn't give assignments. Instead, the students get to work independently on whatever they're interested in and at their own pace. Some people will find his class unorganized. However, Bohary is probably one of the nicest men you'll meet,very down-to-earth, and he is extremely understanding and open-minded. If you ask for his help, he'll help you out and push you in the most subtle ways. Take his class!\"",
            "review 2: \"04X with James Bohary: take painting visiting profs can be a risk... but jim is cool i think talk to colleen randall if you want to get to know about a prof before you take the class the prof can really make or break the class so ask around!! Jim only teaches in the summer i think but he's good so talk to him atleast if you get the chance\""
        ],
        "Enrico Riley": [
            "review 1: \"04S with Enrico Riley: if you get the chance, take a class with enrico he rocks any class will do.. painting, drawing... anything he is teaching he really meets you where you are and helps you grow from there but you have to be willing to put int he time and effort no one is going to do your art for you except yourself so get yo ass in the studio and make some art!!\""
        ],
        "Colleen Randall": [],
        "Jennifer Caine": [],
        "Pamela Thompson": [],
        "Thomas Ferrara": []
    },
    "SART071": {
        "Paul Bowen": [
            "review 1: \"08W with Paul Bowen: Bowen is a visiting professor. class was ok... we spent a lot of critique work in class and a little work.. most of the work was done for homeworks. Homework was not that much work.\""
        ],
        "Ruth Miller-Forge": [
            "review 1: \"06W with Ruth Miller-Forge: Since so few students sign up for Drawing 3 every term, it's usually put together with a drawing 2 class, so it's basically drawing 2 all over again. I mean, drawing is drawing, I don't know what I expected to be different, really. But the class was alright, lots of still life setups, model studies, interrupted by the occasional insightful quote read by the prof. Whom, incidentally, was...well, art professors are art professors, they're all pretty quirky, and she was no exception. She was alright. I've noticed that all art teachers really love to talk. A lot. I just wanted to draw. We spent a lot of time critiquing, which is always nice, but it is incredibly time-consuming. Near the end of the term we were spending half the class going around the room. I think having more small, individuall critiques may have been more helpful. Pulling aside one student at a time during class, for instance, to go over homework, would have been more productive, I think. Overall, though, it wasn't a bad class. I learned a lot.\""
        ],
        "Colleen Randall": [],
        "Edward del Rosario": [],
        "Enrico Riley": [],
        "Gerald Auten": [],
        "Ginger Levant": [],
        "Jennifer Caine": [],
        "John Wilson": [],
        "Oona Gardner": [],
        "Thomas Ferrara": [],
        "Viktor Witkowski": []
    },
    "SART068": {
        "John Wilson": [],
        "Karolina Kawiaka": [],
        "Zenovia Toloudi": []
    },
    "SART066": {
        "Karolina Kawiaka": [
            "review 1: \"08F with Karolina Kawiaka: Just expect to spend most of Monday and Wednesday evenings/nights in the studio...that's when all your work will get done.\"",
            "review 2: \"07F with Karolina Kawiaka: interesting class, but be ready to spend a lot of time in the architecture studio.\"",
            "review 3: \"06F with Karolina Kawiaka: This class was a lot of work and it was not a great idea to take two studio classes simultaneously. It was just way too much work to handle.\"",
            "review 4: \"04F with Karolina Kawiaka: Kawiaka will always ask for more work. But the outcome is worth it and you should have \"loads of fun\"\"",
            "review 5: \"04F with Karolina Kawiaka: This term, we were responsible for redesigning West Lebanon. All we all know, West Leb is a mess in terms of traffic and aesthetics. The project was very exciting, and our ideas are actually being discussed by the town planners, so it could go somewhere. We made a presentation to the Lebanon Planning Board as well. However, the professor made our work very frustrating at times. Whether or not she was actually trying to make us do our best work, the way in which she went about it was wrong. There was no incentive to do well, as many times I had done my assignment correctly and on time, while some in the class hadnt, and instead of being praised for this, I would be given more work to do, while the ones who didnt do the assignment well enough just had to complete it. We were also distracted from the scope of the project by doing some asinine side projects that seemed useless and time consuming. The professor was often unreasonable and unwilling to listen to a class's wishes. The actual class periods are painful as we would sit around for 2 hours discussing the same things over and over instead of having time to work. Help with the computer was also hard to get. So besides having an awesome project, this course was too frustrating to recommend with this professor.\""
        ],
        "Gerald Auten": [
            "review 1: \"08W with Gerald Auten: Very, very, very time-consuming, so expect to spend almost all of your time in the studio, but you do learn a lot. Jerry, the prof, can tell when you are serious about the class and are putting in a lot of hours at the studio, because it really shows through in the quality of your work. You get the term to work through one small project and two big projects, and throughout the term, you get feedback and critique from the professor and fellow classmates, which are extremely helpful in the development of your designs. Take this class only if you're serious about architecture. Even though if it consumed all my time, I didn't mind it because I enjoyed what I was creating in the class.\"",
            "review 2: \"08W with Gerald Auten: The course was a lot of work but very interesting. Jerry has a lot of interesting thoughts and I learned a lot about what he focused on. He made everything interesting and the comments throughout the course were very helpful. Overall great class, as long as you're willing to put in A LOT of work\"",
            "review 3: \"07W with Gerald Auten: Professor Auten is such a cool guy. Class was real laid back but I still learned an incredible amount! Lots of work though!\""
        ],
        "John Wilson": [
            "review 1: \"05S with John Wilson: awesome course, very very interesting. you learn not only about architecture in general, but about everything having to do with the dartmouth campus. not too much work, great prof, very interesting, definitely a great class. however, just be sure to take it with jack, he is very laid back and open about how you do things, the other prof to put it bluntly, is not.\""
        ],
        "Zenovia Toloudi": []
    },
    "SART065": {
        "Karolina Kawiaka": [
            "review 1: \"23W with Karolina Kawiaka: The last review was not exaggerated. Kawiaka's skilled at architecture, but teaching students is a different matter.\"",
            "review 2: \"23W with Karolina Kawiaka: I don't know why this class has 10 upvotes because it was absolute hell. Kawiaka is quite literally insane. I pulled so many all-nighters for this class and fell behind in my other classes because of the atrocious workload. Nothing was ever good enough and I would literally spend 20 straight hours in the studio just for her to step on my work the next day (yes, literally step on it). I have witnessed multiple people crying in the studio at ungodly hours of the night trying to get their work done. She would use words like failure, horrible, stupid, eyesore, etc. to describe students' work. On the last night of class, almost every single student spent the night in the studio and when the TA offered to stay with us she said she wasn't allowed to make him stay overnight because the last time she did that she got in trouble for breaking labor laws. She would gaslight us to try and make it seem like it was our fault we were struggling so much. She would say things like \"This isn't even that much work,\" \"I could do this so much better,\" and \"If you learned to budget your time better you wouldn't have to pull all-nighters.\" She would also talk about how \"in grad school they'll assign you more work, in grad school they won't go as easy on you, in grad school they won't care if you're sick.\" Does she not understand this is literally an INTRO class nobody is even considering grad school. She does give everyone an A but the torture this class put me through was not worth it.\"",
            "review 3: \"23W with Karolina Kawiaka: WORST PROFESSOR AND WORST CLASS EVER. This girl is literally INSANE. I cannot stress how much you should absolutely not take this class. Karol is by far the worst professor I have ever had & is utterly unqualified to be teaching let alone to be around students. She is the most disorganized person ever and classes are so unproductive - they just consist of her going on tangents about God knows what for 2 hours. Also, she assigns WAY too much homework and knows that it's too much. She has told 2 athletes in our class of 9 to quit their sports because architecture is more important. She also does not let you miss class even if you have a fever (if you miss she says she will give you a bad grade and will threaten to give you Cs or fail you). In addition, during reviews SHE IS SO MEAN. She told a girl in our class that her building made her want to c*mmit s*icide and that her building looked like a torture device. YOU LITERALLY CANNOT SAY THAT. She deserves to be fired and she should never EVER be allowed to teach ANYONE ever again and she should probably not be allowed to be around students ever. I cannot say enough bad stuff about her. I don't know whoever hired her at Dartmouth but they really let her slip through the cracks. In addition, sometimes she gets super stressed out because she knows that she is the devil reincarnated and tries to get her students to pity her. DO NOT FEEL BAD FOR HER. This b*itch is CRAZY.\"",
            "review 4: \"21W with Karolina Kawiaka: Kawiaka stresses me out. The actual class is not very organized, and she randomly assigns a crazy amount of work. I can see how it would be much better in person but troubleshooting rhino alone is not the best. I was planning on taking ENGS 44 with her, but I don't think I am now.\"",
            "review 5: \"07F with Karolina Kawiaka: Karol is one of the best professors at Dartmouth (She won SA's Profiles in Excellence award for Fall 07). She is so unbelievably helpful and responsive and available outside of class, she really listens to the class and its needs. YES, there is a LOT of work involved, but it is worth it. TAKE THIS CLASS\"",
            "review 6: \"06X with Karolina Kawiaka: it's a lot of work... and should try to have some background on the computers, because there it would make like so much easier.\"",
            "review 7: \"06W with Karolina Kawiaka: Prof. Kawiaka was awesome. She really tried to inspire students in many ways... (for example, she called students, \"future architects,\" and showed repect to every student's work.) But she also gave out at least 20 hours~30 hours worth of homework every week! She wanted students to learn from their own assignments...(not too much from the lecture itself...)Be prepared to completely devote yourself to the class...but if you work hard, you will be definitely awarded.\"",
            "review 8: \"05F with Karolina Kawiaka: This class is quite fun if you have little problem sleeping an hour or so a night. It is very work intensive, but I think you'll get a fair bit out of it. The first half of the term is mostly a sculpture type class... lots of hands-on projects and stuff. The second half deals more with CAD design and models, etc. Certainly worth your time if you have it to give.\"",
            "review 9: \"05F with Karolina Kawiaka: I would not recommend this class unless you seriously want to go into architecture and are not taking any other remotely time consuming courses. Everyone in the class pulls at least 2 all-nighters a week. You will start to call the studio home. You will keep a toothbrush there and order EBAs for every meal. Karol is totally insensitive to the fact that there might be anything in your life other than architecture (sleep? eating? don't even mention other classes... or a social life). Take this class at your own risk.\"",
            "review 10: \"04F with Karolina Kawiaka: pretty interesting class, a lot of work though, and bad prof - i would try to take it in the spring w/ a different one\"",
            "review 11: \"04F with Karolina Kawiaka: Professor Kawiaka is a great teacher and I learned a lot. But trust me, she is not kidding about the course load. Plan on spending a lot of time outside of class working on projects, some very late nights. You CANNOT breeze through this course. I've pulled the wool over a few studio art professors' eyes, but you need to have some serious output for class every day. But it is a great course don't get scared off.\"",
            "review 12: \"03F with Karolina Kawiaka: From Day 1, it was clear that Prof. Kawiaka was in over her head in this course. There was little, if any, guidance given in class, and when asked, Kawiaka had little insight into the details of her assignments. Class consisted of watching videos and working on our assignments with little guidance from Prof. Kawiaka. At the end of the term, when we began using computer aided drawing, Kawiaka's ineptitude became very apparent. She was unable to answer some very basic questions, and instead referred us to the user manual for guidance. This was a self-taught course. The subject matter is terrific, but Kawiaka brought very little to the table.\"",
            "review 13: \"03F with Karolina Kawiaka: The class is ok by itself. The projects Karol has chosen are time consuming and difficult but worthwhile. You will learn very few technical skills in this class. Instead you will concentrate on the sculptural aspect of architecture. The final project takes so much time to complete to even the minimal amount and you will have little to no help from the professor or TA, so start early and take other classes that won't have final exams\"",
            "review 14: \"01F with Karolina Kawiaka: This class does a good job at introducing architectural concepts at a fundamental level. Although I would have liked to work more with actual building design, the class is appropriate enough, especially if you plan to do more work in architecture (strong basics are very important in anything). There is a tendency for some students to complain about this class becuase of the workload, grading, or professor's intensity, but it is unmerited and generally comes from people who either can't handle work or whine as soon as they get anything under an A-. Welcome to reality. Ths class demends work, but not ridiculous amounts if you know how to manage yourself and deal with the professor. You could probably get away with 10 hours a week of homework, but it will be more around 20 if you care about the class. As far as the professor, she is enthusiastic and cares about architecture, her teaching, and your work in the class, and that is what matters. She is very approachable if you are having problems with certain things or in general, if you bother to actually talk to her. I did have some difficulty in this class, mostly due to outside factors, but I was able to talk to her when I did and things worked out OK.\"",
            "review 15: \"01F with Karolina Kawiaka: After reading the lone, scathing review of Prof. Kawiaka and her architecture course by a bitter former student, I had to offer a contrary opinon. I was in her 00W Arch 1 class as well as her Arch 3 class 01F. She is by far one of the most dedicated instructors I have encountered here and she deserves to be respected. If you do not appreciate the Arch 1 class you are simply unwilling to approach the subject in a manner different from what you expected. That, or you just suck at art and therefore should not become an architect. Take your pick. If you think that you have some sort of architectural talent you must stop. Just stop. You and I do not know anything, so get used to people making you feel that way. While you are at it, get rid of all other preconceived notions of what you believe architecture is before entering the studio. There are no doors, walls, or spiral staricases in design and do not get angry at the professor for telling you so. Oh, and if you only plan on spending fifteen hours a week on projects, do not even bother attempting the course. There is no time for sleep if you want to do well. There should be a prerequisite listed in the course description only allowing perfectionists to register. If you think you want to go to grad school for archtiecture, realize now that Karol is doing you a favor by preparing you for those years of torture. Kudos to her for putting up with obnoxious students who think they know more about design than she does. If you take her class, show her some respect.\""
        ],
        "Zenovia Toloudi": [
            "review 1: \"21W with Zenovia Toloudi: Great from a creative standpoint. I had a lot of fun and Zenovia pushes you creatively, but didn't provide enough structure or technical information. I think some of the issue might be because it was over zoom.\"",
            "review 2: \"21S with Zenovia Toloudi: More work than expected. No real instruction on the structural components of architecture. Overall, however, it was a pretty easy class.\"",
            "review 3: \"21S with Zenovia Toloudi: So full disclosure, the class is going to be confusing as hell, with unclear expectations, pretty much no feedback, and minimal instruction. That being said, if you put in a little bit of effort, show up to class, and make a menial effort to do something with the limited feedback you get, you'll get an A. So yeah, not ideal, but you get to build stuff and get a GPA boost. Worked for me, your mileage may vary.\"",
            "review 4: \"21F with Zenovia Toloudi: Mixed opinions on this class. If you are looking for a layup in terms of how much work you have (this is not it). If you are looking for a layup in terms of just getting a good grade this is it. I would say I put a lot of effort in this class because I cared about the content and I ended up with an A. At the beginning of the course you have a lot of work. You aren't good yet at building models so they take a while. Also, Zenovia is very unclear about what she is looking for and she will put deliverables on the assignment sheet and you sometimes have no idea what to do for them. Idk whether to recommend this course or not because I hated it for the first ~3/4 weeks and loved it by the end.\"",
            "review 5: \"21F with Zenovia Toloudi: Professor Toloudi was a character. She is super understanding and supportive, but pretty unorganized. I'm pretty sure she gives everyone an A if you put in effort so you kinda get out what you put in for this class. All of the real learning was just by building and doing projects, as class time was spent on unmemorable lectures and crits. I really enjoyed the projects and loved learning how to construct with foam board, use the laser cutter, and use photoshop. Also, great resources are available outside of class to help you learn. Overall I really enjoyed this class\"",
            "review 6: \"20F with Zenovia Toloudi: This class was taught credit/no credit when I took it and was interesting and easy. If you showed up to Zoom class and participated in the discussion posts you could actually learn something and get credit for the course. Definitely a good way to take a studio art as usually you have to put in a lot of hours. Feedback from Toloudi was very helpful and not harsh and she genuinely wanted us all to be passionate about architecture and did not care too much if your models or drawings were \"good\" if you look like you put in effort and you presented your ideas well she liked you and you were fine.\"",
            "review 7: \"18F with Zenovia Toloudi: This was a great class. Toloudi is clearly a knowledgable and accomplished as a professional and academic researcher, and brings that into the class. If she gives an outside lecture about her current work like she did during this term, definitely go, or at the very least look at her installation art on her website. Crits are helpful and provide valuable feedback without being harsh or ripping you apart. Toloudi is also very flexible with the work delivered for each crit, understanding of any problems encountered, although I doubt this transfers to upper level courses. If you don't make a due date, don't worry, as long as you show up to class and finish the project by the final due date, this class is an A.\""
        ],
        "John Wilson": [
            "review 1: \"22W with John Wilson: Good class. Honestly didn't do much \"architecture\" - no drawing figures or anything but pretty laid back. Prof. is super nice - 3 projects throughout the term: 1) read city book draw cities and construct model (most time consuming) 2) construct cooking tools out of wood 3) research project for potential design. Prof very knowledgeable about Dartmouth history and architecture - went on a couple tours around campus which was fun! Unfortunately uses all x-hours to learn CAD.\"",
            "review 2: \"07S with John Wilson: By all means take this class with Prof. Wilson if you can. He is SO responsive to students but still gives a fair amount of work. This is not an easy class and you'll do a lot of work outside of class... but you will enjoy it and feel like you're learning and creating.\"",
            "review 3: \"07S with John Wilson: The class would be very interesting if it wasn't taken with this professor. Jack is the campus architect, so he knows a lot of practical information about the campus. However, he's not a great professor, so you feel like you don't learn a lot in the class.\""
        ],
        "Gerald Auten": [
            "review 1: \"08X with Gerald Auten: I don't think I learned a particular lot, but I was able to kind of do what I wanted with the course. Frustratingly, there was no concept of reality throughout the project. I understand that it's a \"art\" class, but we were encouraged to ignore local rules, zoning, enviromental concerns, accessibility, and more. Often, the more absurd the idea, the better Auten liked it. We were never held accountable for our work. Some did all the work all the time and others barely did anything. You couldn't even tell if Auten noticed. We also received no grades or evaluations all term. Finally, it seemed that the professor wasn't helping us with our projects, but rather, he would see something and tell us his ideas for it. The class is what you make of it: you can learn a lot and get to draw a lot if you're pretty driven, but don't expect to be learning from Auten.\"",
            "review 2: \"07X with Gerald Auten: Jerry really inspires you in this course. I've found that I don't look at buildings/spaces in the same way as I did prior to taking this class. The work is hard -- everything is hand-drawn -- but allows you to truly visualize the spaces that you create. Jerry has high expectations but I think he helps you to create a strong foundation for future work in architecture by forcing you to be thoughtful, detail-oriented, thorough. This is an amazing class, but like many studio art classes, takes a lot of time.\""
        ],
        "Kimberly Poliquin": [],
        "Timothy Olson": []
    },
    "SART031": {
        "Benjamin F.": [
            "review 1: \"07W with Benjamin F.: It's a rather straight forward course. Every Tuesday have five new paintings. You in-class paintings are separate and distinct from your outside-class paintings. During class you'll paint and Ben and the TA will walk around, offering critiques on your work for that week. Ben is veyr helpful when you talk to him, though often times cryptic. He tends to get carried away with what he's saying and loses track of time. But he's a great person because he understands and values individual painting styles. As with any studio course, it's a lot of work outside of class, but worth it. You'll definitely be better at painting by the end of the course and have a large body of work to your credit.\"",
            "review 2: \"06F with Benjamin F.: Ben can be a difficult man sometimes and awfully critical. He also appreciated Quantity sometimes over quality which can be unfortunate. He also tends to get a few favorites in his classes and spends a lot of time talking to them and then only visits with everyone else on occasion.\"",
            "review 3: \"04F with Benjamin F.: professor moss really helped me find somethign i was interested in, and inspired me to continue working on the many projects that i started over the course of the term.\"",
            "review 4: \"04F with Benjamin F.: Ben is very serious about painting. He'll tell you right off that all the painting courses at dartmouth are beginner-level, and then he'll give you a 5 still life assignment every week of the term. Boring, but not a huge issue because everyone ignores it after a while. Ask questions, Ben is a great resource and very experienced. Only warning: he tells endless stories in class and can get kind of emotional!\"",
            "review 5: \"04F with Benjamin F.: you can go where you like with your art in this class. this was my first upper level studio art class and i loved the freedom i had in it. all of our assignments were basically to paint, and you could use whatever palette you liked and you could paint whatever subject you liked. that lack of structure was very refreshing, and i enjoyed it. i have mixed feelings about the prof. he's a nice guy, but sometimes he rambles about random stuff and doesn't give much feedback on your work. overall, i enjoyed the class. i'm not sure how much i learned from the prof, but i progressed as a painter with the freedom i received in the class.\""
        ],
        "Enrico Riley": [
            "review 1: \"21W with Enrico Riley: Professor Riley is amazing. I have had him for both Painting I and Painting II online, and I enjoyed both of my experiences. The classes can seem a bit long at times due to the virtual environment, but he does his best to make the, interesting and engaging. Sometimes we will paint in class or have a discussion/critique, and other times we will learn about different artists. The work level can be a bit much, but nothing too unmanageable. As long as you put an effort in, as well as are willing to experiment with different styles and techniques, you will do well.\"",
            "review 2: \"07S with Enrico Riley: Enrico is one of the best professors at Dartmouth. He assigns just enough to help you get the most out of the class without making you feel overworked and he balances directed assignments with more open-ended ones almost perfectly. He will offer as much support and advice as you could ever want if you ask for it, otherwise he will put on some thelonious monk or jazz guitar music and let you work entirely on your own. A truly amazing prof., take painting with Enrico and you will see what I mean.\"",
            "review 3: \"07F with Enrico Riley: I expected each class to begin with a short (10') demonstration of the focus for that class. There was one demo for the first or second class, after that, nothing aside from seeking out the professor individually. He is very available and encouraging in a one-on-one encounter, but as far as \"teaching\" painting, he expected that to be done in painting I. Many students in the class continued to paint abstractly for the entire term, others not so much, but there was little direction in general, little explanation of the \"why\" of what we were doing, and because of this, the tangible importance of the assignments was lost. Frustration was present in every student's work by the end of the term. So, obviously take this class if you like painting, but personally I did not find the worship of this professor very well deserved. He does know a lot about painting, but please, Professor, show us what you mean with visual, not verbal language!!!\""
        ],
        "Thomas Ferrara": [
            "review 1: \"05S with Thomas Ferrara: This was a fantastic class. If you enjoy painting, and you're looking to expand the range of your work, definitely take it.\"",
            "review 2: \"05S with Thomas Ferrara: <span class=\"not-found\">no comment</span>\""
        ],
        "James Bohary": [
            "review 1: \"07X with James Bohary: No structure, not much help, just the freedom to pursue your own projects. You're better off taking a real course where you actually learn something; it's a much better use of your tuition money. However, if you just need the credit and don't want to pour a ton of time into an art class, Bohary is the prof for you.\""
        ],
        "Susan Walp": [
            "review 1: \"05F with Susan Walp: i really enjoyed this class and learned a lot about painting techniques and art history.\""
        ],
        "Colleen Randall": [],
        "Jennifer Caine": [],
        "Pamela Thompson": []
    },
    "SART030": {
        "Brian Miller": [
            "review 1: \"09F with Brian Miller: I really loved this photography class; the photo department at Dartmouth is wonderful. My only complaint is that if you don't have your own camera you are often sharing with other students who aren't always responsible. This left me feeling a little behind and I don't know if all of the students traveled as far conceptually as they could have this term. But it was a good class and I highly recommend anything and everything in the photography department!\"",
            "review 2: \"05S with Brian Miller: This was one of the most fun classes to take. Brian allows you a lot of freedom in Photo 2/3 and you are able to explore b&w, color, digital and even video. He also lets most classes experiment with lots of different cameras and formats, which you don't do as much in Virginia's class. The prof. is really tough but the class is just a blast to be in. Crits are amazing, since everybody is doing such different things... it allows for a lot of growth, exploration and understanding of so many different technical, aesthetic and historical aspects of photography.\"",
            "review 3: \"05S with Brian Miller: Once you've had Virginia, it's hard to have Brian. He does about 8 hours of work a week- 4 each for his 2a and 10a. He's a good critic and his personal work is fantastic. However, he's totally uninspiring as a professor, and he teaches you about 50% of what you ought to learn in a given term. I mean, it's a decent photo class but as studio profs go, he's one of the laziest.\""
        ],
        "Virginia Beahan": [
            "review 1: \"04F with Virginia Beahan: If you are interested in learning how to shoot and develop color photos, take this class. I spent far and above more time working for this class than any other, but it was all enjoyable and well worth it. Open ended assignments.\"",
            "review 2: \"04F with Virginia Beahan: its a class with va\"",
            "review 3: \"04F with Virginia Beahan: Lots of time in the darkroom but it is worth it.\""
        ],
        "Christina Seely": [],
        "Eva O'Leary": [],
        "Hannah Nelson": []
    },
    "SART029": {
        "Brian Miller": [
            "review 1: \"09S with Brian Miller: Brian is a great professor and he clearly knows what he's talking about. If he doesn't like something about your work, he'll tell you and help you understand how to improve it. He's very approachable and is willing to help you out with whatever you need. Also, he has a great big bushy beard. Take this course if you're even remotely interested in photography or art in general.\"",
            "review 2: \"08W with Brian Miller: This is a great class. Prof Miller is awesome- really helpful and easy to go to with questions. There is little structure - weekly crits but no specific assignments or requirements - which allowed for a lot of freedom. It really made me want to do more photo.\"",
            "review 3: \"08F with Brian Miller: Professor Miller is very responsive to students and is always willing to adapt his assignments to students' interests. Photography is a very fun and interesting form of art, but the hours I spent taking photos, processing film, and developing prints in the dark room greatly exceeded my expectations. And, as is usually the case with art classes, you have to be willing to let loose and take risks without being too concerned about your grades.\"",
            "review 4: \"07F with Brian Miller: I really liked this course. It was fun, but it took a lot of my time. But worth it.\"",
            "review 5: \"07F with Brian Miller: Brian is a really cool guy, though he also has high standards and hates people who come to class late. The class is a great introduction to both the technical side of photography, and some of the great photographers of our time. There isn't much of a structure; to quote Brian, \"Take at least a roll of film a week, and print the 5 or 6 negatives that you like the best.\" While the freedom to shoot whatever you want has its merits, it can also be hard for the new photographer to figure out what kinds of pictures to take. Either way, the class is definitely rewarding if you're willing to put in the effort and can take Brian's sometimes harsh critiques.\"",
            "review 6: \"07F with Brian Miller: Brian is kind of crazy and weird but he is a really amusing professor. He gives effective critics on your work and will call you out if your work is subpar or haphazardly created. He's a great teacher and I would recommend him.\"",
            "review 7: \"06W with Brian Miller: Miller's a crotchety one, but he knows his stuff and he has a real enthusiasm for photography and for helping people - just don't mind his demeanor.\"",
            "review 8: \"05S with Brian Miller: He's sarcastic which makes him sometimes funny but usually a jerk. He wasn't too helpful during class and x-hours\"",
            "review 9: \"05S with Brian Miller: You learn a ton in Photo and it is a very interesting course. It is a lot of work and you will spend significant time in the dark room. Fun for senior spring!\"",
            "review 10: \"05S with Brian Miller: The class is tough but interesting and pushes you to work hard\"",
            "review 11: \"04S with Brian Miller: Brian Miller is a bit of a wise-ass, but he's genuinely interesting and leads good critiques. Assignments were left very open-ended, leading to lots of different material for the critiques. The course had a challenging amount of work in terms of both quantity and quality, but I am very happy with the product of my labor.\"",
            "review 12: \"04S with Brian Miller: This was a great intro to Photography. Brian is a wonderful professor who helps everybody develop to the best of their potential, whether you are experienced and want to pursue photography in the future or are clueless and are just taking this class for fun, you will get a lot out of it. Class is a blast, crits are fun, harsh and wonderful. It takes a LOT of time outside of class and you have to be willing to take criticism well, as with most SART courses. One of the best profs EVER, despite his attempts to seem like a troubled artist.\"",
            "review 13: \"04F with Brian Miller: Photo 1 is an awesome course and so much fun if you are at all interested in photography...but be prepared to spend hours in the darkroom! Even though you may find yourself in the darkroom at 2 in the morning before your thursday afternoon \"crits\" (when you have to put your work from the week on the wall), it's not nearly as bad as it sounds. I always blasted music and brought food and had a pretty good time, as long as I didn't have a paper to write afterwards. The class is set up so that after the first week you won't use any class time to develop or print pictures...you need to do that all on your own time. Tuesdays are a lecture/class discussion format about a topic in photography and Thursdays are spent talking about student work. Brian is quite a character. Don't let him scare you. He is very passionate about photography and that defintely inspired me. He gives no assignments during the whole course...he just requires that you take a few rolls of film a week and have 7 or so prints up on the wall on thursdays. This class is definitely worth it! I definitely want to take more photography courses.\""
        ],
        "Virginia Beahan": [
            "review 1: \"22W with Virginia Beahan: Great class, I definitely would recommend. You'll spend a lot of time on this course, whether in the dark room, in the developing area, or out in the field. In the last few weeks of the term I was probably spending about 15 hours a week doing those things outside of class, which isn't terrible (especially since the work isn't too dull) but definitely necessitates some good time management. Beahan is honest when judging your work, and will not hold back with praise or criticism. She's a quirky person but a good and accommodating prof. As someone with no artistic background, I feel like I grew so much as a photographer and an artist in just the 10 weeks of this course.\"",
            "review 2: \"09F with Virginia Beahan: Virginia was awesome. I learned a lot and had a lot of fun. Its definitely a lot of time but she does a good job of pushing every student to do a good job.\"",
            "review 3: \"07X with Virginia Beahan: I think photo is a great course, but it's a ton of work and you really have to love the subject to be that dedicated to it. So I would suggest to only take the course knowing you have a definite interest in photography. But it's definitely worth the effort if you like photography.\"",
            "review 4: \"04X with Virginia Beahan: Terrific class, covering everything from basic picture taking skills to advanced dark room technique. Virginia is responsive to students and always willing to spend extra time critiquing, teaching or being a goofball. Highly recommended.\"",
            "review 5: \"04X with Virginia Beahan: Photo 1 was the the most interesting class i have taken at Dartmouth. Virginia is really funny and down to earth. She is always making a joke and a good person. The material was great and there were no assignments. We just went out and took pictures! It was wonderful. Strongly, strongly recommended.\"",
            "review 6: \"03F with Virginia Beahan: i love photography so i was very eager to take this class. I thought that virginia, could have been more available and responsive. the small class was great, because i really got to know the other students. if you are at all interested in photo i definitely recommend the class.\"",
            "review 7: \"03F with Virginia Beahan: This course is great. I highly recommend Virginia for Photo 1, she is awesome at helping you understand basics while also inspiring students to find a style that works for them through a variety of different assignments. My favorite part was the amount of space I had to work on my own ideas and to find a pace and subject that worked for me. I definitely developed as an artist in this class and would recommend it to any student willing to move into the dark room for a term (and yes I mean move in... as a class we pulled all nighters in there)\"",
            "review 8: \"03F with Virginia Beahan: This course was - undoubtedly - the best Studio Art course that I have taken at Dartmouth. Virginia (the professor) was kind, understanding, and hands-off when it came to shaping students' projects. She provided helpful hints and useful guidance, tailoring suggestions of outside reading/ photography material to each student (in my case, very intuitively). A lot of outside initiative is required for a course like this -- the majority of the work is definitely accomplished in the late-night or early-morning hours, and almost always alone. However, despite her relative unaviailability on non-class dates, Virginia was always willing to remain long after a class had adjourned in order to help students work through difficult problems. Overall, I say - take it. Photography is a fascinating medium, and you will learn SO much, given time and hard work.\"",
            "review 9: \"03F with Virginia Beahan: she was always late, and always seemed to be more interested in helping the advanced photo students than us (photo 1). Onn the first class she didnt even know how to use the timers in the darkroom. She didnt teach students basic knowledge of the quipment and techniques (ei. on the night before final portfolio was due, she finally informed one of the students who had trouble burning due to short exposure time, that she could open her aperature and that would make the time twice as long--basics that she should have told the class 9 weeks earlier). She allowed for flexibility with people's projects which was great.\""
        ],
        "Eva O'leary": [],
        "Christina Seely": [],
        "Eva O'Leary": [],
        "Hannah Nelson": []
    },
    "SART028": {
        "Louise Hamlin": [
            "review 1: \"06W with Louise Hamlin: Louise is very good at explaining the techniques of printmaking, as well as inspiring students to work hard.\"",
            "review 2: \"06S with Louise Hamlin: This course emphasizes color plate printing with multiple plates, so basically, making one print calls for 3 plates and 3 times the work. If you have the time, its a great course. If not, then maybe try something else because the amount of work can really get annoying.\""
        ],
        "Jennifer Caine": [
            "review 1: \"23W with Jennifer Caine: Print is very fun! would recommend. This class was intaglio (scratching into metal) and is very different from wood/linocut. So be forewarned they are not the same class. Nevertheless this is a pretty good art layup in my opinion. Jennifer is very nice.\""
        ],
        "Tricia Treacy": [
            "review 1: \"20F with Tricia Treacy: DO NOT TAKE PRINTMAKING OF ANY KIND WITH TRICIA TREACY!!!!! They LITERALLY made a student cry in the middle of class. They should NOT be the head of the Printmaking department. John Lee is awesome as a Prof and a person, I highly recommend taking it with him. You will actually enjoy life\""
        ],
        "Daniel Heyman": [],
        "John Lee": [],
        "Joshua Dannin": [],
        "Sarah Amos": [],
        "Sharon Lindenfeld": []
    },
    "SART027": {
        "Louise Hamlin": [
            "review 1: \"08S with Louise Hamlin: Professor Hamlin is one of my favorite people and she's really friendly and excited about your work. That said, she tries to cover so many techniques in class that it becomes impossible to really master any of them. I strongly encourage people to take this class. It's a lot of fun, it's great being in the studio with your classmates, and it's just amazing to learn what you can create with a sheet of metal and a ton of acid.\"",
            "review 2: \"07W with Louise Hamlin: Louise is a great prof and you will learn so much in this course. My one quip is that the course moved very quickly and because I took it in the winter, we were a little rushed sometimes. Sometimes I feel like I didn't really get a solid grip on all the techniques. Louise is funny and very helpful in her criticism, though sometimes she is a bit absent-minded, so be aware of that.\"",
            "review 3: \"07S with Louise Hamlin: This class takes up lots of time. You have to spend lots of time in the studio, and it takes a while to perfect your prints. But it is worth it, as Prof. Hamlin is a great professor, and really being satisfied with a print that you made is a great feeling. I highly recommend this class if you are willing to invest the time that is necessary to actually have a good time taking it.\"",
            "review 4: \"07S with Louise Hamlin: I like making art, but hate cleaning up messes. I'm also bad at precise technical skill and planning ahead, which printmaking is kind of all about. But regardless of my impatience with all that, the concept and final product of printmaking is pretty fascinating. If you are a chronic procrastinator, be warned: you'll probably get some chemical burns during those late nights. Inks also seem to find their way on your face and arms, and are very hard to scrub off. But you can make some sick posters for your room/friends, maybe even some tshirts while you're at it. We called Prof Hamlin Miss Frazzle (of Magic Schoolbus fame), mostly because she's very scatterbrained and moody, yet a big sweetheart all the same. She's a bit OCD about neatness, but in general very understanding about lates and missed assignments.\"",
            "review 5: \"06W with Louise Hamlin: Printmaking is a really interesting subject, and I'm really surprised how much I know about the process after taking just this one class. Professor Hamlin knows the subject well and also understands that the prints don't always come out as planned. This class is really good and I recommend it to everyone.\"",
            "review 6: \"03W with Louise Hamlin: you ahve to spend a ton of time jsut to get one print done, so it is very obvious to the prof if you didnt spend enoguh time doing your work make sure you have tim to put into the course. printmaking is very anal... which is why i didnt like it. you have to devote a lot of time into making one print and then its nto always a sure thign how it will turn out i would reccommend waiting to take this class until you ahve done painting and drawing two. i took it right after drawing 1, but wish i had had more color and drawing skills before i took it to apply to my prints.\"",
            "review 7: \"02W with Louise Hamlin: i'm not a studio art major and i've only taken a drawing class and a design class at dartmouth. however, i've also taken many art classes outside of dartmouth and this has been one of the best ones i've had. printmaking, as a subject, is facinating and combines painting and drawing techniques into one medium...and more. and prof hamlin is a professor that i am glad i've gotten to be in contact with and i value her opinion on my work. the class had much personal attention (with only 7 people enrolled), and if you can put the time in, the experience is well worth it!\"",
            "review 8: \"01F with Louise Hamlin: Printmaking is an often overlooked, but worthwhile aspect of the studio art department. It's very complicated, and the techniques are tough, but it's definitely worth it. Don't be intimidated if you're not a sart major; effort is definitely taken into consideration. Don't take this as an easy third class, though; you have to be prepared to work HARD to have it pay off. Louise Hamlin is great, and i would recommend her for any art course. It's like having someone's mom as a prof.\"",
            "review 9: \"01F with Louise Hamlin: Then you should take this class. If you are not seriously interested in it and don't intend to put the time in, then you will not get anything out of it and will do poorly. But Louise is a great prof--warm, understanding, helpful, enthusiastic and generous. she is one of the few studio art profs who does not try to impose her personal styles onto you and she can handle disagreements and challenges. it was a lot of time--both on the assignments for each class and lectures out of class--but totally worth it if you want to learn printmaking.\""
        ],
        "Tricia Treacy": [
            "review 1: \"21X with Tricia Treacy: This prof is the worst professor I have ever had at Dartmouth. They were disorganized, set out unclear expectations, and could not read an email to save her life. She literally made one of her students cry during class. I can't believe that they are in charge of the printmaking department. DO NOT TAKE THE CLASS WITH TRICIA TREACY.\"",
            "review 2: \"21X with Tricia Treacy: She is the worst art professor I have ever had. She will not encourage you to try to do what you want to do. Instead, she will say, \"You had trouble with it before, so you shouldn't do it again.\" She does not teach you how to use the materials. She will not do her job. Do not take printmaking with her. She is fucking terrible. She does not listen to students' concerns about time and mental health. The only reason she pushed a project back one day was because a staff member in the book arts workshop told her she was being unreasonable. She has a project due during week nine and then another final project during week ten. It felt like the entire time I was telling her I did not have capacity to do more, and she would say, yeah, I see that, so redo the whole thing.\"",
            "review 3: \"21F with Tricia Treacy: Great class. I've always been interested in art and this was an awesome addition. Tracy is super nice but not the easiest to get ahold of. Class consisted of four assignments in different mediums. The materials available are insane and you have access to the studio 24/7. Would highly recommend if you don't want to do a ton of work but want to take an art class. Would recommend a little bit of art experience unless you're up for a challenge. Grading was fair I guess but I never knew what my grades were the whole term.\"",
            "review 4: \"20F with Tricia Treacy: This class was a credit non credit course (which I didn't even know before I signed up, and this might be subject to change) which means it's basically a free distrib. The teacher is great and my class size is only 4 students. Definitely take this class if you are looking to knock out the art requirement, just know it is a fair amount of work.\"",
            "review 5: \"20F with Tricia Treacy: Super fun class but know it is a lot of class time that sometimes feels excessive. They provide a lot of really lavish materials so it is a really amazing experience to work with such nice stuff.\""
        ],
        "Jennifer Caine": [
            "review 1: \"23W with Jennifer Caine: Jen and our TA Mikhaila were amazing! This class has a great blend of exposing you to new techniques while still giving you the freedom to go deeper into whichever ones interest you most, and it consists of 5 projects; a drypoint, hard ground, soft ground, and aquatint print plus a final series of your choice. Due dates were always reasonable and flexible depending on the progress made during class periods, and although things can get pretty time consuming, it's really cool work so I always looked forward to my studio time and never felt like I was procrastinating or falling behind. Around weeks 5/6 everyone also had to give short 5-10 minute presentations on a particular printmaker, and throughout the term we had a few Hood museum visits and one workshop in the Book Arts studio. Jen is super approachable and she's always happy to give thoughtful feedback on your prints or assistance if you're having trouble getting started with a new technique. And, as someone who isn't a Studio Arts major and doesn't have much formal training in other art forms, I really appreciated how Jen still gave me the same attention and respect she did to my classmates who had more experience. The studio feels a bit overwhelming at the start, but it's incredible how comfortable you end up with it at the end when you know your way around and how to make your ideas come to fruition. This is one of my favorite classes I've taken at Dartmouth, so even if you're just curious about printmaking definitely give it a try with Jen!\""
        ],
        "Daniel Heyman": [],
        "John Lee": [],
        "Joshua Dannin": [],
        "Sarah Amos": [],
        "Sharon Lindenfeld": []
    },
    "SART026": {
        "Sarah Amos": [
            "review 1: \"09F with Sarah Amos: Lithography is a very complicated and delicate art, and a 10 week term is definitely not enough to get working on a decent collection of prints, at least not in this class. Assignments were scattered, and sometimes didnt even have to do with litho. Sarah is a very experienced printer and knows what she's talking about, but you kind of go through the class not knowing how you're doing and given no warning about what assignments you will have. Definitely very different from most Dartmouth classes. But all in all, learned a lot, and have always found art classes to be very fun here.\"",
            "review 2: \"07F with Sarah Amos: It was a really cool class and I loved it. I definitely recommend it. The only thing is that I didn't think my final grade reflected the effort I put into the class.\"",
            "review 3: \"04F with Sarah Amos: I realize alot of people are scared of the time commitment when it comes to studio art classes, but if you have taken Drawing 1, I highly recommend Lithography. The printmaking shop is a remarkable place to work, and I have heard that enrollment numbers are down. Sarah Amos is an amazing artist. She has an immense amount of knowledge and skill when it comes to Lithography. This class is hard work, but very well worth it.\"",
            "review 4: \"04F with Sarah Amos: Lithography is incredible! The facilities at dartmouth are awesome, amos is a great prof and the class was overall a worthwhile experience. You can learn to draw, paint, or photograph ANY time in your life, but you probably won't have stones, papers, print and instruction made available to you again. Litho takes up a lot of time outside of class and is difficult sometimes because the steps need time in between. it is also not always an easy medium to work in, but suprises and late nights included i would take it again.\""
        ],
        "John Lee": []
    },
    "SART025": {
        "Enrico Riley": [
            "review 1: \"23W with Enrico Riley: Decided to write this review because there are no recent reviews. Riley is a good professor, he is very nice and supporting. Painting is definitely a little tricky because most people are not used to deal with oil paint, it also takes time to mix colors/find colors. It's way more time consuming than drawing, just because with drawing I could go to the studio right away, while with painting I had to change (it's good to have clothes to use only at the studio because they definitely get dirty with paint), open all paint containers, then mix colors, put on gloves. Let aside the fact we need to prepare the paper with gesso, wait for it to dry. Anyway, it's more work. Don't take it with two other time consuming classes because it will not be pretty. Leaving that aside, you do learn a lot in class and by the end of it I felt I was looking at art in a very different way. Riley definitely is more into abstract art, which is interesting but if you're not so much into it he will push you a little bit. Some weeks were very busy with assignments, and I felt they were not so well spaced. We would have like 2 paintings due one Tuesday and then no homework for Thursday, which is a bit annoying. Still, I did enjoy the class a lot and Riley is a good professor. He is definitely a little slow, especially in the first classes. I was a little bored at first but then the class started to be more fun, we started having models and things like that.\"",
            "review 2: \"06S with Enrico Riley: I really liked Prof. Riley and you will definitely learn a ton about color theory! He generally assigns really relevant and interesting assignments, even though you're never going to like all of them. There was a ton of work towards the beginning of the term with about two assigments per week, but as we all got busier outside of painting he adjusted the assignments, which i thought was really nice. Prof. Riley is quiet and really laid back but generally gives great feedback. He's really open to different styles, and as with all studio art classes, your grade is based on improvement and willingness to try new things. Great prof, fun class!\"",
            "review 3: \"06S with Enrico Riley: Coming from a background in drawing, painting is incredibly difficult. But it's amazing to learn a new way to think. And Professor Riley is so good at explaining concepts of color and being both encouraging and very demanding. He's possibly my all-time favorite professor.\"",
            "review 4: \"05S with Enrico Riley: enrico is a great prof - very sensitive to everyones work and really helps inspire art.\"",
            "review 5: \"04F with Enrico Riley: I had Enrico for Drawing I my freshman spring, and I waiting with taking Painting till my Junior fall just so I can have him again. He is really great and he knows how to start you out even if you've never painted in your whole life. The assigments take a lot of time, and if you try to take any shortcuts, Enrico will notice so it's usually not worth it. He does appreciate it when you put in a lot of time int o the class. If you're thinking about taking the class with Enrico, definitely do it but be ready to work a lot and love every minute of it!\"",
            "review 6: \"04F with Enrico Riley: This class was all oil painting, with pretty specific assignments. However, Prof. Riley didn't try to impose his own style on anyone, and was very supportive. In fact, my only complaint might be that he didn't offer any criticism, unless you asked for it directly. Bonus: since you have to build stretchers for the canvas during the second half of the term, you get $75 to use in the woodshop.\"",
            "review 7: \"04F with Enrico Riley: If you are at all interested in learning about the creative process, or about making art, more specifically, or if you like to paint, or you like listening to great music in class, want something 'different' to make a term more interesting, then there is something for you to learn in this class that you would appreciate--even if you are not interested in being an art major. If you are willing to spend a lot of hours in the studio, and willing to take risks to learn to do this, you should take this class, or some art class. Enrico Riley is a great professor.\"",
            "review 8: \"04F with Enrico Riley: I thought it was a great class. We had a variety of interesting and challenging assignments. The only thing is that it is alot of work, you have to be able to spend a good set of hours at the painting studio for every homework assignment. As for the professor, he was very approachable and gave great critiques of your work. He is also very accomodating if you miss class (ex. he set up a mini- still life set up for me when i had to miss class and the class had move on). The only down side to this class is that you don't have alot of freedom with the projects. I was disappointed that we were assigned a project for our final instead of giving us complete liberty to experiment with all that we had learned. Overall though, it was a good class that i recommend.\"",
            "review 9: \"03F with Enrico Riley: Painting 1 is a rigerous introductory course. There is a large emphasis placed upon still life and painting from observation. However, Prof. Riley does not expect exact renderings, he is open abtraction and personal interpretaion of the subject. If you really want to get all you can out of this course, don't underestimate the amount of studio time it requires: Be prepared to do your time in the studio. All in all, it is a great introductory course.\"",
            "review 10: \"03F with Enrico Riley: Enrico is just awesome. Nothing else needs to be said. He inspires you to work hard and is very open to your individual style. He tries to help you find your voice through paint and just cares about your learning and progress. Definitely take this class with him:)\"",
            "review 11: \"03F with Enrico Riley: enrico is great, the class was fun and challenging, be prepared to push yourself. you improve a ton during the term\"",
            "review 12: \"03F with Enrico Riley: painting 1 is a lot different from a class like drawing 1. oil paint is probably a medium that you ve never worked with, unlike pencil or charcoal, so you are starting from scratch. this class starts you off from the beginning, not giving too much too fast. sometimes the assignments were a little long, but nothing unreasonable. class crits are interesting and helpful. enrico is sooo chill, he is a good prof. we had models for a few classes, we did warm/cool studies, and a free assignment. mostly still lifes of course since we are starting. i have a few things that i am pretty proud of, and i have some good experience with the medium. and i can make a canvas stretch in the woodshop. as a perk, when you get access to the woodshop, all the other shops are paid too. make some jewelry and pottery!\"",
            "review 13: \"02F with Enrico Riley: Like other classes within the Studio Art department, Painting 1 was extremely time intensive. The time commitment was entirely worth it, though. It was an excellent class, and Enrico is a great prof.\""
        ],
        "Colleen Randall": [
            "review 1: \"09F with Colleen Randall: I loved this class, but like any studio art class, you get out of the class what you put in. Colleen is approachable, gives really positive and constructive feedback (even if your work is not that great), and will gently help to guide you towards creating better work. You can tell that she cares about her students. You will leave the class with a good understanding of how to work oil paint and how to use color, or at least better than when you came in. bottom line, GREAT class with a great teacher.\"",
            "review 2: \"09F with Colleen Randall: This is a great introduction to working with oil paints. It starts out with the basics of mixing and applying paint. We had a steady progression through different techniques and our paintings got steadily more complicated as the term went on. We learned how to build and stretch canvasses and we painted on three different types of material. Professor Randall explained concepts clearly and provided many examples - photocopies of paintings and books. She also did demonstrations in class when necessary. We didn't paint much from still lifes or models, which was a good thing because we all were still getting acquainted with oil paints. We also had less group critiques than in upper level classes, but I think that also contributed positively to the class. We painted a lot and Professor Randall gave us constructive feedback. We also attended some lectures and visited with the Artist-in-Residence in the Jaffe-Friede Gallery. This is a fun class, but you definitely should not consider it an 'easy third.' You get out of the class what you put in so it's worth it to spend a considerable amount of time in the studio.\"",
            "review 3: \"08F with Colleen Randall: for a studio art course-- lots of work, subjective teaching. like all art teachers, Randall doesn't really encourage art she doesn't like, and grades accordingly. but, don't take painting for the grade. it's so much fun, and really a great medium.\"",
            "review 4: \"06F with Colleen Randall: This class was a lot of time. The assignments were rather boring and we did not learn many \"basics\" of drawing. Prof. Randall was good, and she was very responsive to everyone in class. Still, I am glad to be done with it.\"",
            "review 5: \"06F with Colleen Randall: I really enjoyed learning to paint with oils, and learning to make my own canvases. It's a great intro class, and Prof. Randall does some good assignments for color theory and to get us to think about light and space, rather than separate objects. Definitely take it if you're at all interested in painting!\"",
            "review 6: \"05W with Colleen Randall: You'll feel like you're not learning anything while you're taking the class. In retrospect though, you realize you learned a ton. Colleen is really nice, and she gives you a lot of freedom.\"",
            "review 7: \"05W with Colleen Randall: I think Colleen is a great professor. She is very into abstract art, so if that is not your thing, this might make you uncomfortable, although I found her to be a tough but fair and very supportive professor. She does know what she is talking about, and I grew a great deal as a painter because of her. This class takes up a ridiculous amount of time if you want to be successful at painting. But it is worth the work. Also, Daniele, the TA for the class, made things much more comfortable. She was really nice, very approachable and extremely helpful. My painting class feels like my family now, I will miss them. It was a challenging and rewarding experience.\"",
            "review 8: \"05W with Colleen Randall: good intro to oil paint and color theory. colleen is a good prof who expects a lot of personal growth. her advice is not always concrete - she'll point out a problem and then it is up to you to muck around until you resolve it.\"",
            "review 9: \"05W with Colleen Randall: Awesome class, I highly recommend it. Plus, Colleen Randall is a delight, and a truly good professor.\"",
            "review 10: \"05W with Colleen Randall: this course did help me improve as a painter, but i thought colleen might have talked a little too much. if someone is not talented, no amount of lecturing will magically make them see the light!\"",
            "review 11: \"03W with Colleen Randall: you ahve to take this class if youre a studio art major, and i think it is good tot ake it as early as possible you learn a little bit of color theory which is very useful, but mostly it is good jsut to get you thinking about art in general and how much work goes into making any piece of art colleen also takes you to the hood to look at paintings she thinks are inportant to know about andyou learn a lot about great painters and how they worked\""
        ],
        "Pamela Thompson": [
            "review 1: \"07X with Pamela Thompson: I have mixed reviews about this class. I came out of it very happy with my progress. I went from being uncomfortable with oil paint to feeling like I've developed my own style, and really enjoying my final project, both the process and the result. We painted constantly, and maybe that's the best way to learn. My problem was with Professor Thompson. She hardly ever held class critiques, and the few she did lasted only fifteen minutes. In other art courses I've taken here, we've spent two hours sometimes on a class critique. She seemed like she didn't value our work, or see us as artists. She never gave positive reinforcement. Her class felt technical and uninspiring. The real reward is the more we painted, the more comfortable we became with our paints. The prof only hindered our progress. The one thing I'll say for her is that is was a big class, and she doesn't seem to know how to talk to all of us at the same time. One on one, she was much more encouraging.\"",
            "review 2: \"05F with Pamela Thompson: not a lot of formal instruction, but professor had lots of ideas and suggestions. Painting is more about practice & experience anyway, I don't know how I'd run the class more effectvely. We spent a lot of time critiquing, which seemed like a waste of time at first, but became very helpful. Our TA rocked--always available, very helpful.\"",
            "review 3: \"05F with Pamela Thompson: You know what you're getting into with a studio art course...it's going to be a lot of time in the studio. Some weekends we had 4 or 5 paintings to do. Prof. Thompson, though, is worth working for. She is very effective during critiques (even if she starts repeating herself towards the end of long ones--eventually she notices and moves on). We focused on still lifes and portraits with limited pallets for most of the term and then ended with unlimited pallets and some 2hour model portraits in class, which was great. I highly recommend taking this class with her!\"",
            "review 4: \"04X with Pamela Thompson: A crash course in painting--it may be difficult at first, but you improve tremendously after doing so many paintings. There's an emphasis on learning how to start paintings, not necessarily \"finish\" them. You learn a lot though doing, and the pace of the assignments makes sure that you spend lots of time in the studio. I found it to be a rewarding experience.\"",
            "review 5: \"04S with Pamela Thompson: You'll learn a lot and Prof Thompson is great, but be careful if you're not a quick painter. This class almost killed me because I usually take way too long on a single painting. Can be fabulous though if you just don't try to make everything perfect and be satisfied with a looser, quicker work.\"",
            "review 6: \"04S with Pamela Thompson: quite a lot of work, but lots of fun\"",
            "review 7: \"02S with Pamela Thompson: Esme Thompson is a good teacher, though not the most personable of professors...if you seek her out, however, she will give relevant critiques and suggestions. Make no mistake - her classes require HARD WORK! and long hours, but in the end you'll have a body of work of which to be proud, and a useful stock of technical (color/style) knowledge. A little hint - Esme is a stickler for PROGRESS, and holds students to a high standard. She expects a certain potential to be reached, and rewards accordingly...not an easy grade!\""
        ],
        "Ruth Lauer": [
            "review 1: \"08W with Ruth Lauer: Painting in itself is very interesting. Professor Lauer on the otherhand was less than ideal as a painting instructor. She was very positive about the work we were doing but she rarely gave any constructive criticism or guidance on how to improve our paintings stylistically or through composition. Additionally we did not do much dealing with color theory which is something I really had wanted to learn.\"",
            "review 2: \"08W with Ruth Lauer: If you don't like a lot of guidance with art than this class is for yyou. Lauer is brilliant and psychoanalyzes each piece. Her comments don't really relate to tecnique, but are from a very different point of view and can really open new perspectives. The class is a lot of work, but it's relative for studio art.\"",
            "review 3: \"08W with Ruth Lauer: Professor Lauer is a sweet, fun and slightly out there prof. She knows a lot about art, but rather than teaching us, she gave us assignments and let us figure it out on our own. We only had 2 class critiques and she rarely gave any constructive criticism. I really would have liked more guidance about technique, composition, color theory--really anything. Ruth gave some good assignments, and some really terrible ones. She was an easy grader--I'd be surprised if anyone didn't get an A. Painting is a ton of fun, and the whole class improved dramatically, but I really don't think it was due to our instruction so much as to just practicing. Take painting! But maybe with someone else.\""
        ],
        "Daniele Genadry": [
            "review 1: \"23X with Daniele Genadry: Amazing prof! She only teaches in the summer because she lives and works the rest of the year in Paris. Incredibly kind and helpful prof who will be understanding but also push you. Take this course with her.\""
        ],
        "Daniel E.": [
            "review 1: \"07F with Daniel E.: Interesting class.... prof has some weird tendencies, but I learned a lot.\""
        ],
        "Thomas Ferrara": [
            "review 1: \"06W with Thomas Ferrara: Ferrara didn't really teach. If you go in not knowing how to paing then that's how you'll end. Also he is a big fan of abstract art. If you don't think along his lines then you are labelled as uncreative.\""
        ],
        "Viktor Witkowski": [
            "review 1: \"22W with Viktor Witkowski: Loved the class and Viktor is a super sweet prof. Pretty time-consuming, but it's time that I wanted to spend.\""
        ],
        "Ginger Levant": [],
        "Jennifer Caine": [],
        "Julie Puttgen": []
    },
    "SART023": {
        "John Lee": [
            "review 1: \"05W with John Lee: The two hours in class working from the model are tough, but I think it helped drive my out of class sculpture work in a good direction, bring more animation to my pieces. If you are a drawing student, this is a good course to couple with your figure work. A tough course but lots of room and guidance for artistic growth\"",
            "review 2: \"05W with John Lee: I only took figure sculpture because professor lee asked me to. I really didn't know if i would like figure sculpture, but i thought it was worth a try. The class itself is great because we worked from a live model and mainly sculpted her form in clay, or, later on, if wire, if desired. This was really useful and taught me a lot about the human form. Outside assignments were vague, which was good in letting us go whatever way we wanted to with the concept of the figure. Professor Lee is an interesting character, but he is a good guy and a really helpful professor when you can work one on one with him or ask him for advice and input. he definitely has a passion for the figure and his enthusiasm for the subject spurred the class on. I wish i had more time to learn more about the figure and build on some of the basics I learned in this class, but I am also excited to go back to simply sculpture after having taken this more focused class.\""
        ],
        "Soo Young": [
            "review 1: \"08W with Soo Young: Sonny cares about you as a person and a student and will go to great lengths for your art. the pieces we worked on were varied, which was awesome, and any homework assigned in the library really helped inspire the new pieces (no busy work).\""
        ],
        "Brenda Garand": [],
        "Leslie Fry": [],
        "Margaret Jacobs": [],
        "Marsha Pels": [],
        "Soo Park": []
    },
    "SART022": {
        "Gerald Auten": [
            "review 1: \"22W with Gerald Auten: Professor Auten is a character- he's very knowledgeable and chill as long as you do the work. We had some trouble with getting models this term and Professor Auten always had useful assignments for us to do instead even when the cancelation came last minute. He doesn't use canvas but basically if you put in the work you'll get the grade.\"",
            "review 2: \"21W with Gerald Auten: Professor Auten is pretty entertaining, and I learned a decent amount considering the course was via Zoom. You get an A if you show up to class and do the work.\"",
            "review 3: \"05F with Gerald Auten: The class was outstanding. Professor Auten truly made this class phenominal. His assignments, although hard and time consuming were worthwhile. Each assignment honed my drawing skills. I learned more about drawing in this course than in any other art course I have taken. I do not consider my strength as an artist to lie in the world of drawing. However, after taking this class, I believe I am a much stronger drawer than I was before. I would suggest this class to almost anyone. However, I warn you, the workload is intense.\"",
            "review 4: \"04F with Gerald Auten: I learned to draw the figure SO much better. The quality of work produced in this class was amazing for some of the students having only taken Drawing 1 in the past. I think this is a testament to Jerry's teaching ability. He's an amazing and passionate professor and perfect for this class. He has a way of being keenly interested in the works people produce and taking good works or interesting works of students and immediately putting them up on the wall so you feel like he's really seeing what you're doing. I highly recommend taking this class and especially for SART majors taking it instead of Drawing II for the major requirement.\"",
            "review 5: \"04F with Gerald Auten: This was probably the best studio art class I've taken here; Jerry Auten is an effective and fun prof who cares about the class. You'll work really hard but definitely improve as an artist.\"",
            "review 6: \"04F with Gerald Auten: First of all, Jerry is great. Super enthusiastic, and really positive about work in class (though he tends to be more critical of the homework). Work in class varies in style and medium (though mostly charcoal on paper), and all of it is extremely effective in making you think outside the box when it comes to putting the figure down on paper. It's not just outlining the body, he says, but filling in the space and depth. A fascinating class. The homework could be more restricted to encourage more innovation, but other than that I loved it. Expect to spend a lot of time in the studio, though, if you actually want to improve in the class.\"",
            "review 7: \"04F with Gerald Auten: Professor Auten is friendly and approachable, which carries into his teaching and instruction. The class was time-consuming and often frustrating, but worth it and fun to attend.\"",
            "review 8: \"03F with Gerald Auten: Prof Auten brings figure drawing alive with his enthusiasm for his students and obvious love of drawing. The course was interesting and challenging and kept me glued to the studio. We even had the opportunity to draw visiting dancers and musicians in class! Anyone and everyone should take this class. It is inspiring and worth every moment!\"",
            "review 9: \"03F with Gerald Auten: If yorue at all interested in drawing, take figure drawing in the fall. Jerry is the only one who teaches it and its only offered once a year in the fall. Its was amazing to see how much everyone in the class improved during the term. I might even take it again next fall Also, for any majors, figure drawing counts as drawing II, so you can take this instead of that requirement. If you dont get into figure drawing,t hen definately takwe another class fomr Jerry at some point in your college career. Hes a great prof. and we all learned a ton of stuff.\"",
            "review 10: \"03F with Gerald Auten: I really enjoyed this class on the whole. I took it because I wanted to work on my ability to draw the human figure, so it was wonderful to have the opportunity to draw models in almost every class period. Attendance is mandatory and there are assignments due at every class period, so there is a good amount of work throughout the term. Also, I found it difficult to gauge how I was doing in the class and was ultimately disappointed with my grade. That basically left me pretty bitter about the class, since I had only taken it out of interest and not out of necessity. Aside from that, however, I would recommend the class to anyone who enjoys drawing. The way that the prof gets you to think about how you see and what you see and the space where things are located is definitely worth it.\"",
            "review 11: \"03F with Gerald Auten: As a Studio Art Minor this is the best class I have had in the department. Jerry Auten is a wonderfully inspiring professor, and really allowed the students to explore their own artistic style. I would highly recommend it to anyone considering Figure Drawing.\"",
            "review 12: \"03F with Gerald Auten: If you are serious about drawing, this is a wonderful class. The homeworks are challenging, but fair. Jerry is a great, great professor!\""
        ],
        "Soo Young": [
            "review 1: \"07F with Soo Young: Well, we started drawing the figure, but over time the class devolved into semi-three-dimensional abstract sculpture. So if drawing the figure is not for you, maybe this class is. If you want to learn techniques and ways of seeing to accurately and originally capture the essence of human form and life on paper, you will find yourself lost with Professor Park. That kind of drawing really has no place beyond the first several weeks in this class. Expect many self-portraits and sculptural projects. I suppose this class could be better with a different professor? Park seems maybe not the best choice.\"",
            "review 2: \"07F with Soo Young: My biggest problem with this class and the reason I gave any negative scores was because it can barely be considered a figure drawing class. I think we all signed up expecting to have intense emphasis on the figure, drawing live models in most class periods, and doing homework that would make us practice figure drwaing. Unfortunately that was not what the class was, and that was the reason for my dissatisfaction. We had a model at most 60% of class periods and most of our homework was only loosely figurative. By the end of the course, I really liked Prof. Park as a professor and I thought she brought an interesting perspective - just not for this class. It would have been a really interesting advanced drawing class, but I don't think I really improved at drawing the figure, and that was the biggest reason I took the class!\"",
            "review 3: \"07F with Soo Young: This is NOT exactly a figure drawing class. While you do spend a fair amount of time drawing models in class, I wouldn't say that we had models any more than some drawing II classes would. This is not to say that this is not a worthwhile class; in fact, I think it offers many things that other studio art classes at Dartmouth do not (a focus on more conceptual art, for instance, or the opportunity to work with mixed media). All in all, I would recommend this class: Park is both very knowledgeable and compassionate, and the material is interesting. Just don't expect to be drawing models all the time.\""
        ],
        "Karolina Kawiaka": [],
        "Susan Walp": [],
        "Viktor Witkowski": []
    },
    "SART021": {
        "Brenda Garand": [
            "review 1: \"06W with Soo Young: If Sunny likes you, your life will still be miserable in her course, just less miserable than if she doesn't like you. It helps if you are a boy. In my time at Dartmouth, this is the worst prof I have ever had. If you think it is acceptable for a prof to come to class, swear at students, make fun of them, send the entire class threatening and degrading emails, you should take this class. Sunny is a nice person, but she is very insecure as a teacher, and tends to implode several times over the term. She demands a lot of work, which is fine if you are a major and want to work hard, but her assignments are restricting, and really she doesn't want you to make your own art, she wants you to make her art. She humiliated several students in class during the term. She's young and she tries to fit in with the students, but this is a very bad thing. She talks about how lazy, or untalented people are in the class TO OTHER STUDENTS. Sunny will stay after class and help you, but she will be condescending when she does it. She also seems to resent teaching at Dartmouth instead of an art school, and has no idea that some students like to take art classes for fun. John Lee and Brenda Garand are by far better teachers who are respectful of students.\"",
            "review 2: \"05S with Brenda Garand: I took Sculpture 1 Junior Fall and didn't even intend to take Sculpture 2 to complete my modified major, but due to a scheduling conflict, I enrolled in this course and am glad I did. Sculpture 1 was very enjoyable, and I've grown a lot in my sculpting and creative thinking in this second version of sculpture. While some of the assignments, such as the idea pieces were frustrating, in that I thought they were a waste of time, the large pieces were vastly rewarding. Prof. Garand enabled me to grow in my skills and confidence, and this prompted me to make some pieces I was very proud of. I learned how to weld, which is a great skill to know, and definitely enabled me to make sculptures that I had only dreamed of before. The only frustrating part of the course is the lack of materials provided for the course fee. I had to pay out of pocket for two sculptures, which ended up kind of pricey. I wish the studio art department could have provided more to work with. Other than that, its just about the standard amount of work for a studio art course.\"",
            "review 3: \"04F with Brenda Garand: A big step from sculpture I, but important. Brenda Garand promotes streching abilities, exploring personal motivation to make art, and appreciating (or at least knowing of) comtemporary artwork. Rather than having a particular material assigned to each project (plaster, wood, metal, etc.) the sculptor was free to choose materials. That freedom is tough, but worth it.\""
        ],
        "Soo Young": [
            "review 1: \"07W with Soo Young: Sunny is great. She went way out of her way to help us outside of class and is a great resource for getting a sense of what the artworld is like outside of dartmouth. If you're not serious about art or working hard, then don't by any means take this course. She gives tough critiques and demands a ton from her students. If you're willing to work with her, though, and put a lot of effort and time into the class you'll be rewarded.\"",
            "review 2: \"06W with Soo Young: If Sunny likes you, your life will still be miserable in her course, just less miserable than if she doesn't like you. It helps if you are a boy. In my time at Dartmouth, this is the worst prof I have ever had. If you think it is acceptable for a prof to come to class, swear at students, make fun of them, send the entire class threatening and degrading emails, you should take this class. Sunny is a nice person, but she is very insecure as a teacher, and tends to implode several times over the term. She demands a lot of work, which is fine if you are a major and want to work hard, but her assignments are restricting, and really she doesn't want you to make your own art, she wants you to make her art. She humiliated several students in class during the term. She's young and she tries to fit in with the students, but this is a very bad thing. She talks about how lazy, or untalented people are in the class TO OTHER STUDENTS. Sunny will stay after class and help you, but she will be condescending when she does it. She also seems to resent teaching at Dartmouth instead of an art school, and has no idea that some students like to take art classes for fun. John Lee and Brenda Garand are by far better teachers who are respectful of students.\""
        ],
        "John Lee": [],
        "Leslie Fry": [],
        "Matthew Siegle": [],
        "Silke Rehberg": [],
        "Soo Park": [],
        "Soo Young Park": [],
        "Stina Kohnke": [],
        "Thomas Beale": []
    },
    "SART020": {
        "Thomas Ferrara": [
            "review 1: \"20S with Thomas Ferrara: Great class with a considerate and flexible prof. Did this class online for the spring, and it worked pretty well over zoom. Wherever you're studying its important to have a studio/work space, as the materials are mailed to you. We did biweekly group crits over zoom that were super helpful in explaining/sharing your own work and seeing what other people are working on. The non-group weeks you would meet with the prof directly to get crit and that was also super helpful. Obviously this class would be better in a group studio space working with other students you work on your projects, but the prof and most of the students remained engaged and attentive to the coursework and developing skills. Lots of pencil and charcoal work. The class is usually a mix between those already interested in studio art/drawing, and those who took drawing 2 and discovered a new talent/interest, so there's a mix of experience, talent, and skill throughout the class that makes crits really interesting and comfortable.\"",
            "review 2: \"05S with Thomas Ferrara: The course is good. But you should definitely have an interest in it, everyone in the class is really talented so it can be frustrating at times. Ferrara is nice though.\"",
            "review 3: \"05S with Thomas Ferrara: The class itself is very ideal--7-8 students in a studio no other class occupied. However, I was kind of disappointed by the lack of direction in the class. We spent two weeks drawing stools before we got to the figure, and pretty much it was the figure until the end of the term. There was no real instruction, just continual drawing. That would be fine in drawing III, but I felt a lot of the class wasn't ready for that.. Although there were a couple drawing III students merged with the drawing II class.\"",
            "review 4: \"05S with Thomas Ferrara: Possibly, Ferrara is the worst professor in the art department. It is one thing to be a professional artists- it is another thing to be able to teach. He has no capacity for instruction. He did absolutely nothing all term. The class had no structure or direction. He disappeared into his office for most of the class period. He didn't even look at your work in class. He offered no advice on technique. He was every art major's worst nightmare. Some students I don't think minded a lot because they took the course for fun, and since he assigned very little work, the course didn't cause much stress for anyone. On the otherhand, I think his lack of teaching abilities is a great disservice to art majors. We are here to learn how to be good at what we are doing. If we wanted to draw without instruction, we can do that without costly tuition. But we are here to learn skills, and I can honestly say that I learned nothing from this professor. The growing I did as an artist came from spending money I don't have on instructional books that were far more informative in their introductions than Prof. Ferrara was in his entire term at Dartmouth. Most people say that you do not come to Dartmouth to study art. If this is the case, then why have the department at all? All I know is that I am at Dartmouth, and I am studying art, and I would like to get the best education that I was guaranteed when I matriculated at this institution.\""
        ],
        "Chuck Holtzman": [
            "review 1: \"06S with Chuck Holtzman: Professor Holtzman was just too nice. He was very understanding even to some rude students...(I felt so sorry for him!) I think it is kinda true that he is not well organized....but he was always full of ideas...and so smart!! Overall, Professor Holtzman was really great! (But one side note: don't take this course if you don't like abstract drawing...)\"",
            "review 2: \"06S with Chuck Holtzman: Love it\""
        ],
        "James Bohary": [
            "review 1: \"07X with James Bohary: I hear that Drawing II is actually a lot of work with other professors, but Bohary gave almost no assignments over the entire term. We would just spend the entire class time working on our own personal projects. The perfect easy class for summer term.\"",
            "review 2: \"05X with James Bohary: Professor Bohary is an amazing artist. In this class, you get a lot of freedom to do whatever you want with your skills. He doesn't give assignments. The median for this class was an A. You could do really great in this class if you care about the subject and if it shows that you worked a lot. I'm talking about an A citation...probably. But no worries, if you do very little--or close to nothing for that matter--and you don't care at all about drawing ( and thus your work royally sucks) it's ok too (bravo, yeaaahhh!!!): you'll still get an A. So if you're looking for a GPA booster my friend, go ahead and take this class. If you love art, take it, and try to get the most out of what Bohary has to show you or say to you, because he really helps if you reach out to him.\""
        ],
        "Colleen Randall": [
            "review 1: \"09F with Colleen Randall: Professor Randall is very encouraging of all her students. She pushes her students and holds them accountable for the decisions they make in their work. She really cares about her students and gives everyone individual attention. She doesn't push her students to do one thing or the other, but gives us freedom and tries to challenge us within our focus to improve. The class had a good balance of in-class drawing and group critiques. We also went to lectures and visited the Artist-in-Residence in her studio, which was neat. Professor Randall challenged us but encouraged us at every step of the way.\""
        ],
        "Ruth Miller-Forge": [
            "review 1: \"06W with Ruth Miller-Forge: Overall a good class, but I feel we could have all gone farther if the professor had pushed us a little more. She generally went pretty easy on us in terms of homework assignments--she was almost too nice. We seemed to do the same kinds of assignments repeatedly, which sometimes got a little boring. But we often had models to draw, which was fun.\""
        ],
        "Edward del Rosario": [],
        "Enrico Riley": [],
        "Gerald Auten": [],
        "Ginger Levant": [],
        "Jennifer Caine": [],
        "John Wilson": [],
        "Oona Gardner": [],
        "Viktor Witkowski": []
    },
    "SART017": {
        "Pamela Thompson": [
            "review 1: \"09F with Pamela Thompson: Fantastic professor... she loves her students and wants them to excel. She offers excellent critique, and encourages students to seek inspiration in unique places. This class was by far the most interesting/rewarding course I took this fall, and I hope to take another course with Esme again over the next couple of years that I have here. I would definitely recommend taking ANY class with her!\""
        ]
    },
    "SART017.12": {
        "Viktor Witkowski": []
    },
    "SART017.08": {
        "Karolina Kawiaka": [
            "review 1: \"23F with Karolina Kawiaka: Overall a good class. Karolina is a very unique professor– get to know her. Class consisted of a project every week or two. At the beginning it's doing some hand drawing (easier if you are ok at drawing) then we move into photoshop. Projects I found to be fun. Midterm is 5 pieces. Compared to most other art classes this is not a heavy workload. Show your effort, she will see it. Ask for help and advice. Second half of the class is illustrator. One projects I didn't find to be useful, but we got to use the laser cutter and book arts studio which was very fun. Final was 5-7 pieces for us doing kinda whatever we wanted. Overall I'd definitely recommend this class as an easier SART class.\"",
            "review 2: \"23F with Karolina Kawiaka: Kawaika is definitely unique, but she can also be really passive aggressive and really disorganized, she doesn’t explain exactly what she wants very well. I found the class fairly useful, but I also feel like if I just spent a couple weekends playing around with Photoshop and Illustrator I could have achieved the same objectives in terms of my work digitally. I’m more impressed with the work she had us do by hand (which I’m more comfortable with anyway, so this isn’t too much of a complaint), but in my opinion, the class should have been slightly more digital based than it was. I’m glad I took it, but I can’t say I would really recommend it.\"",
            "review 3: \"22F with Karolina Kawiaka: The class has a heavy workload. For our midterm we had 5 drawings in a week and for our final we had to do 7. Also I feel like I could've learned the skills on my own. But Professor Kawiaka gives some good critiques, and she's an interesting professor.\"",
            "review 4: \"22F with Karolina Kawiaka: Heavy workload but rewarding class. It's a lot of independent work and i'm going to be honest, I got by without doing any of the reading or tutorials. Kaiwaka is very nice and a good professor to know. my biggest advice, USE. THE. PRINTER. the quality of the printer is SUPER nice and I basically printed out my own art from outside of class for my own use sporadically through the entire term, which made up for the cost of this class. (The cost of this class is $225 without aid.)\"",
            "review 5: \"18F with Karolina Kawiaka: I liked this class a lot, but the prof is pretty demanding when it comes to the workload. I would recommend getting Adobe Photoshop and Adobe Illustrator on your personal laptop, that way you don't have to hike to BVAC to work on your homework every other night. Half of the class is spent learning Adobe Photoshop and the other half spent earning Adobe Illustrator, mostly by using Lynda tutorials. There were 3 figure drawing sessions with a model and the rest of the classes were spent on critiques and discussion. She tries to give you more work over the weekend, so you'll likely have more work due on Tuesdays rather than Wednesdays. There is a midterm project and a final project due, in addition to the homework. Knowing Photoshop and Illustrator is definitely a useful skill to have, and the prof is engaging and quirky, so I would definitely call it a great class.\"",
            "review 6: \"17W with Karolina Kawiaka: I really enjoyed this class. If you enjoy being able to work independently, this is the class for you. Kawiaka loves out of the box ideas and she really fosters creativity. She is extremely willing to help you with learning the computer programs (Adobe Photoshop, Illustrator, and even Rhino if you are interested in 3D work). She is extremely knowledgeable in the art realm as well as architecture (she even designed the building in which all SART classes are taken, The Black Family Visual Arts Center). She is so intuitive and can help students develop their own unique style. This class was great if you like to put your headphones in and grind for hours at a time, but I would say that this class took SIGNIFICANTLY less time than other studio art classes due to the fact that you are working on a computer rather than with paper and other media. If you have to fulfill an ART distrib or need to take it for your major, I highly recommend taking this course. Heck, take it for no reason. It's super engaging and fun. Kawiaka is a top-notch professor.\""
        ]
    },
    "SART017.07": {
        "Colleen Randall": []
    },
    "SART016": {
        "John Lee": [
            "review 1: \"22X with John Lee: SUCH AN AMAZING CLASS! Not considered a layup at all tho, be prepared to put in a ton of work outside of class. John is a great professor and cares a lot about his students and helps them through everything, but you're only gonna get what you put in. It's totally worth it if you're willing to dedicate time and effort to this class.\"",
            "review 2: \"07X with John Lee: Everyone should take this class. I came so far in sculpture; the course really challenges you, lets you explore ideas and different materials, and gives you great woodworking, wire, and plaster casting skills. The professor, who insisted we call him John, is just a great teacher. He wants each individual to find their place and do well, and he values everyone's work. We'd spend every tuesday's class just critiquing each other's work, with lots of positive encouragement and sincere criticism. The only problem with this class is that it feels too short. We never even got to do metal. Also, John can be kind of annoying because sometimes he'd just decide he liked a piece even though the whole class knew that person hadn't worked on it at all. But who cares, the point is how you develop your own sculpture work, and in the end those who put the time and effort in grew so much.\"",
            "review 3: \"07X with John Lee: John is a great professor. He asks really good questions that make you think, and is always full of helpful ideas. The quality of the class depends a lot on your classmates, so having a supportive group of people in the class really helps. You'll definitely meet new friends through spending so much time together working in the sculpture studio!\"",
            "review 4: \"07W with John Lee: John is amazing, this class is amazing!!! Take it, please. I was really scared at first because I have no background in sculpture, but after a couple of classes getting John's feedback, I started to love sculpture. The prof covers all aspects of the discipline, unlike other studio art profs who focus on the aesthetics of art. I learned so much in this course, I recommend it to anyone.\"",
            "review 5: \"07S with John Lee: Expect a lot of work but a big rewards from it.\"",
            "review 6: \"06X with John Lee: John is a very nice person who has good intentions. That said, he assigned way too much work and expected us to spend an absurd amount of time in the studio.\"",
            "review 7: \"06W with John Lee: I really enjoyed the class, and John was amazing. There were no reading assignments. However, we had sculpture projects with different materials due about every two weeks. My only regret was that I did not have enough time to give to the class. Most students get REALLY into this class, and you get alot out of it if you do. However, if you don't have the extra time you probably should wait until you have it. =)\"",
            "review 8: \"06W with John Lee: I had no idea or specific interest in sculpture before I took the class, now I can't help noticing the different forms in space around me. The class is amazing. Prof's is really inspiring and TA's very helpful. Be prepared to give up a lot of time for your work, but it's worth it.\"",
            "review 9: \"06S with John Lee: this class is a lot of work, but worth all of it. the prof is great, you get free range in studio, great class participation, interesting lectures. don't take it when you have a tough course load though, b/c it demands quite a bit of time\"",
            "review 10: \"06S with John Lee: John is inspiring, witty, and an all-around must-have art prof. His advice is invaluable. The class itself is great, and it was refreshing, after having only taken drawing or printmaking classes, to work directly with my hands, and with tools, to create a 3-d object. I loved this class, and it makes me want to take the higher level sculpture classes.\"",
            "review 11: \"05F with Soo Young: Absolutely the worst prof in the studio art department. Do not take this course with her. Take sculpture with John Lee. Park will make you miserable. She will make you hate the subject.\"",
            "review 12: \"04X with John Lee: This class should be called Sculpting Blind because there is no actual teaching that takes place. There are no slide shows, lectures, examples, or effective help given. You just come, sculpt something and get critiqued. Sometimes critiques go well, other times, Professor John Lee (call him John) is in a bad mood, and everyone and everything sucks. Don't take this class to fulfill an art credit. Or take it with someone else if you do.\"",
            "review 13: \"04X with John Lee: this, more than any other studio art class i've had here, really demands alot of studio time. you really have to spend hours on end in order to get anythign to show for yourself but if you have the time, definately take it. John is an amazing prof and really helps you to grow where you are ready to grow. and unlike drawing and painting, you are really given the chance to develop ideas. you dont have like 5 things due every class so you can really focus on one project and do it well\"",
            "review 14: \"03F with John Lee: The class is harder than you expect. BE open-minded and be willing to spend many many hours outside of class in the studio burning your fingers with the hot glue gun! Never hesitate to ask for furthur explanation of s sculpture project and don't hesitate to ask for help or input on the sculpture you have made so far. Just be cool.\"",
            "review 15: \"03F with John Lee: John Lee is an incredible professor. I am not a studio art major, but am modified with engineering. I was skeptical of the subject entering the class. After some initial settling in to the subject, sculpture became my favorite class of the term and one of my favorite of my time at Dartmouth. This course, with John, is demanding. Its hard to get by doing minimial work, and it will be reflected in the work. However, the amount of time spent on a project will not really become a burden. It was almost theraputic to spend time in the studio and see an idea come into fruition through hard work. I was actually pleasanty surprised with the last two pieces I turned out. Take this course if you are at all considering it.\"",
            "review 16: \"03F with John Lee: Definitely time consuming but equally rewarding. John is a great sculpture prof...especially if you don't like structure. He's also very helpful outside of class. Take the class while Mike August is TAing if you can because he knows everything. seriously, everything.\"",
            "review 17: \"02F with John Lee: This course was demanding, but it forced me to stretch myself--I'm not an artist by any means, but that didn't matter. The class was basic and expected solid concepts rather than perfect execution.\"",
            "review 18: \"01F with John Lee: if you have the very slightest bit of creative energy, this class is for you. john lee lets you use that energy to go in any direction you choose and he (and the ta) help along the way to guide you/ inspire you if you need it. they also make things technically/materially possible that you might not have though viable before. personally, i loved the art studio evironment in which everyone was making art and curious about and encouraging everyone else's work. it was a loose, non-competitive environment for a change and it was refreshing and freeing. exploration seemed to be the key to enjoyment (rather than focusing on the final products or memorization of knowledge) and when i had that perspective, i was happy this course opened my mind to the questions of how art is made, who makes art, and why and the best part was that i found out the answers to all these questions first hand!\"",
            "review 19: \"01F with John Lee: John is an excellent person and was great to work with. And it did feel like we were working \"with\" him. He tries to identify with students at the same level as them and not as some higher-upper. The class was far better because of this. I would certainly recommend taking a sculpture class with John.\""
        ],
        "Soo Young": [
            "review 1: \"08W with Soo Young: This was a very enjoyable and fun class, though also a lot of work. This is probably one of the most time consuming courses, so don't take it simply for an easy Art distrib. Professor Park was wonderful. She's so enthusiastic and energetic about your work and loves to see this reflected in her students. It's more important to try new methods and experiment than to have a perfect looking piece. She may sound harsh during crits, but she recognizes the effort and time that is put into your work and places a high value on it. If you have questions or are unsure about tools don't hesitate to either ask your Professor or the TAs. The TAs are fantastic and you don't have to be shy about asking for help or advice. It's also fun to see what the other sculpture students are doing, especially the more advanced levels.\"",
            "review 2: \"08W with Soo Young: it's interesting, but it involves many many hours in the studio if you can accept that, then take this course-- it's fun to make things and not have to sit in a lecture. it's hands on in class.\"",
            "review 3: \"08F with Soo Young: This is a course for artists. It can be fun to play around with the different materials, but don't expect any instruction. Park is an artist first and a teacher second. The class is basically time for you to make four different projects, actual learning is minimal.\"",
            "review 4: \"07W with Soo Young: It's sculpture so expect to put in lots and lots of work. But in the end it pays off - the median for the grade was an A- so you shouldn't have to worry too much about your grade. I personally liked Prof. Park's laid back style of teaching but she might not be for everyone. She's can get pretty harsh on critiques but IMO this was a welcome change from highschool or other art classes where people try to be as nice as possible when talking about other people's works.\"",
            "review 5: \"07F with Soo Young: Course work: The workload is rigorous. For us, the syllabus comprised of six pieces, four of which involved specific materials (including plaster, wood, and a found object), and all of which had a specific thematic guideline (e.g. \"tension\"). Six brief homework assignments prepare you for your work. Six or seven classes are devoted to critiques and the rest are free work days or demonstrations on plaster and woodworking. Therefore, the majority of the work is done outside of class. Professor: Professor Park's knowledge and experience are immediately evident. She is a kind person and engages each student personally. She gives constructive criticism when it is helpful and gives praise when it is earned. Her enthusiasm for art is infectious. Worth taking? If you are willing to devote TIME and ENERGY into this course, it is EXTREMELY rewarding. This is a course in which you will learn and grow more than the ORC description alludes to. That said, if you do not have a real enthusiasm or curiosity for art, it is probably not a good choice; you will be happier elsewhere.\"",
            "review 6: \"07F with Soo Young: sculpture 1 is an awesome class. professor park is a great, interesting person who knows a lot about what she is doing. she gives everyone a fair chance and is very supportive. however, this class is a lot of work. the studio art professors set high expectations, and it is very clear to them when their students are not putting in adequate effort. be prepared for some late nights / all-nighters in the studio. the up side to this is that it is way more fun to be up late working on sculpture than it is to be up late in the library.\"",
            "review 7: \"07F with Soo Young: Class material is fun and pretty much what you make out of it. I originally felt like a B-rate carpenter, but as the term went on I got more invested in my projects and was later proud to call them my own. Professor Park walks the fine line between tough love and just plain harsh, often teetering towards the latter. She makes *a lot* of unfounded assumptions about the student's personalities/attitudes, whether you like it or not. In her class, you'll be living according to her narrative of what she thinks you are, and don't always expect her impressions to be accurate or fair.\"",
            "review 8: \"06W with Soo Young: The professor based too much of our grades on how much we commented during group critiques and less on the implementation of our ideas and the amount of time we spent outside of class, which I feel greatly showed. We had four assigmnents throughout the course and she didn't push the syllabus, since we ran out of time and never had a final project. However she wasn't that efficient with the time in class, as we sometimes ran over or had to finish up another day. Also, she frequently used xhours which I find odd for most studio art classes. But a very nice person and fun class but I think she is more regimented than most art profs in what guidelines you have for your work.\"",
            "review 9: \"06W with Soo Young: pretty laid back...she pushed ppl to do better. she was a tight prof and i enjoyed the class.\"",
            "review 10: \"05F with Soo Young: Absolutely the worst prof in the studio art department. Do not take this course with her. Take sculpture with John Lee. Park will make you miserable. She will make you hate the subject.\"",
            "review 11: \"05F with Soo Young: Sculpting, if you like making art, is great fun and this course will help you hone skills with various sculpting materials. The prof, is horrible. When she gets to teaching, she has interesting things to say, but very often it will degenerate to her vetoing or OKing your ideas. I relied ostly on the TA's for help with my projects. Also, professor Park does not seem to understand that she needs to communicate her expectations to the students. She has very big expectations from the students, and she will be convinced, despite all proof, that you are not living up to them. She is also over eager to call students out on thier various misdemeanors, big and small. I lost interest in the class halfway, and just tried to find out what sculptures she wants me to do, so I could save my grade. I don't think it worked.\""
        ],
        "Brenda Garand": [
            "review 1: \"07F with Brenda Garand: Lots of work, late nights, even with some time management. I'm not an artist by any means, this was kind of just me trying something new but I still really enjoyed it, it was difficult sometimes but not in a math or reading way, I enjoyed the break it gave from my other classes -- but was still a lot of work. Hope that wasn't too repetitive.\"",
            "review 2: \"04W with Brenda Garand: get to work with range of materials, quite a lot of fun, good prof\"",
            "review 3: \"04W with Brenda Garand: I had to take this course as part of the art history major, and was very skeptical at first. However, I would definately recommend this course to anyone who loves art, is an art history major, or just wants to change up the pace of their schedule with a fun, hands on class. The class was very demanding, but the more you put in, the more you got out, so in the end, very, very rewarding. Prof. Garand is encouraging, her comments always helpful. She grades everyone based on their progress and dedication to the class, not how \"good\" or \"bad\" their pieces are. Prof. Garand was amazing! I loved this course and as a result plan to take more studio art courses! One of the best overall class experiences I have had at Dartmouth!\"",
            "review 4: \"04W with Brenda Garand: Sculpture I was a great class. prof garand puts limits on the assignments to stimulate creativity and encourage experimentation. the two sculpture classes spent many long nights together. i feel as though i know a lot more about form and structure as they relate to space.\"",
            "review 5: \"04F with Brenda Garand: I really liked the class. The assignments are open enough that you can do what you want, but still have some structure and everyone's piece is somewhat related so the critiques are more interesting. I missed the midterm meeting with the prof since I was sick, so I have no idea what my grade could be - that was the one problem, since I still have no idea what my grade for the class is/was based on. It's still really enjoyable, but you need to do your work consistently (ie. not last minute) and it does take up a lot of time outside the classes, so I wouldn't recommend taking it with another class that also requires a lot of outside-of-class time.\"",
            "review 6: \"04F with Brenda Garand: helped me realize that anyone can do art. I rediscovered my self through art. Nice break from science or other conventional classes. No reading! No essay! No final!\"",
            "review 7: \"04F with Brenda Garand: Take the course with Professor Lee.\"",
            "review 8: \"02W with Brenda Garand: like all classes in the studio art department, expect there to be a lot of work in sculpture 1. anyone who takes an art class expecting it to be less demanding than other courses is sorely wrong. if you do put very few hours into art, it is often reflected in your art, and ultimately in your grade. plus, the work is simply not as satisfying if you are not willing to dedicate a solid amount of time to it. that said, sculpture 1 is a great class. you work with a variety of materials to get a general feel for sculpture and working in 3 dimensions. you'll also get to know your classmates fairly well during your time spent in the studio together. brenda is a very good professor. she expects a lot, but i don't think she should expect any less. she is very enthusiastic about art and is very happy to help students with suggestions, structural ideas, and general information on using the machines and tools. a word of wisdom: if she gives the class an extra weekend to work on a sculpture, work on your sculpture. she will be very unhappy if you don't. overall, a wonderful class. by far my favorite this term, and by far the one i devoted the most time and energy to.\"",
            "review 9: \"02W with Brenda Garand: Sculpture I is an awesome class! It takes a LOT of time, but it's really fun work. The best part for me was just learning how to work with all of the different materials - plaster, wood, metal. I didn't have any experience with sculpture and that wasn't a problem. If you're looking for an art class and don't want to take drawing, this is the class for you.\"",
            "review 10: \"02W with Brenda Garand: I really liked this class. I was skeptical about it at first but it definitely exceeded my expectations. Brenda was a great prof, one of the best I've had here. The class was a lot of work though. I pulled my first ever allnighter for this class, but it was worth it.\"",
            "review 11: \"02W with Brenda Garand: While Sculpture 1 did take a lot of time, it was a wonderful course. Professor Garand does a great job of helping you develop your sense of sculpture through our in-class critiques, through sharing student examples, and by having the class bring in art books of sculptors to discuss. The class uses a variety of materials from cardboard, plaster, metal, wood, with a final sculpture in whatever you want, so there is always the challenge of learning to deal with a new material and knowing that you wont be frustrated by a specific thing for the rest of the term. I'd strongly recommend this course.\""
        ],
        "Matthew Siegle": [
            "review 1: \"22W with Matthew Siegle: Pretty tough class, but great. Prof Siegle really pushed us to make interesting work. We were only 6 students in the class which was crazy. I reconsidered a studio art major after this and switched to a minor. Siegle was tough in critique (told me a piece was “not aesthetically rewarding” ie looked like shit), but he was literally correct every time and was very helpful in reworking. This class was really good for my art as a whole, made me question why I make things. Overall can’t recommend outside the major or minor, but really really good otherwise.\"",
            "review 2: \"22W with Matthew Siegle: This class definitely pushed me harder than most other SART classes I’ve taken here have. Siegle especially really cares about the work that’s produced, and will not hesitate to make comments on how he feels (ie if he thinks your work looks like shit, he will say that during the class critique). I put a lot of time into some projects, just for them to literally fall apart. He also assigns fairly long readings about three times a term on top of lengthy projects. So I would say this class was useful for me as someone who wants to major in studio art because it forced me to be harsher on myself and have higher standards for my work, but I absolutely would not call it an easy class (at least with Siegle)\"",
            "review 3: \"21X with Matthew Siegle: This class is a lot of work, and there are a lot of rules, which can be annoying, but you will learn a lot about sculpture and different methods of art-making. Because there are a lot of rules, you will learn how to question them, and you can learn when it's best to not follow precedents. Prof. Siegle is nice, and individual meetings about your work are informative. There are no harsh critiques in this class.\""
        ],
        "Paul Bowen": [
            "review 1: \"11W with Paul Bowen: Professor Park could not speak clearly in class. 90% of the time, her sentences made no sense and often contradicted her other statements. Studio Art professors MUST have good communication skills. Their method of evaluation is 100% verbal... there is no grading papers with yes and no answers. It's all verbalizing constructive criticism. Professor Park failed at this completely. She stifled anyone doing anything that was not her style and could not give any reason she disliked someone's piece clearly; leaving the student knowing they had failed but without any idea why. She was very harsh on anyone who tried to do anything original. This is art! It's meant to be original! Don't take any class with Professor Park if you expect to have a fair, understandable evaluation.\"",
            "review 2: \"09F with Paul Bowen: Paul is a good (visiting) prof. He assigns lots of little assignments, rather than a few big ones and you get to work in a variety of materials. He's also pretty flexible about assignments. PS: You definitely don't need to be an \"artist\" to take this...building things is fun!\"",
            "review 3: \"08W with Paul Bowen: Bowen is a visiting professor. We had interesting assignments. He allowed you to truly explore the use of different objects. Assignments were not too difficult, but had to spend a lot of time in the studio outside of class. TA Jose - great help\""
        ],
        "Matthew Burke": [
            "review 1: \"01F with Matthew Burke: This was a very interesting class and a great introduction to sculpture, but requires A LOT of work outside of class. It's definitely something you should take if you have an interest in 3-D art but make sure your other classes are not too time consuming.\""
        ],
        "Soo Sunny Park": [
            "review 1: \"21W with Soo Sunny Park: It's a lot of work and was hard to take on a partially locked-down term, but Professor Park is so sweet and very supportive. She's not always the most organized, but is very understanding and enthusiastic, and I enjoyed the course a lot!\""
        ],
        "William Ransom": [
            "review 1: \"22F with William Ransom: This class certainly made me think in a different way than I ever had before. It was SO MUCH WORK though. I spent probably over 20 hours a week outside of class most weeks working on projects. We used plaster for the first project, then wood, and the final was up to us what material we used. There were lectures some days of class, talking about other art, but other class days were just work days. Besides the three main projects, there were a few other little things that just took up time too. There was also a single page paper due near the end of term about any art you go see in person, which was not a difficult assignment. The final project also includes a written component. William was helpful in figuring out how to complete a vision and was realistic about materiality, but he was not flexible with deadlines for any circumstances. The TA and shop tech were both fantastic and super helpful during monitor hours to get work done. The most challenging part of this class was time - especially on projects that need the woodshop, there were very specific hours that that was available, which was challenging to line up a schedule to do that. There is so much work time outside of class, much more than any other class I have taken at Dartmouth, but this was still rewarding and useful to expanding my thinking.\""
        ],
        "Chuck Holtzman": [
            "review 1: \"08S with Chuck Holtzman: Take the class just for Holtzman. He's great, and really interesting to work with. Very unique classroom environment. No regrets about taking this class.\""
        ],
        "Daniel E.": [
            "review 1: \"08F with Daniel E.: The reviews of Prof Dalseth make him seem pretty scary, but he's really not a bad guy. It's true that there were days when he was unnecessarily harsh and just in a bad mood, but he also knows a lot about sculpture, has genuine interest in helping his students overcome problems and progress, and can be really funny. I would say he is just an unconventional teacher. This was a class that frustrated me through most of the term because I disagreed with some of the profs ideas, but at the end--looking over all the work of the term--I realized that because of that, I learned what is important to me as an artist. This is definitely not your typical art class, but if you know what you're getting into, it can be one of the best ones you take at Dartmouth.\""
        ],
        "Elizabeth A.": [
            "review 1: \"03F with Elizabeth A.: Sculpture is a great class in the SART department because there is no drawing prerequisite and there is a wider variety of student enrolled- rather than mostly sart students. Prof Duffy is a very talented artist and very helpful.\""
        ],
        "Marilyn J.": [
            "review 1: \"02S with Marilyn J.: I'm a studio art major, so that probably guaranteed a little more enjoyment of the class than for most ppl. Marilyn's a really nice lady, but I felt like as much as I liked her as a person, I wasn't as sure about her as a prof. I feel like the things I learned about shape, color, texture, whatnot, were 99% from my own experimentation, and very little was actually from her input. Maybe that's the way this is all supposed to work, I don't know. I had zero experience with any type of sculpture before I took this class, and I felt that it was kind of silly to expect us to produce these complete pieces and explain them right off. I think I might have learned more given more space to experiment and find out what things worked, what didn't, and then LATER use that knowledge to create something of more substance, rather than rush through it blindly, with the expectation of producing all these pieces that solve their respective problems AND stand on their own. It's an important class to take, I think that sculpture can be a lot more intuitive than a lot of other mediums, but also vulnerable to more b.s. Mostly yr making something, rather than making a representation of something. But the \"is it/isn't it art?\" issue seems a lot more shaky in sculpture precisely because it all is so abstract and out there. anyhow. I learned a lot regardless, about myself, myself as an artist, and about 3 dimensional art-making. i highly recommend the course, it makes you see the world differently, in a good way. especially if you've never been any good at drawing but do have some un-tapped ability at using yr hands or a quirky sensibility.\""
        ],
        "Joseph Montroy": [],
        "Kathryn Zazenski": [],
        "Silke Rehberg": [],
        "Soo Park": [],
        "Soo Young Park": [],
        "Stina Kohnke": []
    },
    "SART015": {
        "Enrico Riley": [
            "review 1: \"22F with Enrico Riley: I absolutely loved Enrico. He facilitated a great environment for a studio art class, and had helpful critiques regardless of someone’s abilities to actually make art. He made the class fairly easy, especially as someone who has done quite a bit of art in the past. He grades on how much effort he sees you put in, and how you engage with the assignment. So even if you suck at art and/or don’t really click with the assignment, he still allows you to be successful.\"",
            "review 2: \"22F with Enrico Riley: Enrico was a wonderful professor. Enrico's course is laid out in a fashion that forces you to develop some basic drawing techniques before you can see clear and trackable improvement--which makes for a satisfying breakthrough when you look at your work near week 5. His critique was lenient. No more than 2 unexcused absences, or else you're dropped a letter grade (though I don't think he enforced that rule this term). In terms of difficulty, the course was more difficult near week 3 (7 hour hw) and week 9 (13 hour hw). Taking this course brought me insight into how artists see everyday objects and beauty, and, for that, I appreciate it.\"",
            "review 3: \"22F with Enrico Riley: good, easygoing professor, relaxed with work and fair grader. as long as you show up and complete assignments you will get a good grade. you don't have to have previous experience to do well. the class does take some hours outside of the class with homework, but not too bad, not as much as he says it will.\"",
            "review 4: \"17F with Enrico Riley: Professor Riley is the best! He is so calm and kind and he makes an effort to encourage everyone, regardless of their skill. He makes lessons very clear and introduces different skills and techniques step by step. He does also push you at times to get you to out of your comfort zone and think outside the box on your projects. I wouldn't call this class a layup, because of the intense amount of time involved (15 hours a week in the studio outside of class) but because I learned so much in such a short period of time, I'm definitely glad I took it.\"",
            "review 5: \"09W with Enrico Riley: Riley is the best professor to have for this class. He encourages everyone, regardless of their personal art style or level. If you have never taken art or are a horrible drawer, he will encourage you, being kind with his critiques and helping you with different exercises that will transform you into someone who uses their own style. If you are an accomplished artist, he will let you explore different avenues on your own and critique you fairly. He's a very easy grader, but I would say that everyone in my class spent a lot of time on their work (as is necessary, in any art class.) I went into this class thinking that drawing was just messing around with a pencil or maybe some other tool with paper- Riley really taught me a bit about what art is.\"",
            "review 6: \"09W with Enrico Riley: My drawing skills improved significantly and Prof. Riley helped me to, for the first time, look at my work from an intellectual point of view. The class was a great release from the dreary New Hampshire winter. Lots of work? Yes. Worth it? Completely. A word of warning, though: don't try to sleep on the couches while pulling an all-nighter in the Hop. S&S will find you, ask for ID, and threaten to write you up.\"",
            "review 7: \"07W with Enrico Riley: If you are going to take this class you better have a passion for drawing because it will take passion and genuine love for drawing to keep you awake at night finishing the crazy workload of this class! The class itself is well structured, and well-ran. The only problem is that you will have to do LOTS of drawing (which often demand a lot of outside of class time if you aspire to get a good grade), and will pose a challenge if you are taking other classes that also demand a lot of your time. (I would recommend taking this class during a term you have less demanding classes so that you don't go out of your mind juggling the intense workload). The activities: drawing in class and critiquing others' work as well as your own in front of class, mastering techquines, drawing still life, drawing models, and doing a final major project (a huge poster)that demonstrates your mastery of all the techniques learned in the course. Prof Riley is a bit introverted but he is not altogether unapproachable, so do speak to him whenever you don't understand something as he will be happy to explain things to you.\"",
            "review 8: \"07W with Enrico Riley: Prof. Riley is a dream art prof; very funny, very bright, and very sensitive to what students are looking for in a studio art class at a liberal arts institution. He was a former Dartmouth student and \"gets it,\" but he's no pushover. Try to be in his section.\"",
            "review 9: \"07W with Enrico Riley: this course is over all interesting and enjoyable. the assignments are challenging and interesting, and the critiques give some good insight. however, the fact that your work hangs on the wall every week definitely creates some stress. i found it extremely difficult to do the assignment quickly, even if i had a bunch of other things to do. professory riley is really nice, but sometimes it is difficult to see what he wants, as he doesn't really point out what you need to improve.\"",
            "review 10: \"06S with Enrico Riley: I took this class on a whim but it ranks among my favorites at Dartmouth. I loved spending time in the studio even though I'm not a minor or major and have minimal experience drawing. Enrico is a good person and great teacher. You build a foundation with the basics before tackling assignments that seemed way beyond your reach when you're just starting. Everyone in my class improved during the term. Some struggled with various concepts more than others, but I think most of us performed better than expected. Many people believe they can't draw because they've never devoted 5+ hrs to a drawing. On that note, it does take up a lot of time but I'd rather spend 6 hrs on a drawing than 2 on a paper. It's time well spent.\"",
            "review 11: \"06F with Enrico Riley: Enrico Riley is a really amazing teacher. It doesn't matter if you're a beginner or have a lot of experience, he's great at explaining the concepts so that you really understand them and can carry them out in your own work. You make the assignments fit your level and it's an awesome thing to see how much everyone is the class progresses. There is a pretty good amount of studio time involved, but the effort really pays off when you see what you can create and the professor definitely acknowledges your dedication even if you aren't the most gifted.\"",
            "review 12: \"05S with Enrico Riley: Studio art classes are very time-consuming! That said, they are worth the effort. You don't have to be an artist to do well, you just have to do the assignments and show up to class. Enrico is a great teacher and artist and has meaningful comments for everyone. He takes a more hands off approach to teaching, letting us critique each other's work before adding his own comments. The homework assignments oftern took hours, but they would usually be assigned on thursday and due tuesday so we had a long time to get them done. Drawing is a great skill to have, so if you can put in the time for this course, I highly recommend it.\"",
            "review 13: \"05S with Enrico Riley: This class because you have to go to the studio to do homework is very time consuming. But i feel that we had a variety of assignments, and had lots of fun.\"",
            "review 14: \"05S with Enrico Riley: This is a great class and i highly recommend taking it. Just beware, if you do not like to draw, or you're not very good at it, it might not be the class for you to take.\"",
            "review 15: \"05S with Enrico Riley: Enrico Riley is an awesome prof. take a class with him!\"",
            "review 16: \"05F with Enrico Riley: When as space opened up for me in the class, and I sat in for a day, I though Riley was a little too mellow for me and I almost dropped. I'm glad I stuck with it. He takes a while to unfold, but he does and he has suggestions for people with all levels of experience. I already had art before so I admit some of the assignments seemed a little unoriginal. But those of you with art experience--you're going to have to take a drawing I to get to higher levels, and always know that Riley will have both compliments and criticism for you. Be prepared to you lots of charcole!!! Charcole was fun for me but just know you don't branch out a lot with media in this class.\"",
            "review 17: \"05F with Enrico Riley: take it!\"",
            "review 18: \"05F with Enrico Riley: I've already taken this course at an art college. In comparison, Riley's class is not as demanding in time or perfection of pieces. So while I did not improve as much in this course as I had in the one elsewhere, I really enjoyed Riley's openness and love of all art; he found beauty not just in the most accurate of drawings but in all of them. In comparison to the rest of the professors who taught Drawing I, the work load for this class seemed significantly less.\"",
            "review 19: \"05F with Enrico Riley: Enrico is an extremely easy going guy. This helps out because drawing 1 can be especially intimidating for people that have no experience whatsoever. He does a good job of finding the strengths of any drawing, making class critics less intimidating. But at the same time, it's hard to get real criticism from him, which can be a problem if you are want to really improve. You'll be spending a lot of time in the studio for assignments. Though it's much more fun to be working on a drawing than writing an essay.\"",
            "review 20: \"04S with Enrico Riley: Drawing 1 is a lot of work, but it is a different workload than other courses. All homework is drawing in the studio. Prof. Riley was outstanding, with helpful critiques and appropriate assignments. Any who are interested should take this course\"",
            "review 21: \"04S with Enrico Riley: Riley is a cool guy and a great prof. He also doesn't give weird, obscure assignments like I've heard the other drawing-1 profs give.\"",
            "review 22: \"04S with Enrico Riley: I liked this class, it was a solid introductory drawing class. The only problem was that I had extensive experience with drawing before coming to Dartmouth and there is no way to place out of drawing 1 so I felt a bit bored at times, but Professor Riley was mostly accomodating and he tried to make the class interesting and challenging anyway. If you want a good introduction to drawing or are interested in studio art, this is a fine course to take. The only thing was, Professor Riley was really nice about everyone's artwork even if it was utter crap, he still tried to find something positive to say about it. also, he didn't really give anyone criticism of what they were doing wrong, so some people had a hard time with getting past mistakes that they repeatedly made. But in the end, everyone had improved significantly in their drawing abilities. I think professor Riley's greatest strength as a professor is that he often brought in books of artwork in to class and had brilliantly insightful comments to say about the artwork he was talking about. Probably the one thing I took away from this class more than anything else was a new appreciation for great artists of the past, some of whom before I had not been able to understand the value of their work, but after the course, loved their art. This was a fun and relaxing class and I enjoyed it.\"",
            "review 23: \"03W with Enrico Riley: I learned to draw. How astonishing and wonderful. I think that the hours I spent on my drawings were some of my best-spent hours at Dartmouth. Professor Riley is an excellent art teacher. His sequence of exercises really builds skills. And, even better, he and the art he showed us were inspiring.\"",
            "review 24: \"02W with Enrico Riley: I was extremely lucky to be placed in Riley's session. The other sections had homework assignments that were tedious and in areas I wouldn't have been interested in. In Riley's class, we did many still life studies of contour, value, positive and negative space, did some drawing from a model, practiced capturing the emotion of a human face, learned to draw draperies, did an enlargement of a Rembrandt, and even had some free assignments. I have never had so much fun in a class. I was passionate about art to begin with, but I feel this class really allowed me to express myself and to develop my skills with charcoal and other medium. I feel I got better at representing the human figure, and I enjoyed myself while doing so. Other sections focused a lot on collage techniques and plants, but I feel we focused on topics relevant to the typical sort of art I would be interested in pursuing. There is a lot of time needed outside of class for assignments, but in the end they were so fulfilling it was worth it.\"",
            "review 25: \"02W with Enrico Riley: without having any drawing experience and only wanting to get a prerequisite for another course, I went into drawing with a neutral attitude. But the course was very well-taught - professor riley is one of the cooler drawing profs. He didn't assign us impossible homework, although it was pretty challenging - the crumpled-up paper assignment was tedious, and so is having a long assignment that you're expected to spend 4 hours on. the most difficult part of the course is having the motivation to go and spend 2 or 3 hours on a drawing outside of class; that was the most difficult part of it for me, because the class is labor-intensive. it doesn't take much thinking, but after completing a drawing I was completely exhausted. I am definitely glad I took this course, though, because it really helped me strengthen my visual sense in terms of how i view value, line, etc. and it offered me a different approach to drawing than I had before.\"",
            "review 26: \"02W with Enrico Riley: After the first couple of class, I was considering dropping it because, first, I had no other previous drawing experience, secondly, I was too concerned that all my drawings looked ugly. However, this class slowly became my favorite class of the term. It was partly due to Professor Riley. He's so cool. He's really nice and understands that people have different abilities. His lessons, combined with the work you do in class and for homework really helped me become better in drawing and more confident in my drawings, that is if you pay attention and try really hard. I spent a lot of time on the homeworks because you have to display them at the beginning of class and talk about them, so you have to them really good, you can't half ass it or else it's extremely embarrasing. Also, some of the homework assignments are set stuff you have to draw, however there is plenty of room for personal expression, which is really cool.\"",
            "review 27: \"02F with Enrico Riley: This class is A TON of work--be prepared to spend up to 4-5 hours on each night's homework assignment. Enrico is a great guy, and the atmosphere/deadlines are very relaxed. If you miss a class, though, it becomes troublesome...\"",
            "review 28: \"02F with Enrico Riley: All in all, this was an excellent introduction to Drawing for someone who has never had the talent or training for art before. While my grade obviously paled in comparison to my quite-skilled peers, Prof Riley still treated my work with dignity and useful analysis.\"",
            "review 29: \"02F with Enrico Riley: This course really does teach you \"how\" to draw. Professor Riley goes step by step, starting with basic outline drawing to more complicated figure drawing. It's a building process. There isn't that much room, however, for abstract drawing. The course focuses heavily on technique. So, you will learn how to draw, but you may not have as much freedom in what you draw for your assignments. Still, it was a lot of fun and I recommend it to everyone who has an interest.\"",
            "review 30: \"01F with Enrico Riley: This is an awesome class that everyone should take. It is a lot of work, but drawing doesn't really entail thinking. Riley is a new prof i think and he didnt give as much hmwk as the other teachers. He's pretty good and the class is easy, if you are good at art and/or if you put a lot fo time into it. the best part about the class is that there is no reading or essay writing involved.\""
        ],
        "Colleen Randall": [
            "review 1: \"18S with Colleen Randall: It was my first art class at Dartmouth and she completely destroyed my passion for art. She assigned so much work and was very subjective.\"",
            "review 2: \"07S with Colleen Randall: The hardest thing was just getting the concepts. The prof making abstract statements like \"Draw the light\" can be really frustrating until you get it. It kind of clicks at some point in the term. But it's really not as bad as people say. The night or two before a big project is due, yes, you'll be in the studio kind of late, but as long as you keep up with the drawings it's really not much time at all. Be willing to experiment and do lots of erasing!\"",
            "review 3: \"06F with Colleen Randall: i spent so much more time doing my art homework than any other class and the assignments were long and irrelevant. i dont think it helped me become a better artist.\"",
            "review 4: \"05F with Colleen Randall: at first there were a lot of assignments that weren't particularly interesting, but the second half of the class was more open ended so they were as interesting as you made them. If you take this class try not to leave all the work until the night before becuase it sucks pretty hard.\"",
            "review 5: \"05F with Colleen Randall: In the beginning, you feel that other drawing classes are doing so much more than you, and better stuff. At the end of this class however, I think I really understood her PROCESS, which was to help US find our own styles. And I did. It was fun exploring.I feel though, that she is a better professor for those who already have a strong sense of art and artistic technique. For those who have to struggle harder to \"get\" it, there is less imporvemnt.\"",
            "review 6: \"05F with Colleen Randall: This course is an amazingly enjoyable time sink. It's absolutely wonderful to have a reason to spend hours and hours drawing, but DO NOT take it with other time intensive courses. It becomes much more stressful than it ought to be. I made the mistake of taking it with THE most time intensive Lab Bio course this side of the FSP. Colleen is the dept chair, and I've definitely gotten the impression that she's much more strict than some of the other profs in the dept--and she is a horrible lecturer--but she's really good at pushing you to be better. You can tell when she's displeased with what you've done pretty easily.\"",
            "review 7: \"04F with Colleen Randall: I had more homework in this class per week than I did in my math and english class combined. Spending a month doing figure drawings wasn't exactly the greatest....but I learned a lot and my drawings really improved throughout the term. If you really want to learn how to draw well and have the time to put into this class I'd go for it...but I'm pretty sure that the other drawing profs don't assign as much work.\"",
            "review 8: \"04F with Colleen Randall: Lots of work, and you during the second half of the year you are expected to make amazing improvements, though basic techniques are often unexplained...taken as a prerequisite for photography, and glad it is over.\"",
            "review 9: \"04F with Colleen Randall: I've heard so many people bitch and moan about taking drawing one before they can take any other class in the department, but it really does develop critical thinking and your artistic eye. C'mon, you get to draw for homework.\"",
            "review 10: \"04F with Colleen Randall: Although she expects you to put in 10 hrs out of class a week, no one really does. People usually spend about 6 at most at the start, and even less when assignments change from five small drawing to 1 big drawing. It made me a better artist, but the prof isn't fully able to describe art work (whats good and bad about it) in a vocabularly that the non-artist can understand. she does have the artist mentatlity that people shouldn't restrict art, and, thus, students could bend the assignments to their preferences.\"",
            "review 11: \"04F with Colleen Randall: I am really glad that I've taken this course. It requires a lot time but also allow you do a different kind of work so you can get away from your typical course workload. Randall is a very generous grader and I recommend this course to anyone with interest in art/drawing even if you have no experience at all.\"",
            "review 12: \"04F with Colleen Randall: So, its Drawing 1. If you're going to take almost anything else in Studio Art, you have to take it. And the class has to teach you certain things. So, within these limitations, it was altogether not a bad course. Very work intensive. You have to be prepared to spending long hours working on your drawings in the second half of the class. But I, for one, felt like they were hours well spent. Professor Randall is great. She is very helpful in class and encourages questions. In short, I'm glad I took the class and Im glad I had Colleen as my Prof.\"",
            "review 13: \"04F with Colleen Randall: The class was interesting, but often Prof. Randall would tell you you needed to fix an aspect of your drawing, but not offer many ways of how to do that until you asked her. But when you asked her, she'd help you out. To do well in the course, you need to spend a lot of time outside of class on your drawings. Often I would do my drawing the night before, only put 4 hours into it, and then the next day when we hung all our drawings up in class for critiques, my drawing would look less-worked on than others. You need to have time during the week to really spend on the drawings, especially near the end of the term. Good course.\"",
            "review 14: \"04F with Colleen Randall: It was not a particularly bad course, but not too exciting, either. Working in art makes grading a whimsical-seeming process, and selling yourself, as opposed to your results, a necessity. Furthermore, working in black and white will force you to curse the limitations of a gray-scale color-scheme, but at the same time be glad you don't have to worry about all the other colors. In addition, your self confidence may not be helped much by this course, because while you may slave over works, they seem to have a tendancy to fall short of expectations.\"",
            "review 15: \"04F with Colleen Randall: I really loved this course, but it is not at all an easy class. The assignments take a huge amount of time and if you aren't taking this class for love of drawing or art it can get pretty frustrating. I really enjoyed Professor Randall and thought her assignments were creative and challenging.\"",
            "review 16: \"03F with Colleen Randall: But an interesting class to take, especially to get away from the typical course. If you have no drawing experience prior to the course it can be a bit intimidating since several of the students usually have had instruction. However, Colleen critiques individually and bases the grade on your own improvement.\"",
            "review 17: \"03F with Colleen Randall: Professor Randall is great..this course is hard but wonderful and absolutely worth it if you have the time to take it..make the time to take it...i had a wonderful class too so it was fun to come to class each time and I loved seeing other people's work...\"",
            "review 18: \"03F with Colleen Randall: she was mean and unfair, defiantely picked favorties which explains why some people have great reviews,\"",
            "review 19: \"03F with Colleen Randall: although i learned some things, i did not enjoy all of the work in this class and i think it is an unnecessary requirement for a student wishing to take ANY other art class. i also did not always appreciate the tone of the comments of the teacher--quite condescending at times.\"",
            "review 20: \"03F with Colleen Randall: yes it can be quite a lot of work. but it's a fun class to take, there's quite a lot of freedom with the homework assignments.\"",
            "review 21: \"03F with Colleen Randall: I loved this class, and Colleen took a very rational and structured approach to it. Although a bit uninspiring, at times, the encouragement I did get meant all the more to me.\"",
            "review 22: \"02S with Colleen Randall: The class was good, but definitely a lot of work. The assignments are definitely not small, and they require a lot of effort; sometimes more than you would expect. Prof. Randall was helpful if you ask for her help. If you don't say anything or ask her any questions, she won't say much to you. I don't think her comments were very helpful, but at least she was very open-minded. It's a good idea to have a bit of extra time in your schedule to be able to finish all of the assignments.\"",
            "review 23: \"02F with Colleen Randall: you ahve to put in a lto of tiem, but this is a great. class if you think you are at all interested in art, take this class asap, since its a pre req for all other studio art classes except for sculpture. and despite the complaints from photo kids, it really will help you if you want to take photo classes. you learna bout composition and the history of art in this class (colleen takes you to the hood museum to look at other drawings during a couple of the X hours) if you put in the time, you will do fine in the class. she really works with you to bring out your own strengths (we all have them believe it or not) so dont be afraid to take this class because you dont think you have enough art skills. YOU DO!!\"",
            "review 24: \"02F with Colleen Randall: If you're doubtful about whether or not art's for you, give it a try. It pleasantly surprised me.\"",
            "review 25: \"01F with Colleen Randall: Although it's true that this class will not make a master artist out of everyone, it really does teach you how to draw well. In this class, I learned a lot about how a work of art . . . well, works. This class will really open your eyes to a new understanding of art and of your visual perceptions of the world in general. Professor Randall really helped me improve as an artist. She seemed to consider the \"spatial\" considerations of a drawing to the exclusion of many other concerns, but I found that this approach helped me learn to understand art a lot better. PS. Don't avoid this class because you \"can't draw.\" Everyone can.\""
        ],
        "Pamela Thompson": [
            "review 1: \"18F with Pamela Thompson: She's so quirky and sweet, but she literally doesn't understand the fact that human beings can be sick. I had the flu for a week and was bed-ridden, but she specifically lowered my grade because I didn't come to class. She told me my art deserved an A, but because I missed two classes, she had to mark me down. Professor Thompson also assigns a ridiculous amount of work. She asked us to complete a 3 panel drawing between Tuesday and Thursday multiple times. Don't take this class with her.\"",
            "review 2: \"18F with Pamela Thompson: This class is absolutely NOT a layup. Not only did we have hours of homework every week, but Professor Thompson gave very little insight on how to improve drawing skills, leaving students to do their own research outside of class or spend more and more time in the art studio trying to improve their work. I cannot remember a single lecture on how to draw the human body or how to vary line texture, etc. While I took this class to fill the art distrib, I really wish I had taken another class. I enjoyed art and also enjoyed being in the art studio, but the amount of time I had to spend working on the art projects was incredibly stressful, and walking all the way to the BVAC every time I wanted to change just one thing was tedious and tiring.\"",
            "review 3: \"18F with Pamela Thompson: Don't believe your trip leaders when they tell you this class is a layup (shoutout I791). I spent more time in the art studio than in my own dorm room because Thompson assigns so much work. That being said, she is a great prof and really works to help you improve (regardless of whether you enter this class with previous art experience). Overall, I would recommend this class, but not if you already have a heavy work load or if you're just looking for a layup.\"",
            "review 4: \"18F with Pamela Thompson: Bruh whoever said this was a layup is lying to you. Pulled so many all nighters because of this class that the lou's challenge became a routine. I'm sick of Lou's now only take it if you really want to major in art.\"",
            "review 5: \"17F with Pamela Thompson: This class is a lot of work, many many hours, though it is not very straining. Professor Thompson is very pleasant and likable, but I wished she had engaged us more in the process of artistry/expression. It felt like we were following very straight forward directions, without a sense of the concepts underpinning each assignment, etc.\"",
            "review 6: \"08X with Pamela Thompson: not an artist, and i felt comfortable. she does a good job giving appropriate criticisms for everybodys ability level. a lot of work, but it was much more fun than i expected.\"",
            "review 7: \"07S with Pamela Thompson: Professor Thompson didn't take the time to give any sort of lessons or demos, instead she just gave us a subject and told us to draw. While this worked for those in the class who had a lot of talent or had already taken classes, it was ineffective for the beginners. Professor Thompson was also a very subjective grader and did not grade at all based on effort. I suggest taking this class from a different professor if you are a beginner, or not confident in your drawing abilities.\"",
            "review 8: \"07S with Pamela Thompson: I hadn't done \"art\" since junior high. That wasn't a problem here. No experience/knowledge is necessary. You just draw. You will improve greatly simply based on how much time you spend drawing. The prof doesn't really teach techniques, but that isn't always a bad thing. Sometimes, she's a little flaky, so you don't have to follow the assignments exactly, just be confident in whatever you do. Also, she allows you to branch out from pencil/charcoal on a few assignments, which is very nice by the end of the term.\"",
            "review 9: \"07S with Pamela Thompson: This is a GREAT class. The prof is very nice and good at helping you really develop your drawing skills. I had never taken a drawing class before, but that hardly mattered. I would reccomend this class for anyone needing to get their art distib out of the way. but, be warned, this class can eat up a lot of time.\"",
            "review 10: \"07F with Pamela Thompson: I wouldn't recommend taking this course if it's only for an art distrib- it's a beginner course, but a majority of the students have had some previous art and are planning on taking more art. It's a lot of time outside the class; this is not an easy third course. The grading is pretty fair (with Professor Thompson) but it's still a lot of time and patience that you may not have.\"",
            "review 11: \"07F with Pamela Thompson: The first day of class, Professor Thompson told us to expect to draw at least two hours a day outside of class. The time commitment wasn't quite this much, but there were some very long stretches spent in the drawing studios. Thompson has plenty to say, but doesn't explain drawing techniques well. Her lightheartedness, clear interest in the arts, and accommodating personality, however, definitely benefit her students.\"",
            "review 12: \"07F with Pamela Thompson: This was a really amazing class. I never before considered myself to be artistic or had any artistic leanings, but I'm now considering a studio art minor. Professor Thompson looked at all our work based on our won skills and worked to help each of us improve as best we could. She didn't compare students to each other, instead concentrating on individuals, which was really important, though slightly difficult considering how large our class was. I strongly recommend this course, even, maybe especially, to those who don't think that they have any artistic talent. You may surprise yourself by the end.\"",
            "review 13: \"07F with Pamela Thompson: This class can be as time consuming as you would like it to be. You can certainly get by without putting too much effort into your drawings but the more time you put into the class, the more rewarding it will be. Esme is a great person and can be a great teacher, however, students need to ask questions about their work in order for her to explain drawing techniques. Also, you get really dirty in class. My fingers were black from charcoal pretty much all term and it would take the days between classes for the charcoal to finally wear off only to get dirty in class again. Other then the dirty factor, I think this was a great class and would definitely recommend it to other students, especially if Esme is teaching it.\"",
            "review 14: \"07F with Pamela Thompson: This class will take an incredible amount of your time. Each assignment regardless of skill level takes at least three hours to complete. The course does however help improve every students drawing ability dramaticaly. The assignments were rather boring in the begininning, but became really involving as the class went on. The emphasis on drawing portraits was fantastic as it was easy to learn to draw faces well even with having previously zero proficiency. I would recommend this class to everyone that has the time to take it, as the professor passionatly and proficiently improves the skills of all students.\"",
            "review 15: \"07F with Pamela Thompson: One of the best art teachers I've ever had- made it easy to enjoy the class for every level of student, absolutely inspiring and really supportive of everyone's creativity. Thompson really made the class, I had friends in other sections who hated it because of their profs. Work-wise the homework assignments are really time-consuming and I ended up spending anywhere from 2-5 hours in the studio for each one. My only complaint would be that the assignments for Tues classes and those for Thurs classes required the same amount of time, despite having more time for the Tues homework (Thursday night/Fri/Sat/Sun/Mon) as the Thursday homework (Tues night/Wed) since it was a 10A class. I do have to say that the time spent in the studio goes much faster than one would expect, its not like spending 2-5 hours studying history or something. The assignments were really interesting and fun, even for someone who has taken a lot of art before. Highly recommend it.\"",
            "review 16: \"05F with Pamela Thompson: Professor Thompson is really nice and she grades based on improvement so I'd recommend this class to anyone who has an interest in drawing even if you think you're horrible or have never taken an art class before like me. But like I said, it's time consuming.\"",
            "review 17: \"04S with Pamela Thompson: ...so much so, my hands were grimy *all term*. It would take the days between classes to finally wear off, only to be replaced again. Anyways, the class itself was fine. I find the act of drawing soothing, but I wish I could have learned something more practical about style during this course. As a n00b, I had no idea about technique, and it never really was elaborated upon. The weeks of doing the same still-lifes repeatedly became somewhat grating. The homework was something that needed to be done regularly, or one risked falling behind and being buried under it. I still had a good time, but I don't feel that I grew at all as an artist (even just as a green one).\"",
            "review 18: \"04S with Pamela Thompson: Professor Thompson has a true passion for art and as a result she not only is able to see beauty in every work that a student produces, but she also has high expectations. The hours that students put into the assignments are well worth the effort, though. Your skill at drawing is dramatically improved by the end of the term if you actually take the time to practice your art. The course was only this good because Professor Thompson imbued it with her enthusiasm and extensive background knowledge of art. Note: This course should not be taken unless your other courses leave you enough time to really focus on your drawings.\"",
            "review 19: \"02X with Pamela Thompson: Lots of work but an excellent course to take during the summer. The prof is very responsive and encouraging. No matter what your skill level, she is positive and wants you to do well. But, be prepared to put in the hours in the studio! Toughest part of every week is the Tue.-Thurs. assignments.\"",
            "review 20: \"02X with Pamela Thompson: Take this class even if you think you can't draw - I did and it was a great experience. Prof. Thompson is a great teacher - you'll learn new ways to look at your world! Don't let your insecurities prevent you from trying this.\"",
            "review 21: \"02S with Pamela Thompson: Thompson will make you work really hard. Expect to have an unreasonable amount of homework. For our class we were really gung-ho about the class during the 1st half of the class, but enthusiasm waned as the mountains of drawing homework continued to pile on. Consequently, you'll learn alot about drawing and you may be doing more work than the other drawing 1 classes, but you will also be improving the most. There were some late nights pulled in the hop drawing and finishing up homework. it was a bonding experience for the class i think.\""
        ],
        "Susan Walp": [
            "review 1: \"09W with Susan Walp: The class requites a commitment to outside of class work. Students must be extremely patient and learn to manage their time so they finish all of their projects on time.\"",
            "review 2: \"08W with Susan Walp: i thought this class would be more fun, more interesting, and more informative than it was. the class was a lot of drawing from observation and not much creative work. prof walp isn't very effective when explaining concepts. i felt like we were just jumping from one concept to the next with no big picture in mind. the only thing i did like was the comparatively light work load. she gives a lot less work than many of the other drawing 1 professors.\"",
            "review 3: \"08W with Susan Walp: Susan is awesome--very kind, and she always finds something positive or interesting to point out in people's work. Expect to spend a good deal of time in the studio, but if you relax and enjoy drawing, then it can be a great third class and stress relieving. Susan really loves the Renaissance masters, and is pretty classical in her approach although she does value creativity, but don't expect to produce anything extract in her class.\"",
            "review 4: \"05S with Susan Walp: this class definitely helped me improve my drawing skills. Prof Walp was very easy-going and encouraging.\"",
            "review 5: \"05S with Susan Walp: Professor Walp was tough, she was pretty critical at times and didn't give compliments too freely--but I think it was because she saw that we all had potential and didn't want us to get overly confident in our work. She really knows all about drawing, you can tell by the way she teaches that she understand all that goes behind drawing even something that seems quite simple! The course had weekly assignments, but they were reasonable and could always be done in time, especially because the class was in the afternoon. Also, even though it was homework, it didn't seem that bad because it was drawing, which is kind of relaxing, so it was something to almost look forward to! I had taken drawing classes in high school, and thought I knew just about everything about drawing, however Professor Walp still had some great techniques to teach that I had not thought of or heard before. Professor Walp was really nice and understanding, I felt comfortable going up and talking to her if I had a problem with something. I do think she might have had favorites though, but she did not make it too obvious. Overall, great class and great teacher--definitely recommend it to anyone!\"",
            "review 6: \"05S with Susan Walp: I had never taken an art class before, and was very apprehensive to take it, but I enjoyed doodling and thought it could break up reading a bit - I was very pleasantly surprised and thoroughly enjoyed the course. It was a lot of time outside of class - mandatory 8 hours a week and often needed more to complete the assignment well, but it didn't feel like work after many reading/writing intensive courses. Not a joke, so you need to be ready to put in the effort and take it seriously. Definately recommend it to anyone interested!! Professor Walp was great!\"",
            "review 7: \"05S with Susan Walp: Overall, this course was okay. My drawing abilities definitely improved over the term (I came in with 0 experience). Professor Walp is pretty good. One major criticism is that she didn't really teach us any techniques in the beginning - I didn't really have any idea how to use charcoal, I had to figure it out on my own. One other complaint: I came in not really able to draw at all, and I improved a fair amount. However, I'm only going to get a so-so grade, and as far as I can tell, the good grades seem to be reserved for the people who came into the class as really good artists; Walp doesn't really seem to take improvement that much into account when doing grades (a little aggravating, to say the least). P.S. Just a warning, but you're going to have to draw unattractive naked people, probably old, fat, unattractive naked people\"",
            "review 8: \"04F with Susan Walp: The class requires hours of out-of-class studio commitment. The professor is keen on students spending the minimum required hours on each assignments, which is usually between 2-4 hours. However, the professor is very understanding of her students (without being lenient) and is very willing to help.\"",
            "review 9: \"04F with Susan Walp: Takes a lot of time, but is more interesting and relaxing than and normal work\"",
            "review 10: \"04F with Susan Walp: The rather ineffective teaching style of Prof. Walp added to the complete incompetence of the Studio Art Department on nearly all matters put a damper on what should have been a very interesting and useful class. Most work is so individual that it is possible to learn on your own. Prof. Walp is much better if you have some drawing experience already, don't expect her to give you much guidance that would be helpful to a beginner.\"",
            "review 11: \"04F with Susan Walp: Prof. Walp was great. I've heard so many stories about terribly strict Studio Art profs, so I'm glad I took drawing I with her. She really cared about her students, and tried to teach us as much as she could in the short 10-weeks we had. It was a conventional drawing class overall, and I don't think I learned as much as I wanted to. I didn't progress as much as the other students. She's an easy grader though...I recommend Walp's class to everyone.\"",
            "review 12: \"04F with Susan Walp: I had very little previous drawing instruction, but a general intrest in art. I didn't think the course was very difficult. there was the minor thing of attendence, if you missed more than two classes your grade dropped a letter. this was kind of tough when random afternoon lectures and critiques were scheduled. walp did provide alternatives to make up for missed classes.\"",
            "review 13: \"03F with Susan Walp: I never thought I could draw, but because I'm going into the field of product development, I needed to be able to draw what I was thinking. I came in with absolutely no experience drawing, but came out confident that I could draw anything with the proper amount of time and materials. Because of this class, I modified my major with studio art, and I'm taking architecture next term. EVERYONE should take this class. And don't be intimidated if you don't think you can draw. you're honestly not graded on your skill, but instead on the effort you put into the class.\"",
            "review 14: \"03F with Susan Walp: Excellent teacher. Did not teach it in a traditional manner - that would've probably been boring. Instead, she tried to relate the a state of mind, a feeling, a philosophy of art. She taught us technique and principles, yes, but she also taught us an appreciation of art and an ability to perceive. She has a very critical and pereceptive eye. She is amazing.\"",
            "review 15: \"03F with Susan Walp: Professor Susan Walp's Drawing I was a really fabulous course. Every week we had a different subject that taught a different skill. The course was clearly very carefully planned and the skills we acquired each week were useful in the next week's assignment. Although the first week was a bit boring (drawing cardboard boxes) the assignments got more interesting quickly (greek sculpture, drapery, still life, hands and feet, bones, each other's faces, nude models...). We learned to use several different media (pencil, several kinds of charcoal, pen and ink, eraser as a drawing tool). Watching my work and that of my classmates progress was amazing because we all improved remarkably. I had thought that drawing was largely a talent you either had at birth or didn't, but this class showed me that drawing can definitely be taught. This was really a rewarding class. I came away with several pieces worthy of inclusion in a portfolio and a few pieces worth framing. The one thing to watch out for is attendance -- if you are one second late you are screwed and Walp will crucify you. You can't miss any classes and you can't be late. Attendence is really important, she's crazy about it.\"",
            "review 16: \"03F with Susan Walp: Drawing 1 mixes up your schedule. It took time to do the assignments, but it was money not to have MORE reading or writing. I completely recommend this class, especially with Prof. Walp. Don't worry about experience, I had never drawn before, and it really is possible to learn. There will be people that are crazy good in your class, but you don't get graded compared to them, so don't worry about it. Take it, you can slack or you can work hard, you can see the world in a new way or just use it to try something new.\"",
            "review 17: \"03F with Susan Walp: Although this course involves quite a bit of work, I enjoyd Prof. Walp's teachings very much.\"",
            "review 18: \"03F with Susan Walp: It was my best drawing class ever! Prof. Walp strongly inspired me and the homework helped me really learn drawing. If people want to take an easy course, it wouldn't be the best subject since the work-load was pretty time-consuming. But I believe it was really productive and I would like to \"strongly\" recommend drawing 1 for everyone. (Beside, no paper, no exam worked out for me!)\"",
            "review 19: \"02S with Susan Walp: I really enjoyed this class. Prof. Walp really actually teaches you how to draw...I learned a lot, and feel much more confident about drawing just about anything. We worked from the model often in class, and our assignments outside of class progressed from simple line drawings to more difficult and involved ones. It does take significant time up outside of class, and if you don't enjoy drawing, this might not be for you. But I found my drawing homework was a nice break from everything else. I highly recommend this class and prof!\"",
            "review 20: \"02S with Susan Walp: This class was phenomenal. I definetly came into the class with low expectations because, well, it's an intro art class that everyone has to take whether they be into photography or sculpture or whatever. And I also heard some horror stories about intro art teachers. Well Professor Walp was simply great! She was funny and warm from the start. We all took a liking to her immediately. Although the work was challenging, her comments and suggestions helped immensely and if you listened, you realized that she was right on the ball. We spent a lot of time critiquing each other's work, which was great because it allowed us to take a step back. Professor Walp let us do most of the talking, which was really great. Overall, I loved this class. The assignments were always tough but not too much more than we could really handle...I liked how she walked us through the drawing process step by step so by the end we were all great artists. Bravo!\"",
            "review 21: \"01F with Susan Walp: Alot of people want to take an art class but say, \"oh, I don't really have the talent.\" In this class you can come in with any level of experience and get alot out of it. Everyone's work improved greatly over the course of the term. Be prepared to spend many hours of out of class time in the Hop.\""
        ],
        "Louise Hamlin": [
            "review 1: \"09F with Louise Hamlin: There are two weekly assignments for this class, one due Thursday and one due Tuesday. The mid-week assignment usually takes a few hours, while the weekend one can take upwards of 6-10 hours. This class really is what you put into it. Prof Hamlin is very responsive to all types of styles and art making, and she will push you to do something outside your comfort zone. The only real negative thing I can say is that the class time is mostly spent talking about the homework, not actual drawing. This does change by the end, but in the beginning you'll get tired quickly of standing around talking.\"",
            "review 2: \"08S with Louise Hamlin: There ended up being quite of a bit of homework for this course, but if you do it, you're guaranteed a fair review and Hamlin is very responsive to and appreciative of personal improvement- even if all the course has done is changed the way you feel about art! Definitely the best thing about the course was how much the students interacted outside the class- we really got to know one another and benefited from working on the homework assignments together. Take this course if you want to broaden your horizons, but NOT if you have a heavy course load!!\"",
            "review 3: \"07W with Louise Hamlin: Although the coursework did get repetitive after a while it was effective in teaching the necessary concepts. The assignments do take time, but they are definitely manageable and the HOP is open to art students 24/7 if you like to work at night.\"",
            "review 4: \"07W with Louise Hamlin: It's a good class if you are willing to experiment with something new. Definitely helps if you had drawing experience before, but most of the class had had no prior experience, and they still turned out some very quality pieces of work. Hamlin's method of teaching drawing changes the way you observe the world to make drawing possible for even the novice.\"",
            "review 5: \"06W with Louise Hamlin: Hamlin was a fun teacher. She has a lot of enthusiasm for art and describing art. Be warned! Lots of kids come into Drawing I with preset art skills. Hamlin spent way too much time with linear perspectives and trying to get the class away from using \"outlines.\" Art is a craft and everyone in the class seemed to have improved. This is a fun class and you'll end up with a good grade. BUT! Know that it TAKE A LOT OF WORK!!! Art may be a fluff class but you still have devote SO much time to it, because when your crappy 1.5 hr drawing is stuck on a wall next to stellar 6 hr masterpiece, for others to critque, you'll be sorry.\"",
            "review 6: \"06W with Louise Hamlin: Really interesting and fun course. It moves really fast, but that's part of what makes it so interesting. Professor Hamlin is very helpful as well.\"",
            "review 7: \"05W with Louise Hamlin: You may think that you can take drawing for an easy A, but you're wrong. This class is a lot of work. I spent more time on art projects for this class than I did on assignments for my other classes. Even though I had previous drawing experience, it was a challenge. That said, I did thoroughly enjoy the class. It's nice to have art assignments as opposed to papers or pfojects for other classes. Even though I spent hours in the studio I enjoyed drawing, it stimulates a different part of your mind and helps you unwind. Just be prepared to spend a lot of time at the Hop after hours, but the class is definitely worth it, I enjoyed it very much.\"",
            "review 8: \"05W with Louise Hamlin: Drawing 1 is a time consuming course, but completely worth every second. The effort you put into your drawings is not the same kind of work as other courses, so time in the studio is not a burden. Louise was great. She not only inspired me to think about majoring, but also gave the correct amount of instruction and freedom for everyone in the class to expand their abilities and express their own styles. We began the course in pencil, drawing simple still lives, and then moved to charcoal. The last third of the term we could chose which materials to use and had models during class--which I thought was amazing for a beginning drawing class. Louise has a great sense of what is helpful for students and when. Take this course with her if possible!\"",
            "review 9: \"05W with Louise Hamlin: The first homework assignment was not my favorite... But this class is quite good. It requires some time, about 5 hours before each tuesday/thursday class... but the work is fun (if you enjoy drawing), and the class is enjoyable as well. The environment is very chill, and you get to explore a lot of different subjects and styles. I highly recommend.\"",
            "review 10: \"05W with Louise Hamlin: First, my enthusiasm for this course stems from my enthusiasm with art in general, and from the fact that Prof. Hamlin gave us the freedom in the assignments to explore and challenge ourselves. The class as a whole was a good learning experience, and I was excited to be able to improve my skills in drawing. Prof. Hamlin, while often talkative and sometimes hard to reach, gave a lot of productive insight into our artwork. Another aspect of the course I appreciated was the personal attention received throughout the course. Prof. Hamlin devoted a lot of time to preparing our classroom and homework assignments, and she also gave a lot of her time to out-of-class discussions of work. I'm very happy with the course, and am excited to take more studio art classes.\"",
            "review 11: \"05W with Louise Hamlin: The main benefit of this course is just that you're drawing with 15 other students, and Professor Hamlin made this all the better by having all of us tack up each assignment on the wall on the day it was due. I know I greatly improved in drawing through the course. The atmosphere was friendly and relaxed. If you plan to take Drawing I, you should be prepared to spend quite a bit of time on each assignment, but those are hours well-spent.\"",
            "review 12: \"05S with Louise Hamlin: Louise really helps students explore their own styles of art and also exposes them to other ways of drawing. She teaches students about art in general as well as about the specifics of drawing. The assignments start off simple and gain in complexity as your skill and comfort increase.\"",
            "review 13: \"05S with Louise Hamlin: This class is a very good class if you want to learn to draw but it is A LOT of work. I came into the class knowing it would be a lot of work but the amount of time some of the assignments took was excessive.\"",
            "review 14: \"05S with Louise Hamlin: This course was challenging and very time-consuming, but your drawing will really improve. Hamlin is very enthusiastic and willing to help out with anything. I definitely recommend her as a drawing prof. The assignments have a lot of variety but they are not too weird or abstract all the time.\"",
            "review 15: \"04W with Louise Hamlin: Drawing turned out to be a lot of fun, even for a girl who is artistically challanged. Hamlin is a good professor, even if she is a little spacey. Very dedicated, and willing to give you personal help and attention with your work. Grade very much depends on personal growth and the amount of time you put into it. A little bit frustrating though when prof. spent a lot of time looking at work of the 2 students who actually knew what they were doing. Work intensive if you want a good grade - be prepared to live in the Hop. Overall recommended.\"",
            "review 16: \"04S with Louise Hamlin: It was a good class, but you're going to have to spend tons of time doing drawings in order to get good and/or receive a good grade. If you do everything she tells you, you're going to do both. That also requires anywhere from 10-20 hours a week of work. You'll probably get what you put into this class.\"",
            "review 17: \"03S with Louise Hamlin: Hamlin didnt teach any of the basic skills involved in drawing. We only went over fundamentals like linear perspective in one class. Otherwise you are supposed to know everything from the get go. She says she wont grade you on your ability just effort but she definitely doesnt follow that. She also plays favorites so if you're in her calss get on her good side. She assigns a lot of homework and doesnt give you much time to finish your pieces. Be prepared to spend a lot of time in the drawing studio and if you're there when the janitors come in stay out of their way, they probably work the night shift because they have no social skills and hate dartmouth students. Hamlin was pretty nice about grades in the end and is open to ideas of course assignments toward the end of the term.\"",
            "review 18: \"02W with Louise Hamlin: Drawing I was even more work than advertised in the ORC, especially as the term progressed and assignments became more difficult. I found myself spending 12-15 hours outside of class on homework assignments as opposed to 8-10. The class is well worth it, though; I feel my drawing skills greatly improved from being in the class.\"",
            "review 19: \"02W with Louise Hamlin: I took art classes in high school, but none were as comprehensive and challenging as this class. Students with all levels of ability took the class, and Professor Hamlin encouraged and criticized all equally. Her criticisms were never mean spirited or harsh. I've had considerable experience with studio art before this class, and she pushed me in directions I had never considered, even when I was reluctant about the assignments. Some of the homeworks were boring, but the effort I put in made them worthwhile. Students should be pre-warned --- when the professor suggests 10 hours a week of out-of-class time are necessary, it is not an understatement. I spent at least that amount each week, up to 12 hours on one assignment. But it is possible to fit it in with your other classes. I don't think I will major in studio art, but this class definitely put the idea in my mind. I really enjoyed this class, and highly recommend it to majors and non-majors alike.\""
        ],
        "Benjamin F.": [
            "review 1: \"08W with Benjamin F.: this class was awesome. a lot of people say that drawing 1 is a lot of work. it is work, but no more than i would have expected and to be honest if you manage your time, it isnt that bad. it is a nice break from all your other studying and test taking. hte course is a consistent course. you ahve 5 drawings due every tuesday. no tricks. class is just drawing. the first day IS BORING!! DONT DROP IT AFTER THE FIRST DAY! Moss is a great prof, and lets the students be as creative as they want. he leaves options open, get creative, he likes it. this class is also awesome to take during finals because you have a final crit, which you look at your portfolio and its before finals start so it takes a load off ur finals\"",
            "review 2: \"08W with Benjamin F.: I LOVE Ben - as did most of my fellow classmates - but some personalities could definitely not understand or enjoy his pedagogy. Go to the first class and see if you can survive his lecture, and that'll tell you if you'll enjoy Ben as a professor. The weekly assignments were not time-consuming, and the perfect way to ease the non-drawers, such as myself, into a natural, un-self-conscious form. One of my favorite classes at Dartmouth. Proved completely unintimidating and rewarding for someone nervous to jump into studio art.\"",
            "review 3: \"08W with Benjamin F.: moss is a very unique prof. he rambles on about useless personal stories in the beginning and ends of class, and chooses very odd subjects to draw. we were the only section who didn't get to figure drawing with nude models and moss didn't care for portraits, still lifes, or other normal subjects in a basic drawing class. instead, we drew matchsticks, string, and other random objects. although this could sometimes be interesting, it was often boring and uninspiring. overall though, he is a nice guy and the amount of drawing we did helped me improve a lot 5 drawings per week for the entire term\"",
            "review 4: \"06W with Benjamin F.: I'm not going to lie - I didn't know how much I was going to like the class for the first couple of weeks - The first two lectures are basically a summary of P. Moss's life, and the first assignment (for us) was to draw hangers. I'd never taken an art course before and I did not know what to do... and then, somehow, during the third week or so, something happened. I know it's vague, but his hands off approach to art actually works. trust me. it was kind of an awesome time, and i really learned about myself as an artist\"",
            "review 5: \"06W with Benjamin F.: Although we didn't touch on figure drawing or portraits for some reason the class worked really well with all the random objects we had to draw each week. You learn a lot just by looking at the art he posts on the wall each day of your fellow classmates and by his few comments. Just doing a lot of drawing was fantastic and Ben Moss is awesome in appreciating the effort and work you put in..and encouraging you. It is just a great class to take.\"",
            "review 6: \"06F with Benjamin F.: P. Moss doesn't give lectures. During class he walks around and talks to students individually about their work. However, he doesn't meet with all students equally, and there was a three week span when he didn't say a word to me.\"",
            "review 7: \"06F with Benjamin F.: Moss is a great Prof. he has a really annoying voice but once you get over that he is wonderful . The class was a lot of work outside of class, but i always looked forward to going and just drawing and chilling out. It was never a hassle to attend. Moss is cool, take his class, the work was fair and doable, it hink other prfs assign more than he does.\"",
            "review 8: \"05W with Benjamin F.: Prof. Moss can talk... about nothing... a lot of nothing, but he's a cool dude and cares.\"",
            "review 9: \"04S with Benjamin F.: prof moss is an interesting person..he starts off the term with a story of how he got into fine arts as a sophomore in college..etc. it's really not too interesting..but it gave me some confidence that maybe it's not too late for me too, he doesn't really \"teach\" you how to draw..he lets you do your own thing and loves original stuff..new techniques etc.. the subjects that he proposes aren't the usual conventional still life models..we drew hangars, paper clips, scissors, feathers, shoes, maps, brushes, flowers, animals, and finally fruit. moss is particularly really into abstract art..which i personally had a hard time with, but he is very encouraging, and once he notices you he tries to give you pointers..as for grades, studio art is really subjective so it's all up to him..fairly difficult to get an A..though.\"",
            "review 10: \"04F with Benjamin F.: Amazing content, zero opportunity for student input. The professor was never accessible outside of class and be careful of being held to expectations you were not aware of for the final critiques.\"",
            "review 11: \"04F with Benjamin F.: This was the best art class that I have ever taken and I would recommend it to anyone, either just starting out or experienced. Ben lets you do what you want with the subject that he gives you, the more interesting and different you approach the subject the better he likes it. He gives you boring subjects in order to get you thinking differently and see how you can make the subject interesting. He lets you find your own style throughout the course and gives you the freedom to do pretty much what you want with the subject. Ben seems like a difficult professor at first but is very personable when you talk to him. There isn't too much work, 5 drawings outside of class, but you get the week to do them. I loved this class and recommend Ben to anyone who is thinking of this drawing course.\"",
            "review 12: \"04F with Benjamin F.: drawing - no intelligence required. spend less than an hour a week just sketching a flower or scribbling a hanger, and you'll pull off a great grade. easy and stress-free and moss is super nice. really a genuinely kind guy. easy way to round out your schedule and takes almost no time at all to do homework etc. just go to class, get your hands dirty with characoal and you'll pass with flying colors.\"",
            "review 13: \"04F with Benjamin F.: Ben Moss is a very responsive professor who always has something good to say about your drawings. He can be funny at times, but he can also be impatient at times. Sometimes it seems like he thinks the students are just trying to get through the course by doing as little as possible and slacking off, when in reality the students are for the most part pretty enthusiastic about their work. About the course with Moss in general, it's probably the easiest of the drawing 1 courses. He won't teach you skills and techniques like realistic shading and how to draw a body, but he'll let you teach yourself if you want. He gives an assignment of 5 drawings per week on an easy subject, and it's up to us to make it interesting. There is a lot of freedom to learn what you want. You will get out of this course what you put in. Moss likes abstract art, which I didn't like at first, but I liked it more as the class went on. Although he won't teach techniques, he is very articulate when evaluating and criticising work, and his comments are very helpful. I really enjoyed this course\"",
            "review 14: \"04F with Benjamin F.: I LOVED drawing 1 with moss!! when i took drawing this term, there were 3 classes open with 3 diff teachers.... i picked moss based on his reviews, and i am SO glad that i did. I thought he was an absolutley amazing teacher. His teaching style is not overly involved--but for an art class, i think that is REALLY good. he really steps back and lets his students take off in their own, natural direction--and he allows for a lot of different styles to be successful. he doesnt give lectures on perspective, and we dont do nude models--instead, at the beginning of each class he hands out a \"problem\" that we are to draw for the period (matches, leaves, etc). its really quite fascinating, bc as he says, the problem that is handed out really just becomes a vehicle for the drawing itself--the work ceases to be about the object (ie, if everyone were drawing the same still life for perspective, the drawing would be about accuracy). during class, he walks around and sticks drawings up on the wall that he wants to highlight; at the end of class, he gives a commentary on them, pointing out what he likes. i think we all learned a lot just by being able to see each OTHERS work--and by the end, it was so apparent how much we had all learned. i remember reading the reviews for him and some people saying that he goes over class--he does, by about 10 minutes. but by the same token, he didnt give anyone a problem who had to go--youd just pack up and leave. i feel like he might come across as somewhat cold to some people, but if you make the slightest attempt at all to talk to him your efforts are completely reciprocated. plus, he lets us listen to music in class. at the end of his drawing course, i feeel like i have a confidence in my ability--in a large part due to the free structute of the class. and i am not an art major--i am doing econ. soooo id reccomend drawing 1 WITH MOSS to anyone. and on the most basic level, there is no midterm, and a final critique which goes 45 minutes--i wasnt complaining. homework is 5 drawings, due every tuesday--not a huge time commitment (unlike other drawing 1 classes). take it!!! : )\"",
            "review 15: \"04F with Benjamin F.: Professor Moss was uncompromising about several issues and demanded a total devotion to the work done in class - which I KNOW grated on more than one student's nerves. For instance, Professor Moss does not allow any talking at ALL between students during classes. For a two-hour session of nothing but drawing, I found myself very, very bored. The course itself is presented, both in the ORC and by the Professor at the start of the year, as a very informal, introductory course for people INTERESTED in Studio Art. The Professor repeatedly talked about how getting an 'A' in this subject is not important nor hard, as the grade is awarded on the Professor's assessment of improvement and creativity. Given this sort of statement, I thought I did well enough. I attended all classes, as well as regularly complete the homework. But I was given a B at the end of the course - which isn't too low, but I was disappointed. As a student who is not a Stuio Art Major and cares about my GPA, if I knew I'd get a B, I probably would not have taken this subject. This strongly discourages others to 'try out' this subject, for fear or lowering their GPA. Besides this, I am happy with what I have done in this course and the skills I learnt. Nevertheless, I was left with the feeling that I had achieved all of this myself, and wasn't really helped by the professor much.\"",
            "review 16: \"02W with Benjamin F.: If you want to take Drawing I, you probably want to take it with Ben Moss. First, there are tons and tons of rumors about how Drawing I consumes your life, but if you play your cards right, this doesn't happen with Ben. He definitely appreciates an extra investment of time, but due to the subjects he chooses for you to draw, you DO NOT need to sell your soul to this course. Ben is EXTREMELY supportive and takes a special interest in his students. He makes you want to improve and to succeed. His teaching style is different from the other prof's, but I think this is beneficial. We didn't draw for the two first class periods, every period after that was devoted to drawing and critiquing only, there was no final project but there was a final crit, and subjects were very simple: feather, brush, string, noodles, paper bag, plastic silverwear, vegetable, clothing, etc. Other profs start their students on full still life setups the first day, and give lectures on \"how to\" every period. Ben lets you discover \"how to\" and through picking somewhat boring subjects, he forces you to experiment with the medium. (His idea is that if he picks a boring subject, you will indeed by bored by a traditional rendering and you will get a little crazy, experiment a bit more. He considers subjects \"just an excuse to make you draw.\") Take this course, regardless of the major!\"",
            "review 17: \"02F with Benjamin F.: Prof. Moss is a really nice guy but he speaks very softly most of the time. That is not really a very big problem though because when he speaks to you it is usually one to one. I expected this class to teach me basic drawing skills, but it doesn't really. He kind of just lets you go and there is no formal teaching. That is okay though because you sort of pick it up from the other students who do have experience. If you want to know the rules of drawing, this class isn't for you, but if you want to just have some motivation to draw something and finish it, then take it. That is the best thing I got out of it: I learned to just draw, to just sit down and draw it because you have to turn in something. If you have no experience whatsoever it will be intimidating at first, very intimidating and kind of scary, but stick with it if you have always wanted to be able to draw, you might surpise yourself. and from what I hear the other profs aren't much better, so if you get Prof. Moss consider yourself very lucky.\"",
            "review 18: \"02F with Benjamin F.: all the drawing 1 courses do different things. what was great about this course that although i hadn't drawn before, i never felt bad or intimidated. we were allowed to go anywhere with the topic. Moose appreciates the explorations. he always has something interesting to say about your drawings, he's very humorous, encouraging, and fun to work with. he doesn't give lectures, he lets you draw by yourself, but his critique on the work is very useful and if you ask him, he's always willing to teach you how to do specific things.\""
        ],
        "Karolina Kawiaka": [
            "review 1: \"22S with Karolina Kawiaka: This class is great and I loved it, but Prof Kawiaka is not the best. She assigns a huge amount of work, which is good if you have the time because you will indeed learn how to draw different things very well. However, she can be a bit mean sometimes and grading is not very clear. It seems like she picks the students she likes the most and doesn't give much attention to other students. I believe I was one of the students she gave more attention, but it was very difficult to see a pattern to her grading to all students in general. I did improve a lot in drawing, but I wouldn't take a class with Prof Kawiaka again.\"",
            "review 2: \"21S with Karolina Kawiaka: DO NOT take this class with Prof Kawiaka, this class is NOT a layup if you take it with her, or at least don't take it if you aren't already a skilled artist. Taking this class as a beginner was a huge mistake because she doesn't grade on improvement, she grades by comparing the quality of your work to other students' work, and all of the other students had been drawing for years. She has unrealistic expectations for students in an introductory course and will penalize you for not doing extra work outside of the already unreasonably time-consuming assignments, though she won't ever mention that. She's also awful at responding to emails and will hold any missed classes or lateness against you for the rest of the term regardless of your reasoning.\"",
            "review 3: \"21S with Karolina Kawiaka: A great class for people of all skill levels. Professor Kawiaka makes it challenging for artists just starting out and artists who have been drawing for a long time. The class is entirely based on effort, but I really want to emphasize that effort directly translates into quality of the work. While working remotely, we had to do 7 drawings a week, and she expected about 2 hours per drawing. Later in the term, she was saying that we had do significantly less work than was usually required for the course. She's pretty blunt when it comes to critiques as well, but she just has a pretty good idea of how good of an artist you are and where you have to improve the most. I would recommend this course if you genuinely want to learn how to draw and have the time.\"",
            "review 4: \"09F with Karolina Kawiaka: I really enjoyed this class. All of the work was drawing, which was fun and allows you to get a break from written work and use a different part of your brain. I've taken many art classes before (but many in my class had not) and this was the best I've ever taken. I really liked Prof. Kawiaka's approach to teaching and she inspired me to challenge myself to become a better artist and explore different techniques. Although we only drew with charcoal all term it never got boring. I would highly recommend this class.\"",
            "review 5: \"08S with Karolina Kawiaka: I had a lot of fun in this class and drawing was a nice break from reading-intensive classes. However, with 7 drawings a week for homework, I spent a lot of time spring term in the studio. Kawiaka is great and grades based on improvement and effort so as long as you put in the time, you should do well in the class.\"",
            "review 6: \"08S with Karolina Kawiaka: Lots of work but I learned a lot and improved a lot. Sometimes the quantity of drawings was very frustrating but in the end I'm glad I took it. The prof was really good but expected a lot.\"",
            "review 7: \"07S with Karolina Kawiaka: The class requires a lot of drawing, but you are largely free to draw what you want, and professor Kawiaka is amazing to work with and very inspirational. TAKE THIS CLASS WITH THIS PROF! she is WAY better than the other drawing profs.\"",
            "review 8: \"07S with Karolina Kawiaka: don't listen to the reviews saying kawiaka is too difficult!!!! she does assign a lot of work, true, but she is incredibly enthusiastic about the class and her energy was great! she is such a nice funny woman and is very understanding when presented with excuses. so take the class!! kids who sucked at drawing came out amazing artists, no joke. if you're at all interested in the subject, kawiaka is the best.\"",
            "review 9: \"06S with Karolina Kawiaka: kawiaka is out of control...we were doing 4 drawings on the weekends and 2 during hte week, in addition to hte 4/week we'd doi n class. i spent more time drawing that term than breathing...but kawiaka is really nice/enthusiastic/understanding, and you leave that calss with like an 85 drawing portfolio. so unless you want to major in studio art/learn a ton about drawing/draw A LOT, don't take this course with her. take it with a different prof, it will be really different\"",
            "review 10: \"06S with Karolina Kawiaka: Kawiaka is a little crazy. She is overly enthusiastic, which is good to keep the students engaged and excited. The amount of drawings and quality she demaded were way too high. If you wanted to turn in quality drawing, you wouldn't sleep all term. She often sounded really positive in her drawing assesments, then gave you a sub par grade. Kawiaka did an awsome job in improving your skills and her lectures/homework assignments were really good. I just don't quite understand why she thought my drawings were, \"Wow, that is incredible\" and i ended up with a B in the class when the median was an A\""
        ],
        "Deborah Kahn": [
            "review 1: \"06X with Deborah Kahn: She is interesting, but as a professor, doesn't really explain anything and goes back on what she previous said. It's a little disconcerting to not know how you're doing in the class or what you should be doing. That said, it was still a good class because of the interesting assignments we had.\"",
            "review 2: \"06X with Deborah Kahn: advice? learn to love your charcoal Enjoyable drawing class that I didn't find terribly demanding. Take your time with your assignments and invest some effort in creating them and it'll show. Course, you could probably learn just as well by taking out a couple books on the subject from the library and practicing - it's the act of drawing that counts here..\"",
            "review 3: \"04X with Deborah Kahn: Very easy and relaxing for sophomore summer!\"",
            "review 4: \"04X with Deborah Kahn: If you are going to take Drawing I, you have to take it with Kahn. Funny, informative, intersting and a great prof. Makes drawing fun. Only word of advice: don't get on her bad side. Show up to class always, and do your homework and youll get a good grade no matter how bad of an artist you are.\"",
            "review 5: \"04X with Deborah Kahn: Deborah Kahn is not a suitable teacher. She is unable to teach any technique, and she paints giant blobs for a living.\"",
            "review 6: \"04X with Deborah Kahn: The term I this course might not be the typical case of drawing one. Taking this course my sophomore summer, I had Prof. Kahn, who had injured her leg right before the class started. Therefore the class was much more unorganized than usual. Kahn believed in no grading of the hw adn class assignments. Personally I think she was just too lazy to grade the works. Second she held no office hours so you had really no idea how you were going to do in the class until you get your grade. Her lectures were really arbitrary and poorly worded, leaving the class often confused of her intentions. However, her assignments did not take too long, probably b/c she didn't want to come in out of class to grade the hw and graded them all in class. the only bad thing is that you will probably get an A- no matter how much effort you put into the class (as long as you show up and hand in your hw). so don't strive too hard for the A since you will probably won't get it. Probably no one person in our class got a bad grade, except Hannah Chase who missed almost every class and blatantly attempted to kiss Kahn's butt on the few days near the end of the term that she decided to come. very funny actually. Plus Kahn plays favorites so it would be best if you were very eccentric. easy class for an A- if you want that.\"",
            "review 7: \"04X with Deborah Kahn: a great class for soph summer. kahn is great and the work load is really light. plus drawing is just fun. highly recommended!\"",
            "review 8: \"03X with Deborah Kahn: Kahn is awful. Let me give you an idea what kind of artist she is- she painted the same still life for fifteen years- the SAME UMBRELLA- and now she paints giant blobs with tiny paintbrushes. She doesn't put any effort into the class- she just shows up. It may be an easy course, but if you are a major- don't take it with her. She does not teach you the skills you need to know to go on. Take Riley- much better prof.\"",
            "review 9: \"03X with Deborah Kahn: I don't know about the other drawing1 profs, but Kahn is great because you really can be an absolute beginner and you would not feel inadequate or anything. I have no artistic capabilities whatsoever and the assignments can take up a lot of time but it was fun and was kind of fulfilling. I even feel a little more 'artsy' now.\""
        ],
        "John Lee": [
            "review 1: \"23W with John Lee: John Lee is a great guy. That being said, this is NOT a layup. If you aren't already familiar with drawing, prepare to spend a lot of time in the studio. Actually, even if you are good at drawing, you'll be pressured to spend time in the studio because others probably will. Sometimes it's a little bit frustrating because he gives minimal guidelines in the homework, so you won't know what he really wants. He made it clear at the end of the term that that was on purpose - he doesn't care how you interpret the guidelines so as to inspire more creativity and varied works. Take this class if you aren't taking other super hard classes\"",
            "review 2: \"23S with John Lee: This is my first Layup List review, motivated by my undying love for this class. Lots of hard work and long nights in BVAC! But if you invest the time, you'll be proud of your work & be excited to receive feedback. John is a fantastic educator with a wealth of knowlege. He leaves assignments quite vague and encourages you to think outside the box. Take this class!\"",
            "review 3: \"22W with John Lee: shit was fr vibes 💯, we were chillin and hangin out all day on god, my dude was mad chill and built us up like the young kings and queens we are\"",
            "review 4: \"22W with John Lee: I loved this class. It wasn't a \"layup\" time commitment wise, as John (which is what he prefers us to call him) assigned roughly 4 ideally 2 hour-minimum drawings every week, BUT this type of work feels very different from other homework in a fulfilling and refreshing way. I was concerned about stretching myself too thin with this course because I was taking a challenging language class, WRIT 5, and doing the musical alongside it, but if you like drawing and are willing to dedicate yourself to it YOU CAN DO IT. Stick it out, you will grow so much with the deadpan (and unexpectedly caring) John Lee!\"",
            "review 5: \"22W with John Lee: I absolutely loved this class and it convinced me to switch my major to art!! Contrary to what most people think, drawing is almost entirely based on hard work rather than talent, so if you're at all interested in drawing and are willing to put the effort towards improving take this class with John! Everyone in the class improved SO much from this class and the time it required. It's definitely a lot of work but it doesn't feel like work because it's so fun! It was such a nice break from the typical paper/project/exam grind typical of most other classes here. We spent all of class time drawing whatever wild sculpture John put up that day and had to finish the drawing we started + one other for the next class. John is a great professor, although he may not seem it at first, is actually extremely sweet and cares about his students so much. You also get close with the kids in your class which is fun :)\"",
            "review 6: \"22W with John Lee: Professor Lee is the best! Definitely a lot of work towards the beginning of the class but he decreased the workload towards the end and was very accommodating/understanding. Assignments are challenging but really allow you to grow. I took this as a distrib and am now considering becoming a studio art major!! You don't need to be really good at drawing to do well as long as you put in effort. I don't think the workload was unmanageable as long as you plan your week around it - I took this class with a bio foundations class and a part-time job and was totally fine!! TLDR don't be intimidated, take this class and become a much better artist!!!\""
        ],
        "John Wilson": [
            "review 1: \"23W with John Wilson: Professor Wilson definitely is nice and encouraging, but you can tell he is holding back and has strong opinions about art you make. Not necessarily a bad thing! He gives kind of jaded older guy vibes who likes to talk but also likes working with students. As someone who was a complete beginner I do wish there was more instruction and drawing in class. Drawings were assigned around themes (light/shadow, portrait, perspective, etc.) on due Tuesdays and Thursdays and first hour+ of class time was spent discussing other people's work. People were so nice and you lowkey grow to appreciate everyone's style, which was awesome. The second half of class time was usually a pretty boring slideshow of artists the prof loves centered around the next assignment's themes. The class was definitely front-loaded; when we started nude model drawing in-class ~week 6/7 we didn't have assignments which was a breath of fresh air. Overall, if you like having freedom of doing whatever you want and not necessarily learning all the technical details, you'll love this class. It's definitely more self-directed but you still improve over time due to moderate time investment. Great way to explore charcoal, pencil/graphite, and pen and ink materials.\"",
            "review 2: \"21W with John Wilson: Although it is pretty easy to get an A in this class if you work hard and improve, it is a time commitment. I took the class online, and the first half of class was spent going over the work of each student in the class, while the second half of the class detailed the new assignment. Because we were online, there wasn't a big emphasis on the sketch book.\"",
            "review 3: \"21W with John Wilson: I suck at drawing but that didn't matter to prof Wilson as long as you put in some effort. He doesn't grade based on how good of an artist you are, just your effort. We had easy assignments due next class which usually followed along the lines of copying a famous drawing (he gives you options to choose from) and then making your own. I only spent like an hour, two max doing the drawing assignments. He would mention checking our sketckbooks at some point in the term but he never did. He's a cool dude. Honestly though, you don't learn how to draw or go over any type of \"this is how you do...\". Only negative thing I have to say is that class can get boring: you spend half the class looking at/commenting on your classmates drawing (which can hurt a little when no one has any compliments, but the prof will always find something positive to say) and then the other half going over a powerpoint which would be photos of famous drawings. However, we did finish really early a lot of times and he'd let us go. It isn't a difficult class at all and as long as you can take 45 minutes to an hour out of your day and put effort into a drawing then you have nothing to worry about.\"",
            "review 4: \"21F with John Wilson: Try to get Prof. Wilson if you have a choice!! He was so nice and honestly cared about your effort on a piece and learning while making it over \"quality.\" The class content itself is pretty basic, with still life/charcoal/graphite/inkwash etc etc. Classes were about half crit of everybody's homework and half a presentation on the next assignment, we usually got out early. Prof always had something interesting to say about your work, which was nice. Workload was reasonable, we were usually assigned 1-2 pieces + a copy per class which could easily be knocked out in 2-3 hours.\"",
            "review 5: \"19S with John Wilson: Prof Wilson assigned an understandable amount of work that wasn't difficult to complete on time. Earning an A is super easy, just draw a TON in your sketchbook and do extra drawings outside of class for extra credit.\"",
            "review 6: \"19S with John Wilson: tbh idk why people say drawing I is a lot of hours bc honestly, just work quickly in class and work with half sheets if you can and you'll be fine. I had to go into the studio only 2 times the whole term and one of those 2 times was because I missed a class. I really liked this class and prof Wilson is great. Just make sure you have a lot of sketches in your sketchbook and you'll get an A. I also think he's a good prof so take it with him. Decent amount of work and the class is chill.\""
        ],
        "Daniel E.": [
            "review 1: \"08F with Daniel E.: I felt like this class was really good for those of us who went into it unable to draw and not so good for everyone else. I was no good at drawing before taking the class and I signed up for it so I could take photography courses in the future. Because I had no idea how to draw I was able to just do whatever. I could experiment with things and whether or not they came out perfectly didn't matter as much. Prof. Dalseth is clearly more interested in creativity than realism or accuracy which worked out well for me. Prof. Dalseth is pretty clear about what he likes and doesn't like, so if you don't take constructive criticism well, avoid this course. The point is this: If you're already a good artist you might want to either take this class with another professor or make sure you're totally open to changing the way you draw. If you don't know how to draw, then this course is for you.\"",
            "review 2: \"07F with Daniel E.: Throughout high school, I took a studio art course each year. I had a tough teacher then but I still did well, and I thought I was a good artist. But all of that was shattered when I took this course. Prof Dalseth is extremely critical and often very sarcastic towards his students in class, which I thought to be very unprofessional. He won't shy away from embarassing you in front of the entire class either. Although during critiques, he opens the discussion to the whole class, any time anyone says anything, he will either completely negate what you said or just plain cut you off and say that you're wrong. He gave readings about how to properly use art terms, but if you do not completely understand the terms, don't bother using them because he will call you out and embarass you. Also, he tells you to use the readings to help you develop your artistic skills and use what you learn in the readings in your work; but then when you do use them, he'll tell you not to because \"there is no formula that you can follow to create good art.\" Also, he gave crazy amounts of homework and crazy assignments in general (i.e. go out into the woods at night and do three drawings). He also wants you to spend LOTS of time on these assignments, so if you have a heavy class schedule, you might want to think twice before taking this class. If you're interested in learning how to draw better, do not take this class. He doesn't care if you can draw well or if you have some artistic skill, he is looking more for creativity, which may not be everyone's goal in taking this class. Yes, he is an accomplished artist and probably knows what he's talking about, but he is definitely not a great teacher and does not know how to communicate what he knows. He can be very mean, especially if he's in a bad mood, and he has very odd tendencies as well (he's a stereotypical modern \"artist\"). After taking this class, I will never take another Studio Art class again.\"",
            "review 3: \"07F with Daniel E.: He carried a notebook, but barely ever marked anything down in terms of homework, participation etc. The grades were all in his head. In terms of evaluation, the class was like a film cliche; he was hyper critical, almost bringing one student to tears, spouting off things like \"this belongs in the recycling bin\" in front of the entire class. He never once drew or taught anything himself, instead relying on photocopying from whatever arbitrary \"drawing\" books he found and having us read the compiled packets. I repeat: HE DREW ZERO TIMES DURING THE TERM. During class he played loud, distracting music that made it hard to focus on our drawing. He had us buy a book for the class and we never once used it or brought it in. He never graded anything. When a concerned student asked about their grade he said something like \"what does a grade matter? just focus on creating.\" The first and only grade we ever got was the final grade we received in the mail after the term had ended. This may sound severe or bordering on hyperbole, but he was the worst teacher I've ever had. No other teacher has been less qualified, committed, prepared, or competent.\"",
            "review 4: \"07F with Daniel E.: challenging interesting course; best if you really put the time and energy into the drawings; prof dalseth can be intimidating in class, but he's a great guy one-on-one\"",
            "review 5: \"07F with Daniel E.: Professor Dalseth is an interesting guy. He is a little different from most professors, but that is far from a negative comment. He's subtle but very funny. Don't worry about how good you are at art, if you spend time on your work it will show. Get something good to eat and some good music on your iPod and just chill and draw for HW. Even visit the studio after a night out and let the creative juices flow. He loved all my work that was a product of drunken drawing. Just don't tell him.\""
        ],
        "Chuck Holtzman": [
            "review 1: \"08S with Chuck Holtzman: Being in Professor Holtzman's class was like taking a stroll through Lewis Carroll's \"Alice in Wonderland\" novel, in a good way! His random, yet innovative assignments really force students out of their comfort zones and allow them to explore their artistic talents in a way that defies normal instruction. In many ways, this class served as a philosophy course. I must warn, though, that this is not a course for those who are not fond of abstract art, or open to complete exploration and self-discovery. If you are considering taking Drawing I as your art distributive, though, I strongly recommend that you take it with \"Chuck\" as he likes to be called!\"",
            "review 2: \"05S with Chuck Holtzman: Holtzman is great! Really makes you think outside-the-box. Not a class for people looking for technical drawing - you won't learn representational art. It's all abstract, but it's all fun, too!\"",
            "review 3: \"05S with Chuck Holtzman: This class was really interesting. We examined drawing techniques from an abstract point of view. Holtzman was awesome!\"",
            "review 4: \"05S with Chuck Holtzman: HE's a totally awesome prof who teaches you through a seemingly random, weird approach to non-representational drawing. But he totally blew my mind. take his class; you'll see!\""
        ],
        "Brenda Garand": [
            "review 1: \"08F with Brenda Garand: Don't take this class expecting it to be easy. I ended up putting the most time and effort into this class because art is never done. There is always something that can make it better, but it becomes time consuming. However, I enjoyed this class a lot. Everything was taught by example and by direct comments about your specific work. My drawing definitely improved a lot over the course.\"",
            "review 2: \"05F with Brenda Garand: Garand is a tough one...she started out easy going, then midterm she really began to crack the whip. I'm glad she did; her philosophy surrounding how to draw was an interesting one and allowed me to gain appreciation for the media that I worked with and the 2D form. She has no hesitations on calling you out on some aspect of a drawing she knows was due to lack of time or effort, and knows exactly what every student needs to improve upon in terms of basic skill and conceptual risk-taking. Take this class if you are good at being critical of your own work and don't mind others looking and critiquing what you do. If you put in the time, the amount that you know will surprise you at the end.\"",
            "review 3: \"05F with Brenda Garand: I liked this class I think it was a nice balance between relaxed and challenging. it was nice. i thought she organized the class well and I thought that her criticism was helpful most of the time. the only thing that I had a major problem with was the fact that she kept telling people to go slowly, draw slowly and I think that made me a worse artist because at the end of the day I am just naturally a faster artist and therefore, I am able to portray things on paper better when I draw at a faster pace. But other than that I thought she was very naturing to anyone who didn't really know how to draw. This class however, in spite of it's misleading \"drawing 1\" name, has absolutely no one who cannot draw, but it is fun!\""
        ],
        "Ruth Lauer": [
            "review 1: \"08W with Ruth Lauer: I got the impression that some people really loved this class. I enjoyed parts of it, but overall it was not what I expected. I thought drawing 1 meant: a bunch of people who have no idea how to draw, having fun and learning how to use drawing materials and the basics of shape, shading, line, space, whatever...and eventually, by the end, being able to produce a technically decent drawing. well, we did not do ANY of that. Professor Lauer did not help us with technique or materials use at all during the entire term. part of that I assume was out of respect for our freedom as artists, but personally I would have appreciated some direction, at least starting out. also she never made any mention of grades, so I still have no idea what kind of grade I'm going to get for this class. another thing...the other students in the class came into drawing 1 already being extremely talented artists. I was not expecting that. we always had to hang up the assignments we did for homework and I would be downright ashamed. also I felt like Prof. Lauer would look at my drawings and assume that since they were pretty bad, I must not have spent very much time on them, but I always did! her weekend assignments were rough...3 drawings in a weekend. it doesn't sound like much, but I definitely underestimated how much work a studio art class could be. then once we hung up our drawings the professor would talk to each of us about what we did. she had constructive criticism to offer, but it was more about the feeling of the drawing, not the technique or how you could improve. there was a point in the middle of the term when it felt like we were all trying to please her. and since the standards of \"good\" and \"bad\" are so arbitrary in art, this was very frustrating. in the end I found that I was able to draw much better than when I started out...but everything I learned was by trial and error, not from the class itself. so basically you're paying for a term of drawing 1, but all you're getting is drawing materials and the obligation to draw for ~15 hours/wk. but whatever, it's over, I got my ART distrib, I'm happy.\"",
            "review 2: \"08W with Ruth Lauer: Professor Lauer is pretty laid-back, but gives a ton of work. Still, if you do the work, you'll get a good grade. You'll learn a lot, just from the sheer amount of practice. Very encouraging class, but stressful.\"",
            "review 3: \"07S with Ruth Lauer: So responsive in class Great class discussions Such talent in fellow students Interesting assignments SO MUCH FUN!\""
        ],
        "Charles E.": [
            "review 1: \"08F with Charles E.: It was a pretty easy class... because it's not your typical Dartmouth art class - which is usually very time consuming and challenging. Spurrier is a visiting prof, so he's not an actual prof - meaning his teaching methods are somewhat suspect. He tells us to \"feel\" art and understand how to draw, but he tells us that technique doesn't matter. He never teaches technique. Absolutely no structure. I would be happy with my grade (considering how little work I did) but I don't think I was even given a chance to display my work with him one-on-one. I have no idea what he wanted. Your GPA won't really suffer, but the class doesn't teach you anything.\"",
            "review 2: \"08F with Charles E.: Not terrifically interesting. Don't look for any inspiration in this class - you are not going to find any. I had this class in the morning and as the semester progressed I felt no desire whatsoever to even show up to class - we weren't learning anything. I draw outside of class so I went in hoping to improve or at least learn some drawing techniques going into this class. And I have to say I'm disappointed at the end of the semester. Yeah sure it was fun to work with charcoal - but that's almost ALL you work with. We never used the set of pencils he asked us to buy, or even the ink very much in class... Before class he asks to see everyone's work so you have to do some work, but I don't think he has very high expectations for the qualities of the work [or can't... since I doubt he's allowed to grade based on the artistic talent of the student.] You do a LOT of still lifes pretty much until the last two or three weeks where nude models start coming into class sessions. If you are uncomfortable with those, you are allowed to ask for alternatives... but I would advise going to these sessions, as ppl are far more interesting to draw than apples, jars, etc. Pretty much it all depends on how much effort/time/interest you put into this class. This class has a far lighter workload than many of the other art classes. If you are looking for an easy drawing intro in order to get into higher classes, this is the one for you. I'm not sure how he grades exactly... He never explained that during the course, and all of us were too intimidated to ask. That's probably a good thing to ask first day in class.\"",
            "review 3: \"08F with Charles E.: At first I wasn't sure what to think of Spurrier as a professor at all. But he grew on me to the point where I'd really like to take his painting class next fall. Worth all the work... hey, at least you're not writing another essay...\""
        ],
        "Pahl Hluchan": [
            "review 1: \"04X with Pahl Hluchan: hlucan showed us some of his own work which was kind of bizzare, but as the term goes on, you come to appreciate where he is coming from. hes very enthusuastic about drawing and is eager to help if you come by outside of class. i hd a lot of fun doing drawing and i actually looked forward to class even though it wa a 10A it went by really quickly\"",
            "review 2: \"04X with Pahl Hluchan: This was a nice, relaxing way to knock out an art distrib. It was also a good change of pace from standard classes. I'm not the most talented artist, but grades were based on effort and improvement, so it didn't really matter that much. Overall, I'm glad I took this course, especially during the summer.\"",
            "review 3: \"04X with Pahl Hluchan: The time i'd usually spend drawing is time i'd spend reading except with drawing i'd have much more expressive freedom, so it would be like reading whatever i wanted instead of a textbook i guess.\""
        ],
        "Jeneen Piccuirro": [
            "review 1: \"07W with Jeneen Piccuirro: i never took a drawing class before but it really doesn't matter. prof will grade you on your effort, participation, and improvement. the only difficult part is that it's pretty time consuming. if you like drawing then you'll really like this class. i had so much fun i'm definitely going to take another studio art class.\"",
            "review 2: \"07W with Jeneen Piccuirro: Not as many hours as the other drawing classes. Jeneen is really fun and teachers her class very casually.\""
        ],
        "Paul Bowen": [
            "review 1: \"09W with Paul Bowen: I really enjoyed this class. It wasn't too much work, and the assignments and drawings we did in class were fun. Professor Bowen really tried to mix things up, and it worked well; we went on a few field trips to draw or look at drawings and that was interesting. Drawing I is known to be a really time-consuming class, but we only had assignments every Thursday due Tuesday, and we didn't even have a final project. Professor Bowen gave us a lot of freedom in our assignments, so we all came up with very different approaches. The individual critiques at midterms and at the end of the term were very informative to. Overall, a fun class.\"",
            "review 2: \"09W with Paul Bowen: I am an ENGS major with pre-med, so I guess I am used to classes that require a lot of work. But really, this class was the best third class ever because it required very little work but was still extremely interesting and worthwhile. Prof. Bowen was a temporary professor and I hope they hire him again, because he is very enthusiastic about art and his students. He did not assign us ANY homework between Tuesdays and Thursdays, which was awesome. Between Thursdays and Tuesdays, he would give us an assignment, which would be a topic such as \"Light and Dark\" or \"Paper Bag.\" These would be very open-ended, so it was always interesting to see what people came up with. I had a little bit of trouble figuring out what he liked at first, but I eventually figured it out, and had a great time. During one week, I spent a total of 45 minutes on the homework because I had been busy with my other classes, and that was totally OK. In the final week, I stepped up my drawing to 10 hours in that week, but we had no final project, so it was really nice to not have to spend 24 hours on a final project. I had never taken an art class before, although I have always drawn on my own. If you are worried about your level of drawing talent, be assured that Prof. Bowen is less interested in your drawing talent that your artistic vision--i.e., how you place objects in the picture, and so forth. You don't need to be able to make a photorealistic drawing of a crumpled piece of paper or an acorn, as I have heard is required in other classes.\""
        ],
        "Lucy Mink Covello": [
            "review 1: \"20W with Lucy Mink Covello: Prof Mink is GREAT. The projects were very manageable and nearly all of them could be done during class, requiring very little studio time. She also didn't assign a lot of projects and the class was definitely just a participation and attendance based grade. She never really collected actual pieces, we would just hang them on the wall. The midterm was an optional meeting with her which never actually happened. The final project was three pretty self-interpretive drawings, very doable, and a thirty minute meeting to talk to her about your drawings. Definitely a layup with Prof Mink.\"",
            "review 2: \"19F with Lucy Mink Covello: I would only recommend Drawing 1 with Lucy if you're taking it as a throwaway or distrib. Her assignments weren't very interesting or challenging, and she offered very little in the form of technical instruction. She also didn't assign half as much work as Riley or Wilson, and didn't require a sketchbook, so it was definitely super easy in terms of time commitment. If you're looking for a low commitment drawing class, this is it. But if you want to actually improve, or are coming in with any experience at all, I would try literally any other professor.\""
        ],
        "Thomas Ferrara": [
            "review 1: \"05W with Thomas Ferrara: What a fun class! Loved this even though it turns out I'm not such a great artist.\"",
            "review 2: \"05W with Thomas Ferrara: Drawing can take up all of your time but Ferrara was good about not overloading us with work. He is pretty spacey and likes art to be an expression of your feelings, an outlet -- his main objective is to get you to see art that way. He doesn't really care whether you are good at it or not. He's much more relaxed then the other profs and much less work. He gave little direction but had us study line, still life, creative composition, and figures. I actually really liked the class and I was pretty bad at it.\""
        ],
        "Marilyn J.": [
            "review 1: \"02W with Marilyn J.: I'm glad that I took the class because it wasn't a typical class (where I had to take tests or write papers) and because I really like to draw. It was a lot of work, though, (I often spent hours in the drawing studio) and I don't feel like I improved very much.\""
        ],
        "Katharine Cholnoky": [
            "review 1: \"18S with Katharine Cholnoky: AMAZING!!!!!!!!!!!!! By the time of finals, every student in the class had grown SO much as an artist. Professor Cholnoky really pushes students to discover their own style and is always encouraging and helpful. Warmups were fun, assignments all had a personal element that allowed you to create art that you were excited to create, and feedback was INCREDIBLE. Couldn't recommend a better or more intelligent prof\""
        ],
        "Ruth Miller-Forge": [
            "review 1: \"06W with Ruth Miller-Forge: I enjoyed the class.\""
        ],
        "Oona Gardner": [
            "review 1: \"23S with Oona Gardner: Oona was kind of a buffoon and she didn't give much meaningful instruction. She was pretty pretentious and her feedback wasn't all that helpful. Overall a pretty meh class.\""
        ],
        "Soo Young": [
            "review 1: \"09F with Soo Young: Park has a fantastic ability to really connect with her students-I felt that she was really invested in our success, and that she truly wanted us to become better artists. I know I did-my only previous drawing experience before this class was a class in second grade on how to draw a turtle-so at the beginning of this class, I could draw fantastic turtles, but not too much else. Now I really feel that I can express what my words can not through a visual medium-and any visual medium, too. People who want to take photography or architecture might look at this class and think \"This doesn't make sense! The whole reason I take photographs/use a computer design program is to avoid drawing!\" But it's really infinitely helped my creativity-she encourages you to think outside the boxes of convention, and even outside the dimensions of the paper if she's on her game. Also, no matter how talented you are to start with, she can always find something to criticize about you work to help you improve even further. If one thing was changed about this though, I wish that she put a little less emphasis on abstract art, which is what she does(sculpture) and a little more on the technical aspects of drawing. Also, she's a little scatterbrained. Part of being the crazy artist, I guess! She is not easy in any way, shape or form-she told us at the beginning of the term that she assesses our progress against all of the students she has ever taught, and that \"A C is average\". Scary! But you'll do fine. Take this!\""
        ],
        "Gerald Auten": [
            "review 1: \"14X with Gerald Auten: DO NOT TAKE THIS WITH SUNNY PARK. Gerry is utterly amazing, he actually teaches you to look at the world differently. You have to show you're trying, but honestly if you don't you're wasting an amazing opportunity. Best art professor I've ever had. Generally two to four hours of work between each class, but occasionally you'll get the time off. No x-hours. Had a different class with Sunny, and it's really not worth taking classes with her.\""
        ],
        "Ginger Levant": [
            "review 1: \"17X with Ginger Levant: Overall this class was less work than most of the other reviews claimed it to be. Professor Levant gave us a drawing per week, taking 2.5 hours per week for the first two weeks. For week 3 and 4 we had basically no HW. After that the work picked up, reaching 10-15 hours in the last two weeks. I would not recommend taking this class unless you are a fairly good drawer or are willing to work your ass off. Their are only two ways to get a high grade in this class: artistic talent or extreme effort. If you're talented then (at least our) Professor will like your drawings and you won't have to work too hard. If you're not talented but you put in an extreme amount of effort -- show up to all x-hours, office hours, and work after every lecture and do 15+ hours drawing per week, you can get a high grade without excellent drawings. Maybe there is a middle ground - I don't know my grade yet :)\""
        ],
        "Daniel Heyman": [],
        "Edward del Rosario": [],
        "Jennifer Caine": [],
        "Julie Puttgen": [],
        "Kathryn Zazenski": [],
        "Sharon Lindenfeld": [],
        "Soo Park": [],
        "Soo Young Park": [],
        "Viktor Witkowski": []
    }
}