{
    "SSOC001": {
        "Ronald Edsforth": [
            "review 1: \"05S with Ronald Edsforth: Prof Edsforth is great and knows a lot about the subject he is passionate about. You will come out of that course not being sorry you took it. There is a lot of reading involved, around 7 books, and regular papers and exams. Don't even think of getting around the papers and exams without reading... but great class!\"",
            "review 2: \"05S with Ronald Edsforth: It was interesting topic, monotone voice but very very well educated and interesting professor, class is interesting if you have the interest in the subject.\"",
            "review 3: \"05S with Ronald Edsforth: this class has ver interesting subject matter and most of the readings are great. the lectures can be tedious at times, but there are also many interesting film clips shown\"",
            "review 4: \"05S with Ronald Edsforth: A really good class and Prof. Edsforth was a really good lecturer. Very interesting and the papers weren't too long or tough to write. A lot of reading, but manangeable if you keep on top of it.\"",
            "review 5: \"05S with Ronald Edsforth: If you don't like reading, don't take this class. We completed a total of 6 books that were an average of 300 pages each. If you put the effort into the class you will get a lot out of though. Professor Edsforth is an interesting prof, he plays anti-war songs from the 60s, and occassionally reads poetry at the beginning of lecture. On most of the Mondays we would watch a film related to the subjects that we were currently studying. Edsforth is clearly Anti-Bush but he was always open to outside prospectives on the matter and also willing to debate. The class will definitely question at least some of your views, but that isn't a bad thing, and is truly what learning is about.\"",
            "review 6: \"05S with Ronald Edsforth: I had heard so many great things about this class and Edsforth, so I figured it'd be a good way to get rid of a distrib. Boy, was I wrong. Edsforth's passionate and knowledgeable about the subject, but the lectures are dry and a bit disorganized. The 3 papers and exam were fairly easy, but there's so much reading on top of these assignments! Overall, too much work and not interesting enough to motivate me to do it.\"",
            "review 7: \"05S with Ronald Edsforth: This is an excellent class. It is very interesting and the materials are generally easy to understand. Prof. Edsforth is a good lecturer and tries to engage the students a lot. He brought movies, lost of handouts and even music ( including bob marley) to class. I learned a lot in t his course, especially from a discussion session we had every week for an hour which was very helpful to understand the material. Take this course! Its worth it.\"",
            "review 8: \"05S with Ronald Edsforth: This course was an interesting survey of wars of the 20th century but mostly of the international peace and human rights efforts. Edsforth is liberal, if not leftist, and doesn't always present both sides of every issue, but he is very knowledgeable and is extremely passionate about the subject. The readings are fascinating--even if you don't take the class, get the syllabus and read some of these books. Just being exposed to some of these books was worth it. The weekly discussion sections w/ Prof. Edsforth were the best part of the class for me -- sometimes the lectures were a bit confusing, but I always got a lot out of the discussions. The class is heavy on the reading, and you have to keep up if you want to be engaged in the discussion section. Other than reading, there are three papers and one exam. It's pretty manageable--and worth the work.\"",
            "review 9: \"05S with Ronald Edsforth: I was very excited to take War and Peace. I read all the reviews, and it seemed that, given current world events, this class would be particularly relevant. I was disappointed. Edsforth's lectures were terrible and biased. I really did not get much out of this class. I suppose if you need it for a distrib, its an easy class. If you really want to learn something, however, I would choose a different class\"",
            "review 10: \"05S with Ronald Edsforth: This course has a way of deceiving you the first few classes. I enrolled in this class really excited about the topic however Edforth's disorganized lectures and overly passionate tone make for a long term. The class just dragged on without a clear sense of purpose that really helps you to fall asleep or dread attending class. The class was also far too liberal. I'm canadian and I could barely swallow some of the ideas edforth was suggesting were going to come true. I wasn't impressed with any aspect of this course.\"",
            "review 11: \"05S with Ronald Edsforth: Edsforth is a nice, brilliant guy. He's really available. There are discussion sections once a week, which are fun. His lectures, however, are disorganized. He rambles on and on, ignoring the outline he has written on the board. We watch a few videos in class, but sometimes he'd be about to press play but then keep talking and never press play! Essays are good, readings are interesting (a little difficult). NRO this course.\"",
            "review 12: \"05S with Ronald Edsforth: I found the material very interesting. One might not think there is all that much to say on war and peace past a few lectures, but Prof Edsforth explored many different dimensions of the subject. The readings were pretty interesting overall. Prof E is responsive to students during lecture but is rather rambling and disorganized. I thought the discussion sections were much more valuable, but make sure you do the reading first. I tried to email the prof a few times outside of class but didnt hear back, he might have been better in office hours. Interesting material overall, pretty easy tests and grading on the paper assignments. Just make sure you understand his spin and viewpoint and you'll do fine. Actually I cant believe I said that, but we all know what we REALLY want out of a class like this...\"",
            "review 13: \"04S with Ronald Edsforth: this is probably the most important course you could take at dartmouth. it's a ton of work, but it's worth it. and take it now because edsforth could be booted any time. even if you can't take it, get the syllabus, because the reading list and films are really good.\"",
            "review 14: \"04S with Ronald Edsforth: This course is excellent. At times it was a little frustrating because there were some history references that I had to catch up on on my own that the professor assumed we knew. However, I strongly recommend this course. It teaches one a lot about the aspects of war and mentality. It is also a good class because Professor Edsforth allows the students to write papers in different directions. For example, if you are more into psychology, you can focus more on the psychological aspects of war on certain papers. If you are more into history or any other subject, Professor Edsforth seems happy to see different perspectives. This is definitely a class where I felt I learned many things that anyone should really know. Highly recommended.\"",
            "review 15: \"03S with Ronald Edsforth: this was a great course and edsforth is a good prof. he is clearly passionate about the subject and it is definitely applicable to world affairs, but you also get the in depth history behind conflicts, which is cool. this course really made me feel more educated not only as a student, but as a citizen and human. take it!\"",
            "review 16: \"02S with Ronald Edsforth: This was a class full of wonderful ideas and important histories. Edsforth, even though he sort of likes to listen to himself talk, knows an incredible amount about the subject. Everyone should know the basic information offered by this class to be a productive and responsible world citizen. The grading is easy and the opportunities for learning are incredible.\"",
            "review 17: \"02S with Ronald Edsforth: This class was fantastic! The reading was truly exceptional. Prof. Edsforth, though he can get sidetracked in his own thoughts, is a wonderful professor. You really see how much he is struggling with issues of war and peace, too. He wants to illuminate students about the issues that plague him, and I give him credit for that. He is passionate about war and peace studies and inspire me to become a War and Peace Studies Fellow. You can do well in the class if you do the reading thoughtfully and go to class. He wants his students to do well.\"",
            "review 18: \"02S with Ronald Edsforth: Although there is an awful lot of reading required for this course, it all presents new ideas and helps to spark great discussion sections. Professor Edsforth's lectures aren't exactly top of the line quality, but most of the time it isn't too difficult to stay awake and actually learn something. In the present day and age, the material covered in this course can go a long way. Don't hesitate to take this course. Despite quite a bit of reading, the course consists of 4 short, 3-5 page essays and one 10-12 page term paper. Most of the time I spent working on this class was on the essays.\"",
            "review 19: \"02S with Ronald Edsforth: I strongly suggest that you take this course. You will never read the news the same way after this.\"",
            "review 20: \"02S with Ronald Edsforth: Great Course, I highly recommend it\"",
            "review 21: \"02S with Ronald Edsforth: The reading is definitely worthwhile. it will change your life. The lectures were disjointed, unorganized, rambling, and hence boring. My recommendation is to get the reading list and read as much of it as you can, but don't take the course unless you're a history major.\"",
            "review 22: \"02S with Ronald Edsforth: Fascinating material, six of the best books that I've ever read, constant applications to current world events, and a subject that concerns everyone.\""
        ]
    }
}