{
    "THEA010.84": {
        "Monica Ndounou": []
    },
    "THEA010.68": {
        "Analola Santana": [
            "review 1: \"23W with Analola Santana: Santana is a great professor. Attendance is necessary (participation graded and attendance req) and there are a lot of readings. I didn't find the discussion-based format intellectually engaging, personally, but it does enable you to hide whether or not you've done the readings. Personally, I wouldn't take this class unless interested in theater or Latin American history — there are easier distribs. Grading is based on 1 group \"Teach the Class,\" 1 paper, a vocabulary list for all the readings, and 1 final creative project. I received an A on my final, but thought Santana was a little picky (did not explain reasoning for grades or hand back any work with commentary ever) when grading presentations and papers. Would take a class with her again, would recommend this class with a big asterisk though.\"",
            "review 2: \"22W with Analola Santana: Amazing class and Amazing professor. Probably one of my favorite classes at Dartmouth. Very intellectually engaging.\""
        ]
    },
    "THEA010.64": {
        "Laura Edmondson": [
            "review 1: \"23S with Laura Edmondson: Amazing class if you put in the work. We had weekly discussion posts which weren't too hard, you just had to reflect on the readings and the word limit was 250 words. If you take notes as you do readings then you will complete the post in half an hour. She was always available to consult for advice on essays. I recommend going to office hours for a paper review before submitting it because she has specific rules she likes students to follow in her papers. I would definitely recommend taking her class. Looked forward to it everyday.\"",
            "review 2: \"22W with Laura Edmondson: The workload was not small. There were two decent-length essays (like 4-7 pages?), lots of readings, weekly discussion posts, and a huge final project (and yes, it is a performance). But it was amazing anyway. Prof. Edmondson is so great. She would cancel classes to hold extra office hours around essay due dates. She's very understanding with extensions. She genuinely cares about her subject and she is so knowledgable. Be warned that the subject matter is dark at times. It does a great job of showing things from a variety of perspectives, but... homophobia is homophobia, and a fair amount of the readings do deal with that. You have to do the reading because the class is VERY discussion based. We had... two lectures? and a couple movie days, but everything else was group discussion. Prof. Edmondson is a great facilitator and definitely keeps the discussion moving smoothly. Also, the final project looks daunting on paper but it was genuinely so much fun. Like, I genuinely enjoyed it. This professor had me LOOKING FORWARD to a FINAL--and NOT because I just wanted out of the class! That was partly due to the other students in my group, but in a small class with such intense discussion, you tend to get along well with your classmates. Anyway, while that did take like 7ish hours of preparation outside of class, it's in my top three favorite memories of 22W. Highly recommend if you're willing to put the effort in, but don't take it if you just want to do the bare minimum. No prior knowledge needed.\""
        ]
    },
    "THEA010.90": {
        "Laurie Churba": [],
        "Samantha Lazar": []
    },
    "THEA010.51": {
        "Monica Ndounou": []
    },
    "THEA010.28": {
        "Cesar Alvarez": []
    },
    "THEA010.33": {
        "Samantha Lazar": []
    },
    "THEA010.30": {
        "Lawrence Kritzman": []
    },
    "THEA010.29": {
        "Timothy Hackett": []
    },
    "THEA010.57": {
        "John Heginbotham": [
            "review 1: \"22X with John Heginbotham: Literally the easiest, most fun, most relaxing class I have ever taken. I've never written a review here, but I could not recommend this class more. I honestly liked going to this class every day. Profs are super nice. Literally, the only thing I had to do was write one-page intro\""
        ],
        "Monica Ndounou": []
    },
    "THEA010.26": {
        "Jane Shaw": []
    },
    "THEA010.56": {
        "Monica Ndounou": []
    },
    "THEA010.65": {
        "Analola Santana": []
    },
    "THEA010.55": {
        "Monica Ndounou": []
    },
    "THEA092": {
        "Daniel Kotlowitz": [],
        "Laura Edmondson": []
    },
    "THEA012": {
        "Afroditi Manthati-Angelopoulou": [],
        "Michael Lurie": [],
        "Simone Oppen": []
    },
    "THEA010.71": {
        "James Horton": []
    },
    "THEA010.45": {
        "Eman Morsi": []
    },
    "THEA010.32": {
        "Carol Dunne": []
    },
    "THEA010.25": {
        "Michael Ganio": []
    },
    "THEA035": {
        "Carol Dunne": [
            "review 1: \"23W with Carol Dunne: This class was so much fun! Carol is someone who is incredibly passionate about her craft, and that's really the force that drives THEA35. She will be brutally honest with her criticisms, but she will always find that spark of true brilliance in you and articulate it, so you will definitely come out of the class as a much better actor/singer. It also helps that the class basically involves almost no time commitment, sporadic rehearsals excluded, and spending class periods performing alongside other people who are passionate about musical theatre really doesn't feel like work at all. In short, it's a definite recommendation from me! (Also, big shoutout to Annemieke, our wonderful pianist. <3)\"",
            "review 2: \"23W with Carol Dunne: This was definitely my favorite class at Dartmouth so far. What's not to love about showing up twice a week for a few hours to watch truly amazing students sing and act? Carol is such a queen, she really has fun with her students but is also extremely committed to her craft and helping students improve on our acting. The basic format of the class involved three performances over the term. The first was a solo song, the second a partnered Chekov scene, and the third (final) was a duet song + scene. Carol is a really BIG fan of Sondheim (which I didn't mind). Be prepared to commit a few hours a week outside of class to memorize and block scenes and songs. Carol will know if you are unprepared and it will show in class as well. Every day, there are stagings where you and your classmates perform and show progress up until the actual performances. There are a few assignments outside of class, but they are super easy and really help you familiarize yourself with the character and scenes you are performing. Carol makes it clear that if you show up to class prepared and submit the assignments on time, you will get an A. Awesome class, would take again if I could!!\"",
            "review 3: \"18F with Carol Dunne: If you're interested in musical theater, take this class! It will be so helpful to you. Carol is also just an incredible person. She's so easy to talk to and so understanding and SO good at her craft. If you take this class, you will truly be learning from the best. The class itself is also so engaging and really just doesn't feel like school at all. The workload is totally manageable and doesn't even feel like work. If you actually put effort into this class, then you'll succeed in it. Carol can always tell whether or not you're prepared for class, so be prepared for class. She's very straightforward about this. Overall, you just don't want to miss out on taking this course. Carol is amazing and I'm so glad I got to learn from her!\""
        ]
    },
    "THEA010.24": {
        "Barbara Will": [],
        "Colleen Boggs": [],
        "Katherine Hornstein": [],
        "Laura Edmondson": []
    },
    "THEA010.22": {
        "James Rice": []
    },
    "THEA010.23": {
        "Angela Hernandez": [],
        "Francine A'Ness": []
    },
    "THEA007.01": {
        "Mara Sabinson": [
            "review 1: \"23S with Mara Sabinson: BATSHIT CLASS. take this class with your friends and it will be hilarious. She is actually so offensive and says the most out of pocket stuff that it is hard not to laugh. She can be really rude but don’t take her seriously. DEF A LAYUP. I honestly had so much fun because she is so insane.\"",
            "review 2: \"23S with Mara Sabinson: Mara is BATSHIT insane she should have her teaching license revoked deadass. She must have some crazy dirt on the school to be wreaking this much havoc and still keep her job. But such an easy joke of a class take it with a couple friends and it’ll be so entertaining. Mara is also extremely rude and offensive but don’t take it too personally just return the favor.\"",
            "review 3: \"22S with Mara Sabinson: Good prof, good class. Just lie about being liberal and put in a little effort, and it'll be an easy A.\"",
            "review 4: \"21S with Mara Sabinson: She's so funny because she's so rude. I took her seminar online so it was easy to bullshit. I enjoyed this class so much. Would def recommend. It's a joke of a class, which makes it super fun. Take it with your friends. This seminar might be the best seminar layup out there. All we did in class was write scripts, act them out, and make videos on iMovie. Only bad thing is that she can be an old cranky lady here and there.\"",
            "review 5: \"17S with Mara Sabinson: Honestly did not enjoy this class. Sabinson is a very close-minded liberal who picks favorites and openly dislikes conservatives (keep in mind I write this as a liberal myself)\"",
            "review 6: \"16W with Mara Sabinson: Took the course because it's a layup, ended up actually enjoying it as well. Professor lets you resubmit assignments as many times as needed and will never give you a lower grade, so it's difficult to not get an A.\"",
            "review 7: \"14X with Mara Sabinson: This class would definitely be considered a layup, and my class was full of students who definitely were looking for a layup FYS. However, I would also strongly recommend this class to anyone who has a genuine interest in the creative display of social issues.\""
        ]
    },
    "THEA010.03": {
        "Victoria Somoff": []
    },
    "THEA010.05": {
        "Afroditi Manthati-Angelopoulou": [],
        "Michael Lurie": []
    },
    "THEA007.02": {
        "Chante Mouton Kinyon": []
    },
    "THEA091": {
        "Daniel Kotlowitz": [],
        "Laura Edmondson": []
    },
    "THEA090": {
        "Laurie Churba": [
            "review 1: \"23F with Laurie Churba: 100% a layup. You make a portfolio website, have a short audition seminar, learn about industry vocab and taxes and unions a little bit, and do a quick weekend trip to NYC to see a few shows (the dept pays for most of it). Read one play per week and write a short 1-page response. Midterm was to interview someone in the industry and write a short reflection, final was to write about how your experience in the major has changed what you want to do when you graduate. She stated week 1 that if she could make the course pass/fail she would, but because she can't everyone will most likely get an A. There's a bit of devised theater at the end (about 2 weeks), and while it's not my favorite, it can be fun with the right class. She left weeks 3-7 on the syllabus TBD when we first got it because she wanted us to drive the class with what we wanted to learn, so don't hesitate to ask for guest visits or specific workshops or any particular topic that interests you.\""
        ]
    },
    "THEA080": {
        "Daniel Kotlowitz": [],
        "Laura Edmondson": []
    },
    "THEA065": {
        "James Horton": [
            "review 1: \"21X with James Horton: It will take up ALL OF YOUR TIME. The communication is messy- don't take it with another class that has labs or lots of outside of class block meetings. Your enjoyment level will also be impacted with which visiting artists you get matched with, but it's still an unmissable opportunity to work with people in the industry for folks interested in theater. Really recommend if you're a theater major/minor taking a two course summer.\"",
            "review 2: \"19X with James Horton: This class is really for theater majors or people interested in getting a sneak peek into the lives of theater artists and the process of making theater. It's not difficult but definitely very time consuming (most of my classmates did two class terms with this class). Professor Horton oversees the class and sends out logistical information but most of the class is rehearsing with the artists who come for the different festivals. Voxfest and the dodd is a lot of active hours of working in the scene shop, acting, or whatever the role assigned to you. New York Theatre Workshop is many hours of observing and discussing the projects they come through. My three Saturdays for NYTW were pretty much booked from 10 am to 11 pm which could be tiring (although Sundays are days off). I would recommend this class if you're interested in exploring theater as a career or interested in creating some theater projects. Also heads up that you aren't allowed to take any classes after 2 pm on any day for this class. Typically rehearsal was 2-5pm maybe three or four times a week, depending on the project.\""
        ],
        "Timothy Hackett": [
            "review 1: \"06X with Timothy Hackett: Workshopping a new play. Building and helping with ALL aspects of production. Getting to intern with the New York Theatre Workshop. AMAZING. Great group, great prof, great class.\""
        ],
        "Carol Dunne": []
    },
    "THEA062": {
        "Annabelle Melzer": [
            "review 1: \"04F with Annabelle Melzer: This class was completely unique in that most of what I learned was not in the classroom. We went to see about 35 shows in the ten weeks we spent in London, and in class we analyzed trends and ideas we noticed along the way. It was an amazing experience...intense and one-of-a-kind, and sort of required you to create your own structure and passion within the framework of the class. One qualm I had with the class was the fact that we had so many awesome visiting professors, etc that we hardly got any time just with Annabelle lecturing. I wish we'd had more classes!\"",
            "review 2: \"04F with Annabelle Melzer: it was a great class\""
        ],
        "Framji Minwalla": [
            "review 1: \"06F with Framji Minwalla: Easily the best part of the FSP. The shows we saw were fantastic, and weaving them together and using one to comment on the other is the best way I can think of to learn about the art and the craft. It got a bit strange because the actors sometimes took over the class, but otherwise the discussions were very exciting and engaging. Framji, despite his perpetual tardiness, is wonderful and a veritable archive of information.\""
        ],
        "Timothy Hackett": [
            "review 1: \"08F with Timothy Hackett: I liked this course quite a bit-- it involved seeing twenty some plays and then discussing them in class. The plays were incredible and the discussions were interesting enough (but very disorganized-- frequently frustratingly so.) The homework assignments were not difficult but they were rather poorly explained. We had turned in three of them before we got a grade back on the first. Overall, this is a good course, but a badly organized one.\""
        ],
        "Daniel Kotlowitz": [],
        "Laura Edmondson": []
    },
    "THEA061": {
        "Daniel Kotlowitz": [],
        "Laura Edmondson": [],
        "Timothy Hackett": []
    },
    "THEA060": {
        "Daniel Kotlowitz": [],
        "Laura Edmondson": [],
        "Timothy Hackett": []
    },
    "THEA054": {
        "Timothy Hackett": [
            "review 1: \"23F with Timothy Hackett: I took this class as an independent study and it was a waste of time. It was all script analysis or sitting in the back of a rehearsal observing – no actor coaching instruction like the description says, and that's what I wanted out of the course. We only started directing practice in the last three weeks (with FAR AWAY by Caryl Churchill, who I would not consider to be an author from a \"diverse cultural background\") and I only got actual feedback on my directing on the last day of class. As long as you do the work on time he's pretty reasonable with grades, but it's all script analysis (just poke holes in the story and point out where lines lack specificity). Peter Hackett also has a habit of treating white students preferentially and that was evident in his casting of the show we observed (which required a 50% global majority cast and DEFINITELY did not have that). \"Particular attention will be paid to methods for building a creative ensemble based on respect and mutual understanding\" yeah not true. Didn't touch on that once. He assigned pre-reading over the summer and forgot about it. He forgot basic details about ourselves we had shared with him. I can't tell if he just wasn't paying attention or if his retirement age is getting to him. He has so, so much experience, but I think observing rehearsals did significantly more for me as an actor than a director. I guess I can say the same about script analysis while I'm at it: it was more helpful as an actor than as a director. It's the same script analysis you do in Acting 1, just beefed up a bit. Don't expect him to teach you well or be concise with his advice. Not the worst prof I've had, not the best prof either. 5.5/10, disappointing but not unexpected.\"",
            "review 2: \"05F with Timothy Hackett: This class should only be for kids who already direct and want more experience. If you are new to directing, don't expect to learn from this class. Hackett uses lots of esoteric references and psychobabble paired with fluffy books which in theory should make you learn the material but in fact teach you nothing. Huge time commitment is required to find a cast, find your own rehearsal time for scene projects, do the onerous and pointless casebooks, and schedule everything. Class ate my life and I barely learned a thing.\"",
            "review 3: \"04F with Timothy Hackett: Hackett is great and is very smart and helpful -- he really knows what he's talking about and is interesting to listen to and work with. In this class, you had two scenes to direct. The first one, we had plenty of time to do, and the second one, which was the \"bigger\" scene, we had very very little time to do and it felt rushed. Also, the beginning of the class (about the first month) was devoted to acting technique which felt a little redundant, as a pre-req for this class was Acting I. I'd definitely recommend it, but you have to be self-motivated enough to keep up with your journals and casebooks regularly, since they're only collected a few times throughout the term. Definitely a good class, though. Take it. Yay.\"",
            "review 4: \"04F with Timothy Hackett: I think this class was quite strong in terms of what I learned, but the problem with it was the syllabus. We spent a lot of time acting in the beginning of the term, which, although useful, seems redundant because the prerequisit of the class is Acting I. This was Peter's first term at Dartmouth, and having spoken with him, i know that he is going to revise the syllabus to make it more about directing and less about acting. He's an extremely talented and intuitive director, judging by his responses to the work presented in class. Grading was fair, but tough, you definitely have to do the work. It is at first a very technical approach, but you find a lot of artistic freedom within the limitations. The grading is based on just a few things, there are few of them, but they are extensive, the casebooks are a lot of work and you need to be self-motivated in order to accomplish the work, as there are no \"small\" deadlines. Overall, a fantastic class, i definitely recommend it to those interested in the subject material. A great intro to the basics of directing.\""
        ],
        "Annabelle Melzer": [
            "review 1: \"01F with Annabelle Melzer: Professor Melzer is incredible. One of the most dynamic, intelligent and gifted professors I have come across yet. The directing course itself has some problems as it stands righ now in terms of getting willing and able actors to participate in the scenes - but the department is looking to find an apropriate solution. I learned an extraordinary amount about directing, acting, and my place in an ever changing art from this course.\"",
            "review 2: \"01F with Annabelle Melzer: This is perhaps the best class in the Theater department. Annabelle is by far one of the best professors. She is so passionate and so knowledgable about the theatre and passes both of those traits onto her students. This class is tough and at times very stressful. It involves the presentation of three scene on two separate occasions and many hours of rehearsal at night. It is the most rewarding class that I have taken at Dartmouth and I cannot stress how wonderful Annabelle is. I recommend her to anyone.\""
        ]
    },
    "THEA051": {
        "Joseph Sutton": [],
        "Liliana Padilla": [],
        "Mfoniso Udofia": []
    },
    "THEA050": {
        "Joseph Sutton": [
            "review 1: \"17W with Joseph Sutton: Great course for creative writers! I loved this course. You don't really have to buy the books. All you do is write. You write a very short play based on a topic, and then you finally work on a final play at the end of term. The extra time to do rehearsals for the reading is kind of annoying, especially since you probably want to recruit readers yourself, but actors are available to read. Awesome course! -gdp\"",
            "review 2: \"13S with Joseph Sutton: Course: Great course if you're interested in writing or just have something you need to say. Professor: Professor Sutton does prefer that you write following a basic play specific formula but keep in mind but keep in mind this is Playwriting I, meant to get you stated with the basics. Workload: Manageable workload, although it varies depending on how seriously you take your work with regards to drafting. You will get out what you put in.\"",
            "review 3: \"07S with Joseph Sutton: The class was fun, but lots of work.\"",
            "review 4: \"07F with Joseph Sutton: This is a great introduction to playwriting although Prof Sutton has a pretty self-defined definition of what good art is and if you don't compose your play to his standards you won't do well. That being said, you will be pretty proud of your work by the end of the term and thus I think it's a class worth struggling through! Professor Sutton likes to hear himself talk. He's also always right and we're always wrong. Just FYI.\"",
            "review 5: \"07F with Joseph Sutton: I've got mixed feelings about this class. It's an amazing opportunity to write a complete one-act play and hear it read, but the prof, though a nice guy, is very difficult to engage with and can seem a bit narrow-minded in terms of what he expects and values in students' writing. It's a class I'm very glad I took though -- it definitely showed me a lot about where I need to develop as a writer.\"",
            "review 6: \"04S with Joseph Sutton: If you're a writer, or if you enjoy creative writing, DEFINITELY take this class! While Professor Sutton made it seem like there would be a lot of work, it was less \"work\" and more fun. Writing a one-act play might seem like a huge undertaking, but Prof Sutton made it an easy task. He gave great advice, and while ocassionally pushed too much in one direction, was usually pretty helpful in his criticisms. The feeling you get when you watch the reading of your finished play is indescribable. This class was an incredible experience!\"",
            "review 7: \"04F with Joseph Sutton: i liked it. the class is the kind that is as much for you as you put into it. for me i didn't stop thinking about my pages the whole week leading up to class. its very specifically one act realism/naturalism but i guess that's a general playwriting thing that it's good to know. it's great to be done a class and have something to show for it.\"",
            "review 8: \"04F with Joseph Sutton: that, apparently, is the question...\"",
            "review 9: \"04F with Joseph Sutton: i took this class on a whim and I am very happy I did. It was tough work to produce a 45 page play, but I can really look back on the term and feel that I accomplished something. Prof Sutton is available to students and gives good advice and ideas when writing the script. I would highly recommend this class.\"",
            "review 10: \"04F with Joseph Sutton: I learned a ton in this class, and found Professor Sutton especially helpful to helping my hone the craft of playwriting. It is a difficult process and I'm not sure I really have a grasp on it now, but I enjoyed the process. Class consisted of three 5 page scenes, due each week (we met on Mondays and Tuesdays for two hours each) and then a 40-50 page one-act play that was due in 15 page installments throughout the course. Sutton is a professional playwrite and you can learn a lot from him. I'd encourage you to\"",
            "review 11: \"04F with Joseph Sutton: If you enjoy theater, if you like to write, if you have something to say, take this course. At the end of the term you will have produced a 40 minute 1 act play that will be read for you, your classmates, and guests. The exercises at the beginning of the course-- 5 minute scenes-- are fun to write and read. Class consists almost entirely of reading these scenes and eventually of reading scenes from the final play-in-progress. Prof. Sutton gives great feedback and is very encouraging. After the term ends, the course leaves you wanting to finish your play, to see it staged, and to write more. The class is inspiring, if frustrating at times. The workload can get heavy if you become unsatisfied with your play and do serious revisions. The emotional investment in the final project is also much greater than your average final exam or paper. Still, a great learning experience.\"",
            "review 12: \"02F with Joseph Sutton: With any art course it is important to know both the craft and creativity involved in creating a piece of work. The same is true for playwriting. This makes it a difficult subject to teach. Joe takes a harsh approach to teaching playwriting because he wants every student to come out of the course with a well-made play. If you don't end up writing the types of plays that he writes (quite successfully, he's a Pulitzer nominee), then you aren't going to get a good grade. I personally had to change a lot of my play to make him happy without really thinking about what made me happiest with it. But it's definitely fun to take a class that's purely dramatic writing based. There are readings of one act plays and from a book about playwriting, but most of the work is writing short scenes for the first half of the class and then working on our one act plays for the final bench reading at the end of the term. I would recommend this class, as long as you don't mind following his ideas of how a play should be written.\"",
            "review 13: \"01F with Joseph Sutton: The best thing about Playwrighting 1 is that if you don't take it next term, you will probably not write a one-act play. However, for Playwrighting 1 Prof. Sutton is only interested in teaching you to write one kind of play - the kind of play that it is meant to be effective for beginning playwrights to write. This basically means a single central character who is trying to acheive something (his \"throughaction\") with a certain groups of techniques or \"tactics\" but is blocked by the actions of about two other people who he is meant to need something from (\"obstacles.\") There are a few problems with teaching only one style of playwrighting. First, there is really not all that much to learn about such a simple structure, so Prof. Sutton ends up repeating the same things over, and over, and over again. It would be more efficient to just pick up one of the texts in the bookstore and read everything once. More importantly, this is not all theater can be. Some of the best writers in the class never followed this structure, and when they were forced to do a naturalistic, straight-forward main-character throughaction/obstacles play for the final project, their work suffered. If the goal of the class is truly \"for each student to write the best one-act play he or she is capable of writing,\" Prof. Sutton would educate his students about a variety of techniques and let them decide for themselves what will work best for the play they want to write. He would end up with much more interesting and innovative work. If you do decide to take this class, you will write a one-act play next term, but it will have to be the kind Prof. Sutton taught you about or your grade will suffer.\"",
            "review 14: \"01F with Joseph Sutton: The most valuable thing that this course taught me was to avoid profs who were egomaniacs at any cost. Sutton wants people to write exactly as he does and with his vision and philosophy of playwrighting. My biggest problem with this course is that he lies about how he grades. He says at the beginning that he will not grade based on the merit of the material produced, but ends up assigning grades based on how close to his style of drama the play comes. If you can write straight realism with three characters then go for it, but if you cripple your style by trying you'll struggle in the course. I wouldn't recommend this course to anyone because of the prof- there are better writing courses to be had here.\"",
            "review 15: \"01F with Joseph Sutton: Like most creative/art classes, this one is what you make of it. If you want it to be easy, it probably can be. I had a class of ten very driven people and we worked very hard to write plays to be proud of, and it was a huge amount of work. The weekly assignments were usually to write some portion of a play or scene, which we would read out loud in class and get feedback. There were also assignments of playwriting theory to read, and Joe Sutton would give half-hour lectures on theory at the beginning of each class. His feedback would often be in terms of thees theories. This was not all that great because it is only one f many ways to look at plays, and he has a very \"my way or the highway\" attitude. But it's not that hard to just ignore him and write a good play anyway. Feedback from classmates was often the best. This is the kind of class where you know everyone's name by the second week, and will be joking with each other by the end. DON'T BE SCARED TO TAKE THIS IF YOU AREN'T A HARD CORE WRITER OR DRAMA MAJOR. THERE WERE SEVERAL PEOPLE IN MY CLASS WITH NO EXPERIENCE AT ALL.\""
        ],
        "Liliana Padilla": [
            "review 1: \"23F with Liliana Padilla: Great professor. Really encourages you to find what you wanna write about and dig into it. Just a great class that taught a lot of writing skills.\"",
            "review 2: \"21F with Liliana Padilla: This is the best class I have ever taken. I cannot truly describe how much fun this class was, and how much of that is owed to Liliana. I highly, highly recommend taking this class with them while they are still teaching it. Class atmosphere is fun and laidback, and Liliana is super chill and understanding. At the same time, I can confidently say that my playwriting skills are significantly improved. The classwork is super manageable. It consists of mostly in-class writing exercises and writing one-page responses to short plays that you read outside of class, until the end of the class when you write a longer, 10-minute play as your final project. Liliana starts off by mostly lecturing about playwriting technique and various tools that can be used, but the class becomes more and more collaborative/discussion-based as it goes on, especially once people start sharing drafts of their work. Again, this is truly my favorite class I have taken so far and I cannot recommend it highly enough.\"",
            "review 3: \"21F with Liliana Padilla: Liliana Padilla is a fucking godsend. Hands-down, the best writing class I've ever taken. Their teaching style, which usually involves mini-lectures inserted into class discussion, introduces helpful writing techniques that have improved my playwriting and my creative writing style in general. You get lots of opportunities to share your work with the class, including three workshops for your final ten-minute play. The play readings are always interesting, and Liliana chooses such meaningful stories to discuss in class. They start with very short plays, before switching to full-length plays about halfway through the term, so the readings are always manageable and allow for plenty of time to read. Liliana's teaching style was pretty laid-back but super effective, they also always made an effort to provide office hours for students and created a really collaborative classroom environment. Take this class with them if you can. They're headed for huge things beyond Dartmouth for sure and we're so lucky to have them for a short period of time!!!\"",
            "review 4: \"21F with Liliana Padilla: This was easily the best class I have ever taken. Liliana is absolutely incredible and it is so clear how much they care about their students. I thoroughly enjoyed going to every single class period/office hours as they were incredibly engaging and helpful. I promise that if you take this class with Liliana your writing will improve so much, you'll have the time of your life, and you'll remember all of the reasons you wanted to come to Dartmouth in the first place. TAKE THIS CLASS / TAKE A CLASS WITH LILIANA!!\"",
            "review 5: \"21F with Liliana Padilla: Liliana is wonderful. For the first half of the term, classes will start with a quick wellness check-in (a gesture or a word of how everyone’s feeling), a 5-10 min writing exercise, then we’d have a lesson or discuss our readings. Readings would take about an hour total per week (I’m a slow reader). The second half of the class, we’d do check-ins and readings of our own work to get feedback. Liliana is very kind, and they are open to any subject matter in your writing. They are able to support you in your writing goals regardless of whether you want to be a playwright, a screenwriter, or a novelist. Take this class for a layup and an unforgettably dedicated and amazing professor.\""
        ],
        "Mfoniso Udofia": []
    },
    "THEA048": {
        "Margaret E.": [
            "review 1: \"07W with Margaret E.: This class was great! I loved Spicer even though she was brutal to people who had trouble with the design. She was great though, at the final she bought us Lou's and we just chatted about our final projects. The work was heavy, if you cared about your product. i did care so I put in a lot of outside hours on all of my projects it definitely was the class that took up the most time this term. However, if that is the type of work that you like--project t work then you will love it like I did. If you don't like time consuming projects you will hate the class. The projects were 2 non-historical and two historical.i liked the historical material more, but everything was fun.\"",
            "review 2: \"07F with Margaret E.: The class was pretty easy, just show up...look at slides of costumes ranging from 1500 to 1980 mainly in Europe. There aren't much \"hands on\" projects in class, so prepare to go into assignments not sure what you are doing. The assignments were helpful but the last two are a little tricky because Professor Spicer really looks at your designs. And has standards for what is acceptable for the time period. But other than that the class is nice. Helps a lot if you're interested in clothing/costumes/technical theater, etc.\"",
            "review 3: \"07F with Margaret E.: I really liked the class-- I learned a lot about all the work that goes into costume designing, as well as designing for theatre in general, and that was really beneficial for me as an actor and director. The assignments were good, but took a long time to do. Margaret can be finicky about certain details but not others in your project, and you never know which ones are going to be the ones she really harps on. But as long as you stay on her good side she really likes you.\"",
            "review 4: \"05F with Margaret E.: More time than necessary for a gut course\"",
            "review 5: \"04F with Margaret E.: I really enjoyed this class, but if you're not up for spending massive amounts of time on projects that are often frustrating, it's not for you. The projects were a lot of fun, but extremely time consuming. I was expecting this to be my third class, but I spent more time on it than on the major class I took this term. However, the projects were fun and don't require a great amount of concentration. I brought mine to my fraternity house and did them in the middle of the chapter room. It was nice to have to input from fresh eyes. Margaret is extremely knowledgeable and friendly. She has a vast understanding of costume history and is a resource that you should definitely take advantage. Overall, a fun class, but a lot of work.\"",
            "review 6: \"04F with Margaret E.: Good fun. No reading. Time-consuming projects. In-class critiques aren't nearly so scary as you might think. Also, most people can't draw either.\"",
            "review 7: \"02W with Margaret E.: This course was great for creative people who like incorporating their ideas into their assignments. The costume history section is consise and doesnt bog you down, but also doesnt go into much detail. Great for those who are considering costume design or theater as a future, and also for those who arent.\"",
            "review 8: \"02F with Margaret E.: When I say 7 hours a week, that's an average. Some weeks I spent half an hour, and I spent at least 30 hours apiece on my midterm and final projects. I came into the course expecting to create costumes, but found that that's Construction, held every other winter (next due: 05W). This course focuses on the designs themselves--sketching, rendering, color, line, and texture. Projects range from colored pencil renderings to full-on fabric collages (the most painful project I've ever done). There's one about every week, so be ready to work on the weekends, and don't leave it all for sunday night (you won't get it done, trust me). She uses all the x-hours. From this course I'm definitely taking a new appreciation for the work that goes into costuming theatrical presentations. I never would have thought that so much went into a show's color scheme. Now I watch movies and see characters given focus with brighter colors, and bit characters dressed in earth tones. I enjoyed the \"art project\" aspect of the course, even though they took a significant amount of work. The class is small, and each project is individually critiqued by the entire class, so no one can hide behind a lackadaisical effort. Professor Spicer does not allow for as much flexibility as she lets on. She is very serious about staying in period, even though she may tell you that abstraction is part of theater. Don't fret, though, as we're beginniners and can't yet be expected to artfully stray from proper historical costumes. :) Overall, I'd recommend this course to anyone who is willing to put some work in for a new view on the people who work behind the stage and screen. If you like art projects, the assignments can be enjoyable, so just be prepared to put in some major hours.\"",
            "review 9: \"02F with Margaret E.: I thought this class was a really nice break from normal large lecture classes. with only 10 people in the class, we get individual attention. i thought the course material was fun and interesting, but there was a lot of work involved. I never expected this to be the hardest course i took this term, but it was worth it.\""
        ],
        "Laurie Churba": [
            "review 1: \"20S with Laurie Churba: I took this class on zoom and it was a blast! Professor Churba can be a bit chaotic at times (wrong zoom links, random changed assignments, etc.) but she has a very sweet and kind personality. This class isn't super technical and focuses more on ideas related to costume design and drawing renderings of costume ideas. Even if you aren't very artistically inclined, it's great fun. Class assignments were readings, movie responses, and responding to interviews with costume designers (one page double spaced). The readings are pretty short and aren't on any test. Costume renderings could be time-consuming for the days before they were due but they were so fun to work on. I would definitely recommend this class if you are looking to get creative or fulfill the design requirement for the theater major (as I was). I will add that if you are a theater major planning on entering the industry, working in the costume shop may be just as if not more helpful than taking this class to get those technical skills.\""
        ],
        "Laurie Churba Kohn": [],
        "Martin Schnellinger": []
    },
    "THEA046": {
        "Margaret E.": [
            "review 1: \"03W with Margaret E.: Lots of work. That's really all I can say. It's a lot of fun, though.\""
        ]
    },
    "THEA045": {
        "Daniel Kotlowitz": [
            "review 1: \"04F with Daniel Kotlowitz: Dan is a great lecturer and really inspires interest in the subject. You pretty much have a project a week, and they are manageable, but still challenge you to think and be creative. Aside from the projects, there is almost no reading. There are two or three very simple quizzes. The class is very manageable workwise and is also very interesting. I would recommend it to anyone.\"",
            "review 2: \"04F with Daniel Kotlowitz: THis was a nice class. You study the \"composition and design\" of theatrical sets basically by analyzing a variety of art forms. Paintings, actual play sets, movie clips, even music. Very unusual. The professor also really knows what he is doing though. Kotlowitz was a lighting designer for several years in New York and has worked on a countless number of plays. His experience reveals itself in all he does. You will have a bunch of projects in this class that test your ability to apply what you are taught. Stuff like, \"create a collage that expresses the rhthym of so and so poem\". It sounds easy at first but that crazy stuff is tricky as hell when you actually try to do it. Anyway, the class is about average in terms of work load. There is always something to do, but it is never overwhelming. And I think he grades pretty fairly. PEACE OUT HOME BOYEEEEEEEEEEEEEEEEEEEEEESSSSSSssssssssssssssssss\"",
            "review 3: \"04F with Daniel Kotlowitz: Dan is one of the best professors I've had while at Dartmouth. He is a respected professional in his field (lighting design) and also a really great teacher -- a combination which I don't think is present in many professors. He is also very friendly with his students and likes to get to know them as people. Over the course of the term we went to lunch with him at the Hanover Inn and were invited to dinner at his home in Vermont. The class itself was quite a bit of fun, too. There are a lot of projects in a variety of different mediums, so something for everyone. One of the nicest things about our class was the combination of different people -- we had theater majors, biochemistry majors, freshmen, and seniors (and this in a group of 8 people). Everyone has something different to bring to the table and Dan respects that -- so don't be afraid of taking this class if you've never been to a play or drawn anything more complicated than a stick figure. I would recommend this class to just about everyone -- it's a great way to get ART credit for all you sciencey people out there, and a great way for artsy people to challenge themselves and look at their work in a different way.\"",
            "review 4: \"04F with Daniel Kotlowitz: I found this class to be extremely stimulating and challenging. It is primarily about creativity and perception, but don't let that deter you if you think you are \"not an artistic person\". There were plenty of people in our class who were non-majors, \"non-artsy\" people who always brought really interesting things to the table, everyone always had something to offer. The course is a lot about how much work you're willing to put in. I learned a ton. Dan really knows his stuff, and has been in the business a long time, though at first he might seem like not that interesting of a professor (he says himself he's not a lecturer), but his feedback on projects and the critiques in front of the class always taught us a lot. I highly recommend this class to people who are willing to stretch themselves and put a lot of work forward.\"",
            "review 5: \"02F with Daniel Kotlowitz: i loved loved loved this course. the material was really interesting and the projects helped me learn a lot of things about visual design. it was a beautiful course. a relaxed and fun atmosphere, and Dan is a great prof. projects were really fun to work on although they demanded a lot of work. i really wish we had more time for this course!\"",
            "review 6: \"01F with Daniel Kotlowitz: The course was loosely structured, and some of the projects (mostly the individual ones) were able to be completed quite quickly, while others (some of the group ones) took more time outside of class, due to the collaborative process. The small size of the course, the discussions, and group projects made it a real collaborative effort. The workload varied depending on the week, but most of the outside-of-class work involved research and projects, not too much studying or reading, really. Advice if you take this course: Presentation counts, as does attendance and participation.\""
        ]
    },
    "THEA044": {
        "Daniel Kotlowitz": [
            "review 1: \"24W with Daniel Kotlowitz: This class is super easy, you only really need to spend a few hours a week and you'll get an A. There are 5 projects and a final project but proj 5 and final project are pretty much the same. There are also 2 quizzes but easy af and you can retake them. You also have to do 15 hours of theater crew work, but it's kind of fun? Overall a fun and unique course that I'm glad I took as my art credit.\"",
            "review 2: \"08W with Daniel Kotlowitz: Dan Kotlowitz is an amazingly smart, nice, and inspiring prof. I came in with knowledge of the technical side of lighting, but had never approached it from an artistic sense. I struggled at first since I've never been forced to look at the world so visually. It took me a while to get into the swing of things in the class, but eventually found it very interesting and rewarding. Assignments were generally good, and not too hard. They make one think though about the ideas presented in class. The only really tough one was the final assignment, cause we hung lights for a show in the Bentley. Trying to get 9 people doing this at once just didn't work well. It made a stressful finals week a little more hectic, and could have been planned better. Besides that, a very good course.\"",
            "review 3: \"07W with Daniel Kotlowitz: Felt more like a group of us hanging out with our professor and happening to discuss the same material every time. Interesting material, the practical component is not something to be scared of.\"",
            "review 4: \"07W with Daniel Kotlowitz: We learned a lot about lighting design from all the projects, and Prof Kotlowitz was great. The atmosphere of the class was very light and open, but it didn't stop us from learning a lot. And the projects were a lot of fun. Take this class.\"",
            "review 5: \"07W with Daniel Kotlowitz: This course is truly great. Dan is an excellent professor-- knowledgeable, accessible, and helpful. Class is always entertaining, and laidback, but I learned a great deal too. Dan teaches you everything you need to know in order to do the projects, which are challenging and fun. I definitely recommend this class to both majors and someone looking for something a little outside the norm at Dartmouth.\"",
            "review 6: \"05W with Daniel Kotlowitz: it's a lot more work than the orc will lead you to believe, a good amount of projects you will have to work hard to accomplish and accomplish well, but it's a worthwhile class and a lot of fun, dan's an awesome prof and a great guy to know, i recommend it\"",
            "review 7: \"05W with Daniel Kotlowitz: Prof. Kotlowtitz is a passionate instructor with a wide range of professional experience in theater lighting. He knows what he is talking about. Classes revolve around discussing certain aspects of lighting making presentations of the projects. The dicussion were often very deep and interesting. People offered a lot of creative ideas. I was particularly impressed by the prof.'s lectures and his preparedness. For each class, he brings in loads of materials like videos, paintings, etc. and shows how lighting decisions can affect the viewers' response. The prof. is a really great guy and a fine instructor, but his intensity can sometimes be a little bit intimidating. Students who want to do well should actively seek his input during office hours. As a non-theater major, I took this class out of simple curiosity and was thrown off by its intensity. The projects, which are given almost every week, can be very time- consuming. The group projects are especially difficult because everyone seems to have some kind of \"schedule conflict.\" In addition to the projects, you are required to put in 30+ hours working on a school play as a stage hand. Working on the stage can be tiring, but it is quiet moving to attend the performance knowing that you put up that blue light in the corner. If you are not a theater major and the GPA matters a lot (premeds, for example), I would recommend it with some reservations. Be sure that you can put in a lot of work hours and see the prof. often. If you go into the class with an open mind and a serious work ethic, I think it would be a very unique and enjoyable experience.\"",
            "review 8: \"05W with Daniel Kotlowitz: I loved this class. The art of lighting design is really exciting and Professor Kotlowitz teaches it well. The class never got boring and the projects we worked on were continually fun and challenging. Professor Kotlowitz formed a really friendly relationship with the whole class but was never afraid to push us or kick us in the ass when we needed it. Take this class if you're at all interested in lighting design or theater in general.\""
        ]
    },
    "THEA043": {
        "Georgi Alexi-Meskhishvili": [
            "review 1: \"05S with Georgi Alexi-Meskhishvili: Amazing course, amazing prof., worth the work!\"",
            "review 2: \"02S with Georgi Alexi-Meskhishvili: Take this class. I was never interested in set design until I had to take another 2 courses for my minor and Georgi's courses were available and relevant. There should be more of this course. Take this class and then do an independent study or something... I wish I weren't a senior, because I don't think I'd ever stop taking this class. If I had taken this class as a freshman I'd probably be a theatre major instead of a minor now... You build 3 sets during the term and critique them at the end. It does require long hours in the design studio a lot of the time, but it's entirely worth it and building the little sets is a lot of fun. Georgi is the best prof I've had at Dartmouth, and this is by far my favorite class ever.\""
        ],
        "Michael Ganio": []
    },
    "THEA042": {
        "Georgi Alexi-Meskhishvili": [
            "review 1: \"08W with Georgi Alexi-Meskhishvili: Awesome class. Take it.\"",
            "review 2: \"05W with Georgi Alexi-Meskhishvili: The course was amazing, the prof. is awesome, and the work is enjoyable.\""
        ],
        "Michael Ganio": [
            "review 1: \"21F with Michael Ganio: I cannot recommend this class enough. If you're a theater major, minor, or just need an arts distrib, this class is fantastic. Michael is great! The class consists of 3-4 models that take ~5 hrs to build each (but it's pretty much just arts and crafts). Really fun time!\""
        ],
        "Lawrence Moten": []
    },
    "THEA041": {
        "Kathleen Cunneen": [
            "review 1: \"22F with Kathleen Cunneen: Kathleen is the kindest person at Dartmouth. This class is a lot of work, but it's often very fun. She teaches most of the classes in the rehearsal room and in various theaters at Dartmouth. She brings snacks to class— and I mean every single class. She is truly the sweetest person. She requests that we call her by her first name and offers to listen and advise on any problems that we have. Take this class if you want to smile every week at Dartmouth.\"",
            "review 2: \"21W with Kathleen Cunneen: I love this class! I already knew I loved stage management and theatre, but the class is also perfect for any experience level. I took it remotely, and I wish we had an in-person show to stage manage, but it was ok. Kathleen is amazing, and she really cares about all of her students. Take this class if you have any interest in theatre or want to develop management skills in general. The workload this term was probably a lot different than a normal term with an in-person show, but homework was mostly going to rehearsals and working on documents related to the show. The work didn't usually feel like work, and it was a generally relaxing class where you learn a lot of practical skills.\"",
            "review 3: \"03F with Kathleen Cunneen: This course is great for anyone who really wants to learn how to stage manage a show well. I had some prior stage management experience before taking this course, but Kathleen brought me to an entirely new caliber of stage management. She is also very understanding and could easily teach someone with little or no experience how to effectively stage manage a show. Beyond that she's just a great person! I recommend this course, but only for people who are really able to commit to it. This takes a lot of time and shouldn't be entered into lightly. But it is a great class and you are certain to learn a lot by taking it!\"",
            "review 4: \"03F with Kathleen Cunneen: Kathleen is a wonderful professor to work with and just basically a great person to know. This course required a LOT of rehearsal time outside of class, and had my two other classes not been so easy to handle, I might have found myself struggling with the time commitment. The work was never difficult and usually fun, and the experience of taking this class was nothing less than absolutely great.\"",
            "review 5: \"03F with Kathleen Cunneen: This course was one of the best I've taken at Dartmouth. I wish I'd taken it earlier. First the course: The basic thing that was done was stage managing the mainstage production of the Department of Theater - this term it was Arthur Miller's \"A View From the Bridge\" - directed by visiting director Jackson Gay. What does that mean? Well - as you'll learn by taking this class - the nutshell version is that we created a safe, supportive environment to allow the process of making theater possible - through communication and organization . That's just an inkling of all the stuff that you do through the class. If you take this class, be prepared to attend many rehearsals, production meetings, etc - the class didn't meet all the time when alloted, some days we just went to rehearsal instead. Rehearsal is generally Su-Fri 7-11 (with some time before and after for setup/takedown). Class met 6-7:30, m, tu, thurs, in theory. \"Tech Week\" for the show is quite time consuming - plan ahead. It can involve 12-18 hours on a single weekend, followed by evenings later on. The good news is that there's little actual reading - one book which is assigned early on in small pieces that is an easy (and I think) interesting read. I don't think the class particularly cared for it though. There's also reading the play (a couple times) to become familiar with it. A few small assignments in the beginning. And weekly \"journal-things\" to keep track of your progress. There's a final project - in the last weeks of the term, after the mainstage, another play is read, and we basically did the paperwork and preparation for it. It can be somewhat time consuming and the idea of assigning it earlier on in the term was brought up. The course gives a great overview of not just what stage management is and how to do it, but also how the department works, the people in it, and the process of the mainstage. Finally - the best part, perhaps, is meeting and spending a lot of time and going through the stage management process with Kathleen, and the people with your class. You really all get to know each other and get a great mentor in the process. You also learn a lot about yourself, your management style, and so on.\"",
            "review 6: \"01F with Kathleen Cunneen: Theater 41 was a class that I took my first term at Dartmouth, and I can't imagine having the great experience here that I did without having taken the class. For one thing, most of my friends are involved in the theater department and were involved with \"As You Like It\" (the play we stage managed in Fall 01), and thus I met them through taking this class. We were very lucky in that all six of us (that's right, it's a very small class) in the class clicked, and worked togethery happily and productively. The course was interesting and extraordinarily helpful if you have any interest in theater, since you automatically get to know the ins and outs of the department, and you also learn about all of the jobs that go on in order to create any sort of show. The readings were just as interesting and helpful as Kathleen, herself, and there wasn't even that much of it - most of the work, and there was a LOT of it, was in the form of going to rehearsals, creating lists and other paperwork, and doing other various work for \"As You Like It.\" As fo Kathleen, I only wish that I could give her something higher than A+. More than anything else, she made the class the relaxed, loving, fun experience that it was, and she taught us by making us do things, instead of just lecturing to us. A professional stage manager with years of experience, she knew everything there is to know about the job, and communicated that knowledge to us extraordinarily well. And as for developing a personal relationship with a professor - rest assured, by the end of the term, you will, by the very nature of the class. Overall, a class I would recommend to anybody who is willing to put in the work - if you can't commit to spending quite a bit of time, most of it in the evening (the class meets from 6:30 - 7:00, and all rehearsals are from 7:00 - 11:00), then it's not the class for you, since everybody needs to pull their weight in order to make the class a success.\"",
            "review 7: \"01F with Kathleen Cunneen: This class was a lot of fun and unlike any other class i've taken at dartmouth. We really got a chance to work closely with and get to know the other students in the class and the prof. Yes, it is a big time commitment in the evenings, but 4 hours of rehearsal is much better than 4 hours of reading or doing a problem set. I would recommend this class to someone whether they're a major or not.\""
        ]
    },
    "THEA040": {
        "Scott Silver": [
            "review 1: \"08W with Scott Silver: But easy enough. The course material is simple and fun, and it's a great way to try your hand at basic technical theater. Scott Silver is a funny and easygoing prof, but is no-nonsense when it comes to business. He lays out the requirements of the course right away, and if you don't fulfill them you won't do well. Simple as that. A lot of out-of-class time is required in the shop, but all it takes a few hours every day or every other day and you'll easily meet the requirement. Plus, building sets is fun, and you learn a lot about design and construction, if you're in to that at all. Definitely a good class to take, a pre-req for the major, and fun for all.\"",
            "review 2: \"08W with Scott Silver: Looking for an ART and not artistic? Take Theater 40 with Scott. Hands down one of the best courses I have taken at Dartmouth. Scott, Joel, and Carl are great in the shop and Scott gives fine lectures. It's a theater course for everyone. Nerds, jocks, thespians and collis crunchy hippies alike. The tests are preposterously easy if you take notes in class and have access to the book. Literally I think I spent a combined 37 minutes on both take home exams. Shop hours = your grade (don't ever skip class or....you fail). 50 hours = B, 75 hours = A. Now, that's kind of a chafe (lord knows I haven't spent close to half that in any of my other courses in 4 years) but working the mainstage or building in the shop is pretty relaxing. Take the class. As Carl says, you'd have to be a f***ing idiot to not get an A.\"",
            "review 3: \"08F with Scott Silver: I took this course because I was interested in the material. Only later did I discover that you could learn the same things by getting a job in the theater shop. The class is not a lot of work (mental, maybe physical as you have to do a certain number of hours in the shop). The two exams are take home open book and if you take any notes, you'll be fine. Apparently, if you do loads of hours in the shop, you can also get a citation.\"",
            "review 4: \"08F with Scott Silver: This was the last class for my minor and I didn't really want to take it. I heard it took a lot of time and I didn't think I would really like building sets. Now that it's all said and done though, I am so glad I took this course! I learned a lot about the shop and it was a really nice change of pace from normal academic classes. Prof Silver is very knowledgeable and funny. He expects a lot, but tries to make it manageable. Take it!\"",
            "review 5: \"07W with Scott Silver: Scott's a lot of fun and the material is interesting - it's more than manual labor for a grade. Working on the mainstage is a really great experience.\"",
            "review 6: \"07F with Scott Silver: The course does have shop hours instead of homework (mostly) and there is a double standard for majors/non-majors that can be hard on majors participating in the mainstage. But Scott is so excited about the class, and so happy and energetic in general, that it is a wonderful way to start the day. And if you do enough shop hours, your test scores don't really matter.\"",
            "review 7: \"07F with Scott Silver: Surprisingly fun. You have to put in a lot of hours working in the scene shop, but other than that there are only 3 assignments that you have to do and they're pretty easy. Working in the shop can be fun-- though there's definitely a lot of grunt work too.\"",
            "review 8: \"06W with Scott Silver: Even if you don't know much about theater this is a great class. In the words of the master carpenter Carl, \"You have to be a dumbass to not get an A in this class\". If you stay on top of your work hours outside of class you are almost gaurenteed an A. The tests are open book, open note, and if you stil can't find it you can ask anyone and cite them. There is no reason to not take this course for your art credit.\"",
            "review 9: \"05S with Scott Silver: You will learn EVERYTHING in this class. The profs are fantastic and will teach you all they know about theater and life. It's just a great class overall. Take it even if you are not a theater major.\"",
            "review 10: \"05F with Scott Silver: This class is no Joke! Although the in-class work is pretty simple! The In-SHOP Theater Lab takes time. Try at least 75 hours of your time. Nevertheless, if you want to learn alot about what goes on behind the scenes in Theater and if you want to leave a Dartmouth Course with that warm and fuzzy rewarding feeling, this could possibly be the course for you. I came into the course ignorant of almost everything when it comes to onstage and backstage theater. After leaving the course, I not only have a profound knowledge of what actually takes place behind stage, but I have a thorough understanding on how to use practical handy tools and power tools to create almost anything. Also I have definitely learned how to be quick on my toes.\"",
            "review 11: \"04S with Scott Silver: Lots of outside work - most of your \"homework\" is putting hours in at the shop - but it's fun. Profs are helpful and willing to teach students. Guaranteed good grade if you put in the hours.\"",
            "review 12: \"04F with Scott Silver: This course is not a \"gutt class\" as many think it is. True, it is not very difficult to get a good grade in the class but the hours you will spend in the workshop completely make up for the simple take-home open-book exams and the single assignment/project. The course is definitely a great way of learning a bit about everything involved in putting together a mainstage production (not just the technical aspect); the lectures are simply overviews but they tie in nicely with almost everything you will be doing for the mainstage so that at the end of the term you really feel that you can speak to anyone about theater production. A great intro course for anyone even remotely interested in theater. Also, a great way to balance a stressful courseload - those hours in the workshop, thinking of nothing but wood, paint, and softgoods is a great way of taking ones mind off other mundane school stuff.\"",
            "review 13: \"04F with Scott Silver: This a probably one of the best \"hands-on\" classes at Dartmouth. You learn all aspects of the technical work that goes into theater productions - which are essentially things like woodworking, lighting, painting, set design, stage crew, etc. The class is very easy but you need to spend at least 50 hours over the term working in the shop or doing stage crew (and about 75 hours will get you an A). Your grade is based almost entirely on your hours in the shop and how productive you are while you're there. Just beware that even though it's an easy class, the shop requirement will take up the bulk of your free time during the term.\"",
            "review 14: \"04F with Scott Silver: The trick to this class is the 70 hours of shop time you need to log either by building the mainstage set or by doing backstage work during the show. Get started on it early. Other than that there was one homework assignment where we drafted our dorm rooms, and two open-book take home exams which were really easy if you went to class. Scott's an awesome prof and I recommend the class even if it's the only one you take in the department (it is for me).\"",
            "review 15: \"04F with Scott Silver: lots of fun. Its required for the theater major/minor, but its also very interesting. Everything is hands on. Lots of work with powertools, lumber, construction, artwork etc... The book is kinda worthless except for the take home midterm and final. Go to the lectures. 60% of your grade is out of class work in the production shop. Basically, if you do everything else, and put in about 75 hours for the term in the shop, you'll get an A.\"",
            "review 16: \"04F with Scott Silver: scott, carl, and matt are possibly the coolest people you'll ever get to work with at dartmouth. Take the class, I even think it gives you an art credit. Good times.\"",
            "review 17: \"04F with Scott Silver: This class is a shop class. Take it. Scott and Carl are the shit.\"",
            "review 18: \"03F with Scott Silver: Overall a great intro class to theatre and art in general. The prof was fair and likeable. the class really gives an appreciation for the arts and all those involved behind the scenes in the theatre. such a fun, rewarding term. take the class for sure.\"",
            "review 19: \"03F with Scott Silver: This course is all about spending hours in the shop. You get to hammer stuff, paint stuff, and generally have a good ol' time with tools and two of the best guys you'll meet in your time here- Scott and Carl. The reading is minimal, and the tests are great as long as you go to class. Not for wimps- be ready to get your hands dirty!!\"",
            "review 20: \"02S with Scott Silver: I have never done any theater related stuff before, but this class was awesome. Your grade is based almost entirely on whether or not you complete your shop hour requirement (50 hours for the term) and it's really fun. You get to take ice cream breaks, and the theater people aren't all that weird. and you play with tools and heavy machinery. Take the class!!\"",
            "review 21: \"02S with Scott Silver: The most challenging part of taking Theater 40 is the shop requirement. Your grade almost completely reflects how much time you spend working in the scene shop and how effective and enthusiastic you are when there. Being interested in building and stagecraft is necessary to get through the 50+ hours in the shop. I loved it, but if you don't want to put that kind of time in, you won't enjoy the class nearly as much.\"",
            "review 22: \"02S with Scott Silver: This was an all-around awesome class. This is a great introduction to the world of theater production from a non-acting, sort of atypical side of things. The majority of your grade is based on whether or not you complete the required time in the scene shop (“fishbowl” by the HBs) satisfactorily – and to do this, you will need to start early on in the term, and be sure to plan to have your hours done by the last show of the term, when that’s done, there are basically no more hours left (and it comes quickly). It appeared to me like running a show – light board, sound board, or ‘running crew’ would have been a good way to get hours out of the way quickly, and easily, if you can make that time commitment. Carl Choquette, who is the master carpenter helps with a lot of the stuff in the scene shop, although he’s not a prof. Both Carl and Scott REALLY know this stuff cold and are experts in the craft. They really inspired me in terms of theater. I wish I could’ve taken more theater courses while here. Stage management sounds really interesting. The exams were quite easy – take home, open book, open note. There were a few quizzes, didn’t seem to count for much and they were easy. And you get to use big (and small) tools, learn to do stuff that is just useful in general. Get a good night sleep before strike, though.\""
        ],
        "Jason Merwin": [
            "review 1: \"21F with Jason Merwin & Brianna Parry: I absolutely loved this class and would take it again if I could. Unlike the other reviews, only 60ish hours in the costume shop or scene shop (or working tech on a show) gets you an A in the course (there's no hard limit, just put in some good effort and that's the number Jason estimates to be a fine enough amount in the shop), and there are very few homework assignments. I strongly disagree with the comments about Jason being rude or mean, he is one of the coolest people I have ever met. He's the technical director here, and if you've ever met a good and professional TD who is fluent in sarcasm, it's Jason. Bri is new to the department as of the pandemic and is super on top of things. She's really great about listening to students and working to improve the department. Both Jason and Bri make it clear that they love their jobs and are here for the students. You get to see them have fun working in their element in the shop hours, so try to get as many of those in as you can. Theyre also pretty reasonable about flexibility of grading and attendance. Theyve also changed up the policies for the class so that when you do work in the shop, it's only on show-related tasks (like building a set, gathering props, installing and focusing lights, the things you read about in class but now in a hands-on opportunity). If you have any experience backstage (or even onstage and you've payed any attention to what's happening around you), this class is a breeze. I recommend scheduling regular hours to be in the shop each week rather than trying to change it up all the time – I went with 9-1 Tuesdays and Thursdays with one day in costumes building a dress and the other day in the shop doing light hang and strike. While there are a few powerpoint lectures, Jason and Bri really dislike talking at students so they always open class with a weird intro question and some discussion. It really helped me to get to know my peers, and I've found some really great friends in this class. As long as you can mange your schedule with the hours properly, this is most definitely a layup (again, fewest homework assignments I've ever seen). There are no papers or exams, there's just one day at the end of the term where they give you hands-on tasks we talked about in class (and practiced in class too) to show that what they've taught has stuck. That's the final – playing in the scene shop and showing you remember what happened. They have a review day for people to ask questions and recover anything folks might have missed. X hour is not used. As a theater major, this was my first theater class with the department due to covid, and I loved it. 100% would recommend – it's a great way to jump into the department because everything you learn is taught by Jason and Bri and then demonstrated by the person in charge of that within the department, so we met the master electrician, the master carpenter and rigger, the cutter/draper and head of costumes for our day downstairs, and of course the TD and Production Manager (Jason and Bri respectively). Have a good time, don't be afraid to joke around, and don't forget to ask everyone about their crazy theater stories – they have some good tales to share.\"",
            "review 2: \"21F with Jason Merwin & Brianna Parry: This class is definitely a layup. All you need to do is go have fun during the required shop hours. You only need to work 60-65 hours in a term in a scene shop or costume shop to have an A. Bri and Jason are great instructors; they ask funny questions at the beginning of each class and that might seem funny and unrelated, but it really helped us to create a space where everyone's answer is respected. Bri is always open to student feedback. She wants to hear from students about how to better create the learning environment or improve the theatre department. Jason is just funny. No other explanations are needed. Although the main instructors are Jason and Bri, Scott, Janine, and Anna - assistant tech director (carpenter), master electrician, and costume shop manager - take part in the class. You will interact with them a lot during your shop hours and they are also really friendly and nice. If you have never done theatre-related activities, it's totally okay, you will learn a lot and still have fun. Some students even decide to become work-study students in the scene shop after taking this class. I am not a theatre major student, but I would still recommend this class for everyone if they are looking for any layup courses or just to have fun and enjoy part of being the theatre department.\"",
            "review 3: \"20X with Jason Merwin: I'm a theater major so I knew the workload for this class. This class is 10 times less work on zoom and it's a lot of lectures and a few hands-on projects. The information is only really useful if you are seeking a career in theater or want to get involved in the scene shop on campus. Jason and Jenn tried really hard to make this class engaging and they succeeded most of the time (there were a few bland powerpoints). Definitely recommend taking the zoom version while you can to avoid the hours of workload for this class. I wouldn't recommend if you aren't a theater major or minor unless you are really interested in the course material.\"",
            "review 4: \"19S with Jason Merwin: If you need an art distrib, take drawing 1 or a different thea class instead. fr. Don't take this class...unless you are a theater major or minor. Well. Rip. Sucks to be you. This class made me contemplate whether or not I wanted to major in theater. This class was THAT bad. It's just a lot of hours and honestly...a waste of my time. Sometimes I did work that wasn't for any of the theater production. Jason is intimidating and he is not nice. I didn't like him at all. If you can, and if you know how to sew, try to fill all your hours at the costume shop. Costume shop ppl are nice and wonderful. Just like what someone else said, you are basically a free manual laborer for them. Not to mention, they basically lecture at u while clicking through a POORLY made powerpoint...it's just the worst. Make sure you bring your laptop to class so you can at least somewhat escape from the misery. Don't take it. If you have to take it, try to get on their good side and laugh at their jokes.\"",
            "review 5: \"19S with Jason Merwin: 75 hours of work in the shop means it is a guaranteed A, but it's also a lot of time. It's harder to take it Spring term because there is usually no big production, so you have to be in the shop during weekdays from 9 - 5. It can take a LONG time to get the 75 so if you HAVE to take the class, I'd recommend taking it in the Fall or Winter where there is a larger production, which will get you an automatic ten hours during strike compared to the three hours we got in Spring. There are also a lot more opportunities to earn hours outside of the 9-5 when there is a big production. Some of the people in the shop and costume shop are wonderful and really friendly, but Jason and Scott (especially Scott) are intimidating people and not very nice. Class has useful/interesting information sometimes, quizzes are take home so you can find answers online. Take it if you are a major/minor and need to, or if you really love building things and working on sets, but otherwise if you're just here for an art distrib you're better off taking another course.\"",
            "review 6: \"18F with Jason Merwin: A very good class if you are willing to put in 75 hours of manual work. Beware, 75 hours in a 10-week term is a lot. IT'S A LOT. Good for an Art Dist. Jason is not the kindest person in the world, and I did not like him. I found it fun to work in the theater, many of my friends did not. We are like free manual laborers for the Theater department as ALL theater majors have to take this, and it is offered every term. If you are willing to put in 75+ hours of work in the term, sit through the boring classes (you can just do your homework), and do 5 easy quizzes (one hour timed, open book), you are guaranteed an A. Fun class, would recommend.\""
        ],
        "Jason Merwin & Brianna Parry": [
            "review 1: \"21F with Jason Merwin & Brianna Parry: I absolutely loved this class and would take it again if I could. Unlike the other reviews, only 60ish hours in the costume shop or scene shop (or working tech on a show) gets you an A in the course (there's no hard limit, just put in some good effort and that's the number Jason estimates to be a fine enough amount in the shop), and there are very few homework assignments. I strongly disagree with the comments about Jason being rude or mean, he is one of the coolest people I have ever met. He's the technical director here, and if you've ever met a good and professional TD who is fluent in sarcasm, it's Jason. Bri is new to the department as of the pandemic and is super on top of things. She's really great about listening to students and working to improve the department. Both Jason and Bri make it clear that they love their jobs and are here for the students. You get to see them have fun working in their element in the shop hours, so try to get as many of those in as you can. Theyre also pretty reasonable about flexibility of grading and attendance. Theyve also changed up the policies for the class so that when you do work in the shop, it's only on show-related tasks (like building a set, gathering props, installing and focusing lights, the things you read about in class but now in a hands-on opportunity). If you have any experience backstage (or even onstage and you've payed any attention to what's happening around you), this class is a breeze. I recommend scheduling regular hours to be in the shop each week rather than trying to change it up all the time – I went with 9-1 Tuesdays and Thursdays with one day in costumes building a dress and the other day in the shop doing light hang and strike. While there are a few powerpoint lectures, Jason and Bri really dislike talking at students so they always open class with a weird intro question and some discussion. It really helped me to get to know my peers, and I've found some really great friends in this class. As long as you can mange your schedule with the hours properly, this is most definitely a layup (again, fewest homework assignments I've ever seen). There are no papers or exams, there's just one day at the end of the term where they give you hands-on tasks we talked about in class (and practiced in class too) to show that what they've taught has stuck. That's the final – playing in the scene shop and showing you remember what happened. They have a review day for people to ask questions and recover anything folks might have missed. X hour is not used. As a theater major, this was my first theater class with the department due to covid, and I loved it. 100% would recommend – it's a great way to jump into the department because everything you learn is taught by Jason and Bri and then demonstrated by the person in charge of that within the department, so we met the master electrician, the master carpenter and rigger, the cutter/draper and head of costumes for our day downstairs, and of course the TD and Production Manager (Jason and Bri respectively). Have a good time, don't be afraid to joke around, and don't forget to ask everyone about their crazy theater stories – they have some good tales to share.\"",
            "review 2: \"21F with Jason Merwin & Brianna Parry: This class is definitely a layup. All you need to do is go have fun during the required shop hours. You only need to work 60-65 hours in a term in a scene shop or costume shop to have an A. Bri and Jason are great instructors; they ask funny questions at the beginning of each class and that might seem funny and unrelated, but it really helped us to create a space where everyone's answer is respected. Bri is always open to student feedback. She wants to hear from students about how to better create the learning environment or improve the theatre department. Jason is just funny. No other explanations are needed. Although the main instructors are Jason and Bri, Scott, Janine, and Anna - assistant tech director (carpenter), master electrician, and costume shop manager - take part in the class. You will interact with them a lot during your shop hours and they are also really friendly and nice. If you have never done theatre-related activities, it's totally okay, you will learn a lot and still have fun. Some students even decide to become work-study students in the scene shop after taking this class. I am not a theatre major student, but I would still recommend this class for everyone if they are looking for any layup courses or just to have fun and enjoy part of being the theatre department.\"",
            "review 3: \"20X with Jason Merwin: I'm a theater major so I knew the workload for this class. This class is 10 times less work on zoom and it's a lot of lectures and a few hands-on projects. The information is only really useful if you are seeking a career in theater or want to get involved in the scene shop on campus. Jason and Jenn tried really hard to make this class engaging and they succeeded most of the time (there were a few bland powerpoints). Definitely recommend taking the zoom version while you can to avoid the hours of workload for this class. I wouldn't recommend if you aren't a theater major or minor unless you are really interested in the course material.\"",
            "review 4: \"19S with Jason Merwin: If you need an art distrib, take drawing 1 or a different thea class instead. fr. Don't take this class...unless you are a theater major or minor. Well. Rip. Sucks to be you. This class made me contemplate whether or not I wanted to major in theater. This class was THAT bad. It's just a lot of hours and honestly...a waste of my time. Sometimes I did work that wasn't for any of the theater production. Jason is intimidating and he is not nice. I didn't like him at all. If you can, and if you know how to sew, try to fill all your hours at the costume shop. Costume shop ppl are nice and wonderful. Just like what someone else said, you are basically a free manual laborer for them. Not to mention, they basically lecture at u while clicking through a POORLY made powerpoint...it's just the worst. Make sure you bring your laptop to class so you can at least somewhat escape from the misery. Don't take it. If you have to take it, try to get on their good side and laugh at their jokes.\"",
            "review 5: \"19S with Jason Merwin: 75 hours of work in the shop means it is a guaranteed A, but it's also a lot of time. It's harder to take it Spring term because there is usually no big production, so you have to be in the shop during weekdays from 9 - 5. It can take a LONG time to get the 75 so if you HAVE to take the class, I'd recommend taking it in the Fall or Winter where there is a larger production, which will get you an automatic ten hours during strike compared to the three hours we got in Spring. There are also a lot more opportunities to earn hours outside of the 9-5 when there is a big production. Some of the people in the shop and costume shop are wonderful and really friendly, but Jason and Scott (especially Scott) are intimidating people and not very nice. Class has useful/interesting information sometimes, quizzes are take home so you can find answers online. Take it if you are a major/minor and need to, or if you really love building things and working on sets, but otherwise if you're just here for an art distrib you're better off taking another course.\"",
            "review 6: \"18F with Jason Merwin: A very good class if you are willing to put in 75 hours of manual work. Beware, 75 hours in a 10-week term is a lot. IT'S A LOT. Good for an Art Dist. Jason is not the kindest person in the world, and I did not like him. I found it fun to work in the theater, many of my friends did not. We are like free manual laborers for the Theater department as ALL theater majors have to take this, and it is offered every term. If you are willing to put in 75+ hours of work in the term, sit through the boring classes (you can just do your homework), and do 5 easy quizzes (one hour timed, open book), you are guaranteed an A. Fun class, would recommend.\""
        ],
        "Jennifer Hard": [
            "review 1: \"19F with Jennifer Hard: Worst layup ever. Actually, not a layip at all. The class is gruntwork—you have to do the most menial and laborious tasks. 75 hours over the course of the term if you want to get an A. The treatment is miserable and the work is not worth the grade. The professors teach at different points in the term and the class is disgusting. People who say it is a layup are theater majors who enjoy doing the gruntwork and production. Don't take it. Even if you get the 75 hours, you are not guaranteed the A, as myself and friends got an A- even after getting so many hours of work in.\""
        ],
        "Brianna Parry": []
    },
    "THEA036": {
        "James Rice": [
            "review 1: \"21S with James Rice: PROF RICE IS PURE HEART OF GOLD, take the class!! I'm an engs student and took the class remotely, but it's still by far my favorite class at Darty! Prof Rice is the warmest, most caring prof you can wish for -- and an expert in his field. He's the genius of creating safe spaces: his philosophy is that when everyone is a fool, no one is a fool. It's a small class of 10 people and I was amazed how closely we got to know each other and how safe we felt to be vulnerable. --- The class is about freeing up your natural voice, we did a lot of breathing and voice exercises, and there are presentations -- like 3-minute self-presentation, giving a political speech, telling a silly fairy tale, etc. At the end of the class, there's a big performance/presentation for friends. --- This class changed me a lot. TAKE IT!\"",
            "review 2: \"19S with James Rice: Great class that just gives you an opportunity to reflect tons. None of the work is difficult but there are small presentations and you are required to write a short reflection on every day of class. Would definitely recommend this class to anyone. It's great if you're taking some harder classes and you need time to decompress.\"",
            "review 3: \"17W with James Rice: As a 10A, I honestly did not like doing stretches and vocal exercises for a whole HOUR. I also did not like meeting with him outside of class to do the extra vocal work. The second hour during class is always fun. I did not like having to memorize a Shakespeare sonnet, but if you break it down and rehearse by yourself, it's not bad at all! I took Acting 1 with Rice and I think he's super nice! You don't have to do the reading, but its hard to BS the journal. Please make a note about what happened after EVERY class so that you won't be stuck and overwhelmed trying to reflect on the days when you have to turn your journal in. Please. He actually does read them! Easy A though. -gdp\"",
            "review 4: \"08W with James Rice: There's no way I can do justice to James Rice or his class in the space of this review, but working with him and taking this course has changed me in a huge way. It's an incredible experience, an opportunity to learn so much about yourself and your classmates in the span of ten weeks. Probably the best class I've taken at Dartmouth.\"",
            "review 5: \"08W with James Rice: This class was the best class I've taken so far at Dartmouth. I was originally unsure of what it was going entail but I quickly realized that it was challenging yet lots of fun. You learn where your voice comes from, how it is shaped on your experiences. Professors Rice and Dunne (who took over halfway through the course) are awesome and really show you how your voice comes through in real life. I definitely would recommend this course for anyone who needs an ART distrib or who is generally interested in learning about how the voice works! I have learned more about myself in this class than through the 4 previous terms that I have been here at Dartmouth.\"",
            "review 6: \"07W with James Rice: This class is great. I really invested a lot into it-and it helped me out a lot. You focus on your voice and have to be very introspective during the class to gain awareness of yourself and your voice. As a non theater person I thought it was a great class because the assignments weren't too difficult but still challenged me. I can honestly say that Professor Rice cared about the students and wanted us all to do well. I reccomend this to everyone-majors and non majors. In the absence of a speech department this class is really helpful.\"",
            "review 7: \"06W with James Rice: There was a lot of really easy written work assigned and a lot of vocal work assigned, but it was all worth it. In the end, I found that everyone in the class had significantly improved in speech and voice. You'll learn how to improve, how to project, how to create, how to rehearse, and how to make a speak passionately in character or in everyday life. Great Course. Thorough Course. A Solid Dartmouth Experience.\"",
            "review 8: \"06W with James Rice: The course is very interesting. We covered from body relaxation to breathing and from vibration of voice to reading Shakespeare Sonnets. Prof Rice is very nice and patient with students and his tutorials really help. Excellent and pragmatic course for a non-Thea major/minor who wants to satisfy Arts requirement.\"",
            "review 9: \"05W with James Rice: Wonderful class! Inspiring and well taught. Not too much work, just something you need to keep up with. Assignments aren't difficult, just take the willingness to be open and do the work. Class content can be inspiring and lead to soul-searching if the student allows it to be.\"",
            "review 10: \"05W with James Rice: easy class.\""
        ]
    },
    "THEA032": {
        "Timothy Hackett": [
            "review 1: \"08S with Timothy Hackett: Great class -- I definitely feel like it's helped me grow as an actor.\"",
            "review 2: \"05S with Timothy Hackett: If you are an aspiring actor or director you MUST take class with Peter Hackett for two reasons: (1) in terms of advanced scene study, he is the best professor here; (2) he will be chair of the department in a few months and is a permanent fixture in the department, so you will get to know him well. He has great insights into plays - their staging, background, the intentions of the playwright - great presence, and has a way of inspiring everyone and raising the level of their performances. The class itself is wonderful. Each Wednesday you write a half-page play report/character spine on plays ranging from Checkov's farces to modern Pulitzer Prize winning plays. You do three scenes in your nine or so weeks together, each done in three weeks: first reading, first staging, second staging. I can't stress enough how much you should take this with Peter if you are serious about acting.\"",
            "review 3: \"05S with Timothy Hackett: For anyone who has taken Acting I and II, and wants to have a phenomenal experience in advanced acting techniques with a phenomenal and brilliant professor, take Peter Hackett's Acting III course in the spring. Hackett is an experience profession, who is responsive to the needs of students, a relaxed and approachable professor who takes his job as a professor and a member of a larger theater community with the utmost clarifty of purpose and sincerity. In his class you will be exposed to the works of Mamet, Ionesco, Chekhov, as well as a broad range of plays to take home and read over from Susan Lori-Parks' \"Topdog/Underdog\" to Caryl Churchill's \"Far Away.\" An essential and enjoyable course for minors and majors, as well as those who have taken Acting I and II, and are looking for an enjoyable challenged with an inspirational professor.\""
        ]
    },
    "THEA031": {
        "Carol Dunne": [
            "review 1: \"08W with Carol Dunne: Good class, but be prepared to do quite a bit of work outside of class.\"",
            "review 2: \"08W with Carol Dunne: A great class with a great teacher. So much fun, and I've grown a lot as an actor during this course. Whatever your background/interest in theater is, if you have the chance to take a class with Carol Dunne, you should.\"",
            "review 3: \"08W with Carol Dunne: Carol is the most wonderful, inspiring, and fun theater teacher this (and possibly any) department has. She is so good at getting the best work out of you, and never in a mean or bullying way, does not play mind games (as some theater people do), keeps class fun and laid back, and yet really expects the best out of all of us, and because we all love her, we do our best without her having to make us. And she's also great into figuring out each student's needs and working through that to a deeper understanding of the text, the character, and themselves as actors. Wonderful. I've learned more from Carol (in my various encounters with her) about myself as an actor and director and thus grown than in any other theater experience.\"",
            "review 4: \"08W with Carol Dunne: I can't say enough good things about this class. Carol is amazing-- really caring and supportive of her students. She really fostered a lovely atmosphere in the classroom so no one was ever self conscious or uncomfortable in the work that we did. Fabulous, fabulous class!\"",
            "review 5: \"06W with Carol Dunne: All I can really say is \"Wow!\" Carol is a spectacular person, teacher, and actress. She has so much depth and insight. She always knows what to do to push you and make you a better actor. From the first day of class, Carol makes sure to create a warm and nurturing environment, so you can feel free to explore and experiment with your character. She is a very positive person who knows exactly how to conduct her class and interact with her students.\"",
            "review 6: \"06W with Carol Dunne: I love Carol. She's amazing. I learned so much under her, and feel as though I really grew as an actor under her tutelage. She is also very available. I don't know how many times I contacted her to ask for extra advice, and she always made time for me.\""
        ],
        "James Horton": [
            "review 1: \"07S with James Horton: This has been one of the best classes I have taken at Dartmouth. Besides being extremely enjoyable, any student of acting can learn so much from this class, particularly from Professor Horton. Professor Horton is an accomplished actor and director himself, and his skill in getting the most out of his students is evident because of this. His enthusiasm for the subject and just general good humor made every class a joy to go to, and he knows how to get down to business while still having a good time. And it showed: every student--of all experience levels--in the class showed marked growth by the end of the term. The readings were well chosen, and though there was a decent amount of reading to do, it was not unmanageable. Some extra rehearsal time was required outside of class (usually 2-3 hours a week after the midterms). And the course was a little top-heavy. No papers or exams, just presentations and scene work, which were generally fun to do, and very helpful feedback was always given. Journaling could be a bit tedious at times, but it did provide you a nice outline of the creative process throughout the term. If anything, it was a small price to pay for an amazing class. If you can take this class with Professor Horton, do it. Really, a wonderful course, recommended for anyone with an interest in acting.\"",
            "review 2: \"07S with James Horton: Take this class. Prof Horton is an incredibly knowledge, sensitive, helpful prof. I learned so much in this class. Take it.\""
        ],
        "James Rice": [
            "review 1: \"07W with James Rice: In order to really benefit from this class you have to be willing to do some work beyond what is assigned. Art cannot be spoon fed and by acting II actors should be taking it upon themselves to find their own techniques. As long as you take some initiative this class is awesome!\"",
            "review 2: \"07W with James Rice: If you took Acting 1 with Rice, expect similar exercises this time around. 90 second intro, etc. It is a deeper study of acting, but I feel like I didn't learn that much more than Acting 1. He always runs over time-EVERY freakin class. He has no concept of time and we were a little behind on the syllabus as the term wore on.\""
        ],
        "Mara Sabinson": [
            "review 1: \"05W with Mara Sabinson: For majors: if you want to act, you need to get through acting II. Get through it with Mara, that's the best I can offer. The class is painfully slow, Mara rarely participates in the warmup work or any exercise, and she expects everyone to know what to do before she gives instructions. She is brutally honest, which I admire, but in this setting she ruthlessly stifles creativity. She loves to hear herself talk and simple explanations turn into hour long discussions. During scene work, she helpful with blocking and things of those sorts; she would make a good director, but sucks as a teacher of acting. For those who are dabbling in theater: seriously quesiton if you want to do this course on a whim - it may save you many painfully boring hours. Nice enough person, probably a good director, but terrible acting prof.\""
        ],
        "Paul J.": [
            "review 1: \"02W with Paul J.: Paul is a wonderful teacher and a great guy. I learned so much from this course. I grew so much as an actor. Big recommendation.\""
        ],
        "Christian Kohn": [],
        "Keith Coughlin": [],
        "Timothy Hackett": []
    },
    "THEA030": {
        "James Rice": [
            "review 1: \"21F with James Rice: I loved this class! I had taken some acting classes before but not many but honestly you don't need any experience. The activities and techniques we were taught were super interesting, although it might have seemed a little useless at the time ( I assure you they are not). It is also such a nice class to meet new people. You become very close with every single person in your class, and all of you become one big family. Professor Rice is very nice and an amazing theatre professor. He will make class very fun and uplifting but also expects a lot from each of his students. I think anyone who is actually interested and willing to put in some work will really enjoy this class. It has been one of my favorite classes at Dartmouth! I will say though, Professor Rice does assign a lot of homework. You have weekly logs to turn in on Saturdays and a very long written final, so I wouldn't exactly call it a layup in that sense. However, the class is still super fun and I totally recommend.\"",
            "review 2: \"21F with James Rice: This class is not a layup. I cannot stress this enough. It's easy if it's NOT with Rice. WITH RICE IT'S SO MUCH WORK. If you don't buy into all the Acting b.s don't take the class.\"",
            "review 3: \"19S with Timothy Hackett: Professor Hackett can be fun, but overall was just okay. He's not particularly invested in students on a personal level, he does a personal coaching session with you and your scene partner for the final, and that is supposed to last an hour but he only spends around ten to fifteen minutes. The class is built on learning how to act truthfully, and the exercises can be repetitive but helpful in really getting you into an actor's headspace especially as a non-theater major, but I probably would have enjoyed it more with another prof (James Rice is really good).\"",
            "review 4: \"19F with James Rice: This is an amazing class. Not only will you learn a lot about acting, but you will also find a great group of people that you probably wouldn't meet otherwise. Sometimes Professor Rice can give some pretty weird or complicated assignments, but it is always worth it in the end. Also, this class is NOT a layup. Yeah, the classes are pretty much devoted to acting exercises so it is easy to put in a lot of effort, but there is a ton of work outside of class. You also really have to keep track of doing all the readings and assignments on time because there are a lot of different parts to the work and he will rarely remind you of any due dates because it's expected that you are keeping up with the syllabus. There is a lot of daily journaling, so make sure you do it on time because it really sucks if you procrastinate and have to do it all last minute. Despite the amount of work, you will grow a lot as a person and as an actor and build a really great community with your classmates. Professor Rice is also a really cool person and a great prof. He really knows his stuff and it is super cool to be able to learn from someone who was taught by some of the greatest acting teachers ever. Overall, I would definitely recommend this class.\"",
            "review 5: \"19F with James Rice: Really great guy and had a great time. The course was fun as I had never taken acting before. The class is time-consuming but 100% work it.\"",
            "review 6: \"18F with James Rice: Okay, I have a lot of feelings about this class. You do some weird stuff sometimes, but you just have to go with it. Honestly, if you actually care about this class and put effort into it, you can learn a lot about yourself-- highly recommend. But it's a lot of freaking work. START IT EARLY. So many of us put off all the assignments until the last week or a few days before it was due, and that was a serious mistake. I spent a day and a half doing everything during finals week, which was an L for my other finals. Just start early and don't forget about the class, because it's a lot lot lot of work.\"",
            "review 7: \"18F with James Rice: Best professor. Best class I've ever taken. Prepared to learn more than you could ever imagine about yourself and bond with everyone in the class.\"",
            "review 8: \"18F with James Rice: THIS CLASS IS NOT A LAYUP. Now that that is out of the way, I would still recommend taking this class. It's a lot of work, but the community of friends and the lessons you learn from the class make it worth it. The class consists of in class work and maintaining an observational notebook. You have to watch 5 live performances, 5 movies, and read 2 plays and respond to each of those. On top of that you must maintain journal entries for each class and some other in class assignments. Rice uses every x hour, and you're expected to meet with him at least three times for coaching sessions before each scene you perform (2 scenes in total). Additionally, you must rehearse with your acting partners before each coaching session with Rice. We only got a week to prepare for the final scene, so it felt like a lot of the work was back piled towards the end of the term. Beyond the coursework, you'll gain a community of friends amongst your classmates. Rice does an amazing job of creating a safe and inclusive environment in the classroom where we all felt comfortable talking to each other about anything. Rice may seem very unorthodox at times, but there's a method to his madness. You never know what to expect. Everyone experiences a lot of self growth in the course. If you have the time, you should take acting 1.\"",
            "review 9: \"15F with James Rice: Amazing class! You learn more about yourself and develop new perspectives on theater/life. Not only are you learning about the art of acting, but you are also understanding who you are.\"",
            "review 10: \"10F with James Rice: A lot of the activities will really help you to act truthfully. Its a really great intro to acting class. You have to interview to get into and most people have had some experience prior to taking it.\"",
            "review 11: \"09F with James Rice: GREAT CLASS a lot more written work than expected, but james is great and makes the class fun for anyone, even if you don't want to act. definitely good art distrib!\"",
            "review 12: \"08S with James Rice: OK. Take this class. It is great. You make friends and really get to know all your classmates, the prof is a cool guy, and you basically get a grade to tell stories about your life, do yoga, fun warm-up exercises, and have fun acting in a completely stress-free environment. No matter what your experience level is, you will come out of the class having acting out a scene REALLY WELL. Professor Rice is good at what he does and knows how to push you where you need it and explain the techniques in a way that make sense. I ALWAYS looked forward to this class as a place where I could be as silly as I wanted and have fun with other people doing the same. Just a warning: there is a decent amount of (really easy) journal writing for this class. Keep up with it or you will have to do some major cramming at the middle and end of the term. Also, near the end of the term you have to meet outside of class a lot to work on scenes. Make time for this because it is fun, rewarding, and you get to know your partner really well.\"",
            "review 13: \"07F with James Rice: this class helped me survive freshman fall. you learn about yourself and you meet 15 really cool people who are open and accepting of anything you do or say. we focused on our bodies, we talked about our feelings, we had fun. in class you let all your stress and problems fall away. you become a part of a family.and you do really funny excercises and scenes. we had a good time. take this class. get to know 15 new people and a really great prof. it will be an unforgettable experience.\"",
            "review 14: \"07F with James Rice: This is a fantastic class that I would recommend to anyone regardless of whether or not they have a serious interest in acting. Professor Rice is amazing and very interested in his students. The one drawback to the course is the readings, which are sometimes incredibly interesting and sometimes unnecessary and tedious. The course is also paced a little slow which is either a bad or a good thing depending on your perspective. As a prospective theater major, I was occasionally frustrated by this slow pace. These two small quibbles aside, this was an incredible class that I would most definitely recommend!\"",
            "review 15: \"07F with James Rice: Professor Rice does a good job coaxing non-actors into learning how to act. Unfortunately, this means that people with previous acting experience are left twiddling their thumbs for much of the first half of the class. Professor Rice is great about meeting outside of class for coaching, and his suggestions are very helpful. Be warned, though: the assigned reading and writing are dull, extensive, and unnecessary.\"",
            "review 16: \"07F with James Rice: You will love your classmates- there's few people that I've become closer to on campus. If there's one thing that Professor Rice does incredibly well it is to build an very tight knit ensemble. That, in itself, is the reason to take the course. I'm still rather uneasy about the course from a standpoint of someone who came here with prior theatrical experience- if this sounds like you and you are here intending to major in theater don't be surprised if you are a bit taken aback by his experimental take and getting to know yourself first attitude. For example, there's a lot of emphasis on breathing and a bit of a self-help twist. It's great because this enables you to get to know your class, but it also may cause frustration if you're looking for a class that starts early with scenes etc. (We only looked at a scripted scene in the last couple weeks of class). Every day you will have journal entries which you are expected to self-reflect on. There are many many journal type assignments which get overwhelming by the end of the term, even if you've done journals and kept up with the work on a daily basis.\"",
            "review 17: \"07F with James Rice: This class requires an extraordinary amount of work. The work is easy, but it is consistent, almost like one of those annoying high school classes. However, with that said, if you can stomach daily journal entries and whatnot, this is one of the best classes one can take at Dartmouth. Pure self-betterment. Rice is a really awesome professor.\"",
            "review 18: \"07F with James Rice: I took this class randomly, thinking it would balance out my harder science/lab courses. We did some pretty weird things, but in the end, everything made sense. I love this class because of Professor Rice, who really comes to care about you and because of the other students. You delve into the past a lot, and share memories with your classmates. It's a small class and we got pretty close, the work load is very reasonable, and best of all, it's just fun to go to, and to discover how much work really goes into acting. I recommend taking it - it's something new, and you won't regret it.\"",
            "review 19: \"07F with James Rice: I don't think I've ever bonded with a group of people more, in such a short amount of time. Your classmates are what makes this course. The lowered inhibitions that accompany theater, and the encouragement that James gives to release those inhibitions, allow for such a release from typical classes. I looked forward to my tues/thurs mornings. I WANTED to wake up for a ten o'clock class. You don't know what you're missing if you pass up this course. Take it with James if at all possible. And don't be afraid to make a fool of yourself.\"",
            "review 20: \"07F with James Rice: I loved Acting with James Rice - he's definitely great to having in class every day. I learned tons about myself and learned what good acting was. It's definitely a class that allows you to reflect on yourself, get to know your classmates (I loved my group, especially by the end). Most of the course is not much work throughout the term, but be prepared for a good deal of line memorization at the very end of term. Just to get to know 15 other people you'll really end up liking, take the class. Take the class for a new experience. Take the class to learn something new about yourself and how theater provokes and challenges you. It's an immensely rewarding experience. It's difficult to understand how until you take it yourself. The journal work is very time consuming and while self exploratory, still can be mind numbing after so long. There's just too much writing and you can only say so much. Don't worry about this too much, though, just do it.\"",
            "review 21: \"07F with James Rice: this is an amazing class! HIGHLY recommend this class-i took it for the art distrib and it turned out to be so much more!!\"",
            "review 22: \"07F with James Rice: James is an AWESOME professor and this class is a great way to really get to know a professor and 15 other really great people. Acting class was always a very relaxing period and lots of fun - a much needed break in a busy day. I especially recommend this class for any freshmen. This class really made my first term a really great term.\"",
            "review 23: \"06W with James Rice: Professor Rice is so great! This course is so amazing! Though it is challenging and requires a great deal of work, it is so rewarding. I would recommend this course to anyone, whether they are interested in theater or not. If you commit fully to the work, you will grow as both an actor and as a person and will have a ton of fun. :)\"",
            "review 24: \"06W with James Rice: Teaches you to act and to understand yourself. Completely formative experience. TAKE IT. It has the potential to be the best class you'll take at Dartmouth. ESPECIALLY, if you're not an actor.\"",
            "review 25: \"06F with James Rice: This class was fantastic, and Rice is 90% responsible. He is so passionate about teaching his students that anyone can enjoy this class. We had everyone from experienced actors to quiet, shy seniors looking for an easy class-- by the end everyone was a good actor- we got to perform our own scenes. Prepare to make great friends... you get to know everyone in your ensemble very very well. This review can't do the class justice. Take this class, you won't regret it.\"",
            "review 26: \"06F with James Rice: It was so much fun. Plus the class is small, so we were able to bond with our classmates.\"",
            "review 27: \"06F with James Rice: Professor Rice puts forth the idea of ensemble-building right from the beginning of the term, and, sure enough, it happens in this class. Coming from a \"British\"-style theater training background, I felt a little thrown for a loop. Suffice it to say that I needed to stop over-intellectualizing and just act. That was my major hurdle in this class. It's a fairly (if not very) writing-intensive class, with a decent amount of extracurricular time investment required (journals, performance responses, performance attendance, scene practice sessions etc.). It's a fair amount of work, but ultimately very rewarding. There are two personal essay assignments, and some reading (plays, acting texts - with writing assignments). If you want to get to know yourself a little better (and make some great, new friends), I highly recommend this course.\"",
            "review 28: \"05W with James Rice: Well. This was supposed to be my screw around class, I had read online that it was pretty chill and the Prof was tight. I got to the class, and literally for the first 4 weeks I felt like I was in elementary school. We played lots of group games and did yoga warmups and sort of talked about each other and theater as a sort of vague abstract concept. The work in this class really started after week 5. You get paired up in partners, and have to do a scene. The scene takes a lot of work, and it requires memorizing lines and working with Professor Rice a couple times out of class. The second (final scene) that you do takes a ton of time, but once you do it you realize everything that the class was about. Everything you did that made absolutely no sense sort of comes together. There's also a journal that you have to keep that has all your written work in it. Mine ended up being like 70 pages double spaced. Regardless, the class is sweet and fun to do work for/go to. Attendance is mandatory. Professor Rice is a really sweet dude, and I'd recommend the class to anyone who will have the time to put into it towards the end of the term. And he puts the median high!\"",
            "review 29: \"05W with James Rice: This course was a great way to learn about yourself. All of the course objectives are met. You meet a great bunch of new people and grow and learn together. You challenge yourself and are inspired to push through what feels uncomfortable to ultimately succeed in performances. This course is not just for actors - it's for anyone who wants to try something new, regardless of experience level. There is a lot more reading/writing than you'd expect, but if you keep up with it, it's not too much of a burden.\"",
            "review 30: \"05W with James Rice: definitely take this course at some point, even if you're not (or don't think you are) really into theater. its really interesting, you meet a lot of cool people (cause the class is small and theres kind of a lot of bonding) and you learn a lot about yourself, in addition to stuff about acting. surprisingly valuable.\"",
            "review 31: \"05W with James Rice: Even as an Acting I (beginners) course, this class seemed very High School to me. There is a lot of Yoga, self-discovery, and bonding that goes on in this class. It was fun and def a good stress reliever, but I don't really feel like one gets a lot of actual theatrical training in the class. There is a heavy focus on Miesner and Uta Hagen, which is productive and enjoyable but there is also a heavy focus on \"theatre games\" that are played without explanation of the techniques rendering the skills non-transferable to the stage.\"",
            "review 32: \"05F with James Rice: Rice is an amazing professsor and his passion is infectious. He brings out the best in people. It is a great opportunity to grow as an individual and as an actor.\"",
            "review 33: \"05F with James Rice: This class was so much more amazing than I expected. One thing I didn't know was how the class expects you to take challenges, and put yourself completely out there. I was stretched emotionally and put outside of my comfort zone. The class was my favorite. I always wanted to go to class, and I made some great friends. I highly recommend this class to anyone interested in acting or just looking to fill the distrib. You won't regret it.\"",
            "review 34: \"05F with James Rice: I advise everyone, major, minor or non-major, to take this course. It was SO much fun!!and it teaches students so much! it helps them grow, it helps them get to know themselves and each other... You also get to bond with your class, so you will probably be friends until graduation. The written assignments were demanding, in the sense that we had to commit to daily journal writing. My advice: do it on time, or you will not be happy when the time to turn it in comes. Also, there is some reading involved, and all kinds of other writings, but that is not nearly the most important part of the course, it is just the necessary part. In class we got to learn about breathing techniques, movement and voice training, and how to get our life on the stage. we became less self conscious and more comfortable with each other with every class. It was the course that helped me through this term, freshman fall... it helped me adjust to college life and it helped me find a special group of people whom I now consider some of my closest friends. Take the course, you will not regret it. and take it with professor Rice if you want to make the best of it!!\"",
            "review 35: \"05F with James Rice: So...I have mixed feelings about this course. On the one hand, Prof. Rice is an incredible professor at times who obviously cares deeply about what he does and the students to whom he devotes an absurd amount of time. He invests more of himself in this course than any other prof I've encountered. I also had a lot of fun, met a lot of people I wouldn't have otherwise encountered, and learned a lot about myself. With that said, Prof. Rice can be unncessarily harsh, close-minded, and demanding. I walked in late ONE time and after I had told him I would be late because of religious reasons (which he acknowledged at the time) and I still got a glare from him upon my arrival. So...my verdict? take it, but be aware that the course is a lot of busy work, touchy-feely crap, and unnecessary hassle. With that said, it is often a lot of fun and you learn pragmatic skills like public speaking.\"",
            "review 36: \"05F with James Rice: Professor Rice is a fine professor and Acting 1 is a great introduction to the wonderful art of acting. Also, Acting 1 is a great chance to overcome shyness and gain confidence while speaking and working with others. I recommend this class to anyone who is interested in the theater or who just wants to branch out and try something very interesting. Don't expect a pushover class, though, Professor Rice expects that you will devote considerable time to the readings and the mandatory journal entries. Also, all theater department shows must be attended and rehearsal with partners is expected. As long as you are prepared to participate fully and willing to work hard in and out of class, Acting 1 is sure to be a good experience. It is by permission only, so be prepared to meet with Professor Rice and explain why you want to take the class.\"",
            "review 37: \"05F with James Rice: I really enjoyed this class. Bizarre at times, if you invest a real effort in this class, you will have a lot of fun with it--and you'll become a better actor. I had no acting experience prior to this class, and I now I feel comfortable enough with my acting ability that I am considering trying a small role in a play at some point. There are no analytical papers and no tests...your grade is based on coming to class and as my friend said \"letting your balls hang out\". You'll love this class!\"",
            "review 38: \"04F with James Rice: This class was a lot of fun and really has a lot to offer anyone. If you already have an interest in theater, this class will not disappoint. If you've never really done theater before, there is a lot you can gain from this class. I would especially recommend taking it freshman year because the class develops a sort of ensemble feel and you get to know your classmates very well by the end of the term. It's a nice way to start off classes. That being said, there is a lot of work for the class. the work is all rather easy, but there is a lot of it. You are required to keep a journal and record responses to everything theater-related you do (read a play, see a play, go to class, etc.) Most of the reading is very boring and long winded. There is one kernel of important information surrounded by many pages of repetition and hot air in most of the readings. Many projects require out of class rehearsal time -- sometimes at odd hours. However, if you're willing to put in the work, this course will definitely be worth your while. The teacher is understanding of students and passinate about his work. The class is fun, and i have no regrets abot taking it. I would recommend this class to everyone.\"",
            "review 39: \"04F with James Rice: I'm not a theater person, and most of the time I'm not exactly looking to go outside of my comfort zone. I've never acted in any performance before, and I took this course because I wanted to fulfill my ART distrib in a way that would be meaningful and different. I got EXACTLY was I was looking for and MUCH more. Professor Rice is absolutely incredible in the way he moves you through the term allowing you to grow first as a person and second, as an actor. He requires a lot, and you're expected to keep daily journals and attend coaching sessions outside of class time, but it's all very worthwhile. I wouldn't take this course with anyone besides Professor Rice because he REALLY made this experience for me. I'm someone who is sometimes shy and often skeptical about the effectiveness of techniques and exercises in terms of improving yourself as a person, but I can honestly say that this course made my term and caused me to get off cruise control during my senior fall long enough to realize that these are exactly the types of courses I hoped to find at Dartmouth...ones that stimulated me and forced me to reconsider my own preconceptions about myself. Please take this course...seriously, you'll be REALLY glad that you did :)\"",
            "review 40: \"04F with James Rice: just take it, it will change your life. plus, it's fun :)\"",
            "review 41: \"04F with James Rice: Professor Rice really brought the stage and acting to life for all of his students. Some of the readings and reflecting did become repetitive and boring at times, but it all comes together in the end. Work load is light in the beginning but quickly picks up when reading assignments are due. The second half of the term is dedicated to scene work which required out of class time. The class was amazing, lots of fun. There was rarely a day where I didn't want to go to class.\"",
            "review 42: \"04F with James Rice: Please take this class! It is one of the best classes here at Dartmouth! Do be warned though, the pace may seem really slow at first and as the term progresses, it will pile up on you if you haven't been keeping up. But you cannot graduate from Dear Old Dartmouth without taking the class!\"",
            "review 43: \"04F with James Rice: It was a good class, but there was a lot to do outside of class-- readings of texts (only half of which were interesting) and plays, as well as LOTS of scene work and other smaller assignments. It was good, but be prepared to work and accept what goes on.\"",
            "review 44: \"04F with James Rice: Brilliant class. It was just an absolute joy. Yes, the journals suck, and yes, you may find yourself on third floor Berry writing a review of the course as a study break from writing all the journals you should have done over the past month and a half. But if you keep up with your work, you'll find that the workload isn't that bad. Really though, all the writing and reading aside--there's a decent ammount, don't take it as an easy, light class--this class was FANTASTIC. I took it because a friend of mine said it \"changed her life,\" and honestly, I'm inclined to agree. You can't beat James Rice. Everyone in the class grew so much as actors in three short months--it was really pretty incredible. Take this class. You don't need to be an actor, you don't need to plan on majoring, you don't even need any knowledge of the stage at all. Do yourself a favor and take this class to learn something important about yourself if nothing else. Brilliant class.\"",
            "review 45: \"04F with James Rice: Really changed the way I watch plays, but on a more everyday level, it's a big self-awareness class. James has really perfected the short ten-week course into a collection of readings, exercises, out-of-class activities and discussions that help take you step by step through the fundamentals of acting for beginners. Plus, sometimes you get to bring in music and dance to it. Nothing like it. Have fun.\"",
            "review 46: \"04F with James Rice: it is a great class and fulfills the art requirement\"",
            "review 47: \"04F with James Rice: james rice is simply brilliant - a joy learning from. you will learn so much about yourself in this class, a great deal of introductory acting technique, and a great deal about other people. the class was more of a therapy session than a rigid learning environment. I looked forward to this class whenever I wasn't in it. TAKE IT WITH JAMES!!!!\"",
            "review 48: \"04F with James Rice: The best advice I can give for anyone watking theater thirty is to try and do some of the work throughout the year and not leave it all until the end. Toward the end of the term everything becomes due and you have a final scene that requires a lot of out of class work with a partner, requiring working around scheduling difficulties. But the course is very rewarding if you are willing to get into it and make sure that you show up, because Professor Rice WILL NOTICE and will call you out. But he really, really cares about what he does, that much is obvious.\"",
            "review 49: \"04F with James Rice: If you havent taken a course from Prof. Rice, you should definitely. Besides being a very good professor, Prof. Rice is a very good friend. Plus the course material is not really tough. It just takes a long time to deal with the folder...\"",
            "review 50: \"03F with James Rice: Our class ranged from people who were very experienced in theater to people who had no experience. I think everyone got something good out of the class, which is why I would recommend it to anyone. Even if you are shy, and would never think of yourself as an actor, this class will help you overcome alot and you will find yourself comfortably doing things in front of your class that you would never imagine doing before. The best part of this class for me was the self observation aspect of it- I ended up learning alot about myself that I never even thought about before. The class was sooo refreshing compared to my other classes ( lectures with over a hundred people in them.) In conclusion, take the class- its fun, worthwhile, and a nice change of pace from most of the other classes here :)\"",
            "review 51: \"03F with James Rice: James is an awesome prof. I just wish I had taken this class during a term where I had more time to devote to it. There is TONS of reading and written work which is a royal pain in the butt. It is ALOT of work, and you get no feedback on it, so it's quite frustrating. On the other hand, the in-class work and scene work is AWESOME. So you kind of have two extremes. Overall, I'm glad I took this class, but you probably should only take it if you're willing to work harder than I did.\"",
            "review 52: \"03F with James Rice: Professor is amazing and inspired. Class is really fun and a stress reliever Felt like I learned a lot and understood where the class was really going. Lot of work, especially near the end of the term, but felt like you really learn a lot about yourself. i recommend for non-actingmajors as well.\"",
            "review 53: \"03F with James Rice: yes -- i really do mean all of those. this class was amazing! james is great. he really cares about all of his students and pushes the right amount...he is motivating, inspiring, helpful, intelligent, and fun. i can't remember a second that i was ever bored in class. the people in the class are great, and even those who seem less willing to commit to it at first always come around within the first few weeks. the exercises are great and teach you a lot about other people, life, and especially about yourself! the scenes are great, too, and the final performance is really energizing. over the course of 10 (is it 10? or 9? aw, who cares...) weeks, you really see your fellow students improve and it is a wonderful feeling. i would reccomend this class to ANYONE who is open to new experiences, new insights, new people, and new skills! i loved it. i would take it again if i could!\"",
            "review 54: \"03F with James Rice: Take this course. It is not that hard, although you do spend a lot of outside hours doing rehearsals and preparation...but the \"homework\" is fun. There are readings, and you can or cannot do them, depending on what you want to get out of it. This is definitely a course that you will remember all your life. Rice is a great prof and very understanding.\"",
            "review 55: \"03F with James Rice: An awesome break away from the average class. I highly recommend this class to everyone, especially people that don't view themselves as someone who would take a class like this. It was a lot of fun and was so much more than acting.\"",
            "review 56: \"03F with James Rice: Professor Rice is genuinely fascinated with theater and wants so much to inspire interest in his students. He is one to push his students emotionally and revels in their \"breakthoughs\" and progess. Truly cares about his students. On the flip-side, it's a little much at times. This class attracts two groups-- those who are looking to fill the art distrib and have heard good things about Theater 30, and those who are all intense about acting and set to pursue it here at Dartmouth. At times, it can get heavy and although it's fun and a lot of \"bonding,\" being surrounded by deep thinkers and having to expose private information can get uncomfortable for everyone. All in all, it's a solid course. The acting methods touched upon are interesting although they aren't utilized in class as much as I would have liked. The journaling is a bit excessive, but fairly simple. A good art distrib course.\"",
            "review 57: \"02W with James Rice: I was intimidated to take this class at first. The idea of having to interview to get into a class seemed like it was setting me up for disappointment. But it ended up being one of the least intimidating academic environments I've experienced. Everyone in the class was very comfortable opening up to one another, which made a lot of the exercises easier. Taking this will make you more comfortable with yourself and with sharing yourself with others. And it will probably change your way of looking at acting, both as a performer and an audience member. Definitely worth taking, for actors and non-actors.\"",
            "review 58: \"02W with James Rice: If you are at all like me, and have no acting/performance arts backgroud, then challenge yourself and take this class. If you come into this class with an open mind and a positive attitude, i guarantee you will grow tremendously. The best part of the class for me, was the interaction between classmates. Everyone in our class had an open mind and we became really close, which made the class the amazing experience that it was. This will definitely be a class i will remember beyond my time at dartmouth. Prof. Rice is a little excentric, but he is very passionate about acting, and is very committed to the class/students. Just take the damn class.\"",
            "review 59: \"02F with James Rice: This was my favorite class in the fall and I highly recommend it to anyone, even people with no desire to act. Class is a great stress-reducer and the work, although a lot at times, is never boring drudgery like so many other classes. This class will help you vocally and physically as well as increasing self-awareness. TAKE THIS CLASS. I guarantee you will learn something and enjoy it.\"",
            "review 60: \"02F with James Rice: This is a wonderful class. Not only was it an incredible amount of fun, it also helps to really improve who you are as a person. I have made friends in this class that I may never have met otherwise and become incredibly close to them as a group. This class is great regardless of experience, or lack thereof, in acting. I would suggest it to anyone willing to open up to other students.\"",
            "review 61: \"01F with James Rice: Why take Acting 1? no no, Why NOT take Acting 1???? I had a blast, I learned a lot, I developed SO MUCH as an actor, I made wonderful friends, and I developed greatly as a person, learning a lot about myself and gaining confidence and comfort. James is wonderful--a bit intimidating at times because of his very high expectations of your committment, but nonetheless entirely supportive and helpful and caring. THAT'S THE BULK OF WHAT I HAVE TO SAY, BUT READ ON IF YOU WANT TO HEAR MORE: We had to read three books. The first was quick and easy and good. The next was really long and boring and a waste of time, so I didn't really bother reading it. The third was really long too, and I regret not having enough time to get past page 92 during the course, but I intend to finish it during xmas break because it's really applicable and helpful. There's LOTS of busy work, responses to EVERYTHING. But don't worry about it, it's all worth it in the end!!! And you can push a lot of it off until finals week and the notebook isn't due until the last day of finals. But keep up with the journal of responses to every class!!!! or else you'll be pissed at yourself. But seriously, many people don't take the class because they think you need to be an actor to take it!!! no no no!!! Only like 5 of 16 of us had acting experience before!!! and it's often easier if you don't have acting experience because then you won't have incorrect misconceptions! JUST TAKE IT!!!!!!\"",
            "review 62: \"01F with James Rice: Great class, therapy almost. Good for anyone, not just Theatre majors. Prof Rice is a great instructor for this introductory class. Not a blow-off class by any means, but the work is fun and worthwhile.\""
        ],
        "Carol Dunne": [
            "review 1: \"23F with Carol Dunne: Definitely take this class! I am not a theater major and only took it for my art distrib. You only have to turn in 3 hand-written assignments, and they are all pretty straight forward. The first one is answering nine questions about a character for an exercise, second is a three column exercise in preparation for the final performance, and the third is a 200 word reflection after seeing a live play. At the end of the term, you get to act out a scene from a play. The first 7 weeks were mostly spent doing warmup activities and introductory exercises to get you familiar and comfortable with acting, we didn't really act out any scenes. We only started actually acting out scenes around week 8. Carol makes everyone feel comfortable and welcome and even made us call her by her first name. You get to bond with the people in your class and it is overall just good vibes. There is never a day when you will be bored in this class (at least not before people start performing). As long as you follow instructions and commit some time to rehearsing your final scene, you should be 100% fine. Def take this as your art distrib if you can.\"",
            "review 2: \"09W with Carol Dunne: Take this class if you can!! We all had so much fun it actually didn't seem like a class. Where else could you tumble and somersault, as well as learn about yourself? Also, it was a great place to bond with other students.\"",
            "review 3: \"09W with Carol Dunne: take it!\"",
            "review 4: \"09W with Carol Dunne: Carol Dunne is a wonderful woman and prof. She give her best to the class and you will feel compelled to do the same. You learn a lot about yourself during the course in a fun and comfortable environment. Definitely take this class with Dunne!\"",
            "review 5: \"07W with Carol Dunne: This class was a lot of fun, primarily because of Prof Dunne. She was energetic and a good teacher. We learned a lot of acting techniques over the course of the term. My only criticism is that we learned a lot of techniques for speaking \"properly\" and breathing effectively, etc, but didn't directly apply them to performances until the end of the course. Overall, though, the class was a lot of fun and I definitely recommend it.\"",
            "review 6: \"06W with Carol Dunne: ...as a 3rd (or 4th) class. I learned how to do cartwheels and speak better. It was a lot of fun.\"",
            "review 7: \"06W with Carol Dunne: This class covers the basics of acting technique. If you're at all interested in doing any kind of acting, whether professionally or just for fun, this is the place to start. I was a better actor for it.\"",
            "review 8: \"06W with Carol Dunne: So much different than any other class that you will EVER take at Dartmouth. And Carol is sooo amazing, intellegent, and an overall great professor!\"",
            "review 9: \"05W with Carol Dunne: Cool class, although the grading is a little sketchy. take it because it's easy\"",
            "review 10: \"05W with Carol Dunne: this class is so fun to take-- it's a great change from the usual lecture hall and professor dunne did a wonderful job she brought energy into the class every day\"",
            "review 11: \"05W with Carol Dunne: If you, like me, learn best through experience rather than having it banged into your head with a lot of theory books, take any class that Carol Dunne offers. She's very relaxed in the classroom, clearly knows a ton about acting, and is very responsive. It's also a very enjoyable, low-key class in which you will learn a lot without adding another eight hours of reading to your week. Definitely one of the most enjoyable classes I've taken at Dartmouth.\"",
            "review 12: \"05W with Carol Dunne: The class is a nice break from the usual grind. Prof. Carol Dunne is great - really nice, personnable, and engaging. You do have to be willing to participate and feel awkward at times, but I think it becomes easier as you go on. Prof. Dunne challenges you to go outside your comfort zone, but you'll be better off for it.\"",
            "review 13: \"05W with Carol Dunne: If you want a nice easy course to get your ART or to give you a break from your tough econ classes, this is it. If you want lots of practice with scenes and dialogues and plays, you'll have to wait for more theater classes. Carol's great at getting people to open up and develop their abilities as actors, but I felt that the lack of scenework that we did (only one two minute scene) didn't really allow us to practice the skills that we learned. You'll spend the first two weeks learning to focus, stretch, and relax, and you won't even really \"act\" until near the end of the term. Out of class assignments are sparse, usually consisting of journals and a fantastic book by an actor that was a great read. Overall, a great introduction to acting\"",
            "review 14: \"05W with Carol Dunne: This class is very interesting and very fun. I only take issue with the subjectivity of the grading. The assignments are poorly explained and then left up to interpretation, and then graded as though there were objective standards to it, which there were not. This can be very frustrating.\"",
            "review 15: \"05W with Carol Dunne: I was intimidated to take acting being someone who takes classes as far away from the HOP as possible but I truly enjoyed acting. There is no reason to be intimidated and Carol (we had to call her by her first name) was wonderful. She eased any tension anyone may have had and made acting seem accesible to everyone.\"",
            "review 16: \"05S with Carol Dunne: I really enjoyed this class...I think it kept me sane. I'd come out feeling refreshed in both body and mind. Carol Dunne is a wonderful woman and a great prof, and she made this class a lot of fun. I also learned a lot about my acting!\""
        ],
        "Timothy Hackett": [
            "review 1: \"23S with Timothy Hackett: Do not take with Professor Hackett. Very bad professor, and quite frankly a stain on the entire theatre department.\"",
            "review 2: \"23S with Timothy Hackett: I really enjoyed this class! Professor Hackett is laid-back, really approachable, and the entire class is structured around this idea that \"acting is behaving truthfully under imaginary circumstances\" which was an idea I hadn't heard before. He really leans into that concept with students, starting off with basic exercises that allow you to become comfortable with performing in front of other individuals, and then intentionally building upon those skills by adding improv, character backgrounds, and other details. All of that builds up to the final scene performance, in which students have multiple opportunities to stage their scenes and get helpful feedback. The workload really isn't too bad, and the amount of time I spent working on homework outside of class was below average for my other courses. There is a decent bit of writing involved in creating detailed character backstories, but I found it to be pretty fun. Also boosted my confidence levels a bit through performing. Overall, really enjoyed the class, and would recommend it!\"",
            "review 3: \"22W with Timothy Hackett: Professor Hackett is amazing. Only 1-4 hours of work per week ,and that time is worth it. All of his assignments help you become a better performer and are NOT busy work. Could not recommend this class and this professor enough.\"",
            "review 4: \"22S with Timothy Hackett: Timothy Hackett is a vile human being. If you have no interest in pretending to be a victim of abuse or a cancer patient, I wouldn't recommend taking this course. He has no sense of humor and prefers students who will mock cancer patients over students who choose less \"life or death\" situations. If you submit any assignment marginally late, Professor Hackett will take joy in failing you. Consistently viewed as the worst professor in the theater departments, he will also force you to read and comment on a variety of extremely crappy and contextually-inappropriate plays, some of which are extremely triggering. As a STEM major, Hackett is the WORST professor I've had at Dartmouth, an almost impressive feat from the theater department.\"",
            "review 5: \"22S with Timothy Hackett: I have no idea what the other review is talking about. Never once heard a peep about cancer. All in all, good class and funny prof. The plays we read were about 2 groups of couples in shitty relationships, a genius daughter of a mathematician, a coming of age play about some kids in a movie theater, and a play about MLK. Not sure what was triggering about this at all. People need to grow up. Don't let that person discourage you. Everyone in the course loved it. (minus one I guess)\"",
            "review 6: \"21W with Timothy Hackett: This class was great. Professor Hackett is so nice and understanding, and the class is a great easy layup to take. Fully recommend.\"",
            "review 7: \"19S with Timothy Hackett: Professor Hackett can be fun, but overall was just okay. He's not particularly invested in students on a personal level, he does a personal coaching session with you and your scene partner for the final, and that is supposed to last an hour but he only spends around ten to fifteen minutes. The class is built on learning how to act truthfully, and the exercises can be repetitive but helpful in really getting you into an actor's headspace especially as a non-theater major, but I probably would have enjoyed it more with another prof (James Rice is really good).\""
        ],
        "Mara Sabinson": [
            "review 1: \"05S with Mara Sabinson: Becuase of the time and the class being so small....not exactly what I expected.\"",
            "review 2: \"05S with Mara Sabinson: If you are looking for a different type of class, other than the classical classroom leture or discussion format, take this class! Acting was a lot of fun, and even though there was a decent amount of work to be done, the assignments were very interesting. I am glad I took this class, it was a nice experience.\"",
            "review 3: \"04X with Mara Sabinson: Prepare to DIE while reading. You read really really miserable books and have to keep a journal about them. This is definitely not a class where you can skip the reading or the other seemingly trivial assignments because you have to write about all of them in a really long journal. But, other than that, this class is a lot of fun. It's great for sophomore summer because you don't feel like everyone's trying to be a professional actor some day. It's chill and it's energetic. Just be prepared to work a decent amount outside of class on stuff that doesn't feel very important.\"",
            "review 4: \"04X with Mara Sabinson: Good course. In-class work is fun, but the books are hell - dry and long. Prof can be harsh but is really effective. Most people came a long way in this class.\"",
            "review 5: \"04X with Mara Sabinson: this class had the potential to be a lot of fun... except for Mara, who really made it quite stressful to be in class with. She was one of those profs who makes you nervous just to ask a question because she isn't happy that you didn't already know the answer - and considering how subjective the grading system is for acting 1... it's not good to get on her \"bad side\". I hear the class with Rice is real good though... so I won't give acting 1 as a whole a bad review.\""
        ],
        "James Horton": [
            "review 1: \"09F with James Horton: This class was awesome! Professor Horton is really chill and really nice. We did interesting exercises and \"transformation exercises\" during class and it really did improve my acting. We had to keep journals which weren't too much fun but it beat taking tests or writing actual papers so I can't complain. TAKE IT for your art distrib and definitely if you're at all interested in acting/theater. This is a class you will not regret taking.\"",
            "review 2: \"07F with James Horton: A really really great class, and Jamie's a wonderful teacher. I'd highly recommend taking it, even/especially if you've never acted before.\"",
            "review 3: \"07F with James Horton: This class is by far the most fun class that I have taken at Dartmouth. Prof. Horton is a great prof. and the acting assignments are fairly simple and so much fun. Whether you have acted before or not, this class is a must!\""
        ],
        "Christian Kohn": [
            "review 1: \"23W with Christian Kohn: Absolute legend of a professor. Kohn makes you feel comfortable. He takes 3 weeks to do so. He helps connect you with your classmates. By the end of the course, I was friends with everyone in the classroom and performed with some of the strongest emotion I've ever felt in my life. Buy in to this class, and you will get so much out of it. This was one of the best classes in all 4 years of my Dartmouth experience. Also, you will definitely get an A (just try). I spent maybe an hour a week on work outside of class and grew so much because of this course. I recommended this class to everyone I know. It's absolutely amazing. TAKE THIS CLASS!!!\"",
            "review 2: \"23W with Christian Kohn: This is the best class you will ever take at Dartmouth. Christian Kohn is such a sweet, loving, caring prof. Get to know the entire class really well, also MOTHER OF ALL LAYUPS. The things you learn are practical and can be generalized to other areas of your life. Can not recommend enough.\"",
            "review 3: \"21F with Christian Kohn: Great Prof who really cares about his students. Chris is very laid back and doesn't fall to the stereotypical norms of the professor students relationship but rather becomes your friend throughout the term. If you put in the work, memorize your lines, and dedicate yourself, then you will get an A.\""
        ],
        "Keith Coughlin": [
            "review 1: \"24W with Keith Coughlin: Incredibly good professor and incredibly fun class .\"",
            "review 2: \"22F with Keith Coughlin: Unreal class, even better prof. Grade was made up of participation, a couple script reviews and a final performance where you have to memorise ~20 lines and perform in class. Highly recommend for a fun/interesting layup.\""
        ],
        "Myxolydia Tyler": [
            "review 1: \"22S with Myxolydia Tyler: Do not take this class. Bad time, not much learning, bad grading and feedback loops. NOT a layup - only take if you are interested in being in a play at Dartmouth.\""
        ],
        "Gary Cherniakhovsky": [
            "review 1: \"02S with Gary Cherniakhovsky: This course's fairly easy for everyone: no exam, no quiz, even not much reading (justu a one-page essay). Prof's responsible and quite a pleasant teacher, except strong russian accent. Probably the only difficult thing to do is to think about how you will act, what you can do about the assignments. This course challenges your imagination a lot. P.S: You will probably easily get bored at the prof's \"circle\" exercise. Just take it easy.\""
        ],
        "Shirley Finney": []
    },
    "THEA029": {
        "Thomas Evans": [
            "review 1: \"04F with Thomas Evans: Being in the Dance Ensemble is quite a commitment. It requires over three hours of dance class and rehearsal combined, five days a week, for all three terms. It is only for those who are really dedicated to modern dance. Although it is a big time commitment, it is worth it. I have become ten times the dancer I was before Dartmouth due to Ford's teaching. I have had a chance to work with professional choreographers from all over the country, as well as the chance to develop my own choreographic skills. I hope that in the future the Dance Ensemble will get more support from the Hop and more recognition on campus for all of the hard work we do.\"",
            "review 2: \"04F with Thomas Evans: DDE is probably one of the best things about my Dartmouth experience. It's a totally intense group focused on being more of a dance company than a \"fun dance group\" at Dartmouth. DDE is the only Hop Dance Ensemble and it's very hard to get into. Ford, the director, is amazing. He shapes his dancers. He's very involved in the process, group, and our lives. He knows his dancers, pushes them, and the results are astounding. Around four to five dancers from DDE have gone on to dance either in grad school or professional companies. If you expect a laid back hip-hop group, this is not what we are. We dance up to 5 hours a day up to 6 days a week. If you miss, you pay ... (exams and Dick's house are excusable) You must take pilates and a modern technique class along with the daily rehearsals. Benefits? Being in the best shape of your life, becoming the best dancer you could possibly be, meeting some of the best people at Dartmouth, two amazing winter concerts, touring schools or other countries, learning what artistic process is, giving up any ego you have, and getting to know Ford and Melinda Evans. Come see the concerts we put on, see what we are about.\""
        ],
        "John Heginbotham": [],
        "Rebecca Stenn": [],
        "Trebien Pollard": []
    },
    "THEA028": {
        "Thomas Evans": [
            "review 1: \"05W with Thomas Evans: This class is awesome. You can only take it if you have either taken Dance Studies 1 OR you are in the Ensemble and are approved by Ford. It's a tough class that requires constant attention and full effort. If you are one to sleep through classes or miss classes, this is not the class for you. Participation is everything.\""
        ],
        "John Heginbotham": [],
        "Rebecca Stenn": []
    },
    "THEA027": {
        "Thomas Evans": [
            "review 1: \"08W with Thomas Evans: This class is awesome! It is so much fun! You dance during class and for homework you create dance compositions in a group. Professor Evans is awesome. This class takes guts, though. You have to be comfortable doing some pretty strange things in class and not getting self-conscious. If you're at all interested in dance, take this class!\"",
            "review 2: \"06F with Thomas Evans: This course was amazing and fruitful because you learn how to live life and experience freedoom in movement, which is a great thing. I found that much of the stuff I learned in class, I could use outside of class. Also, I actually got some really good workouts in the class as well. BUT WATCH OUT, this class is more than you think. You will not only work VERY hard PHYSICALLY through your movement work and dance, but you will also be stretched mentally in that you will be required to learn (IN DEPTH) about the different muscles, ligaments, tendons, abdomins, bony landmarks, etc. You will also need to know the fundamentals of dance and movement, which can get pretty technical. Nevertheless, you will love the class if you take it. Moreover, you will love the way you feel after class on Tuesdays and Thursdays. You might even find yourself moving over the weekends in attempt to feel the sensation that comes with experiencing movement and dance. So take the class. It'll change your life.\"",
            "review 3: \"06F with Thomas Evans: This is a wonderful class! Professor Evans is an awesome professor. However, this class is not easy. You have to completely apply yourself in class as well as for the assignments to do well. Evans demands the personal best from everyone, but accepts people at whatever dance level they are at. You do not need previous dance experience to take this class. If you want to explore dance, human anatomy, and to learn about your body and how it moves, as well as to take many risks and have some fun, take this class! You won't regret it.\"",
            "review 4: \"06F with Thomas Evans: This is a great course to take if you have two other difficult courses. Work outside of class is minimal/nonexistent. You do have to meet with a group of classmates a couple times: this is hard with busy students. Prof. Evans/Ford loves when you ask questions. He is sort of crazy, but typical. He gets very into some dances and loves to talk about his dance background. With a good class, it can be a fun course, but I didn't learn a lot about specific types of dance: more about my body and movement in general.\"",
            "review 5: \"05F with Thomas Evans: very easy, ford is great\"",
            "review 6: \"05F with Thomas Evans: This a great class. Different than any of the other classes I've taken because it's a performance class. There is the occassion class discussion about dance techniques and visiting dance groups. This a very phsyical class. You will be dancing with partners and rolling around on the floor. So be prepared but not discouraged. Prof. Evans is a great guy, very friendly and passionate about dance. He assigns readings on dance techniques about every week and a half. You will be required to watch the performances of visiting professional dance troops. But there is a lot of work at the end of the term. You have to perform a group dance routine and write a five page based on the assigned readings.\"",
            "review 7: \"04F with Thomas Evans: Dance Studies 1 is unlike any other course at Dartmouth. Most of class time is spent on the floor, working on movement patterns. Although it sounds easy, it is hard to do the material correctly; much of the emphasis of the course was on changing bad habits, such as slouching, tense shoulders, etc. We also were given experience in dance choreography. This was the most difficult part of the course, beause it involved a lot of time outside of class. Ford is a great teacher, though, and I'd encourage anyone to take dance 1, especially theater majors and athletes.\"",
            "review 8: \"04F with Thomas Evans: You've got to be willing to take some risks but you will thank yourself in the end! This class is entirely experiential (50% of the grade was participation) and if you don't fully invest yourself in it, Prof. Evans will know. We studied the history of modern dance but spent the majority of our time in the dance studio, learning about the basics of movement and choreographing 2 pieces. The rest of our grade comprised journals and 2 short papers. If you are interested in dance or just want to learn more about your body, alignment, and living healthily, this class has a lot to offer.\"",
            "review 9: \"04F with Thomas Evans: If you love meditation, rolling on the ground, or just moving, take this class! Ford is a great professor and really encourages class participation and discussion. He's very knowledgeable about dance, anatomy, and various dance techniques and kineseology. His classes are always fun and informative, but take a strong person who isn't afraid of what others think.\"",
            "review 10: \"04F with Thomas Evans: This class does present some interesting perspectives regarding pilates, body posture and re-learning body movement. However, Prof. Evans is a dance instructor, not a professor. he really shouldn't be teaching graded classes. He's really concerned w/ not being perceived as an \"easy\" class that he will try and make it seem like a \"real\" class and will overload you with absurd amounts of reading --not even my comp lit classes had this much -- on modern dance, it's history, composers, etc. which he hasn't even read himself. he then tries to hold 'discussions' which are a disaster, you learn nothing, except that you really did't really have to do all that reading. he also makes you keep a journal of what you learn every day of class, and it's a pain. participation counts for 50% but he's very biased towards majors and experienced dancers, and is always using them as an example. so in the end it's sort of unfair bc he'll give you a lower grade even though you're not supposed to have any previous dance experience for this class. on the bright side, the essays that you have to write -- yes, essays for a dance class -- are on the topic of your choice (within a range of selections) so if you know a topic or choreographer quite well then you can shape your topic around that and it's not so hard. additionally, for presentations, you're expected to put in a lot of extra time outisde class to practice, so that can get annoying after a while (he keeps attendance records, which aren't always accurate, that he then uses to deduct points out of your final grade). finally, he is very 'emotional' -- like no professor i've seen before, he definitely takes everything personally (even the tiniest thing, like showing up 5min late once) NS he doesn't allow for sick days (after 2 absences he'll fail you). he will then use all this to lower your grade as much as possible at the end so you have to make sure you ask what each grade accounts for, ask for percentages, etc. so that he has to somewhat stick to the initial guidelines he gave you. oh, and the syllabus doens't mean anything, he won't follow it, so don't even bother reading it. however, if you really love dance, and are very experienced, the he will love you and this is a class you should take! otherwise, i don't reccomend it. there are better/easier ways to get that A.\""
        ],
        "Keith Coughlin": []
    },
    "THEA026": {
        "Keith Coughlin": [
            "review 1: \"21F with Keith Coughlin: This class is literally the best class I've ever taken at Dartmouth. It is so worth it even if it seems like it is out of your comfort zone. Keith is the best teacher and a really cool dude. I kind of expected to feel weird about my body in this class or to compare myself and my abilities to others but he makes it such a safe space and all of the dancing that you do is within most people's abilities. PLEASE take this class I cannot stress enough how amazing it is. Perfect destresser too.\"",
            "review 2: \"21F with Keith Coughlin: so much fun, you stretch and dance the whole time. keith is fantastic and super understanding! can't recommend enough. there are maybe three short papers that are super easy and he doesn't grade, I'm pretty sure everyone get A's\"",
            "review 3: \"16F with Keith Coughlin: Keith is a great teacher. The class is fun, especially if you take it with friends. The assignments aren't heavy, and it is a class I would recommend trying if you want to relax.\""
        ],
        "Thomas Evans": [
            "review 1: \"08F with Thomas Evans: Ford is an amazing prof and really inspires the students. This is a great class even if you aren't a theater major. There are a few compositional assignments and some short papers but most of the work is in the dance studio - which is always a great experience and the best part of your week. Take this class!\"",
            "review 2: \"07F with Thomas Evans: Do not leave Dartmouth without it. This course taught me the most of any course at Dartmouth. Amazing experience, will be with me my entire life.\""
        ]
    },
    "THEA025": {
        "Analola Santana": [],
        "Irma Mayorga": []
    },
    "THEA024": {
        "Woon-ping Chin": [
            "review 1: \"15S with Woon-ping Chin: Assigned readings straightforward and not needed to do well. Workload something like 2 papers, a short presentation, and a quiz. I'm fairly certain every person got an A.\""
        ],
        "Woon-Ping Chin": []
    },
    "THEA023": {
        "Kellen Hoxworth": [],
        "Laura Edmondson": []
    },
    "THEA022": {
        "Soyica Colbert": [
            "review 1: \"07F with Soyica Colbert: The subject matter of this class interested me greatly, however Professor Colbert left much to be desired. Maybe one could attribute it to her being a new prof but she really didn't encourage free thought and was one of those profs who wanted you to regurgitate whatever was discussed in class on the exam. If you did not respond the way she wanted you to, you were wrong, which was sad in a theatre class that focused on close readings and interpretation of the material. The plays we read were excluding one or two were very interesting and I was glad that I had the opportunity to read them. However, I wish we could have gone more in depth with the interpretations and gone down different avenues.\""
        ],
        "Chante Mouton Kinyon": [],
        "Monica Ndounou": []
    },
    "THEA021": {
        "Irma Mayorga": [],
        "Kellen Hoxworth": [],
        "Laura Edmondson": [],
        "Shamell Bell": []
    },
    "THEA019": {
        "Annabelle Melzer": [
            "review 1: \"06W with Annabelle Melzer: I did learn a lot in the class, although a lot of the visual material shown is disturbing, especially if you have more conservative views, I don't recommend this class. It is good that you have a choice in writing the papers, but the midterm consists only of three lists of bibliography and although it seems easy, it is really hard to find what you need. Also, don't ever turn in your papers 1 minute late because she might not even accept it.\""
        ]
    },
    "THEA017": {
        "Monica Ndounou": [
            "review 1: \"22S with Monica Ndounou: A very, very interesting course and it truly has the potential to be great, but this was so disorganized that it was frustrating. Communication was inconsistent, student requests were not respected and accommodations were not met, and overall I’d say my mental health suffered due to this course. There were many days I’d regret coming to class (or scheduling work after class), and there were several occasions when I had to put a required reading down because it had taken too much of a toll on my well-being for the day. There’s so much potential, but this course falls short and is in serious need of refining and a communication tune-up. Additionally, very few of the assignments were posted in a timely manner and expectations were anything but clear throughout the duration of the course. By the end of the term, the issues with this course had become an accessibility issue for me. My grade has suffered due to my personal needs not being met, and I know I am not the only one in this position. I’ve reached out to my dean for assistance because this course is NOT representative of the theatre department, and as a major I am sorely disappointed that *this* was one of my requirements. I had such high hopes. Take this course with someone who has taught it before, and you should probably avoid taking a class with Ndoudou at all if possible.\"",
            "review 2: \"22S with Monica Ndounou: While this was the first time that this course was taught by Dr. Ndounou, she as a person is one of the kindest professors I have ever taken a course with. She is engaging and cares about her students. I have taken another class with her in the past and that class was the highlight of that term. She is a very intellectual person who loves when students are creative and makes tons of space for that creativity. I would take another class with her in a heartbeat.\""
        ],
        "Annabelle Melzer": [
            "review 1: \"04F with Annabelle Melzer: the prof for this class 2004F was actually a prof named Dominica Borg, not Annabelle..unfortunately. the class was unfocused, uninspiring, dry, and attempted to cover far too many literary movements and periods...almost insufferable course. no one ever wanted to go... but hey, the course is required for the fsp. i think it depends on which prof is teaching, hopefully borg won't go to london next time-- although she is a perfectly nice person generally speaking\""
        ],
        "Framji Minwalla": [
            "review 1: \"06F with Framji Minwalla: This class wasn't taught by framji, instead we had several professors who rotated. there was no homework, no readings, and no grade. some professors were better than others, but most knew what they were talking about. there wasn't really any continuity between the level at which we were taught. we had some field trips, of varying quality. this was by no means a serious history class - it was very practical - we learnt how to do a court masque, and manners and things to that effect - so don't expect any real 'digging' that may have been requisite in other history classes\""
        ],
        "Analola Santana": [],
        "Irma Mayorga": [],
        "Kellen Hoxworth": []
    },
    "THEA016": {
        "Analola Santana": [
            "review 1: \"23W with Analola Santana: I have to be honest and say that I do not love this era of theatre. Santana definitely is passionate about this class, which is a plus. Work included discussion posts (I think eight were required out of the ten throughout the course), a take home midterm, a group multimedia project, and a research paper. This class is definitely a layup if you are looking for something to fill out the spot.\"",
            "review 2: \"22W with Analola Santana: Wonderful prof who really cares about the content! A fair amount of reading, but everything is reviewed in class lectures so you could get away without reading if you wanted to. Read about a play a week, so working ahead is helpful. Midterm is 5 free-response questions that tie what you learn about the time periods to the plays, so I'd recommend reading all of the content offered in the first half of the course.\""
        ],
        "Laura Edmondson": [
            "review 1: \"08S with Laura Edmondson: I recommend both the course and the prof. It's the kind of class that's difficult to pack into ten weeks, but I really enjoyed the material.\""
        ],
        "Samantha Lazar": []
    },
    "THEA015": {
        "Amy Strahler": [
            "review 1: \"04F with Amy Strahler: I should preface this by saying that there were only 5 students in this class when I took it, which undoubtedly made it a more enjoyable and effective experience. I'm a government major and this class was totally unrelated to my major but that's part of what made it so interesting.\"",
            "review 2: \"04F with Amy Strahler: I came into this course expecting an average required course, covering a lot while not really going into any depth. However, I found that we were able to cover a lot more material in much more detail than I expected, which was very satisfying. Overall, a very entertaining and enriching course!\"",
            "review 3: \"03F with Amy Strahler: Looking back on this course I realized I really enjoyed it. During the term I often found the discussion to be a little annoying and off topic but the readings are very interesting and Professor Hozapfel is vastly knowledgable and exciting.\"",
            "review 4: \"03F with Amy Strahler: I was dreading taking this class (and so put it off till senior fall) but it turned out to be my favorite this term. Amy is wonderful, and I learned an incredible amount.\"",
            "review 5: \"03F with Amy Strahler: Amy rocks. Hard. If you have never taken a theater course, this is a great way to get started. If you think you know a lot about theater, this course will help you to realize how much you don't know. And if you're lucky enough to have Amy as a prof, you will be mad psyched to hit the books and delve full-force into the material. Unless you're a rock, her passion will inspire you to unimagined pinnacles of achievement. Seriously! You'll have to find out for yourself.\"",
            "review 6: \"02F with Amy Strahler: the material in this class is great but until prof. holzapfel learns how to teach without being unfairly difficult it wont be worth the trouble unless you are serious about theater and/or have no choice.\"",
            "review 7: \"02F with Amy Strahler: Theater 15 is required for the theater major and rightly so because the material covered is very important for a someone preparing for a life in theater to know. However, the setup of the course made it more about memorization than learning material (especially for the tests). There's also a performance project that is pretty harmless. It could be a really interesting course, but the workload is pretty demanding and the discussions don't always go as planned, partially because there were only 9 people in the class... 8 majors. And everyone was pretty much interested in the same thing. For theater majors it's a bit difficult because it's more dramaturgy than anything else and that can be different for actors and designers and such. And it's assumed that we knew a lot more about theater history and such than we did coming into the class. Some of my friends joked that this was like a weeder course for theater majors. I don't know if that's entirely true, but it's certainly more difficult than it needs to be.\""
        ],
        "Laura Edmondson": [
            "review 1: \"22F with Laura Edmondson: I echo what the 20F review says: \"On the first day of class, Prof. Edmondson said the class would be discussion-based, but it ended up being lectures 95% of the time. The class has weekly discussion posts, three ~1,500-word essays, and a group project.\" You can get away with not reading the textbook, although you have to read the plays. I'd recommend at least skimming the text so you have an idea of what you want to include in your final paper (the topics are available starting week one so you can also bookmark pages throughout the term). Edmondson is fun to learn from but a tough grader. I know she gave several papers back for our first midterm without grades and simply asked students to try again. I got a B+ on the first one and she allowed a rewrite which bumped me up to an A. She won't allow rewrites if you have an A or A-. Participation is important and she's a stickler about not having your laptop open in class so if you aren't up for paying attention, doodle instead. This course is definitely better than THEA17, but I think I liked THEA16 with Analola more\"",
            "review 2: \"20F with Laura Edmondson: On the first day of class, Prof. Edmondson said the class would be discussion-based, but it ended up being lectures 95% of the time. The class has weekly discussion posts, three ~1,500-word essays, and a group project. The workload isn't too bad in terms of reading/writing, and the topics are interesting for the most part. She also brings in a couple of guest speakers to supplement our readings, and those sessions were all very interesting. She's very flexible/accommodating as well.\"",
            "review 3: \"07F with Laura Edmondson: laura is really nice, but her lectures drag. although she has her phd and certainly had to study evereything contained in the course, she is a specialist on african performance and some of the lectures only scratch the surface. that being said, it is a survey course and we surveyed a lot. she provides ample opportunity for students to respond during class - this can be maddening esp. when you have people who like to hear themselves talk in class - but when you have something you think is intelligent to say, she makes sure to get to everyone. the reading responses are good exercises - you write about a page of questions and responses to the day's reading. (You only have to do ten of about 15 or so). the paper topics are narrow and easy to bang out, and the essays aren't too bad (5-7 pgs. for midterm and final) i am a major so I had to take it - I don't think I could recommend it to a non-major, but don't dread it if you're a major. good stuff.\"",
            "review 4: \"07F with Laura Edmondson: Laura is great. There's so much material in this class that it's difficult to cover anything as completely as you might want to, but discussions can be very interesting and she's definitely the kind of teacher who makes you want to learn about the subject.\"",
            "review 5: \"07F with Laura Edmondson: It was a decent class, I really like the material for the first 2/3 of the term (the ancient Greek and Roman theatre) but the last chunk (medieval and japanese theatre) was boring and bad. A lot of reading and a lot a lot of paper writing. But I definitely feel like I learned a lot both about the topic and about how to think about performance history.\"",
            "review 6: \"07F with Laura Edmondson: I really enjoyed this class. It was based around discussions, so you have to make sure you do the readings, but they're actually interesting. The end of the course started going really fast, but it wasn't hard at all. I overall really enjoyed the class.\""
        ],
        "Wendy Weckwerth": [
            "review 1: \"05F with Wendy Weckwerth: It should be really interesting, that's what was so disappointing about it. Weckwerth will probably be a good prof in about 5 years, but as a first time lecturer, she's pretty awful. Apparently this class is awful in different ways no matter who takes it. Again, that sucks, because the material is/can be/should be fascinating. Take it because you have to.\""
        ],
        "Kellen Hoxworth": []
    },
    "THEA010.13": {
        "Joseph Sutton": []
    },
    "THEA010.08": {
        "Daniel Kotlowitz": [],
        "Melinda Evans": []
    },
    "THEA010.04": {
        "Carol Dunne": []
    },
    "THEA007": {
        "Mara Sabinson": [
            "review 1: \"23S with Mara Sabinson: Bad prof, but easy class. You won't get an A if you don't act liberal. She constantly professes her hatred of FOX and Trump and Republicans and imposes her views on you, not letting you express your own opinions. But you can rewrite things if she doesn't like them. Just show up to class. She boos people who come in late. Don't get on her bad side. You also won't learn anything.\"",
            "review 2: \"21S with Mara Sabinson: TAKE THIS FIRST YEAR SEMINAR! Professor Sabinson is sassy, but fun and humorous. She is incredibly knowledgable, and she gets shit done. You do one real academic essay, a short story, and the rest are scripts (super fun to write and also read in class). The final is basically anything you want to do as long as its a piece of \"theater for social change.\" Find something you're passionate about changing, and you'll do well.\"",
            "review 3: \"11W with Mara Sabinson: Mara is sorta crazy. Yes, she prefers you call her Mara. She is very judgmental and SASSY. She picks favorites, so get on her good side FAST. Its really not a hard class - at all. If you get lower than an A-, she either hates you or I have no idea how you got into dartmouth.\"",
            "review 4: \"09S with Mara Sabinson: Okay! This class was horrible. Worst class i have taken at Dartmouth and i've taken alot of bad classes. This was so bad if you are thinking of taking this seminar no dont. She is crazy and has no idea what she is talking about. She is so outdated and if you google her she tried to sue Dartmouth. Advice always google professors before you take the class you can tell alot about a person by there google info. She cant even fairly grade. All she does is sitt there and talk about her life.\"",
            "review 5: \"08W with Mara Sabinson: I didn't learn anything about writing in this course, and I only learned some things about theater in that class. I think that the packets that she hands out can be dull, but they have a point. Overall she is really critical about the stories and scripts you have to write for the class (you only write 2). She doesn't really offer much as to how to improve your writing even in a theater setting. There isn't much direction and she doesn't really give you many guidelines for what you are supposed to do. Overall I did not like the class, but a lot of people would say that is was easy since you don't do much; Two papers, two scripts, a presentation and reading packets(that most people don't do). You can rewrite most of it as much as you want though, and in a one on one setting she can be really nice, but in class she is brutal.\"",
            "review 6: \"08S with Mara Sabinson: While in the beginning of the term we were assigned loads of reading that 80% of the class didn't do, the latter part of the course all came down to an independent research project. On the topic of choice you wrote a 1000 word paper, a 3000 word paper, and did a presentation, which made up 75% of your grade. I considered this research the strength of the course. The majority of class time was spent discussing and watching contemporary artists (youtube was a large component of the course), which was very fun. A good freshman seminar to take.\"",
            "review 7: \"08F with Mara Sabinson: Everyone has to take a Freshman seminar. People complain a lot, but this one isn't that bad. We watched a lot of youtube comedy videos, and your research paper can be on pretty much whatever you want- as long as it's somewhat pertinent to theater & social change. Some of the readings are interesting. Some are not. You can get away with skipping the boring ones...just try to have something to say.\"",
            "review 8: \"08F with Mara Sabinson: Professor Sabinson is somewhat of a hot-button teacher. It is easy to offend her, especially whe you interrupt her. She's eloquent and intelligent, but she also seemed to pick favorites in class. Her style of paper grading is somewhat convoluted, but overall, she was a good freshman seminar professor. The video clips and readings she chose were all interesting, and the workload was light and fun if you chose a topic in which you held interest.\"",
            "review 9: \"07W with Mara Sabinson: Mara Sabinson is very helpful and understanding....she sets out the task at hand and then helps you get through it. I only wish we could have had more time in the course. She assigned the papers early and gave us time with her to discuss (and strengthen) our theses, and she was always up for a good laugh in class and made interesting subject matter even more interesting.\""
        ],
        "Suk-Young Kim": [
            "review 1: \"05W with Suk-Young Kim: I just love her. she is a fantastic professor, the course was VERY interesting. it has inspired in me tons of interest in chinese theater. it encompassess not just theater, but chinese culture, literature, and history. it is an effective seminar, i think my writin gimproved through the course, and...oh yes im in love with suk-young kim.\"",
            "review 2: \"05W with Suk-Young Kim: I took this course for my seminar requirement. I went in not knowing what i was going to get from a theater class. Overall, the class was interesting. The plays that were read in class were pretty entertaining. Prof. Kim goes into the material very thoroughly and has students discuss the material. Lots of writing! Students in this class were expected to write at a very high level and wrote constantly. Take this class if you are interested in Chinese theater or if you just want to try something refreshing.\"",
            "review 3: \"05W with Suk-Young Kim: While this course is mildly interesting, the course material is rather irrelevant in terms of being useful outside of this class. Professor Kim is enthusiastic about this material, even though she is not the most experienced teacher. Be careful not to get on her bad side, because she was merciless in making fun of students she did not particularly favor.\"",
            "review 4: \"05W with Suk-Young Kim: The class is fairly interesting, focusing on a lot of discussion and interaction during class periods. The homework consisted of a fair bit of reading (50-100 pages a night), and a paper every week or two, with plenty of time to write drafts and revise.\"",
            "review 5: \"05W with Suk-Young Kim: It was an interesting course and a fresh experience. The readings for the class weren't too bad, but there were lots of writing. Professor Kim is a very enthusiastic teacher, but not so experienced. She makes each class very interesting, but she grades really harshly.\""
        ],
        "Amy Strahler": [
            "review 1: \"05S with Amy Strahler: Perhaps the best class I have taken at dartmouth. Great material and a varity of subjects.\"",
            "review 2: \"05S with Amy Strahler: prof. rundle taught the majority of the course. it was a crash course in social movements. prof. rundle talked a lot, but she was pretty awefully open to political debate and unorthodox ideas.\"",
            "review 3: \"05S with Amy Strahler: Although the material that was covered in the class was interesting, when it was time for grading, the instructors were sort of discouraging.No matter how good the paper was in terms of content, the instructors were more interested in punctuation rather than the content of the paper. The material was really diverse. If you want to focus on different issues in your seminar, this semiar can be the proper one for you. The spectrum of topics is really wide. The instructors are pretty much informed about the material covered in this seminar. However in terms of grades, do not expect to get high grades from this seminar.The grading is tough and most of the time, discouraging.\""
        ],
        "William Phillips": [
            "review 1: \"06W with William Phillips: The course, if it were a film course, would make more sense. I read one of the 4 plays we worked with in class and received good marks on all my papers. The best part of the class is seeing great movies and being able to write whatever you want on them. Freedom is great.\"",
            "review 2: \"06W with William Phillips: We watched movies during class, which was fun. We saw two versions of Romeo and Juliet, Who's Afraid of Virginia Woolf, Glengarry Glen Ross, and Roxie Hart and Chicago. We a;lso watched commentary on most of these movies which made things pretty boring. The discussions were not really related to class and usually centered around making movies. The best part of the class was that we were allowed to write a screenplay for one of our essay options. Professor Phillips is a really nice guy and knows a lot about film writing.\""
        ]
    },
    "THEA001": {
        "Annabelle Melzer": [
            "review 1: \"09F with Annabelle Melzer: This class had surprisingly little to do with theater, as we also focused on photo journalism, the theatricality of the olympics, and film. We only had one assignment - a final paper that was due on the last day of classes before Thanksgiving, so no one has any idea how they're going to do in the class. Annabelle cancelled class a lot, and during the week that we had guest lectures from people working on Rocky Horror Show (the director, costume designer, technical director, etc.) she didn't even show up to class. An interesting experience.\"",
            "review 2: \"08W with Annabelle Melzer: The good news about this class is that it's quite easy-- a lot of readings are assigned but you are never tested on them and they are never discussed in class. There is no midterm or final, only a midterm project and a final paper (which half the class wrote the day before it was due.) Annabelle is nice (and very helpful and available outside of class) but her lectures are long and not quite interesting enough to merit their length. This is certainly an easy class but not really challenging or interesting.\"",
            "review 3: \"08F with Annabelle Melzer: I came into this course with very little exposure to theater. This course exposed me to a lot of things I've never seen before, especially post-modernism. Professor Winograd is very passionate about the subject. However, she is also very biased and only wants to see her opinions expressed in the papers.\"",
            "review 4: \"08F with Annabelle Melzer: Absolutely horrible. The class is no work, but your grade pretty much comes down to how Annabelle is feeling at a given moment.\"",
            "review 5: \"08F with Annabelle Melzer: i'm not a theater person at all, but am very experienced in musical performing arts. prof winograd is so incredibly passionate and deeply knowledgeable about her subject, its amazing. the way she talks and rants about her love...theater, is really inspiring. all you have to do is try, and be sure to consult her before attempting your projects. i think a lot of kids didnt like her because they didnt spend enough time on their assignment making sure they actually made sense. easy and interesting class.\"",
            "review 6: \"08F with Annabelle Melzer: Anabelle can be interesting at times, but those times are very few. The readings are all optional and her lectures are repetitive and boring! She has no criteria for grading and depends on whether she likes you or not. The midterm is a joke because she gives everyone horrible grades since if it is not done how she would have done it, it is unworthy of anything above a D. During office hours she is condescending and not helpful at all. Every time I went to see her she spent time telling me how I didn't know anything and how she wasn't going to spoon feed me when I just asked how she wanted a paper set up. She also goes off on rants about different political subjects, which can be amusing but no one dares challenge her because she is crazy! I really enjoyed theater before taking this class. Now I don't think I'll ever take a theater class at Dartmouth again!\"",
            "review 7: \"07W with Annabelle Melzer: Annabelle is really wonderful. Her lectures are fantastic, and the class is a great intro to the world of theater - I highly recommend this course.\"",
            "review 8: \"07W with Annabelle Melzer: I took this class because it was made a requirement for the major. However, this class is horribly boring and a waste of your time. If you have absolutely no theater background whatsoever, it may be a decent idea to take it but if you've ever been in a play, seen a play, or read about theater in any other capacity it will probably be pretty boring. Annabelle does know her stuff but she definitely knows it and she really always thinks that she is right. She spent the entire term talking about basically the same things. She is often really obnoxious and mean to her students and embarrasses people in class. There were a lot of readings but you didn't have to do them as the only 2 assignments were two papers which were very long and which we were only given a few days notice about. Don't take this course unless you have to.\""
        ],
        "Analola Santana": [
            "review 1: \"21F with Analola Santana: Very time consuming + lots of readings assigned but overall not a hard class. We had to attend 5 performances at the Hop outside of class and write a paper on each.\""
        ],
        "Irma Mayorga": [
            "review 1: \"12S with Irma Mayorga: Course: Having participated in theater in high school, I really enjoyed this class. It primarily focused on the history of theater and why theater is important in today's society. It culminates with a final project on an intense report comparing to theater companies around the United States. Very fun! Professor: Professor was always prepared for class, and I loved how she incorporated multi-media components into her PowerPoints so that the lectures didn't drag. Workload: Readings aren't necessary but are interesting. Read the plays, though.\""
        ],
        "Monica Ndounou": [
            "review 1: \"17F with Monica Ndounou: It was clear from the onset that Professor Ndounou did not know what she was doing. Did not know how to work Canvas, changed how she grades four times, and frequently found herself way over or way under time during lectures. Most of the class would have not cared had it not been for her propensity to grade arbitrarily and harshly. Coupled with the fact that the Professor spews some of the most ignorant things you may have ever heard. I would not take this class. It's not just that you will learn nothing, its that you will literally leave dumber.\""
        ],
        "Shamell Bell": []
    }
}