{
    "TUCK003": {
        "Christian Stadler": [
            "review 1: \"22S with Christian Stadler: Completely disagree with the 21S reviews, probably because this course was taught in-person this term. Stadler was an excellent professor who showed up to class everyday radiating energy. He made the class as fun and engaging as possible. The material taught is dry during some portions of the course but I found it, overall, to be an extremely informative class. My only complaint is the final project/small group presentation requirements are slightly unclear. However, this leaves a lot of room for you to get creative with it. If you're looking for a class with little work, take this. There are daily reading assignments which take maybe 15 min to do (which you can easily do before or during class). Only assignments are a first draft presentation with your small group, a final slide deck submission and a final exam consisting of 3 case study questions. Very manageable workload and a great professor. If you are interested in learning about consulting, try this class out.\"",
            "review 2: \"22S with Christian Stadler: I loved this class. I would recommend it to anyone interested in business, consulting, or wanting professional development. As a FGLI POC student I found the class to be accessible and the professor approachable. He is a great ally and honestly a great listener. The atmosphere is mostly male-dominated, but I would recommend not to be afraid of participating and using your voice. The class content includes globally sourced case studies and different ways of viewing business strategy. There really is no wrong answer, it is just a matter of effort and quality of work. That being said a huge chunk of your grade is participation (so don't be afraid to participate otherwise.......he will call on you lol) the other is the slides which is a group project.\"",
            "review 3: \"21S with Christian Stadler: Found the class pretty boring. The assignment expectations are unclear and when you ask for clarification, he says it's in the assignment but it isn't. Huge portion of grade on just a few slides and we don't even get clear instructions for those slides.\"",
            "review 4: \"21S with Christian Stadler: Christian is an exceedingly arrogant professor who does not care for his students whatsoever. His lectures are awful and poorly planned, as much as he pretends to be a good professor. A big chunk of your grade is participation and attendance (30%) which was stupid given the remote setting and radically different time zones. Fucking useless group presentation that didn't properly represent the class material. He never gave students at least a 5-min break, even though this class was from 10:20 am - 12:10 pm. Given he contributes to a small section on Forbes, he loves to brag about how he engages with the magazine and his shitty, \"compelling\" strategy columns. His utterly strong Austrian accent made class difficult to comprehend and forbade students to offer more than two comments during class. He ensured that even the most deserving students of a high participation grade received an A- because they did not have their cameras on for the class period. I love business and the corporate world, but this stupid professor made a rather simple and interesting subject turn into an awful class. I truly hope the Tuck folks read my course assessment and fire him from Dartmouth, or limit him to write useless content on Forbes. Also, he will love to brag that his wife is from Kenya. No one cares!!! I highly encourage you not to take this course with him and learn the material by yourself.\""
        ],
        "Mark Desjardine": [
            "review 1: \"24S with Mark Desjardine: Really really poor class. Assessments are bs. You do not learn much, minimal work but may get a bad grade. Much better layups out there. Tuck is a sham.\"",
            "review 2: \"24S with Mark Desjardine: Don't bother taking it with Mark Desjardine. Super arbitrary, has his class favorites, and would rather play around selectively with grades than support you. If you don't talk in every class you're not going to get a good participation grade unless you really suck up to him. Not very bright either. You don't learn much from this class and not a layup because there is so much busy work.\""
        ],
        "Andrew King": [
            "review 1: \"18W with Andrew King: Overall, TUCK 003 was an easy, ok class. I think in general business classes are not useful unless you are about to take a business role in a medium to large company. But at least the class had little work. The only homework we ever had was to read an HBS ~12pg case study before each class. Hence the class involved ~5-6 hours work per week. Prof. Andrew King was ok, although not a great explainer. His classes were typically very disorganized. In class he would ask us discussion questions about the cases that were posted on Canvas with the cases. He would then raise our hands (occasionally he cold called) and he would take points from various students and put them on board. He tried to keep classes structured, but they often weren’t. Our grade was determined entirely by class participation, and midterm and final scores. We had little idea what would be on midterm and final until close to the exams, and even then with no other graded assignments, it was uncertain how the exams would be graded. As of 2018W there is no way to NRO this class. As of yet I do not know my grade in the class, and I don’t have a good idea of what it will be. Final was also take-home, so there may have been considerable cheating. I’ve had other classes that had take home exams at Dartmouth and from what I gather a number of students cheated. I would not recommend this class unless you do not care much about your GPA and want a layup not likely to be particularly useful.\""
        ],
        "Catherine Maritan": [
            "review 1: \"20S with Catherine Maritan: Do not take this class with Professor Maritan. I had heard fantastic things about Tuck 3 from friends, but Maritan was a terrible professor and made this class a huge waste of time. Her slides were poorly made, she did not allow people to think creatively, and when people gave thoughtful and correct answers Maritan would say they were wrong. The cases were interesting, but Maritan's discussions barely scratched the surface of the interesting conversations they could have sparked. If you want to take the class, take it with a different professor. The other Tuck programs and classes are a much better use of your time.\""
        ],
        "Margaret Peteraf": [
            "review 1: \"12S with Margaret Peteraf: Course: Interesting, well-paced, and probably semi-applicable to the real business world. Case studies were pretty frequent and always very interesting and informative. Professor: Professor Peteraf is great, she's very nice, a very clear lecturer, and she tries to make class pretty entertaining. Workload: Only four one-page homework assignments (and you get to drop one) and three midterms (no final). The midterms are pretty straight forward and easy, plus you can bring in a page of notes so you don't even really need to study that much.\""
        ],
        "Giovanni Gavetti": []
    },
    "TUCK002": {
        "Lauren Grewal": [
            "review 1: \"23F with Lauren Grewal: Solid class with little to no work each week (probably spent max 1 hour on it unless it was a graded component). A median. Prof. is super sweet, makes participation easy, and genuinely wants to get to know her students. Go to office hours - she has a ton of good career advice for anyone who is hoping to go into business or consulting, and she is soooo funny.\"",
            "review 2: \"23F with Lauren Grewal: Fun class. A little memorization heavy for my tastes but anyone with an aptitude for that will find this class to be extremely easy (especially the final). Grewal is very nice and tries to get students involved in class discussion often (it makes up 10% of your grade so make sure to speak in classes). Class is very light until the last 2 weeks which are a bit of sprint. Overall, would recommend taking with Grewal if you're looking for a 3rd class on the lighter side.\"",
            "review 3: \"23F with Lauren Grewal: There's pretty much no work outside of class, and the material is the most straightforward of any class I've taken at Dartmouth. You don't ever need to try to understand something - it's pretty much all logic and memorization. Grewal is a decent prof, and was always available and excited to talk to her students. Anyone can get an A in this.\"",
            "review 4: \"23F with Lauren Grewal: This was a boring and lame class. Easy though. The last case writeup, group project, and final all kind of happen at the same time and was suddenly a little busy, but that also meant you had basically not work for the first 8 weeks. Grewal can be annoying and tries too hard to be cool and relatable but is nice enough. Marketing, especially how Grewal teaches it, is super super boring . She just spits out boring definitions and made up frameworks or processes broken out into arbitrary steps and then you memorize them off the slides for the final. It's all stuff that there is no reason to memorize made up terms for because you'd understand the same idea from just common sense. It's pointless. Kind of (actually fully) the opposite of the type of learning that teaches you anything about the real world (which is lame for a Tuck class) and also has none of the cool or interesting parts of regular Dartmouth classes. I would not take this class. You won't get anything out of it, so if you want to take an easy class then go find some fun liberal arts class with a cool topic and cool professors. That is much more what Dartmouth is meant for, not some bad undergraduate business class you won't get anything from. Waste of your tuition dollars, effort, and time.\"",
            "review 5: \"23F with Lauren Grewal: Solid Class - I thought we would talk a lot more about real world research (the most interesting parts of the class were when we talked about real world phenomenon ex: organizing drinks in display refrigerators vertically attracts more sales etc. ) but most of the class was spent on boring marketing concepts that feel really made up (used to describe common sense). Regardless this class didn't entail much work and is def a easy A- or A.\"",
            "review 6: \"23F with Lauren Grewal: Great class- 3 quizzes (untimed, online, and open book), 2 case study write-ups (two pages, double spaced), group presentation, and a final exam (wasn't hard at all). There was a lot of content but most, if not all, was common sense. Class discussions were very engaging as well. If you're not into class participation, this isn't the class for you (10% of grade and heavily considered). Easy A or A-.\"",
            "review 7: \"21F with Lauren Grewal: Great course, great professor! Very interesting topics! Workload: two case studies, 3 take home quizzes, 2 fifteen minute research surveys (graded on completion), a group project and a final. Very witty and funny professor, super knowledgeble. Straightforward lectures. Super easy to read textbook. Little work + very interesting topics + super fun and knowledgeble professor.\"",
            "review 8: \"21F with Lauren Grewal: While the course material is quite intuitive, the lessons really compelled me to think more deeply about the world around me, business strategy, and the marketing messages I consume. I also really enjoyed the case studies we analyzed — not only were they fascinating, but they also were a great way to practice strategic thinking. Professor Grewal's lectures were very engaging and she was always eager to answer any questions. Beyond that, she is extremely kind, passionate and understanding. I highly recommend taking this class.\"",
            "review 9: \"21F with Lauren Grewal: Highly recommend this class. First of all, there is next to no work throughout the term, the quizzes were open-note and take-home (at least for us) and the final exam pretty easy, and beyond that the 2 case studies and 1 group presentation we had to do were definitely manageable and pretty interesting. It was my 4th class and thankfully was almost no added workload. Also, she's just a really engaging and funny lecturer and you'll learn a lot, even though some of it is intuitive as others have said; it's more concrete info and the projects do help you apply it to the real world (like you'd do in consulting - if you're interested in that field I think this class would be useful).\"",
            "review 10: \"21F with Lauren Grewal: Yes, Professor Grewal is an engaging, entertaining lecturer and the coursework — consisting of weekly readings, 2 case studies, and a final project — is pretty light. However, as the term went on I found some of the material to be repetitive and a little boring to be frank. While the class is useful to gain a better conception of marketing basics (pricing, supply chains, consumer behavior), I did not particularly enjoy analyzing advertisements, memorizing definitions and concepts, and learning certain topics that seemed self-explanatory.\"",
            "review 11: \"20F with Lauren Grewal: This was a great class and honestly made me want to enter the field of business marketing. Prof. Grewal is a great and energetic professor and you can tell she really cares about her students. She also brought in some really cool guests, such as the CMO of the NBA and others. Highly recommend.\"",
            "review 12: \"20F with Lauren Grewal: I recommend this as a good third class that is also fun and interesting. The workload and expectations for the class are reasonable and clearly defined at the beginning of the term. Professor Grewal really cares about making the class interesting for students, getting to know/mentor students, and being accommodating to students during COVID. The material in the class was applicable to the real world and interesting, and there were very cool guest speakers. The class is great exposure to marketing and provides skills that would be helpful to know for marketing and thinking about businesses generally.\"",
            "review 13: \"19F with Lauren Grewal: This is a great class if you want to get an overview of the major concepts in marketing. The class covers a ton of material, but none of it is particularly difficult to understand. There were no midterms, instead, there were two case studies to complete during the term, a group project at the end, and a final. Professor Grewal is a really nice lady and really cares about her students. Participation is a small part of your grade and she makes it easy and non-stressful to participate during class. I would recommend this class as both a layup and a valuable business class at a school that has very few such classes.\"",
            "review 14: \"19F with Lauren Grewal: Tuck Marketing is one of my favorite classes. Professor Grewal is a fantastic lecturer, makes herself available to mentor students, teaches valuable skills and grades fairly. Could not ask for more in a class. But do be prepared, this class requires significant work but it is not unreasonable.\"",
            "review 15: \"19F with Lauren Grewal: I would definitely recommend this class! Professor Grewal is such a kind woman that cares about her students and gives interesting examples to make the material come to life. The workload is great with a final group project, the final exam, three take-home open-book and note quizzes, two case studies, and participation. The class is graded extremely fair and you definitely learn some interesting concepts that are well worth your time.\"",
            "review 16: \"19F with Lauren Grewal: Workload is definitely on the lighter side. 3 short online multiple-choice quizzes, 2 case studies, participation in 3 45 min. research studies, group paper & presentation & final. None of these were particularly hard. You learn some marketing frameworks and watch a good amount of shark tank. There were also 3 guest speakers. A nice class to balance out 2 harder ones and you learn some applicable business stuff.\""
        ],
        "Conwell Worthington": [
            "review 1: \"22F with Conwell Worthington: *DO NOT TAKE WITH WORTHINGTON* Professor Worthington is just all around, a very poor professor. He sets extremely unclear expectations and I question his knowledge of marketing concepts. Throughout the term, people would ask questions and he frequently would ignore them and move on or gloss over the original question all together. I am not sure how this guy ended up teaching this class but don't take Tuck 2 with him. It's not worth it. Better off trying to learn marketing concepts on your own than learn from this dude.\"",
            "review 2: \"22F with Conwell Worthington: CONWELL SUCKS. So obvious he picks favorites and thinks certain students deserve better grades than others from the start of the term. Conwell thinks a B is a good grade and said he'd make the median as such. Do not take this class if you want a good grade.\"",
            "review 3: \"22F with Conwell Worthington: Conwell is an awful professor. Has little grasp of the material and is a rather poor lecturer- avoid if possible\"",
            "review 4: \"22F with Conwell Worthington: Where do I even begin with Professor Worthlesston's class? This class turned out to be my least favorite class that I have taken at Dartmouth. First, Prof Worthington taught straight out of the textbook and any extra examples he did provide were always related to sports (NHL, Nike, etc.). When a student brought up this point about how his examples were catered towards a subset of the class (i.e. domestic students & athletes), he told the class that the onus should be on us to bring diverse examples to the conversation. Excuse me?? Second, the format of the quizzes and final was awful. The quizzes were 5 questions, 35 minutes total. Each question was a short-answer response, except that most questions actually contained more than one question. As a result, I ended up writing at least 800 words per quiz and never had time to double check my answers. Worthington seemed to think that this format was completely doable--easy for him to say when he already had the answers in mind while writing the questions--because despite numerous complaints from students, he did not change the format. He was also extremely nitpicky in his grading and would randomly dock points for things that we failed to include in our answers even though he never asked about them in the original question. This nitpicky grading also applied to the two group projects as well, with the maximum score on the first project being a 93. Also sidenote -- he had this dumb policy where you had to meet in-person to see your grades, so people would often be waiting 15-20 minutes after class to check their grade. Lastly, the worst part of this class was PARTICIPATION. Every day he graded us on scale of 1 to 5 on participation, and to get some sort of an A grade you had to speak at least twice per class (and one word answers don't count). This would've been doable had the class been 25-30 people, but keep in mind that each section was 60 people. As a result, it felt like a competition to get one's participation points in, and the quality of contributions was quite poor. So TLDR -- don't waste your time with this class. The material is so easy it could be taught to a fifth grader but Prof Worthington is one of the most incompetent, difficult, and problematic professors I've had at Dartmouth.\"",
            "review 5: \"22F with Conwell Worthington: Conwell was an interesting professor who encouraged students to engage with the material. While participation is key, the questions are not hard and most were just observations students made about how something made them feel. Not a hard class or time consuming.\"",
            "review 6: \"22F with Conwell Worthington: While this class was much harder than anticipated, I thought TUCK 2 with Professor Worthington was not as bad in the end. You didn't need to do the readings because the slides he provided had everything before class. The participation is mostly being creative and learning how to make an informed opinion on your feet. Make sure your marketing campaign and project is a cool company and fascinating to you, and talk to him outside of class A LOT (office hours, after class, before class, during class). He will see you care about the class and this will influence your final grade positively if you keep at it. He had interesting case studies but sometimes it felt like the students had to run the whole class rather than him. His lectures were very engaging and he would cold call frequently, so be aware. But, this class challenged me and took me outside my comfort zone with material that is interesting and kind of easy. Quizzes and tests were all essay based, except for some MC on the final.\""
        ],
        "Eesha Sharma": [
            "review 1: \"17F with Eesha Sharma: This class is such a joke. If you want to learn more about marketing, just pick up the textbook and don't waste your time in a class that covers outdated concepts with dry lectures.\""
        ]
    },
    "TUCK001": {
        "Thomas Porter": [
            "review 1: \"24W with Thomas Porter: In my opinion a layup. 3 quizzes, a take home midterm, and a take home final. Quizzes and the midterm were extremely easy, final was slightly challenging. Did not go to class a single time. Definitely recommend taking this class with friends. Useless for finance recruiting so don't take if you think it will help with that.\"",
            "review 2: \"23W with Thomas Porter: bruh . . . . . . . . . . . . . . . . ..............................................................................................................................................\"",
            "review 3: \"23W with Thomas Porter: Structure: 3 quizzes worth 10% each, midterm worth 30%, and final worth 40% all on Canvas I would not consider this class a lay-up. You can do well (get a B/B-) if you don't come to class and just read the book and do the ungraded homework, but to get an A, go to class and make Porter know who you are. Class can seem a little pointless because the content covered in class is rarely on the quizzes. However, I did learn a lot of life skills, especially how to work Excel and read financial statements. If possible, take the class with people you know to study together. Porter is very understanding and will let you re-take quizzes if you bombed them or explain why you got something wrong and give maybe half-credit. MAKE A MEETING WITH HIM AFTER EVERY QUIZ! THAT WILL SAVE YOU! Overall, take the class if you're thinking about IB or just want it on your resume. I would not recommend taking this class if you just need another course/you are looking for a layup.\"",
            "review 4: \"23W with Thomas Porter: Tom is a nice guy. This class, however, was a total waste of time. I didn't learn anything, attended class three times, and got an A. I think attending class actually hurts your understanding of material. Took the class because I thought it would help with IB prep. I guess if you try to learn the material it would, but I learned all the material on my own in a week after the course had ended. It doesn't get you any distribs, work towards any majors, or teach you anything, so I'd suggest a different class.\"",
            "review 5: \"23W with Thomas Porter: Porter is very nice. It is all pretty basic accounting material and was a pretty easy course overall. 10 weeks felt like a very long time for the amount of material we covered. All of the quizzes and exams were take-home, which I disliked.\"",
            "review 6: \"22W with Thomas Porter: Porter is lazy and self-absorbed. Not smart and constantly confused over simple formulas and calculations. The class is easy, but Porter does not care about you at all. Sure he has a lot of experience with accounting since he worked at PwC for quite a few years, but that is just about it, and his work is pretty mundane. The class is so basic that one can actually learn it by oneself. For folks interested in finance, take the much more useful ECON 36 and you learn a ton more, unless you are only smart enough for this,\"",
            "review 7: \"22W with Thomas Porter: This class is NOT a layup: it is extremely time-consuming and challenging. That being said, I thought it was very useful, and I feel better about going into the working world knowing that I have a basic understanding of financial statements. Professor Porter is lovely and a good professor. He wants you to succeed and is willing to help you out; he has lots of office hours available. I'd recommend taking this class prior to going through finance corporate recruiting because the class teaches you a lot about how to read financial statements. The class is very focused on \"financial accounting\" rather than accounting used in corporate finance; it does not cover many topics that are in the finance internship and job interviews like DCFs or LBOs.\"",
            "review 8: \"22W with Thomas Porter: Quite frankly, Porter is that guy. Porter is the goat and that is all I will be saying today\"",
            "review 9: \"22W with Thomas Porter: Tuck 1 was allegedly a layup in previous years, but this is not the case for Porter. I assume most people in 22W signed up for what they thought would be a layup with no work, only to be hit by a truck — hence the other reviews. The course essentially consists of a hefty textbook, which you must learn in order to do well. The material itself isn't extraordinarily overbearing, but it takes a decent amount of time to learn and become comfortable. Porter is very nice and accessible for help, but I didn't find classes to be that engaging. The structure was a little bit disorganized, and I felt that I needed to teach myself from the textbook first to actually understand the content. The grade is entirely based on quizzes, a midterm, and a final, so it actually reflects your ability to do accounting — no free points or \"group projects.\" Basic accounting is a good skill to have, so I'd recommend this course if you're interested in that, but don't take this course if you plan to commit no effort.\"",
            "review 10: \"22W with Thomas Porter: This class was kinda dry ngl. Prof. Proter is nice enough but also kinda dry and not the most engaging. Class is not a layup but you should be able to keep up if you read the textbook and do all the practice stuff there. There is a curve to this class because of all the finance & econ ppl taking it but its not too hard to get at least the A- (much better than typical econ class). Wouldn't say this class is a must take but the material is kinda useful if you're going into business/finance.\"",
            "review 11: \"22W with Thomas Porter: Learned so much useful stuff. Not too hard of a class, Porter was a little disorganized but always super understanding and nice. Couldn't recommend this class enough, especially if you're going to do recruiting. Expect a decent amount of work for weekly assignments, but it actually helps you learn and do better.\"",
            "review 12: \"22W with Thomas Porter: This class is probably the most practical class I have taken at Dartmouth especially if you are interested in finance. The material is not hard per se but you definitely have to spend time outside of class the keep up with everything. Homework/reading often took me 2-3 hours per assignment (2 assignments/wk) if I wanted to actually understand the material. Prof was super willing to help if you ask and is a really nice guy. Definitely wouldn't take if you are looking for a class where you don't have to pay attention outside of class/don't want to show up to class.\"",
            "review 13: \"22W with Thomas Porter: What a guy. Class is definitely harder than it's been in the past but you'll learn a ton and it's actually useful. Quizzes, midterm, final all online. Recommend for sure.\"",
            "review 14: \"22W with Thomas Porter: DO NOT TAKE THIS CLASS WITH PORTER. Professor Porter is a lovely and well-hearted person, but his teaching style and assessments are not enjoyable. The class is based solely on three quizzes, a midterm and a final. On multiple quizzes, there were questions that we did not do in class, were not in the textbook, and were not in any of the practice problems or homework. In class, he tries to bring in real-world companies' financial statements to contextualize his teaching material. However, these 20-30 minute lengthy analyses did not help prepare or further my understanding in the class. Frequently, I would find that reading the textbooks and doing the practice problems were far more helpful than any of his lectures – quite frankly, I did better when I didn't go to class and learned the material independently. I hate to bash a professor and a course in this way, but I highly suggest taking this class with a different professor when it is offered.\"",
            "review 15: \"22W with Thomas Porter: This class torpedoed my GPA, leveled me as a person, and is one of the reasons I do not trust men. Despite his relaxed teaching style, the class was curved down. Learned some stuff though.\"",
            "review 16: \"22S with Thomas Porter: Nice guy but unprofessional. Gave me half a heart attack when he dropped the grades (he promised a generous curve but yet my grade was well below what I deserved even UNCURVED). frequently made errors and literally just learned what a textbook can teach\""
        ],
        "Jordan Schoenfeld": [
            "review 1: \"21W with Jordan Schoenfeld: Really chill prof. He makes the class understandable and interesting to be a part of, despite the fact that it is 10A/2A class. Really enjoyed the current news aspects. However, I wouldn't recommend to people who hate participation because it is a heavy component and thus, there are LOTS of tryhards, to the point where you'll know who they are by the sound of their voice\"",
            "review 2: \"21W with Jordan Schoenfeld: GREAT prof; Schoenfeld is a nice guy, really easy to talk to in office hours & class. Encourages lots of participation. You get whatever you put into this class. It can feel a tad long on Zoom as a 2A (~2 hrs + 5 min break, but Prof. would sometimes let us out early). Workload is easily manageable - 2 textbook reading quizzes, 2 case study quizzes, 3 \"memo\" assignments, 1 final, + participation.\"",
            "review 3: \"21W with Jordan Schoenfeld: Super easy class. Prof. Schoenfeld is really chill and prioritizes learning general concepts rather than useless details (which I thought was great). Would highly recommend!\"",
            "review 4: \"19W with Jordan Schoenfeld: Great teacher. He engages with the class and talks about what is currently happening in the financial sector. He also recommended some good books to me that he thought might be helpful for my upcoming internship. In this course you will learn a general overview of accounting, how to recognize revenue, and how read financial statements. The workload is not too intense, but does require a fair amount of reading.\""
        ],
        "Robert Resutek": [
            "review 1: \"14W with Robert Resutek: Course: I would definitely recommend this course. I really learned a ton of useful information. It is relatively fast-paced and the material is difficult, but it is definitely manageable. If you keep up with the homework and go to TA office hours when you're having trouble, you'll probably be fine on the midterm and final. Professor: Professor Resutek is great--he really knows his stuff and does a good job teaching the material. He realizes that everyone NROs the class, so he definitely tries to make it manageable. He even offers an alternative final exam for people struggling with the class that only focuses on the first 4 weeks of material (if you take the alternative final, your maximum grade is a C+ in the class, so the NRO kicks in). That being said, if you stick with it and do the work, you should do ok in the class. Workload: The weekly homework is difficult, but you get full credit as long as you put some effort into it. You really need to do the homework to understand the material though. And you probably don't need to read the textbook as long as you're trying the practice material that Professor Resutek provides. The midterm and final make up 30 and 40 percent of your grade, respectively. The rest is homework, class participation, and quizzes.\"",
            "review 2: \"12W with Robert Resutek: Course: Solid course, but definitely NRO it! It's nice to have the option of taking the NR if all of your other classes are out of control during finals. Learned a lot about basic accounting. Professor: Really nice guy. Super understanding. He does a nice job with material which can be super dry. Workload: Definitely manageable. You can mess up the homeworks and still get full credit as long as you showed some effort.\""
        ],
        "Anup Srivastava": [],
        "Dirk Black": [],
        "Phillip Stocken": []
    }
}